[
    {
        "type": "text",
        "blog_name": "tobehonestifeelcompletelyalone",
        "blog": {
            "name": "tobehonestifeelcompletelyalone",
            "title": "To be honest I feel completely alone",
            "description": "https://youtu.be/VGexpzNQR-0 \nGet it? Funny right? No? Just me. Okay.",
            "url": "https://tobehonestifeelcompletelyalone.tumblr.com/",
            "uuid": "t:TjmQ-wdteV-rF1H-W0DDJA",
            "updated": 1541498361
        },
        "id": 176691919886,
        "post_url": "https://tobehonestifeelcompletelyalone.tumblr.com/post/176691919886/infinity-war",
        "slug": "infinity-war",
        "date": "2018-08-06 10:17:28 GMT",
        "timestamp": 1533550648,
        "state": "published",
        "format": "html",
        "reblog_key": "yFhVISUv",
        "tags": [
            "avengers",
            "infinity war",
            "shocked",
            "dead inside",
            "iron man",
            "spiderman",
            "spider man: homecoming",
            "thor",
            "thor ragnarok",
            "thor odinson",
            "loki",
            "loki (marvel)",
            "marvel"
        ],
        "short_url": "https://tmblr.co/Z52H6d2aZgBmE",
        "summary": "Infinity war",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 12,
        "title": null,
        "body": "<h1>Infinity war</h1><p>Sooooo&hellip; I finally watched Infinity war and i have never been so shocked. Like wow&hellip;. I cried 5 times and after that i stared into the darkness for 20 minutes. </p><p> I am afraid for Avengers 4</p>",
        "reblog": {
            "comment": "<p><h1>Infinity war</h1><p>Sooooo… I finally watched Infinity war and i have never been so shocked. Like wow…. I cried 5 times and after that i stared into the darkness for 20 minutes. </p><p> I am afraid for Avengers 4</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "tobehonestifeelcompletelyalone",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#95e3f1",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/dc5c6fb327882c444166de4a9ecaf6c8/kb3xkfr/CzQp6pd0v/tumblr_static_3pbztout9esk0sckcscgk04gw.jpg",
                        "header_image_focused": "https://static.tumblr.com/dc5c6fb327882c444166de4a9ecaf6c8/kb3xkfr/CzQp6pd0v/tumblr_static_3pbztout9esk0sckcscgk04gw_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/dc5c6fb327882c444166de4a9ecaf6c8/kb3xkfr/CzQp6pd0v/tumblr_static_3pbztout9esk0sckcscgk04gw_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176691919886"
                },
                "content_raw": "<p><h1>Infinity war</h1><p>Sooooo… I finally watched Infinity war and i have never been so shocked. Like wow…. I cried 5 times and after that i stared into the darkness for 20 minutes. </p><p> I am afraid for Avengers 4</p></p>",
                "content": "<p><h1>Infinity war</h1><p>Sooooo&hellip; I finally watched Infinity war and i have never been so shocked. Like wow&hellip;. I cried 5 times and after that i stared into the darkness for 20 minutes. </p><p> I am afraid for Avengers 4</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "fandomfanfics12",
        "blog": {
            "name": "fandomfanfics12",
            "title": "Fanfiction",
            "description": "<p>I’m Madds, I’m a ravenclaw, marvel and stony own my ass. I write fan fiction in my spare time. Requests are open, feel free to chat. </p>",
            "url": "https://fandomfanfics12.tumblr.com/",
            "uuid": "t:7Qf6Xm4ntsV19pr26MLE-A",
            "updated": 1552814715
        },
        "id": 176691722833,
        "post_url": "https://fandomfanfics12.tumblr.com/post/176691722833/we-are-a-family-part-3",
        "slug": "we-are-a-family-part-3",
        "date": "2018-08-06 10:06:14 GMT",
        "timestamp": 1533549974,
        "state": "published",
        "format": "html",
        "reblog_key": "X2rEgwxI",
        "tags": [
            "superfamily",
            "superhusbands",
            "stony",
            "stony fic",
            "avengers",
            "avengers fluff",
            "avengers fic",
            "peterparker",
            "tony stark",
            "Steve Rogers",
            "tony stark rogers",
            "steve stark rogers",
            "Iron Man",
            "captain america",
            "we are a family fic",
            "wade wilson",
            "spiderman",
            "deadpool",
            "spideypool"
        ],
        "short_url": "https://tmblr.co/ZQeSSd2aZfRfH",
        "summary": "We Are A Family-part 3",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 86,
        "title": "We Are A Family-part 3",
        "body": "<p>Title: We Are A Family.<br/>Pairings: Steve x tony, Peter x Wade, Nat x Clint, Sam x Bucky.<br/>Part: 3/?<br/>Warnings: swearing, fluff, angst, violence, eventual smut, slowburn.<br/>Summary: When Nat comes into the avengers tower with baby Peter Parker, the avengers didn&rsquo;t know what they were getting themselves into. But now that Peter is here,Steve and Tony both feel protective over him. It doesn&rsquo;t help that Peter hates everyone other than Steve and tony. But as Steve and tony raise Peter, they start to fall for one another. Will this superfamily work out or will it all turn to hell?\n\n<br/></p><p><a href=\"http://fandomfanfics12.tumblr.com/post/169767449338/we-are-a-family-part-1\">Part 1</a>, <a href=\"http://fandomfanfics12.tumblr.com/post/176056617463/we-are-a-family-part-2\">Part 2</a></p><figure class=\"tmblr-full\" data-orig-height=\"200\" data-orig-width=\"500\" data-tumblr-attribution=\"hey-kids-want-some-avengers:HA9nF7UfNpwcSr4D-2Ey-A:ZuKLoh23tEdUN\"><img src=\"https://66.media.tumblr.com/15e9a60abbd655c737739ce86f0e4777/tumblr_o4j0w3pOZn1v9mi9to1_500.gif\" data-orig-height=\"200\" data-orig-width=\"500\"/></figure><!-- more --><p>\n\nTony knew that Steve was spending more time at the supermarket. Knew it was because he wanted to see Peter. And Tony was tempted to do the same thing. But he managed to refrain. Ben had been very clear, he didn&rsquo;t want them involved. So Tony was making a point of not getting involved. But it was killing a small part of him, not seeing that smiling, giggling face Peter bore. It had been more than a month since Tony had seen that face. Tony shook his head, burying himself deeper into his work. That&rsquo;s when Steve walked into the workshop, and sat down on the couch. <br/>&ldquo;Hello to you too Rogers.&rdquo; Tony murmured dryly. <br/>&ldquo;Does this not bother you?&rdquo; Steve demanded and Tony sighed. <br/>&ldquo;You know it does. But Ben was very clear- we are not supposed to get involved.&rdquo;<br/>&ldquo;But-&rdquo;<br/>&ldquo;No buts Steve. The best thing we can do is move on and hope the kid comes back to us later on, hope he wants to be an avenger then.&rdquo; Steve sighed and shook his head. <br/>&ldquo;I can&rsquo;t accept that Tony. You can&rsquo;t either, even if you won&rsquo;t admit it now. You want to go and get him as much as I do-&rdquo;<br/>&ldquo;But we can do nothing Steve. Don&rsquo;t you have some mission to attend to or?&rdquo; Steve raised a brow. <br/>&ldquo;So you&rsquo;re just going to pretend like the last couple of months never happened?&rdquo; Steve demanded and Tony sighed. <br/>&ldquo;What do you want me to say? That I miss a kid that was never mine? That I wish May and Ben would gain some common sense and understand that he&rsquo;d be better off here? That a part of me hates Ben for taking Peter away? Steve He isn&rsquo;t ours!&rdquo; Tony shouted and Steve shook his head. <br/>&ldquo;But you wanted him to be.&rdquo;<br/>&ldquo;That was never an option. He was never going to be ours and he never will be. Now get your self righteous ass out of my workshop!&rdquo; Tony snapped and Steve shook his head. <br/>&ldquo;Why won&rsquo;t you admit that you wanted Peter?&rdquo; Steve demanded. <br/>&ldquo;Why do you care?&rdquo; Tony didn&rsquo;t want to talk about this. <br/>&ldquo;Because you&rsquo;re the only person who understands what it feels like to lose Peter.&rdquo; Steve murmured and tony sighed. <br/>&ldquo;Just go Steve. I don&rsquo;t want to talk about this. I <i>can&rsquo;t</i> talk about this. <i>Please</i>.&rdquo; Steve sighed but nodded his head. He got up and left, slamming the door shut behind him.\n\n<br/></p><hr><p>\n\nSteve was standing in the kitchen, bleary eyed and pouring milk into his cereal. He hadn&rsquo;t spoken to Tony in a week and didn&rsquo;t feel slightly inclined to talk to him today. When Peter was around&hellip; Tony seemed tolerable. Now Tony had reverted back to the same old asshole that he used to be. There was a banging at the front door and with a deep sigh, Steve went to answer it. There was a slight scar from the bullet but he had healed well. Steve opened the door to find May. Her eyes were red and swollen and she had a crying Peter on her hip. <br/>&ldquo;Take him. Please. I just can&rsquo;t-&rdquo; <br/>&ldquo;What&rsquo;s wrong?&rdquo; Steve asked and took Peter. <br/>&ldquo;I can&rsquo;t be here.&rdquo; She then sprinted down the driveway, got in her car and sped off. Peter didn&rsquo;t settle, only continued to cry. <br/>&ldquo;Steve?&rdquo; It was Natasha&rsquo;s voice. But Steve had his phone out and was calling Ben. Had he gotten into a fight with May? The phone went to voicemail. This time he tried May. She didn&rsquo;t answer. <br/>&ldquo;Somethings wrong with May. She was crying and she handed Peter over and then ran&hellip;&rdquo;<br/>&ldquo;Was Ben there?&rdquo; Nat asked and Steve shook his head. <br/>&ldquo;They won&rsquo;t answer their phones.&rdquo; Steve made an attempt to calm Peter down but the wailing continued. <br/>&ldquo;I&rsquo;m going to take him to Tony. Maybe his powers were too much&hellip;&rdquo; Nat nodded and Steve headed down to Tony&rsquo;s workshop. When Steve got to the workshop, coffee cups were strewn all about the place. <br/>&ldquo;Tony?&rdquo; Steve asked softly and Tony turned. Spotting Peter immediately. <br/>&ldquo;Why do you have him?&rdquo; Tony blurted and Steve handed him over. Tony hugging him immediately. <br/>&ldquo;May was crying, something&rsquo;s wrong Tony, and I can&rsquo;t get ahold of her or Ben and-&rdquo;<br/>&ldquo;It&rsquo;s going to be alright Steve. I&rsquo;ll call them and watch Peter. Maybe you should go out looking for them?&rdquo; Tony offered. <br/>&ldquo;No need.&rdquo; Nat said from the doorway. May beside her. <br/>&ldquo;May?&rdquo; Steve asked. <br/>&ldquo;I feel bad. Leaving him like that, so I turned around and I just, I can&rsquo;t do it alone.&rdquo;<br/>&ldquo;Alone?&rdquo; Tony asked. <br/>&ldquo;Ben&hellip;&rdquo; May began crying and shook her head. <br/>&ldquo;What? What happened May?&rdquo; Natasha asked gently. <br/>&ldquo;They caught the guy who killed him. He&rsquo;s going to prison, but I just&hellip;I can&rsquo;t raise Peter. Not alone.&rdquo; Ben was dead. Steve shared a look with Tony. This poor woman had lost so much. <br/>&ldquo;You&rsquo;re grieving May. Why don&rsquo;t we look after Peter for a little while and you can decide later. You might just need time&hellip;&rdquo; she nodded. <br/>&ldquo;I just can&rsquo;t be here. I can&rsquo;t do this.&rdquo; And then she left with Natasha. Tony held Peter tightly to his chest and tony was watching Steve very closely. <br/>&ldquo;I know we wanted Peter to be ours but&hellip;&rdquo; Tony couldn&rsquo;t even finish the sentence. But Steve understood. <br/>&ldquo;Not like this.&rdquo; Steve agreed. <br/>&ldquo;If she really doesn&rsquo;t want him though, I&rsquo;m not going to abandon him.&rdquo; Steve nodded. <br/>&ldquo;Agreed.&rdquo; Tony sat down and studied Peter, who had mercifully stopped crying. <br/>&ldquo;We&rsquo;re going to have to baby proof the entire damn building.&rdquo; Tony muttered. <br/>&ldquo;We don&rsquo;t have to.&rdquo; Steve thought of the one place he kept secret from the avengers. <br/>&ldquo;Why not?&rdquo; <br/>&ldquo;I have an apartment. In Brooklyn. It&rsquo;d be easier to look after him there&hellip;&rdquo; <br/>&ldquo;Why am I only learning about this now?&rdquo;<br/>&ldquo;I asked Jarvis to not say anything and&hellip;&rdquo; Steve shrugged. <br/>&ldquo;Okay, well we can baby proof your secret apartment and take shifts looking after Peter until May makes a decision.&rdquo; Steve nodded.<br/>&ldquo;Okay.&rdquo; This could work. This <i>would</i> work. \n\n<br/></p><hr><p>\n\nTony soon realised he and Steve had both seriously underestimated just how hard it was to look after Peter. An hour into Steve&rsquo;s first shift, Tony got a phone call requesting help. Tony had lasted a triumphant three hours before calling Steve. So now they were co-parenting. Full time. Which was strange. But the first time Tony had walked into Steve&rsquo;s apartment, it felt strange. Homey. Which was a foreign thing to Tony. There was an amazing view of the skyline, there were books and sketches and clothes everywhere. His kitchen was small and could barely fit three people in it. But it was homey. And Tony found he loved to spend time there. More than his workshop. </p><p>&ldquo;Okay Pete I&rsquo;m going to make us some lunch, so no climbing the walls or the roof. Okay?&rdquo; Peter giggled. It had become a routine now, they had been doing this for a couple weeks and the guilt of enjoying this vanished very quickly. Now Tony just enjoyed every second with Peter. But as much as he loved Steve&rsquo;s apartment, he hated Steve&rsquo;s couch. It was leather and old and totally uncomfortable to sleep on. He knew he could always go back to the compound to sleep, but hated the idea of leaving Peter. So tony put up with the couch while Steve slept in his bedroom. Tony opened the cupboards and found an old packet of two minute noodles. With a frown, tony decided to check the empty fridge. <br/>&ldquo;I think we need to go grocery shopping Pete.&rdquo; Tony muttered. Steve was out, training with Nat or something. It didn&rsquo;t bother Tony all that much, but it felt a little strange going grocery shopping for cap&rsquo;s kitchen. What if Tony bought the wrong cereal? And should Tony get coffee? Because Steve didn&rsquo;t even have a coffee machine here, which Tony was struggling with. It just made more sense to buy the damn coffee machine, but Tony didn&rsquo;t want to invade Steve&rsquo;s space. <br/>&ldquo;This is weird isn&rsquo;t it kid?&rdquo; Tony asked but Peter being a toddler, didn&rsquo;t respond. <br/>&ldquo;I mean, Steve and I are barely even civil and I&rsquo;m sleeping on his couch!&rdquo; Tony ran a hand through his hair. This was crazy. Tony felt tempted to run, but knew that would be stupid. They were going to make this work. For Peter. <br/>&ldquo;This is gonna work. We will make this work for you kid. So you better appreciate it when you&rsquo;re older.&rdquo; Tony told him. Peter merely smiled at tony. <br/>&ldquo;Are you even hungry?&rdquo; Tony asked. Peter merely stared and Tony sat down next to him. <br/>&ldquo;I&rsquo;ve been researching everything about being a good father. My dad wasn&rsquo;t good to me and if we do end up keeping you, I want to be a good father. Someone you can count on&hellip;&rdquo; Tony never wanted Peter to walk into someone else&rsquo;s home and find it strange because he had never experienced a home before. <br/>&ldquo;Tony?&rdquo; Steve swung the door open and mercifully had bought food. <br/>&ldquo;Oh thank god, we were going to starve.&rdquo; Steve rolled his eyes and placed the food down on the counter. <br/>&ldquo;I checked this morning before I left, how&rsquo;s he been today?&rdquo;<br/>&ldquo;Good. I think he&rsquo;s settled into this routine. With you and me and this place.&rdquo; Steve nodded and began to put things in cupboards and in the fridge. <br/>&ldquo;I bought you some instant coffee which I know isn&rsquo;t as good as a coffee machine but-in case this doesn&rsquo;t work out, I didn&rsquo;t want to invest in a coffee machine just yet.&rdquo; It was an olive branch. Steve had bought Tony coffee. <br/>&ldquo;Thanks.&rdquo; Steve smiled, seemingly relieved that tony wasn&rsquo;t going to argue.<br/>&ldquo;How is everyone back at the compound?&rdquo; Tony asked. <br/>&ldquo;Good. They think this is very weird but they&rsquo;ve gotten used to us not being around as much.&rdquo; Steve shrugged. <br/>&ldquo;I was thinking about swinging by later, tinkering with the suit for a bit&hellip;&rdquo; Steve nodded. <br/>&ldquo;Sure. I&rsquo;ve got no plans tonight so I&rsquo;m happy to look after the little guy.&rdquo; Steve said over his shoulder and tony nodded. <br/>&ldquo;Have you heard from May recently?&rdquo; Tony asked. <br/>&ldquo;No. Not a word. Nat checks up on her though. Makes sure she is doing alright.&rdquo; Steve murmured and Tony nodded. <br/>&ldquo;I can&rsquo;t even begin to imagine what she must be feeling right now.&rdquo; Tony murmured. And a part of him hoped he would never have to go through that. That he&rsquo;d never have to experience the horror of losing those he loved the most. He already lost his parents in a car accident. <br/>&ldquo;She&rsquo;s a strong woman. She&rsquo;ll get through this.&rdquo; Steve began to make lunch and Tony smiled, his stomach seemed to settle a little now that food was on the way. <br/>&ldquo;Yeah. She will.&rdquo;\n\n<br/></p><hr><p>Steve and Tony were in the middle of watching the lion king with Peter when the doorbell rang. It was pouring with rain outside and Steve wasn&rsquo;t expecting anyone. It had been a risk, buying Tony the coffee. But it seemed worth it now. It was a step in the right direction apparently. Tony paused the movie as Steve got up to answer the door. <br/>&ldquo;Pizza must be here.&rdquo; Steve murmured. They had both been far too lazy to cook dinner and had just ordered pizza. Steve grabbed the money and swung the door open, ready to pay for the pizza but it wasn&rsquo;t the pizza guy standing there. <br/>&ldquo;May?&rdquo; His heart was pounding, mind racing. <br/>&ldquo;Hi Steve. Can I come in?&rdquo;<br/>&ldquo;Of course.&rdquo; And he stepped aside, letting her in. <br/>&ldquo;Natasha told me you&rsquo;d be here.&rdquo; She smiled at Peter and Steve&rsquo;s heart sunk a little. <br/>&ldquo;How are you holding up?&rdquo; Steve asked. <br/>&ldquo;I&rsquo;ve been a lot better.&rdquo; May admitted and Steve noticed how Tony was studying Peter. <br/>&ldquo;I&rsquo;m so sorry May.&rdquo; Steve murmured and she nodded. <br/>&ldquo;I know I haven&rsquo;t been fair to the two of you, dropping by to sleep whilst you babysit and abandoning Peter all together. I haven&rsquo;t been the best guardian to him.&rdquo; There was a lump in the back of Steve&rsquo;s throat. His gut was churning. Here it was. Her decision. The truth. <br/>&ldquo;You&rsquo;ve been through a lot.&rdquo; Steve was relieved Tony spoke, because Steve was pretty sure he had lost all of his abillity of speech.<br/>&ldquo;I know. But I should have been better. Tried harder. And I&rsquo;m still in a bad way, but I&rsquo;m seeing a therapist which is helping.&rdquo; May murmured. <br/>&ldquo;That&rsquo;s good.&rdquo; Twice Peter has been ripped away from them. Steve wasn&rsquo;t sure he could bare it a third time. <br/>&ldquo;My therapist helped me come to this decision. I left the two of you as anonymous trusted family friends. But I want you two to know I made this decision with a clear head and I have a second opinion which didn&rsquo;t in any way effect the outcome of this decision.&rdquo; <i>Just say it already. Rip it off like a band aid. </i>Steve couldn&rsquo;t bare the wait. The anticipation. He just wanted to know her choice. <br/>&ldquo;This wasn&rsquo;t an easy decision. But it is the best decision. For the both of us.&rdquo; Tony was watching Steve. They were both terrified and anxious. <br/>&ldquo;I&rsquo;ve decided that Peter is better off living with the two of you. But I still want to be involved in his life. Like Friday night dinner or something.&rdquo; Steve let out a deep and relieved breath. He was ecstatic. <br/>&ldquo;Of course May.&rdquo; He couldn&rsquo;t surprise the grin and neither could tony. <br/>&ldquo;So we&rsquo;ll foster him?&rdquo; Tony asked and May shook her head. <br/>&ldquo;It would be easier if the two of you simply adopted him. I can arrange for a lawyer to talk to us all on Tuesday.&rdquo; May explained and tony shared a look with Steve. While the co-parenting was working right now, would it still be working in five months? A year? What about when Peter was a teenager? When they were off on missions? Was adoption truly the best option? A silent conversation passed between them. Steve nodded and Tony did too. <br/>&ldquo;Sounds perfect May. Thank you.&rdquo; Steve said, his grin grew even wider. <br/>&ldquo;We would love to adopt him.&rdquo; Tony murmured and looked down at Peter. <i>My son</i>. And this time, it was true. Peter really was theirs now. And now they really, truly, did have to make this work. They were in it for the long haul and there was no backing out. Peter was their responsibility and with a bit of luck, it would remain that way forever.</p>",
        "body_abstract": "\n<p>Title: We Are A Family.<br>Pairings: Steve x tony, Peter x Wade, Nat x Clint, Sam x Bucky.<br>Part: 3/?<br>Warnings: swearing, fluff, angst, violence, eventual smut, slowburn.<br>Summary: When Nat comes into the avengers tower with baby Peter Parker, the avengers didn&rsquo;t know what they were getting themselves into. But now that Peter is here,Steve and Tony both feel protective over him. It doesn&rsquo;t help that Peter hates everyone other than Steve and tony. But as Steve and tony raise Peter, they start to fall for one another. Will this superfamily work out or will it all turn to hell?\n\n<br></p>\n<p><a href=\"http://fandomfanfics12.tumblr.com/post/169767449338/we-are-a-family-part-1\">Part 1</a>, <a href=\"http://fandomfanfics12.tumblr.com/post/176056617463/we-are-a-family-part-2\">Part 2</a></p>\n<figure class=\"tmblr-full\" data-orig-height=\"200\" data-orig-width=\"500\" data-tumblr-attribution=\"hey-kids-want-some-avengers:HA9nF7UfNpwcSr4D-2Ey-A:ZuKLoh23tEdUN\"><img src=\"https://66.media.tumblr.com/15e9a60abbd655c737739ce86f0e4777/tumblr_o4j0w3pOZn1v9mi9to1_500.gif\" data-orig-height=\"200\" data-orig-width=\"500\"></figure>\n",
        "reblog": {
            "comment": "<p>Title: We Are A Family.<br>Pairings: Steve x tony, Peter x Wade, Nat x Clint, Sam x Bucky.<br>Part: 3/?<br>Warnings: swearing, fluff, angst, violence, eventual smut, slowburn.<br>Summary: When Nat comes into the avengers tower with baby Peter Parker, the avengers didn’t know what they were getting themselves into. But now that Peter is here,Steve and Tony both feel protective over him. It doesn’t help that Peter hates everyone other than Steve and tony. But as Steve and tony raise Peter, they start to fall for one another. Will this superfamily work out or will it all turn to hell?\n\n<br></p><p><a href=\"http://fandomfanfics12.tumblr.com/post/169767449338/we-are-a-family-part-1\">Part 1</a>, <a href=\"http://fandomfanfics12.tumblr.com/post/176056617463/we-are-a-family-part-2\">Part 2</a></p><figure class=\"tmblr-full\" data-orig-height=\"200\" data-orig-width=\"500\" data-tumblr-attribution=\"hey-kids-want-some-avengers:HA9nF7UfNpwcSr4D-2Ey-A:ZuKLoh23tEdUN\"><img src=\"https://66.media.tumblr.com/15e9a60abbd655c737739ce86f0e4777/tumblr_o4j0w3pOZn1v9mi9to1_500.gif\" data-orig-height=\"200\" data-orig-width=\"500\"></figure>[[MORE]]<p>\n\nTony knew that Steve was spending more time at the supermarket. Knew it was because he wanted to see Peter. And Tony was tempted to do the same thing. But he managed to refrain. Ben had been very clear, he didn’t want them involved. So Tony was making a point of not getting involved. But it was killing a small part of him, not seeing that smiling, giggling face Peter bore. It had been more than a month since Tony had seen that face. Tony shook his head, burying himself deeper into his work. That’s when Steve walked into the workshop, and sat down on the couch. <br>“Hello to you too Rogers.” Tony murmured dryly. <br>“Does this not bother you?” Steve demanded and Tony sighed. <br>“You know it does. But Ben was very clear- we are not supposed to get involved.”<br>“But-”<br>“No buts Steve. The best thing we can do is move on and hope the kid comes back to us later on, hope he wants to be an avenger then.” Steve sighed and shook his head. <br>“I can’t accept that Tony. You can’t either, even if you won’t admit it now. You want to go and get him as much as I do-”<br>“But we can do nothing Steve. Don’t you have some mission to attend to or?” Steve raised a brow. <br>“So you’re just going to pretend like the last couple of months never happened?” Steve demanded and Tony sighed. <br>“What do you want me to say? That I miss a kid that was never mine? That I wish May and Ben would gain some common sense and understand that he’d be better off here? That a part of me hates Ben for taking Peter away? Steve He isn’t ours!” Tony shouted and Steve shook his head. <br>“But you wanted him to be.”<br>“That was never an option. He was never going to be ours and he never will be. Now get your self righteous ass out of my workshop!” Tony snapped and Steve shook his head. <br>“Why won’t you admit that you wanted Peter?” Steve demanded. <br>“Why do you care?” Tony didn’t want to talk about this. <br>“Because you’re the only person who understands what it feels like to lose Peter.” Steve murmured and tony sighed. <br>“Just go Steve. I don’t want to talk about this. I <i>can’t</i> talk about this. <i>Please</i>.” Steve sighed but nodded his head. He got up and left, slamming the door shut behind him.\n\n<br></p><hr><p>\n\nSteve was standing in the kitchen, bleary eyed and pouring milk into his cereal. He hadn’t spoken to Tony in a week and didn’t feel slightly inclined to talk to him today. When Peter was around… Tony seemed tolerable. Now Tony had reverted back to the same old asshole that he used to be. There was a banging at the front door and with a deep sigh, Steve went to answer it. There was a slight scar from the bullet but he had healed well. Steve opened the door to find May. Her eyes were red and swollen and she had a crying Peter on her hip. <br>“Take him. Please. I just can’t-” <br>“What’s wrong?” Steve asked and took Peter. <br>“I can’t be here.” She then sprinted down the driveway, got in her car and sped off. Peter didn’t settle, only continued to cry. <br>“Steve?” It was Natasha’s voice. But Steve had his phone out and was calling Ben. Had he gotten into a fight with May? The phone went to voicemail. This time he tried May. She didn’t answer. <br>“Somethings wrong with May. She was crying and she handed Peter over and then ran…”<br>“Was Ben there?” Nat asked and Steve shook his head. <br>“They won’t answer their phones.” Steve made an attempt to calm Peter down but the wailing continued. <br>“I’m going to take him to Tony. Maybe his powers were too much…” Nat nodded and Steve headed down to Tony’s workshop. When Steve got to the workshop, coffee cups were strewn all about the place. <br>“Tony?” Steve asked softly and Tony turned. Spotting Peter immediately. <br>“Why do you have him?” Tony blurted and Steve handed him over. Tony hugging him immediately. <br>“May was crying, something’s wrong Tony, and I can’t get ahold of her or Ben and-”<br>“It’s going to be alright Steve. I’ll call them and watch Peter. Maybe you should go out looking for them?” Tony offered. <br>“No need.” Nat said from the doorway. May beside her. <br>“May?” Steve asked. <br>“I feel bad. Leaving him like that, so I turned around and I just, I can’t do it alone.”<br>“Alone?” Tony asked. <br>“Ben…” May began crying and shook her head. <br>“What? What happened May?” Natasha asked gently. <br>“They caught the guy who killed him. He’s going to prison, but I just…I can’t raise Peter. Not alone.” Ben was dead. Steve shared a look with Tony. This poor woman had lost so much. <br>“You’re grieving May. Why don’t we look after Peter for a little while and you can decide later. You might just need time…” she nodded. <br>“I just can’t be here. I can’t do this.” And then she left with Natasha. Tony held Peter tightly to his chest and tony was watching Steve very closely. <br>“I know we wanted Peter to be ours but…” Tony couldn’t even finish the sentence. But Steve understood. <br>“Not like this.” Steve agreed. <br>“If she really doesn’t want him though, I’m not going to abandon him.” Steve nodded. <br>“Agreed.” Tony sat down and studied Peter, who had mercifully stopped crying. <br>“We’re going to have to baby proof the entire damn building.” Tony muttered. <br>“We don’t have to.” Steve thought of the one place he kept secret from the avengers. <br>“Why not?” <br>“I have an apartment. In Brooklyn. It’d be easier to look after him there…” <br>“Why am I only learning about this now?”<br>“I asked Jarvis to not say anything and…” Steve shrugged. <br>“Okay, well we can baby proof your secret apartment and take shifts looking after Peter until May makes a decision.” Steve nodded.<br>“Okay.” This could work. This <i>would</i> work. \n\n<br></p><hr><p>\n\nTony soon realised he and Steve had both seriously underestimated just how hard it was to look after Peter. An hour into Steve’s first shift, Tony got a phone call requesting help. Tony had lasted a triumphant three hours before calling Steve. So now they were co-parenting. Full time. Which was strange. But the first time Tony had walked into Steve’s apartment, it felt strange. Homey. Which was a foreign thing to Tony. There was an amazing view of the skyline, there were books and sketches and clothes everywhere. His kitchen was small and could barely fit three people in it. But it was homey. And Tony found he loved to spend time there. More than his workshop. </p><p>“Okay Pete I’m going to make us some lunch, so no climbing the walls or the roof. Okay?” Peter giggled. It had become a routine now, they had been doing this for a couple weeks and the guilt of enjoying this vanished very quickly. Now Tony just enjoyed every second with Peter. But as much as he loved Steve’s apartment, he hated Steve’s couch. It was leather and old and totally uncomfortable to sleep on. He knew he could always go back to the compound to sleep, but hated the idea of leaving Peter. So tony put up with the couch while Steve slept in his bedroom. Tony opened the cupboards and found an old packet of two minute noodles. With a frown, tony decided to check the empty fridge. <br>“I think we need to go grocery shopping Pete.” Tony muttered. Steve was out, training with Nat or something. It didn’t bother Tony all that much, but it felt a little strange going grocery shopping for cap’s kitchen. What if Tony bought the wrong cereal? And should Tony get coffee? Because Steve didn’t even have a coffee machine here, which Tony was struggling with. It just made more sense to buy the damn coffee machine, but Tony didn’t want to invade Steve’s space. <br>“This is weird isn’t it kid?” Tony asked but Peter being a toddler, didn’t respond. <br>“I mean, Steve and I are barely even civil and I’m sleeping on his couch!” Tony ran a hand through his hair. This was crazy. Tony felt tempted to run, but knew that would be stupid. They were going to make this work. For Peter. <br>“This is gonna work. We will make this work for you kid. So you better appreciate it when you’re older.” Tony told him. Peter merely smiled at tony. <br>“Are you even hungry?” Tony asked. Peter merely stared and Tony sat down next to him. <br>“I’ve been researching everything about being a good father. My dad wasn’t good to me and if we do end up keeping you, I want to be a good father. Someone you can count on…” Tony never wanted Peter to walk into someone else’s home and find it strange because he had never experienced a home before. <br>“Tony?” Steve swung the door open and mercifully had bought food. <br>“Oh thank god, we were going to starve.” Steve rolled his eyes and placed the food down on the counter. <br>“I checked this morning before I left, how’s he been today?”<br>“Good. I think he’s settled into this routine. With you and me and this place.” Steve nodded and began to put things in cupboards and in the fridge. <br>“I bought you some instant coffee which I know isn’t as good as a coffee machine but-in case this doesn’t work out, I didn’t want to invest in a coffee machine just yet.” It was an olive branch. Steve had bought Tony coffee. <br>“Thanks.” Steve smiled, seemingly relieved that tony wasn’t going to argue.<br>“How is everyone back at the compound?” Tony asked. <br>“Good. They think this is very weird but they’ve gotten used to us not being around as much.” Steve shrugged. <br>“I was thinking about swinging by later, tinkering with the suit for a bit…” Steve nodded. <br>“Sure. I’ve got no plans tonight so I’m happy to look after the little guy.” Steve said over his shoulder and tony nodded. <br>“Have you heard from May recently?” Tony asked. <br>“No. Not a word. Nat checks up on her though. Makes sure she is doing alright.” Steve murmured and Tony nodded. <br>“I can’t even begin to imagine what she must be feeling right now.” Tony murmured. And a part of him hoped he would never have to go through that. That he’d never have to experience the horror of losing those he loved the most. He already lost his parents in a car accident. <br>“She’s a strong woman. She’ll get through this.” Steve began to make lunch and Tony smiled, his stomach seemed to settle a little now that food was on the way. <br>“Yeah. She will.”\n\n<br></p><hr><p>Steve and Tony were in the middle of watching the lion king with Peter when the doorbell rang. It was pouring with rain outside and Steve wasn’t expecting anyone. It had been a risk, buying Tony the coffee. But it seemed worth it now. It was a step in the right direction apparently. Tony paused the movie as Steve got up to answer the door. <br>“Pizza must be here.” Steve murmured. They had both been far too lazy to cook dinner and had just ordered pizza. Steve grabbed the money and swung the door open, ready to pay for the pizza but it wasn’t the pizza guy standing there. <br>“May?” His heart was pounding, mind racing. <br>“Hi Steve. Can I come in?”<br>“Of course.” And he stepped aside, letting her in. <br>“Natasha told me you’d be here.” She smiled at Peter and Steve’s heart sunk a little. <br>“How are you holding up?” Steve asked. <br>“I’ve been a lot better.” May admitted and Steve noticed how Tony was studying Peter. <br>“I’m so sorry May.” Steve murmured and she nodded. <br>“I know I haven’t been fair to the two of you, dropping by to sleep whilst you babysit and abandoning Peter all together. I haven’t been the best guardian to him.” There was a lump in the back of Steve’s throat. His gut was churning. Here it was. Her decision. The truth. <br>“You’ve been through a lot.” Steve was relieved Tony spoke, because Steve was pretty sure he had lost all of his abillity of speech.<br>“I know. But I should have been better. Tried harder. And I’m still in a bad way, but I’m seeing a therapist which is helping.” May murmured. <br>“That’s good.” Twice Peter has been ripped away from them. Steve wasn’t sure he could bare it a third time. <br>“My therapist helped me come to this decision. I left the two of you as anonymous trusted family friends. But I want you two to know I made this decision with a clear head and I have a second opinion which didn’t in any way effect the outcome of this decision.” <i>Just say it already. Rip it off like a band aid. </i>Steve couldn’t bare the wait. The anticipation. He just wanted to know her choice. <br>“This wasn’t an easy decision. But it is the best decision. For the both of us.” Tony was watching Steve. They were both terrified and anxious. <br>“I’ve decided that Peter is better off living with the two of you. But I still want to be involved in his life. Like Friday night dinner or something.” Steve let out a deep and relieved breath. He was ecstatic. <br>“Of course May.” He couldn’t surprise the grin and neither could tony. <br>“So we’ll foster him?” Tony asked and May shook her head. <br>“It would be easier if the two of you simply adopted him. I can arrange for a lawyer to talk to us all on Tuesday.” May explained and tony shared a look with Steve. While the co-parenting was working right now, would it still be working in five months? A year? What about when Peter was a teenager? When they were off on missions? Was adoption truly the best option? A silent conversation passed between them. Steve nodded and Tony did too. <br>“Sounds perfect May. Thank you.” Steve said, his grin grew even wider. <br>“We would love to adopt him.” Tony murmured and looked down at Peter. <i>My son</i>. And this time, it was true. Peter really was theirs now. And now they really, truly, did have to make this work. They were in it for the long haul and there was no backing out. Peter was their responsibility and with a bit of luck, it would remain that way forever.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fandomfanfics12",
                    "active": true,
                    "theme": {
                        "header_full_width": 562,
                        "header_full_height": 307,
                        "header_focus_width": 545,
                        "header_focus_height": 307,
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,553,307,8",
                        "header_image": "https://static.tumblr.com/842f092786d525588b5fb680aba3381d/vpci9w3/J9Cpd334k/tumblr_static_34d5hwvkcoqowoccwoko48ko4.jpg",
                        "header_image_focused": "https://static.tumblr.com/842f092786d525588b5fb680aba3381d/vpci9w3/u3Npd334l/tumblr_static_tumblr_static_34d5hwvkcoqowoccwoko48ko4_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/842f092786d525588b5fb680aba3381d/vpci9w3/J9Cpd334k/tumblr_static_34d5hwvkcoqowoccwoko48ko4_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176691722833"
                },
                "content_raw": "<p>Title: We Are A Family.<br>Pairings: Steve x tony, Peter x Wade, Nat x Clint, Sam x Bucky.<br>Part: 3/?<br>Warnings: swearing, fluff, angst, violence, eventual smut, slowburn.<br>Summary: When Nat comes into the avengers tower with baby Peter Parker, the avengers didn’t know what they were getting themselves into. But now that Peter is here,Steve and Tony both feel protective over him. It doesn’t help that Peter hates everyone other than Steve and tony. But as Steve and tony raise Peter, they start to fall for one another. Will this superfamily work out or will it all turn to hell?\n\n<br></p><p><a href=\"http://fandomfanfics12.tumblr.com/post/169767449338/we-are-a-family-part-1\">Part 1</a>, <a href=\"http://fandomfanfics12.tumblr.com/post/176056617463/we-are-a-family-part-2\">Part 2</a></p><figure class=\"tmblr-full\" data-orig-height=\"200\" data-orig-width=\"500\" data-tumblr-attribution=\"hey-kids-want-some-avengers:HA9nF7UfNpwcSr4D-2Ey-A:ZuKLoh23tEdUN\"><img src=\"https://66.media.tumblr.com/15e9a60abbd655c737739ce86f0e4777/tumblr_o4j0w3pOZn1v9mi9to1_500.gif\" data-orig-height=\"200\" data-orig-width=\"500\"></figure>[[MORE]]<p>\n\nTony knew that Steve was spending more time at the supermarket. Knew it was because he wanted to see Peter. And Tony was tempted to do the same thing. But he managed to refrain. Ben had been very clear, he didn’t want them involved. So Tony was making a point of not getting involved. But it was killing a small part of him, not seeing that smiling, giggling face Peter bore. It had been more than a month since Tony had seen that face. Tony shook his head, burying himself deeper into his work. That’s when Steve walked into the workshop, and sat down on the couch. <br>“Hello to you too Rogers.” Tony murmured dryly. <br>“Does this not bother you?” Steve demanded and Tony sighed. <br>“You know it does. But Ben was very clear- we are not supposed to get involved.”<br>“But-”<br>“No buts Steve. The best thing we can do is move on and hope the kid comes back to us later on, hope he wants to be an avenger then.” Steve sighed and shook his head. <br>“I can’t accept that Tony. You can’t either, even if you won’t admit it now. You want to go and get him as much as I do-”<br>“But we can do nothing Steve. Don’t you have some mission to attend to or?” Steve raised a brow. <br>“So you’re just going to pretend like the last couple of months never happened?” Steve demanded and Tony sighed. <br>“What do you want me to say? That I miss a kid that was never mine? That I wish May and Ben would gain some common sense and understand that he’d be better off here? That a part of me hates Ben for taking Peter away? Steve He isn’t ours!” Tony shouted and Steve shook his head. <br>“But you wanted him to be.”<br>“That was never an option. He was never going to be ours and he never will be. Now get your self righteous ass out of my workshop!” Tony snapped and Steve shook his head. <br>“Why won’t you admit that you wanted Peter?” Steve demanded. <br>“Why do you care?” Tony didn’t want to talk about this. <br>“Because you’re the only person who understands what it feels like to lose Peter.” Steve murmured and tony sighed. <br>“Just go Steve. I don’t want to talk about this. I <i>can’t</i> talk about this. <i>Please</i>.” Steve sighed but nodded his head. He got up and left, slamming the door shut behind him.\n\n<br></p><hr><p>\n\nSteve was standing in the kitchen, bleary eyed and pouring milk into his cereal. He hadn’t spoken to Tony in a week and didn’t feel slightly inclined to talk to him today. When Peter was around… Tony seemed tolerable. Now Tony had reverted back to the same old asshole that he used to be. There was a banging at the front door and with a deep sigh, Steve went to answer it. There was a slight scar from the bullet but he had healed well. Steve opened the door to find May. Her eyes were red and swollen and she had a crying Peter on her hip. <br>“Take him. Please. I just can’t-” <br>“What’s wrong?” Steve asked and took Peter. <br>“I can’t be here.” She then sprinted down the driveway, got in her car and sped off. Peter didn’t settle, only continued to cry. <br>“Steve?” It was Natasha’s voice. But Steve had his phone out and was calling Ben. Had he gotten into a fight with May? The phone went to voicemail. This time he tried May. She didn’t answer. <br>“Somethings wrong with May. She was crying and she handed Peter over and then ran…”<br>“Was Ben there?” Nat asked and Steve shook his head. <br>“They won’t answer their phones.” Steve made an attempt to calm Peter down but the wailing continued. <br>“I’m going to take him to Tony. Maybe his powers were too much…” Nat nodded and Steve headed down to Tony’s workshop. When Steve got to the workshop, coffee cups were strewn all about the place. <br>“Tony?” Steve asked softly and Tony turned. Spotting Peter immediately. <br>“Why do you have him?” Tony blurted and Steve handed him over. Tony hugging him immediately. <br>“May was crying, something’s wrong Tony, and I can’t get ahold of her or Ben and-”<br>“It’s going to be alright Steve. I’ll call them and watch Peter. Maybe you should go out looking for them?” Tony offered. <br>“No need.” Nat said from the doorway. May beside her. <br>“May?” Steve asked. <br>“I feel bad. Leaving him like that, so I turned around and I just, I can’t do it alone.”<br>“Alone?” Tony asked. <br>“Ben…” May began crying and shook her head. <br>“What? What happened May?” Natasha asked gently. <br>“They caught the guy who killed him. He’s going to prison, but I just…I can’t raise Peter. Not alone.” Ben was dead. Steve shared a look with Tony. This poor woman had lost so much. <br>“You’re grieving May. Why don’t we look after Peter for a little while and you can decide later. You might just need time…” she nodded. <br>“I just can’t be here. I can’t do this.” And then she left with Natasha. Tony held Peter tightly to his chest and tony was watching Steve very closely. <br>“I know we wanted Peter to be ours but…” Tony couldn’t even finish the sentence. But Steve understood. <br>“Not like this.” Steve agreed. <br>“If she really doesn’t want him though, I’m not going to abandon him.” Steve nodded. <br>“Agreed.” Tony sat down and studied Peter, who had mercifully stopped crying. <br>“We’re going to have to baby proof the entire damn building.” Tony muttered. <br>“We don’t have to.” Steve thought of the one place he kept secret from the avengers. <br>“Why not?” <br>“I have an apartment. In Brooklyn. It’d be easier to look after him there…” <br>“Why am I only learning about this now?”<br>“I asked Jarvis to not say anything and…” Steve shrugged. <br>“Okay, well we can baby proof your secret apartment and take shifts looking after Peter until May makes a decision.” Steve nodded.<br>“Okay.” This could work. This <i>would</i> work. \n\n<br></p><hr><p>\n\nTony soon realised he and Steve had both seriously underestimated just how hard it was to look after Peter. An hour into Steve’s first shift, Tony got a phone call requesting help. Tony had lasted a triumphant three hours before calling Steve. So now they were co-parenting. Full time. Which was strange. But the first time Tony had walked into Steve’s apartment, it felt strange. Homey. Which was a foreign thing to Tony. There was an amazing view of the skyline, there were books and sketches and clothes everywhere. His kitchen was small and could barely fit three people in it. But it was homey. And Tony found he loved to spend time there. More than his workshop. </p><p>“Okay Pete I’m going to make us some lunch, so no climbing the walls or the roof. Okay?” Peter giggled. It had become a routine now, they had been doing this for a couple weeks and the guilt of enjoying this vanished very quickly. Now Tony just enjoyed every second with Peter. But as much as he loved Steve’s apartment, he hated Steve’s couch. It was leather and old and totally uncomfortable to sleep on. He knew he could always go back to the compound to sleep, but hated the idea of leaving Peter. So tony put up with the couch while Steve slept in his bedroom. Tony opened the cupboards and found an old packet of two minute noodles. With a frown, tony decided to check the empty fridge. <br>“I think we need to go grocery shopping Pete.” Tony muttered. Steve was out, training with Nat or something. It didn’t bother Tony all that much, but it felt a little strange going grocery shopping for cap’s kitchen. What if Tony bought the wrong cereal? And should Tony get coffee? Because Steve didn’t even have a coffee machine here, which Tony was struggling with. It just made more sense to buy the damn coffee machine, but Tony didn’t want to invade Steve’s space. <br>“This is weird isn’t it kid?” Tony asked but Peter being a toddler, didn’t respond. <br>“I mean, Steve and I are barely even civil and I’m sleeping on his couch!” Tony ran a hand through his hair. This was crazy. Tony felt tempted to run, but knew that would be stupid. They were going to make this work. For Peter. <br>“This is gonna work. We will make this work for you kid. So you better appreciate it when you’re older.” Tony told him. Peter merely smiled at tony. <br>“Are you even hungry?” Tony asked. Peter merely stared and Tony sat down next to him. <br>“I’ve been researching everything about being a good father. My dad wasn’t good to me and if we do end up keeping you, I want to be a good father. Someone you can count on…” Tony never wanted Peter to walk into someone else’s home and find it strange because he had never experienced a home before. <br>“Tony?” Steve swung the door open and mercifully had bought food. <br>“Oh thank god, we were going to starve.” Steve rolled his eyes and placed the food down on the counter. <br>“I checked this morning before I left, how’s he been today?”<br>“Good. I think he’s settled into this routine. With you and me and this place.” Steve nodded and began to put things in cupboards and in the fridge. <br>“I bought you some instant coffee which I know isn’t as good as a coffee machine but-in case this doesn’t work out, I didn’t want to invest in a coffee machine just yet.” It was an olive branch. Steve had bought Tony coffee. <br>“Thanks.” Steve smiled, seemingly relieved that tony wasn’t going to argue.<br>“How is everyone back at the compound?” Tony asked. <br>“Good. They think this is very weird but they’ve gotten used to us not being around as much.” Steve shrugged. <br>“I was thinking about swinging by later, tinkering with the suit for a bit…” Steve nodded. <br>“Sure. I’ve got no plans tonight so I’m happy to look after the little guy.” Steve said over his shoulder and tony nodded. <br>“Have you heard from May recently?” Tony asked. <br>“No. Not a word. Nat checks up on her though. Makes sure she is doing alright.” Steve murmured and Tony nodded. <br>“I can’t even begin to imagine what she must be feeling right now.” Tony murmured. And a part of him hoped he would never have to go through that. That he’d never have to experience the horror of losing those he loved the most. He already lost his parents in a car accident. <br>“She’s a strong woman. She’ll get through this.” Steve began to make lunch and Tony smiled, his stomach seemed to settle a little now that food was on the way. <br>“Yeah. She will.”\n\n<br></p><hr><p>Steve and Tony were in the middle of watching the lion king with Peter when the doorbell rang. It was pouring with rain outside and Steve wasn’t expecting anyone. It had been a risk, buying Tony the coffee. But it seemed worth it now. It was a step in the right direction apparently. Tony paused the movie as Steve got up to answer the door. <br>“Pizza must be here.” Steve murmured. They had both been far too lazy to cook dinner and had just ordered pizza. Steve grabbed the money and swung the door open, ready to pay for the pizza but it wasn’t the pizza guy standing there. <br>“May?” His heart was pounding, mind racing. <br>“Hi Steve. Can I come in?”<br>“Of course.” And he stepped aside, letting her in. <br>“Natasha told me you’d be here.” She smiled at Peter and Steve’s heart sunk a little. <br>“How are you holding up?” Steve asked. <br>“I’ve been a lot better.” May admitted and Steve noticed how Tony was studying Peter. <br>“I’m so sorry May.” Steve murmured and she nodded. <br>“I know I haven’t been fair to the two of you, dropping by to sleep whilst you babysit and abandoning Peter all together. I haven’t been the best guardian to him.” There was a lump in the back of Steve’s throat. His gut was churning. Here it was. Her decision. The truth. <br>“You’ve been through a lot.” Steve was relieved Tony spoke, because Steve was pretty sure he had lost all of his abillity of speech.<br>“I know. But I should have been better. Tried harder. And I’m still in a bad way, but I’m seeing a therapist which is helping.” May murmured. <br>“That’s good.” Twice Peter has been ripped away from them. Steve wasn’t sure he could bare it a third time. <br>“My therapist helped me come to this decision. I left the two of you as anonymous trusted family friends. But I want you two to know I made this decision with a clear head and I have a second opinion which didn’t in any way effect the outcome of this decision.” <i>Just say it already. Rip it off like a band aid. </i>Steve couldn’t bare the wait. The anticipation. He just wanted to know her choice. <br>“This wasn’t an easy decision. But it is the best decision. For the both of us.” Tony was watching Steve. They were both terrified and anxious. <br>“I’ve decided that Peter is better off living with the two of you. But I still want to be involved in his life. Like Friday night dinner or something.” Steve let out a deep and relieved breath. He was ecstatic. <br>“Of course May.” He couldn’t surprise the grin and neither could tony. <br>“So we’ll foster him?” Tony asked and May shook her head. <br>“It would be easier if the two of you simply adopted him. I can arrange for a lawyer to talk to us all on Tuesday.” May explained and tony shared a look with Steve. While the co-parenting was working right now, would it still be working in five months? A year? What about when Peter was a teenager? When they were off on missions? Was adoption truly the best option? A silent conversation passed between them. Steve nodded and Tony did too. <br>“Sounds perfect May. Thank you.” Steve said, his grin grew even wider. <br>“We would love to adopt him.” Tony murmured and looked down at Peter. <i>My son</i>. And this time, it was true. Peter really was theirs now. And now they really, truly, did have to make this work. They were in it for the long haul and there was no backing out. Peter was their responsibility and with a bit of luck, it would remain that way forever.</p>",
                "content": "<p>Title: We Are A Family.<br />Pairings: Steve x tony, Peter x Wade, Nat x Clint, Sam x Bucky.<br />Part: 3/?<br />Warnings: swearing, fluff, angst, violence, eventual smut, slowburn.<br />Summary: When Nat comes into the avengers tower with baby Peter Parker, the avengers didn&rsquo;t know what they were getting themselves into. But now that Peter is here,Steve and Tony both feel protective over him. It doesn&rsquo;t help that Peter hates everyone other than Steve and tony. But as Steve and tony raise Peter, they start to fall for one another. Will this superfamily work out or will it all turn to hell?\n\n<br /></p><p><a href=\"http://fandomfanfics12.tumblr.com/post/169767449338/we-are-a-family-part-1\">Part 1</a>, <a href=\"http://fandomfanfics12.tumblr.com/post/176056617463/we-are-a-family-part-2\">Part 2</a></p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><p>\n\nTony knew that Steve was spending more time at the supermarket. Knew it was because he wanted to see Peter. And Tony was tempted to do the same thing. But he managed to refrain. Ben had been very clear, he didn&rsquo;t want them involved. So Tony was making a point of not getting involved. But it was killing a small part of him, not seeing that smiling, giggling face Peter bore. It had been more than a month since Tony had seen that face. Tony shook his head, burying himself deeper into his work. That&rsquo;s when Steve walked into the workshop, and sat down on the couch. <br />&ldquo;Hello to you too Rogers.&rdquo; Tony murmured dryly. <br />&ldquo;Does this not bother you?&rdquo; Steve demanded and Tony sighed. <br />&ldquo;You know it does. But Ben was very clear- we are not supposed to get involved.&rdquo;<br />&ldquo;But-&rdquo;<br />&ldquo;No buts Steve. The best thing we can do is move on and hope the kid comes back to us later on, hope he wants to be an avenger then.&rdquo; Steve sighed and shook his head. <br />&ldquo;I can&rsquo;t accept that Tony. You can&rsquo;t either, even if you won&rsquo;t admit it now. You want to go and get him as much as I do-&rdquo;<br />&ldquo;But we can do nothing Steve. Don&rsquo;t you have some mission to attend to or?&rdquo; Steve raised a brow. <br />&ldquo;So you&rsquo;re just going to pretend like the last couple of months never happened?&rdquo; Steve demanded and Tony sighed. <br />&ldquo;What do you want me to say? That I miss a kid that was never mine? That I wish May and Ben would gain some common sense and understand that he&rsquo;d be better off here? That a part of me hates Ben for taking Peter away? Steve He isn&rsquo;t ours!&rdquo; Tony shouted and Steve shook his head. <br />&ldquo;But you wanted him to be.&rdquo;<br />&ldquo;That was never an option. He was never going to be ours and he never will be. Now get your self righteous ass out of my workshop!&rdquo; Tony snapped and Steve shook his head. <br />&ldquo;Why won&rsquo;t you admit that you wanted Peter?&rdquo; Steve demanded. <br />&ldquo;Why do you care?&rdquo; Tony didn&rsquo;t want to talk about this. <br />&ldquo;Because you&rsquo;re the only person who understands what it feels like to lose Peter.&rdquo; Steve murmured and tony sighed. <br />&ldquo;Just go Steve. I don&rsquo;t want to talk about this. I <i>can&rsquo;t</i> talk about this. <i>Please</i>.&rdquo; Steve sighed but nodded his head. He got up and left, slamming the door shut behind him.\n\n<br /></p><hr /><p>\n\nSteve was standing in the kitchen, bleary eyed and pouring milk into his cereal. He hadn&rsquo;t spoken to Tony in a week and didn&rsquo;t feel slightly inclined to talk to him today. When Peter was around&hellip; Tony seemed tolerable. Now Tony had reverted back to the same old asshole that he used to be. There was a banging at the front door and with a deep sigh, Steve went to answer it. There was a slight scar from the bullet but he had healed well. Steve opened the door to find May. Her eyes were red and swollen and she had a crying Peter on her hip. <br />&ldquo;Take him. Please. I just can&rsquo;t-&rdquo; <br />&ldquo;What&rsquo;s wrong?&rdquo; Steve asked and took Peter. <br />&ldquo;I can&rsquo;t be here.&rdquo; She then sprinted down the driveway, got in her car and sped off. Peter didn&rsquo;t settle, only continued to cry. <br />&ldquo;Steve?&rdquo; It was Natasha&rsquo;s voice. But Steve had his phone out and was calling Ben. Had he gotten into a fight with May? The phone went to voicemail. This time he tried May. She didn&rsquo;t answer. <br />&ldquo;Somethings wrong with May. She was crying and she handed Peter over and then ran&hellip;&rdquo;<br />&ldquo;Was Ben there?&rdquo; Nat asked and Steve shook his head. <br />&ldquo;They won&rsquo;t answer their phones.&rdquo; Steve made an attempt to calm Peter down but the wailing continued. <br />&ldquo;I&rsquo;m going to take him to Tony. Maybe his powers were too much&hellip;&rdquo; Nat nodded and Steve headed down to Tony&rsquo;s workshop. When Steve got to the workshop, coffee cups were strewn all about the place. <br />&ldquo;Tony?&rdquo; Steve asked softly and Tony turned. Spotting Peter immediately. <br />&ldquo;Why do you have him?&rdquo; Tony blurted and Steve handed him over. Tony hugging him immediately. <br />&ldquo;May was crying, something&rsquo;s wrong Tony, and I can&rsquo;t get ahold of her or Ben and-&rdquo;<br />&ldquo;It&rsquo;s going to be alright Steve. I&rsquo;ll call them and watch Peter. Maybe you should go out looking for them?&rdquo; Tony offered. <br />&ldquo;No need.&rdquo; Nat said from the doorway. May beside her. <br />&ldquo;May?&rdquo; Steve asked. <br />&ldquo;I feel bad. Leaving him like that, so I turned around and I just, I can&rsquo;t do it alone.&rdquo;<br />&ldquo;Alone?&rdquo; Tony asked. <br />&ldquo;Ben&hellip;&rdquo; May began crying and shook her head. <br />&ldquo;What? What happened May?&rdquo; Natasha asked gently. <br />&ldquo;They caught the guy who killed him. He&rsquo;s going to prison, but I just&hellip;I can&rsquo;t raise Peter. Not alone.&rdquo; Ben was dead. Steve shared a look with Tony. This poor woman had lost so much. <br />&ldquo;You&rsquo;re grieving May. Why don&rsquo;t we look after Peter for a little while and you can decide later. You might just need time&hellip;&rdquo; she nodded. <br />&ldquo;I just can&rsquo;t be here. I can&rsquo;t do this.&rdquo; And then she left with Natasha. Tony held Peter tightly to his chest and tony was watching Steve very closely. <br />&ldquo;I know we wanted Peter to be ours but&hellip;&rdquo; Tony couldn&rsquo;t even finish the sentence. But Steve understood. <br />&ldquo;Not like this.&rdquo; Steve agreed. <br />&ldquo;If she really doesn&rsquo;t want him though, I&rsquo;m not going to abandon him.&rdquo; Steve nodded. <br />&ldquo;Agreed.&rdquo; Tony sat down and studied Peter, who had mercifully stopped crying. <br />&ldquo;We&rsquo;re going to have to baby proof the entire damn building.&rdquo; Tony muttered. <br />&ldquo;We don&rsquo;t have to.&rdquo; Steve thought of the one place he kept secret from the avengers. <br />&ldquo;Why not?&rdquo; <br />&ldquo;I have an apartment. In Brooklyn. It&rsquo;d be easier to look after him there&hellip;&rdquo; <br />&ldquo;Why am I only learning about this now?&rdquo;<br />&ldquo;I asked Jarvis to not say anything and&hellip;&rdquo; Steve shrugged. <br />&ldquo;Okay, well we can baby proof your secret apartment and take shifts looking after Peter until May makes a decision.&rdquo; Steve nodded.<br />&ldquo;Okay.&rdquo; This could work. This <i>would</i> work. \n\n<br /></p><hr /><p>\n\nTony soon realised he and Steve had both seriously underestimated just how hard it was to look after Peter. An hour into Steve&rsquo;s first shift, Tony got a phone call requesting help. Tony had lasted a triumphant three hours before calling Steve. So now they were co-parenting. Full time. Which was strange. But the first time Tony had walked into Steve&rsquo;s apartment, it felt strange. Homey. Which was a foreign thing to Tony. There was an amazing view of the skyline, there were books and sketches and clothes everywhere. His kitchen was small and could barely fit three people in it. But it was homey. And Tony found he loved to spend time there. More than his workshop.&nbsp;</p><p>&ldquo;Okay Pete I&rsquo;m going to make us some lunch, so no climbing the walls or the roof. Okay?&rdquo; Peter giggled. It had become a routine now, they had been doing this for a couple weeks and the guilt of enjoying this vanished very quickly. Now Tony just enjoyed every second with Peter. But as much as he loved Steve&rsquo;s apartment, he hated Steve&rsquo;s couch. It was leather and old and totally uncomfortable to sleep on. He knew he could always go back to the compound to sleep, but hated the idea of leaving Peter. So tony put up with the couch while Steve slept in his bedroom. Tony opened the cupboards and found an old packet of two minute noodles. With a frown, tony decided to check the empty fridge. <br />&ldquo;I think we need to go grocery shopping Pete.&rdquo; Tony muttered. Steve was out, training with Nat or something. It didn&rsquo;t bother Tony all that much, but it felt a little strange going grocery shopping for cap&rsquo;s kitchen. What if Tony bought the wrong cereal? And should Tony get coffee? Because Steve didn&rsquo;t even have a coffee machine here, which Tony was struggling with. It just made more sense to buy the damn coffee machine, but Tony didn&rsquo;t want to invade Steve&rsquo;s space. <br />&ldquo;This is weird isn&rsquo;t it kid?&rdquo; Tony asked but Peter being a toddler, didn&rsquo;t respond. <br />&ldquo;I mean, Steve and I are barely even civil and I&rsquo;m sleeping on his couch!&rdquo; Tony ran a hand through his hair. This was crazy. Tony felt tempted to run, but knew that would be stupid. They were going to make this work. For Peter. <br />&ldquo;This is gonna work. We will make this work for you kid. So you better appreciate it when you&rsquo;re older.&rdquo; Tony told him. Peter merely smiled at tony. <br />&ldquo;Are you even hungry?&rdquo; Tony asked. Peter merely stared and Tony sat down next to him. <br />&ldquo;I&rsquo;ve been researching everything about being a good father. My dad wasn&rsquo;t good to me and if we do end up keeping you, I want to be a good father. Someone you can count on&hellip;&rdquo; Tony never wanted Peter to walk into someone else&rsquo;s home and find it strange because he had never experienced a home before. <br />&ldquo;Tony?&rdquo; Steve swung the door open and mercifully had bought food. <br />&ldquo;Oh thank god, we were going to starve.&rdquo; Steve rolled his eyes and placed the food down on the counter. <br />&ldquo;I checked this morning before I left, how&rsquo;s he been today?&rdquo;<br />&ldquo;Good. I think he&rsquo;s settled into this routine. With you and me and this place.&rdquo; Steve nodded and began to put things in cupboards and in the fridge. <br />&ldquo;I bought you some instant coffee which I know isn&rsquo;t as good as a coffee machine but-in case this doesn&rsquo;t work out, I didn&rsquo;t want to invest in a coffee machine just yet.&rdquo; It was an olive branch. Steve had bought Tony coffee. <br />&ldquo;Thanks.&rdquo; Steve smiled, seemingly relieved that tony wasn&rsquo;t going to argue.<br />&ldquo;How is everyone back at the compound?&rdquo; Tony asked. <br />&ldquo;Good. They think this is very weird but they&rsquo;ve gotten used to us not being around as much.&rdquo; Steve shrugged. <br />&ldquo;I was thinking about swinging by later, tinkering with the suit for a bit&hellip;&rdquo; Steve nodded. <br />&ldquo;Sure. I&rsquo;ve got no plans tonight so I&rsquo;m happy to look after the little guy.&rdquo; Steve said over his shoulder and tony nodded. <br />&ldquo;Have you heard from May recently?&rdquo; Tony asked. <br />&ldquo;No. Not a word. Nat checks up on her though. Makes sure she is doing alright.&rdquo; Steve murmured and Tony nodded. <br />&ldquo;I can&rsquo;t even begin to imagine what she must be feeling right now.&rdquo; Tony murmured. And a part of him hoped he would never have to go through that. That he&rsquo;d never have to experience the horror of losing those he loved the most. He already lost his parents in a car accident. <br />&ldquo;She&rsquo;s a strong woman. She&rsquo;ll get through this.&rdquo; Steve began to make lunch and Tony smiled, his stomach seemed to settle a little now that food was on the way. <br />&ldquo;Yeah. She will.&rdquo;\n\n<br /></p><hr /><p>Steve and Tony were in the middle of watching the lion king with Peter when the doorbell rang. It was pouring with rain outside and Steve wasn&rsquo;t expecting anyone. It had been a risk, buying Tony the coffee. But it seemed worth it now. It was a step in the right direction apparently. Tony paused the movie as Steve got up to answer the door. <br />&ldquo;Pizza must be here.&rdquo; Steve murmured. They had both been far too lazy to cook dinner and had just ordered pizza. Steve grabbed the money and swung the door open, ready to pay for the pizza but it wasn&rsquo;t the pizza guy standing there. <br />&ldquo;May?&rdquo; His heart was pounding, mind racing. <br />&ldquo;Hi Steve. Can I come in?&rdquo;<br />&ldquo;Of course.&rdquo; And he stepped aside, letting her in. <br />&ldquo;Natasha told me you&rsquo;d be here.&rdquo; She smiled at Peter and Steve&rsquo;s heart sunk a little. <br />&ldquo;How are you holding up?&rdquo; Steve asked. <br />&ldquo;I&rsquo;ve been a lot better.&rdquo; May admitted and Steve noticed how Tony was studying Peter. <br />&ldquo;I&rsquo;m so sorry May.&rdquo; Steve murmured and she nodded. <br />&ldquo;I know I haven&rsquo;t been fair to the two of you, dropping by to sleep whilst you babysit and abandoning Peter all together. I haven&rsquo;t been the best guardian to him.&rdquo; There was a lump in the back of Steve&rsquo;s throat. His gut was churning. Here it was. Her decision. The truth. <br />&ldquo;You&rsquo;ve been through a lot.&rdquo; Steve was relieved Tony spoke, because Steve was pretty sure he had lost all of his abillity of speech.<br />&ldquo;I know. But I should have been better. Tried harder. And I&rsquo;m still in a bad way, but I&rsquo;m seeing a therapist which is helping.&rdquo; May murmured. <br />&ldquo;That&rsquo;s good.&rdquo; Twice Peter has been ripped away from them. Steve wasn&rsquo;t sure he could bare it a third time. <br />&ldquo;My therapist helped me come to this decision. I left the two of you as anonymous trusted family friends. But I want you two to know I made this decision with a clear head and I have a second opinion which didn&rsquo;t in any way effect the outcome of this decision.&rdquo; <i>Just say it already. Rip it off like a band aid. </i>Steve couldn&rsquo;t bare the wait. The anticipation. He just wanted to know her choice. <br />&ldquo;This wasn&rsquo;t an easy decision. But it is the best decision. For the both of us.&rdquo; Tony was watching Steve. They were both terrified and anxious. <br />&ldquo;I&rsquo;ve decided that Peter is better off living with the two of you. But I still want to be involved in his life. Like Friday night dinner or something.&rdquo; Steve let out a deep and relieved breath. He was ecstatic. <br />&ldquo;Of course May.&rdquo; He couldn&rsquo;t surprise the grin and neither could tony. <br />&ldquo;So we&rsquo;ll foster him?&rdquo; Tony asked and May shook her head. <br />&ldquo;It would be easier if the two of you simply adopted him. I can arrange for a lawyer to talk to us all on Tuesday.&rdquo; May explained and tony shared a look with Steve. While the co-parenting was working right now, would it still be working in five months? A year? What about when Peter was a teenager? When they were off on missions? Was adoption truly the best option? A silent conversation passed between them. Steve nodded and Tony did too. <br />&ldquo;Sounds perfect May. Thank you.&rdquo; Steve said, his grin grew even wider. <br />&ldquo;We would love to adopt him.&rdquo; Tony murmured and looked down at Peter. <i>My son</i>. And this time, it was true. Peter really was theirs now. And now they really, truly, did have to make this work. They were in it for the long haul and there was no backing out. Peter was their responsibility and with a bit of luck, it would remain that way forever.</p>",
                "content_abstract": "<p>\n<p>Title: We Are A Family.<br />Pairings: Steve x tony, Peter x Wade, Nat x Clint, Sam x Bucky.<br />Part: 3/?<br />Warnings: swearing, fluff, angst, violence, eventual smut, slowburn.<br />Summary: When Nat comes into the avengers tower with baby Peter Parker, the avengers didn&rsquo;t know what they were getting themselves into. But now that Peter is here,Steve and Tony both feel protective over him. It doesn&rsquo;t help that Peter hates everyone other than Steve and tony. But as Steve and tony raise Peter, they start to fall for one another. Will this superfamily work out or will it all turn to hell?\n\n<br /></p>\n<p><a href=\"http://fandomfanfics12.tumblr.com/post/169767449338/we-are-a-family-part-1\">Part 1</a>, <a href=\"http://fandomfanfics12.tumblr.com/post/176056617463/we-are-a-family-part-2\">Part 2</a></p>\n<figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "medieval-clotpoles",
        "blog": {
            "name": "medieval-clotpoles",
            "title": "",
            "description": "Medieval clotpoles, fallen angels and futuristic space boyfriends...",
            "url": "https://medieval-clotpoles.tumblr.com/",
            "uuid": "t:3HaEUwlEflgd6x14B5rW-w",
            "updated": 1550103686
        },
        "id": 176691506131,
        "post_url": "https://medieval-clotpoles.tumblr.com/post/176691506131/just-imagine-how-thor-is-feeling-post-infinity-war",
        "slug": "just-imagine-how-thor-is-feeling-post-infinity-war",
        "date": "2018-08-06 09:54:16 GMT",
        "timestamp": 1533549256,
        "state": "published",
        "format": "html",
        "reblog_key": "yFRsKwr3",
        "tags": [
            "marvel",
            "infinity war",
            "steve rogers",
            "thor",
            "avengers",
            "post infinity war",
            "think about his face when bucky disappears",
            "the look of helplessness and sadness overtaking steve",
            "because he couldn't save his best friend",
            "and then he looks at thor",
            "thor looks like his entire world is crashing down on him",
            "'I lost everyone I loved'",
            "'and now because of me everyone else will to'",
            "'why didn't I just go for the fuckin head'"
        ],
        "short_url": "https://tmblr.co/ZnPumv2aZeclJ",
        "summary": "just imagine how thor is feeling post infinity war he lost everyone he ever cared about, his entire family is gone and he had...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 5,
        "title": null,
        "body": "<p>just imagine how thor is feeling post infinity war</p><p>he lost everyone he ever cared about, his entire family is gone and he had thanos</p><p>he fuckin had him on the strings, stormbreaker shoved into his chest and it still wasn’t enough </p><p>and now he has to watch all of his friends lose everyone they care about the most</p>",
        "reblog": {
            "comment": "<p>just imagine how thor is feeling post infinity war</p><p>he lost everyone he ever cared about, his entire family is gone and he had thanos</p><p>he fuckin had him on the strings, stormbreaker shoved into his chest and it still wasn’t enough </p><p>and now he has to watch all of his friends lose everyone they care about the most</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "medieval-clotpoles",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/777c76cba460c8a42324892ccf56e8c2/dmwusxl/8Dzotgmui/tumblr_static_77o7x5jju4o44g4sso4gg8ks0.jpg",
                        "header_image_focused": "https://static.tumblr.com/777c76cba460c8a42324892ccf56e8c2/dmwusxl/8Dzotgmui/tumblr_static_77o7x5jju4o44g4sso4gg8ks0_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/777c76cba460c8a42324892ccf56e8c2/dmwusxl/8Dzotgmui/tumblr_static_77o7x5jju4o44g4sso4gg8ks0_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176691506131"
                },
                "content_raw": "<p>just imagine how thor is feeling post infinity war</p><p>he lost everyone he ever cared about, his entire family is gone and he had thanos</p><p>he fuckin had him on the strings, stormbreaker shoved into his chest and it still wasn’t enough </p><p>and now he has to watch all of his friends lose everyone they care about the most</p>",
                "content": "<p>just imagine how thor is feeling post infinity war</p><p>he lost everyone he ever cared about, his entire family is gone and he had thanos</p><p>he fuckin had him on the strings, stormbreaker shoved into his chest and it still wasn&rsquo;t enough&nbsp;</p><p>and now he has to watch all of his friends lose everyone they care about the most</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "writernextdoorblog",
        "blog": {
            "name": "writernextdoorblog",
            "title": "Im The Writer Next Door!",
            "description": "Author, Blogger, Roleplayer",
            "url": "https://writernextdoorblog.tumblr.com/",
            "uuid": "t:ng2sMcVWvwv89hN6qhEbAg",
            "updated": 1557280374
        },
        "id": 176691237696,
        "post_url": "https://writernextdoorblog.tumblr.com/post/176691237696/31-flavours-an-avengers-fanfic-chapter-3-on",
        "slug": "31-flavours-an-avengers-fanfic-chapter-3-on",
        "date": "2018-08-06 09:38:27 GMT",
        "timestamp": 1533548307,
        "state": "published",
        "format": "html",
        "reblog_key": "mkBAcCFH",
        "tags": [
            "avengers",
            "avengersfanfiction",
            "comedy-romance",
            "conflict",
            "fanfiction",
            "friendship",
            "humor",
            "love",
            "lovetriangle",
            "marvelcomics",
            "marvelfanfic",
            "marveluniverse",
            "sadness",
            "sliceoflife",
            "teenagers",
            "wattpad",
            "books",
            "amreading"
        ],
        "short_url": "https://tmblr.co/ZNDU_n2aZdbD0",
        "summary": "31 Flavours (An Avengers Fanfic) - Chapter 3 (on Wattpad) https://my.w.tt/JmeCfAKP9O\n\nAn AU fanfic where the Avengers are living...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1,
        "source_url": "https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.wattpad.com%2F614557607-31-flavours-an-avengers-fanfic-chapter-3&t=Mjg0MzE3NWRlMTQ2MjVlZWE1YzdhY2EyNTMzM2I4MDA2OTI5NGFmNSwxNzY2OTEyMzc2OTY%3D&b=t%3Ang2sMcVWvwv89hN6qhEbAg&p=https%3A%2F%2Fwriternextdoorblog.tumblr.com%2Fpost%2F176691237696%2F31-flavours-an-avengers-fanfic-chapter-3-on&m=1",
        "source_title": "wattpad.com",
        "caption": "<p><b>31 Flavours (An Avengers Fanfic) - Chapter 3</b> (on Wattpad) <a href=\"https://my.w.tt/JmeCfAKP9O\">https://my.w.tt/JmeCfAKP9O</a>\n\nAn AU fanfic where the Avengers are living their teenage lives. \nThere will be laughter, sadness, conflicts and much more, so I&rsquo;d rather you don&rsquo;t miss out on this one. \n*All Characters and names belong to Marvel*\n*Pic credits to owner* </p>",
        "reblog": {
            "comment": "<p><b>31 Flavours (An Avengers Fanfic) - Chapter 3</b> (on Wattpad) <a href=\"https://my.w.tt/JmeCfAKP9O\">https://my.w.tt/JmeCfAKP9O</a>\n\nAn AU fanfic where the Avengers are living their teenage lives. \nThere will be laughter, sadness, conflicts and much more, so I’d rather you don’t miss out on this one. \n*All Characters and names belong to Marvel*\n*Pic credits to owner* </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "writernextdoorblog",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 485,
                        "header_focus_width": 500,
                        "header_focus_height": 281,
                        "avatar_shape": "circle",
                        "background_color": "#dccbe7",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "63,500,344,0",
                        "header_image": "https://static.tumblr.com/8ee779b2b08692e92bb349afbdf6f184/jiunej6/m00ovtg5a/tumblr_static_9hjmg4gnnmsk4c4skk400wcco.jpg",
                        "header_image_focused": "https://static.tumblr.com/8ee779b2b08692e92bb349afbdf6f184/jiunej6/Fkaovtg5b/tumblr_static_tumblr_static_9hjmg4gnnmsk4c4skk400wcco_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/8ee779b2b08692e92bb349afbdf6f184/jiunej6/m00ovtg5a/tumblr_static_9hjmg4gnnmsk4c4skk400wcco_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#211927",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Caslon FS",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176691237696"
                },
                "content_raw": "<p><b>31 Flavours (An Avengers Fanfic) - Chapter 3</b> (on Wattpad) <a href=\"https://my.w.tt/JmeCfAKP9O\">https://my.w.tt/JmeCfAKP9O</a>\n\nAn AU fanfic where the Avengers are living their teenage lives. \nThere will be laughter, sadness, conflicts and much more, so I’d rather you don’t miss out on this one. \n*All Characters and names belong to Marvel*\n*Pic credits to owner* </p>",
                "content": "<p><b>31 Flavours (An Avengers Fanfic) - Chapter 3</b> (on Wattpad) <a href=\"https://my.w.tt/JmeCfAKP9O\">https://my.w.tt/JmeCfAKP9O</a>\n\nAn AU fanfic where the Avengers are living their teenage lives. \nThere will be laughter, sadness, conflicts and much more, so I&rsquo;d rather you don&rsquo;t miss out on this one. \n*All Characters and names belong to Marvel*\n*Pic credits to owner* </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "https://my.w.tt/JmeCfAKP9O",
        "image_permalink": "https://writernextdoorblog.tumblr.com/image/176691237696",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/3acfa638717ba84558c0e82b51e8feac/tumblr_pd19g3tR7M1tx63zgo1_400.jpg",
                    "width": 256,
                    "height": 400
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/3acfa638717ba84558c0e82b51e8feac/tumblr_pd19g3tR7M1tx63zgo1_400.jpg",
                        "width": 256,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/3acfa638717ba84558c0e82b51e8feac/tumblr_pd19g3tR7M1tx63zgo1_250.jpg",
                        "width": 250,
                        "height": 391
                    },
                    {
                        "url": "https://66.media.tumblr.com/3acfa638717ba84558c0e82b51e8feac/tumblr_pd19g3tR7M1tx63zgo1_100.jpg",
                        "width": 100,
                        "height": 156
                    },
                    {
                        "url": "https://66.media.tumblr.com/3acfa638717ba84558c0e82b51e8feac/tumblr_pd19g3tR7M1tx63zgo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "video",
        "blog_name": "npgk",
        "blog": {
            "name": "npgk",
            "title": "Within the sound of Silence",
            "description": "Fangirl a tempo pieno e slasher in incognito. \nAssisto un high-functioning sociopath e viaggio spesso tra Camelot, Westeros, Narnia e Middle-Earth. Quando mi capita finisco nell'antica Roma con gladiatori cazzuti, nell'antica Grecia con un Pitagora più simpatico del solito, nella Scandinavia dei primi secoli e nella Scozia del XVIII secolo in compagnia degli highlanders.\nSpesso mi diletto nel canto insieme al Glee club e a quei poveri sfigati degli Amis de l'ABC. E amo la matematica e vorrei Sheldon come insegnante.\nNel tempo libero salvo il l'Enchanted Forest dall'Hydra in compagnia degli Avengers.\nTributo, strega e impavida, sono sposata segretamente con Tom Hiddleston e Benedict Cumberbatch (tra i tanti).\nLa musica celtica e tutto ciò che è medievale mi fa credere sempre di più di essere nata nel secolo sbagliato.\nIl mio sogno è quello di diventare una mutante e di andare nello spazio a bordo dell'Enterprise per sconfiggere Darth Vader.",
            "url": "https://npgk.tumblr.com/",
            "uuid": "t:Xvyz-KltwuZYfe0HQraTqg",
            "updated": 1558298406
        },
        "id": 176691086222,
        "post_url": "https://npgk.tumblr.com/post/176691086222/when-iw-came-out-3-months-ago-but-you-arent-over",
        "slug": "when-iw-came-out-3-months-ago-but-you-arent-over",
        "date": "2018-08-06 09:29:43 GMT",
        "timestamp": 1533547783,
        "state": "published",
        "format": "html",
        "reblog_key": "AxjimY0Q",
        "tags": [
            "civil war",
            "stony",
            "fanvid",
            "avengers",
            "marvel",
            "slash"
        ],
        "short_url": "https://tmblr.co/ZueRcs2aZd0EE",
        "summary": "When IW came out 3 months ago but you aren't over Civil War yet.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 8,
        "caption": "<p>When IW came out 3 months ago but you aren&rsquo;t over Civil War yet.</p>",
        "reblog": {
            "comment": "<p>When IW came out 3 months ago but you aren’t over Civil War yet.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "npgk",
                    "active": true,
                    "theme": {
                        "header_full_width": 483,
                        "header_full_height": 485,
                        "header_focus_width": 483,
                        "header_focus_height": 272,
                        "avatar_shape": "square",
                        "background_color": "#ebe0c8",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "106,483,378,0",
                        "header_image": "https://static.tumblr.com/bb618d591bf23f03a484497733974e95/dpqruof/hL9nd561s/tumblr_static_43yg5jp4bdk4c4ss8s0k8ow0o.gif",
                        "header_image_focused": "https://static.tumblr.com/bb618d591bf23f03a484497733974e95/dpqruof/Olbnd561s/tumblr_static_tumblr_static_43yg5jp4bdk4c4ss8s0k8ow0o_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/bb618d591bf23f03a484497733974e95/dpqruof/hL9nd561s/tumblr_static_43yg5jp4bdk4c4ss8s0k8ow0o_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#c09992",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176691086222"
                },
                "content_raw": "<p>When IW came out 3 months ago but you aren’t over Civil War yet.</p>",
                "content": "<p>When IW came out 3 months ago but you aren&rsquo;t over Civil War yet.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "permalink_url": "https://www.youtube.com/watch?v=TkwMr_YZfck",
        "html5_capable": true,
        "video": {
            "youtube": {
                "video_id": "TkwMr_YZfck",
                "width": 540,
                "height": 304
            }
        },
        "thumbnail_url": "https://i.ytimg.com/vi/TkwMr_YZfck/hqdefault.jpg",
        "thumbnail_width": 480,
        "thumbnail_height": 360,
        "player": [
            {
                "width": 250,
                "embed_code": "<iframe width=\"250\" height=\"141\"  id=\"youtube_iframe\" src=\"https://www.youtube.com/embed/TkwMr_YZfck?feature=oembed&amp;enablejsapi=1&amp;origin=https://safe.txmblr.com&amp;wmode=opaque\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>"
            },
            {
                "width": 400,
                "embed_code": "<iframe width=\"400\" height=\"225\"  id=\"youtube_iframe\" src=\"https://www.youtube.com/embed/TkwMr_YZfck?feature=oembed&amp;enablejsapi=1&amp;origin=https://safe.txmblr.com&amp;wmode=opaque\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>"
            },
            {
                "width": 500,
                "embed_code": "<iframe width=\"500\" height=\"281\"  id=\"youtube_iframe\" src=\"https://www.youtube.com/embed/TkwMr_YZfck?feature=oembed&amp;enablejsapi=1&amp;origin=https://safe.txmblr.com&amp;wmode=opaque\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>"
            }
        ],
        "video_type": "youtube",
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "sam-winchesters-moose-hair",
        "blog": {
            "name": "sam-winchesters-moose-hair",
            "title": "Cool stories and equality and stuff yo",
            "description": "You can call me \"E\" please be my friend",
            "url": "https://sam-winchesters-moose-hair.tumblr.com/",
            "uuid": "t:qC9zf0jDYlenmkwQi8pzXw",
            "updated": 1557440527
        },
        "id": 176691010667,
        "post_url": "https://sam-winchesters-moose-hair.tumblr.com/post/176691010667/ok-so-have-any-of-you-marvel-fans-especially",
        "slug": "ok-so-have-any-of-you-marvel-fans-especially",
        "date": "2018-08-06 09:25:16 GMT",
        "timestamp": 1533547516,
        "state": "published",
        "format": "html",
        "reblog_key": "kqoUKy4M",
        "tags": [
            "avengers",
            "marvel",
            "tony stark",
            "infinity war",
            "natasha romanoff",
            "scarlett johansson",
            "black widow",
            "black widow movie",
            "Marvel",
            "robert downey junior",
            "coulson",
            "phil coulson",
            "agent coulson",
            "coulson lives",
            "clint barton",
            "jeremy renner",
            "natalia alianovna romanova",
            "red room",
            "ivan somodorov",
            "ava orlova",
            "forever red",
            "black widow forever red",
            "Margaret Stohl",
            "marvel comics",
            "comics"
        ],
        "short_url": "https://tmblr.co/ZQBCjd2aZcjnh",
        "summary": "Ok so have any of you Marvel fans (especially black widow fans can I get a yeah boi) read this book??\nI'm just over half way...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 66,
        "title": null,
        "body": "<h1>Forever Red *Black Widow Book*</h1><p>Ok so have any of you Marvel fans (especially black widow fans can I get a yeah boi) read this book??</p><figure class=\"tmblr-full\" data-orig-height=\"4032\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/8fe293d79e1627c51cfdaa619cec4278/tumblr_pd18twAlfI1v06w3c_540.jpg\" data-orig-height=\"4032\" data-orig-width=\"3024\"/></figure><p>I&rsquo;m just over half way through and it&rsquo;s pretty darn good!</p><figure class=\"tmblr-full\" data-orig-height=\"4032\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/6919588a0c3247802df7415f9e3e3511/tumblr_pd18u0ku801v06w3c_540.jpg\" data-orig-height=\"4032\" data-orig-width=\"3024\"/></figure><h2>*SPOILER ALERT FROM HERE*</h2><h2>Ok so its about black widow (obviously) and another girl (Ava) who wasn&rsquo;t part of the Red Room the same as Natasha, but was experimented on by the same man who ran the Red Room (Ivan Somodorov).</h2><p>But it gives us a few clues about certain stuffs in the marvel universe:</p><ul><li>The book starts with an &ldquo;8 years previously&rdquo; and it mentions that at that point, Natasha is quite new to shield. So say she&rsquo;s been their 2-4 years (I only say that long because she was on a solo mission which means she must have been trusted at that point, and that trust ain&rsquo;t easy to get). The majority of the book then takes place about a year after New York. Which means Natasha has actually only been a good guy for around 10-14 years. Which might seem a lot for a normal person, but in the comic books she is similar to Steve Rogers and the Winter Soldier, she&rsquo;s genetically advanced and in the comics had been around since pre WW2. Plus there is a brief mention that her birthday is redacted from her file which could show that she&rsquo;s actually a lot older than she looks and it&rsquo;s never implicitly contradicted that in the movies (or book, so far).</li></ul><h2>Bear in mind that the only person to state that this is part of the MCU is the author if the book, no one else from Marvel has confirmed or denied that&hellip;</h2><ul><li>Now this is a big <b>*spoiler* </b>but Coulson is in it. Not just in the first chapter either he is in it throughout. Him and Nat talk and he helps her out for a bit. Now do you remember me mentioning that this is after New York? This is indesputible because there is 1 or 2 pages dedicated to Natasha thinking about how hard it&rsquo;s been to keep a low profile since the Avengers became world famous, how she&rsquo;s had to work a whole lot harder to disguise herself because the entire world now knows what she looks like.</li><li>Natasha knowing Coulson is alive isn&rsquo;t even the best part.</li><li>Tony Stark is in it.</li><li>He only appears for a few chapters (so far, he might come back) to try and help Natasha and Ava with a lil problem they have.</li><li>But</li><li>He</li><li>Mentions</li><li>Natasha getting help from Coulson.</li><li>Obviously the rest of his line won&rsquo;t make sense until you read the book but he says this &ldquo;So you circle the wagons, pick up Mini-Me, take out Ivan&rsquo;s welcome party, <i><b>hop aboard Coulson&rsquo;s good ship</b></i> Lollipop and hitch a ride to S.H.I.E.L.D.&rsquo;s doorstep?&rdquo;. Plus earlier it says &ldquo;a few well placed calls from Coulson&rdquo; help Tony and Natasha get access to what they want access to at the New York Triskellion. So this HEAVILY implies that Tony Stark also knew Coulson was alive?? Which leads on to the question do the others know? Did they tell them or did they realise he was *dead* for a reason and keep the secret?</li></ul><h2>&hellip;.Or it could be set in an entirely alternate universe where Coulson never died&hellip;.in which case half this post is pointless (but it&rsquo;s still a good book so go read)</h2><ul><li>Plus there are a few other bits, for example Tony makes a Star Trek reference proving many people&rsquo;s headcannons that he is a huge nerd. And Natasha follows that with &ldquo;is that before or after they blow up the death star&rdquo; proving that even in the midst and a crisis she is a HUGE troll&hellip;.OR&hellip;. she is completely anti-nerd and doesn&rsquo;t care for movies or pop culture&hellip;</li></ul><p>Now I&rsquo;m not gonna lie, it&rsquo;s not the BEST book I&rsquo;ve ever read (maybe because I&rsquo;m a year or 2 too old) but it&rsquo;s well written and thorough and it gives a really big insight to Natasha&rsquo; s character. When she isn&rsquo;t with her Avenger buddies, people she trusts implicitly, she is cold and calculating and has no fucking clue on how to deal with teenagers, or how to connect with Ava (who is very similar to her in experiences and past traumas). Through this it also gives a large insight into what the Red Room was like, which lots of fans have been searching for for a long time. Also there are lots of bits in Russian which is interesting and it&rsquo;s written in a way that you can usually understand what it translates to (or it&rsquo;s translated for you).</p><p>However, the only major downside to this book that I can find is that Clint Barton isn&rsquo;t in it. So far he hasn&rsquo;t even been mentioned (I think😅) and I looked some things up and it doesn&rsquo;t look like he comes into the second half of the book either. Now as much as that is disappointed there are still 1 or 2 books (i forget) in this series in which he m<i>ight </i>appear in. I doubt it though.</p><p>All in all its a thouraghly enjoyable book and I definitely wouldn&rsquo;t mind any Black Widow movie to be based on it (although the inclusion on Clint Barton would be preferable) so you BW fans out there go read it it&rsquo;s good👍👍</p><figure class=\"tmblr-full\" data-orig-height=\"540\" data-orig-width=\"540\" data-tumblr-attribution=\"mithborien:4wWTbDJzPyopvCOTiK_KXw:ZNhUmt25cDta6\"><img src=\"https://66.media.tumblr.com/4de48127e8a95d3a1e8e6cd53dc1ce82/tumblr_o64zzi9QbH1rls5aco1_540.gif\" data-orig-height=\"540\" data-orig-width=\"540\"/></figure><p>-E</p>",
        "reblog": {
            "comment": "<p><h1>Forever Red *Black Widow Book*</h1><p>Ok so have any of you Marvel fans (especially black widow fans can I get a yeah boi) read this book??</p><figure class=\"tmblr-full\" data-orig-height=\"4032\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/8fe293d79e1627c51cfdaa619cec4278/tumblr_pd18twAlfI1v06w3c_540.jpg\" data-orig-height=\"4032\" data-orig-width=\"3024\"></figure><p>I’m just over half way through and it’s pretty darn good!</p><figure class=\"tmblr-full\" data-orig-height=\"4032\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/6919588a0c3247802df7415f9e3e3511/tumblr_pd18u0ku801v06w3c_540.jpg\" data-orig-height=\"4032\" data-orig-width=\"3024\"></figure><h2>*SPOILER ALERT FROM HERE*</h2><h2>Ok so its about black widow (obviously) and another girl (Ava) who wasn’t part of the Red Room the same as Natasha, but was experimented on by the same man who ran the Red Room (Ivan Somodorov).</h2><p>But it gives us a few clues about certain stuffs in the marvel universe:</p><ul><li>The book starts with an “8 years previously” and it mentions that at that point, Natasha is quite new to shield. So say she’s been their 2-4 years (I only say that long because she was on a solo mission which means she must have been trusted at that point, and that trust ain’t easy to get). The majority of the book then takes place about a year after New York. Which means Natasha has actually only been a good guy for around 10-14 years. Which might seem a lot for a normal person, but in the comic books she is similar to Steve Rogers and the Winter Soldier, she’s genetically advanced and in the comics had been around since pre WW2. Plus there is a brief mention that her birthday is redacted from her file which could show that she’s actually a lot older than she looks and it’s never implicitly contradicted that in the movies (or book, so far).</li></ul><h2>Bear in mind that the only person to state that this is part of the MCU is the author if the book, no one else from Marvel has confirmed or denied that…</h2><ul><li>Now this is a big <b>*spoiler* </b>but Coulson is in it. Not just in the first chapter either he is in it throughout. Him and Nat talk and he helps her out for a bit. Now do you remember me mentioning that this is after New York? This is indesputible because there is 1 or 2 pages dedicated to Natasha thinking about how hard it’s been to keep a low profile since the Avengers became world famous, how she’s had to work a whole lot harder to disguise herself because the entire world now knows what she looks like.</li><li>Natasha knowing Coulson is alive isn’t even the best part.</li><li>Tony Stark is in it.</li><li>He only appears for a few chapters (so far, he might come back) to try and help Natasha and Ava with a lil problem they have.</li><li>But</li><li>He</li><li>Mentions</li><li>Natasha getting help from Coulson.</li><li>Obviously the rest of his line won’t make sense until you read the book but he says this “So you circle the wagons, pick up Mini-Me, take out Ivan’s welcome party, <i><b>hop aboard Coulson’s good ship</b></i> Lollipop and hitch a ride to S.H.I.E.L.D.’s doorstep?”. Plus earlier it says “a few well placed calls from Coulson” help Tony and Natasha get access to what they want access to at the New York Triskellion. So this HEAVILY implies that Tony Stark also knew Coulson was alive?? Which leads on to the question do the others know? Did they tell them or did they realise he was *dead* for a reason and keep the secret?</li></ul><h2>….Or it could be set in an entirely alternate universe where Coulson never died….in which case half this post is pointless (but it’s still a good book so go read)</h2><ul><li>Plus there are a few other bits, for example Tony makes a Star Trek reference proving many people’s headcannons that he is a huge nerd. And Natasha follows that with “is that before or after they blow up the death star” proving that even in the midst and a crisis she is a HUGE troll….OR…. she is completely anti-nerd and doesn’t care for movies or pop culture…</li></ul><p>Now I’m not gonna lie, it’s not the BEST book I’ve ever read (maybe because I’m a year or 2 too old) but it’s well written and thorough and it gives a really big insight to Natasha’ s character. When she isn’t with her Avenger buddies, people she trusts implicitly, she is cold and calculating and has no fucking clue on how to deal with teenagers, or how to connect with Ava (who is very similar to her in experiences and past traumas). Through this it also gives a large insight into what the Red Room was like, which lots of fans have been searching for for a long time. Also there are lots of bits in Russian which is interesting and it’s written in a way that you can usually understand what it translates to (or it’s translated for you).</p><p>However, the only major downside to this book that I can find is that Clint Barton isn’t in it. So far he hasn’t even been mentioned (I think😅) and I looked some things up and it doesn’t look like he comes into the second half of the book either. Now as much as that is disappointed there are still 1 or 2 books (i forget) in this series in which he m<i>ight </i>appear in. I doubt it though.</p><p>All in all its a thouraghly enjoyable book and I definitely wouldn’t mind any Black Widow movie to be based on it (although the inclusion on Clint Barton would be preferable) so you BW fans out there go read it it’s good👍👍</p><figure class=\"tmblr-full\" data-orig-height=\"540\" data-orig-width=\"540\" data-tumblr-attribution=\"mithborien:4wWTbDJzPyopvCOTiK_KXw:ZNhUmt25cDta6\"><img src=\"https://66.media.tumblr.com/4de48127e8a95d3a1e8e6cd53dc1ce82/tumblr_o64zzi9QbH1rls5aco1_540.gif\" data-orig-height=\"540\" data-orig-width=\"540\"></figure><p>-E</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "sam-winchesters-moose-hair",
                    "active": true,
                    "theme": {
                        "header_full_width": 1080,
                        "header_full_height": 2220,
                        "header_focus_width": 622,
                        "header_focus_height": 350,
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "438,622,788,0",
                        "header_image": "https://static.tumblr.com/e6452410bc7e02969c6557686b81b927/iyypag7/nVIpnysf8/tumblr_static_-2094870472-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/2bc4f183771207f302b3bfff1b759c53/iyypag7/5ZGpnysfb/tumblr_static_tumblr_static_-2094870472-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e6452410bc7e02969c6557686b81b927/iyypag7/nVIpnysf8/tumblr_static_-2094870472-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#902628",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#902628",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176691010667"
                },
                "content_raw": "<p><h1>Forever Red *Black Widow Book*</h1><p>Ok so have any of you Marvel fans (especially black widow fans can I get a yeah boi) read this book??</p><figure class=\"tmblr-full\" data-orig-height=\"4032\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/8fe293d79e1627c51cfdaa619cec4278/tumblr_pd18twAlfI1v06w3c_540.jpg\" data-orig-height=\"4032\" data-orig-width=\"3024\"></figure><p>I’m just over half way through and it’s pretty darn good!</p><figure class=\"tmblr-full\" data-orig-height=\"4032\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/6919588a0c3247802df7415f9e3e3511/tumblr_pd18u0ku801v06w3c_540.jpg\" data-orig-height=\"4032\" data-orig-width=\"3024\"></figure><h2>*SPOILER ALERT FROM HERE*</h2><h2>Ok so its about black widow (obviously) and another girl (Ava) who wasn’t part of the Red Room the same as Natasha, but was experimented on by the same man who ran the Red Room (Ivan Somodorov).</h2><p>But it gives us a few clues about certain stuffs in the marvel universe:</p><ul><li>The book starts with an “8 years previously” and it mentions that at that point, Natasha is quite new to shield. So say she’s been their 2-4 years (I only say that long because she was on a solo mission which means she must have been trusted at that point, and that trust ain’t easy to get). The majority of the book then takes place about a year after New York. Which means Natasha has actually only been a good guy for around 10-14 years. Which might seem a lot for a normal person, but in the comic books she is similar to Steve Rogers and the Winter Soldier, she’s genetically advanced and in the comics had been around since pre WW2. Plus there is a brief mention that her birthday is redacted from her file which could show that she’s actually a lot older than she looks and it’s never implicitly contradicted that in the movies (or book, so far).</li></ul><h2>Bear in mind that the only person to state that this is part of the MCU is the author if the book, no one else from Marvel has confirmed or denied that…</h2><ul><li>Now this is a big <b>*spoiler* </b>but Coulson is in it. Not just in the first chapter either he is in it throughout. Him and Nat talk and he helps her out for a bit. Now do you remember me mentioning that this is after New York? This is indesputible because there is 1 or 2 pages dedicated to Natasha thinking about how hard it’s been to keep a low profile since the Avengers became world famous, how she’s had to work a whole lot harder to disguise herself because the entire world now knows what she looks like.</li><li>Natasha knowing Coulson is alive isn’t even the best part.</li><li>Tony Stark is in it.</li><li>He only appears for a few chapters (so far, he might come back) to try and help Natasha and Ava with a lil problem they have.</li><li>But</li><li>He</li><li>Mentions</li><li>Natasha getting help from Coulson.</li><li>Obviously the rest of his line won’t make sense until you read the book but he says this “So you circle the wagons, pick up Mini-Me, take out Ivan’s welcome party, <i><b>hop aboard Coulson’s good ship</b></i> Lollipop and hitch a ride to S.H.I.E.L.D.’s doorstep?”. Plus earlier it says “a few well placed calls from Coulson” help Tony and Natasha get access to what they want access to at the New York Triskellion. So this HEAVILY implies that Tony Stark also knew Coulson was alive?? Which leads on to the question do the others know? Did they tell them or did they realise he was *dead* for a reason and keep the secret?</li></ul><h2>….Or it could be set in an entirely alternate universe where Coulson never died….in which case half this post is pointless (but it’s still a good book so go read)</h2><ul><li>Plus there are a few other bits, for example Tony makes a Star Trek reference proving many people’s headcannons that he is a huge nerd. And Natasha follows that with “is that before or after they blow up the death star” proving that even in the midst and a crisis she is a HUGE troll….OR…. she is completely anti-nerd and doesn’t care for movies or pop culture…</li></ul><p>Now I’m not gonna lie, it’s not the BEST book I’ve ever read (maybe because I’m a year or 2 too old) but it’s well written and thorough and it gives a really big insight to Natasha’ s character. When she isn’t with her Avenger buddies, people she trusts implicitly, she is cold and calculating and has no fucking clue on how to deal with teenagers, or how to connect with Ava (who is very similar to her in experiences and past traumas). Through this it also gives a large insight into what the Red Room was like, which lots of fans have been searching for for a long time. Also there are lots of bits in Russian which is interesting and it’s written in a way that you can usually understand what it translates to (or it’s translated for you).</p><p>However, the only major downside to this book that I can find is that Clint Barton isn’t in it. So far he hasn’t even been mentioned (I think😅) and I looked some things up and it doesn’t look like he comes into the second half of the book either. Now as much as that is disappointed there are still 1 or 2 books (i forget) in this series in which he m<i>ight </i>appear in. I doubt it though.</p><p>All in all its a thouraghly enjoyable book and I definitely wouldn’t mind any Black Widow movie to be based on it (although the inclusion on Clint Barton would be preferable) so you BW fans out there go read it it’s good👍👍</p><figure class=\"tmblr-full\" data-orig-height=\"540\" data-orig-width=\"540\" data-tumblr-attribution=\"mithborien:4wWTbDJzPyopvCOTiK_KXw:ZNhUmt25cDta6\"><img src=\"https://66.media.tumblr.com/4de48127e8a95d3a1e8e6cd53dc1ce82/tumblr_o64zzi9QbH1rls5aco1_540.gif\" data-orig-height=\"540\" data-orig-width=\"540\"></figure><p>-E</p></p>",
                "content": "<p><h1>Forever Red *Black Widow Book*</h1><p>Ok so have any of you Marvel fans (especially black widow fans can I get a yeah boi) read this book??</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/8fe293d79e1627c51cfdaa619cec4278/tumblr_pd18twAlfI1v06w3c_540.jpg\" class=\"\"/></figure><p>I&rsquo;m just over half way through and it&rsquo;s pretty darn good!</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/6919588a0c3247802df7415f9e3e3511/tumblr_pd18u0ku801v06w3c_540.jpg\" class=\"\"/></figure><h2>*SPOILER ALERT FROM HERE*</h2><h2>Ok so its about black widow (obviously) and another girl (Ava) who wasn&rsquo;t part of the Red Room the same as Natasha, but was experimented on by the same man who ran the Red Room (Ivan Somodorov).</h2><p>But it gives us a few clues about certain stuffs in the marvel universe:</p><ul><li>The book starts with an &ldquo;8 years previously&rdquo; and it mentions that at that point, Natasha is quite new to shield. So say she&rsquo;s been their 2-4 years (I only say that long because she was on a solo mission which means she must have been trusted at that point, and that trust ain&rsquo;t easy to get). The majority of the book then takes place about a year after New York. Which means Natasha has actually only been a good guy for around 10-14 years. Which might seem a lot for a normal person, but in the comic books she is similar to Steve Rogers and the Winter Soldier, she&rsquo;s genetically advanced and in the comics had been around since pre WW2. Plus there is a brief mention that her birthday is redacted from her file which could show that she&rsquo;s actually a lot older than she looks and it&rsquo;s never implicitly contradicted that in the movies (or book, so far).</li></ul><h2>Bear in mind that the only person to state that this is part of the MCU is the author if the book, no one else from Marvel has confirmed or denied that&hellip;</h2><ul><li>Now this is a big <b>*spoiler* </b>but Coulson is in it. Not just in the first chapter either he is in it throughout. Him and Nat talk and he helps her out for a bit. Now do you remember me mentioning that this is after New York? This is indesputible because there is 1 or 2 pages dedicated to Natasha thinking about how hard it&rsquo;s been to keep a low profile since the Avengers became world famous, how she&rsquo;s had to work a whole lot harder to disguise herself because the entire world now knows what she looks like.</li><li>Natasha knowing Coulson is alive isn&rsquo;t even the best part.</li><li>Tony Stark is in it.</li><li>He only appears for a few chapters (so far, he might come back) to try and help Natasha and Ava with a lil problem they have.</li><li>But</li><li>He</li><li>Mentions</li><li>Natasha getting help from Coulson.</li><li>Obviously the rest of his line won&rsquo;t make sense until you read the book but he says this &ldquo;So you circle the wagons, pick up Mini-Me, take out Ivan&rsquo;s welcome party, <i><b>hop aboard Coulson&rsquo;s good ship</b></i> Lollipop and hitch a ride to S.H.I.E.L.D.&rsquo;s doorstep?&rdquo;. Plus earlier it says &ldquo;a few well placed calls from Coulson&rdquo; help Tony and Natasha get access to what they want access to at the New York Triskellion. So this HEAVILY implies that Tony Stark also knew Coulson was alive?? Which leads on to the question do the others know? Did they tell them or did they realise he was *dead* for a reason and keep the secret?</li></ul><h2>&hellip;.Or it could be set in an entirely alternate universe where Coulson never died&hellip;.in which case half this post is pointless (but it&rsquo;s still a good book so go read)</h2><ul><li>Plus there are a few other bits, for example Tony makes a Star Trek reference proving many people&rsquo;s headcannons that he is a huge nerd. And Natasha follows that with &ldquo;is that before or after they blow up the death star&rdquo; proving that even in the midst and a crisis she is a HUGE troll&hellip;.OR&hellip;. she is completely anti-nerd and doesn&rsquo;t care for movies or pop culture&hellip;</li></ul><p>Now I&rsquo;m not gonna lie, it&rsquo;s not the BEST book I&rsquo;ve ever read (maybe because I&rsquo;m a year or 2 too old) but it&rsquo;s well written and thorough and it gives a really big insight to Natasha&rsquo; s character. When she isn&rsquo;t with her Avenger buddies, people she trusts implicitly, she is cold and calculating and has no fucking clue on how to deal with teenagers, or how to connect with Ava (who is very similar to her in experiences and past traumas). Through this it also gives a large insight into what the Red Room was like, which lots of fans have been searching for for a long time. Also there are lots of bits in Russian which is interesting and it&rsquo;s written in a way that you can usually understand what it translates to (or it&rsquo;s translated for you).</p><p>However, the only major downside to this book that I can find is that Clint Barton isn&rsquo;t in it. So far he hasn&rsquo;t even been mentioned (I think&#128517;) and I looked some things up and it doesn&rsquo;t look like he comes into the second half of the book either. Now as much as that is disappointed there are still 1 or 2 books (i forget) in this series in which he m<i>ight </i>appear in. I doubt it though.</p><p>All in all its a thouraghly enjoyable book and I definitely wouldn&rsquo;t mind any Black Widow movie to be based on it (although the inclusion on Clint Barton would be preferable) so you BW fans out there go read it it&rsquo;s good&#128077;&#128077;</p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><p>-E</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "the-spectacular-spider-bi",
        "blog": {
            "name": "the-spectacular-spider-bi",
            "title": "Henlo frend",
            "description": "I make posts about my art, food I make, the occasional booty pic, and get really horny on main alot. I like to keep it interesting so expect to see a lot of me trying too hard for attention. \nThat being said they're AWESOME booty pics...\n\noh and the art and food posts are pretty good too. Otherwise I reblog things I like, maybe you'll like them too 😊\n\nReblogs are encouraged but no reposting plz.\n\nIcon and header art by ...\n*gasp!*\nMe!! 😁",
            "url": "https://the-spectacular-spider-bi.tumblr.com/",
            "uuid": "t:B4Vx5wfvQnPnY2aL8kktiw",
            "updated": 1558414644
        },
        "id": 176690775981,
        "post_url": "https://the-spectacular-spider-bi.tumblr.com/post/176690775981/this-is-what-i-do-at-209-am-instead-of-fucking",
        "slug": "this-is-what-i-do-at-209-am-instead-of-fucking",
        "date": "2018-08-06 09:11:59 GMT",
        "timestamp": 1533546719,
        "state": "published",
        "format": "html",
        "reblog_key": "fzISMDnC",
        "tags": [
            "avengers infinity war",
            "infinity war",
            "avengers",
            "aiw",
            "iw",
            "thanos",
            "thor",
            "spider-man",
            "mcu",
            "marvel",
            "my shitposts",
            "meme",
            "memes",
            "hella swag",
            "infinity war spoilers"
        ],
        "short_url": "https://tmblr.co/Z5l1Ug2aZbqUj",
        "summary": "This is what I do at 2:09 am instead of fucking sleeping, enjoy.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 17,
        "caption": "<p>This is what I do at 2:09 am instead of fucking sleeping, enjoy.</p>",
        "reblog": {
            "comment": "<p>This is what I do at 2:09 am instead of fucking sleeping, enjoy.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "the-spectacular-spider-bi",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#E379F9",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/77fc4c71c6f6716cfbcd1ff9d72a35af/d3kokuk/OpIpft087/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/77fc4c71c6f6716cfbcd1ff9d72a35af/d3kokuk/OpIpft087/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/77fc4c71c6f6716cfbcd1ff9d72a35af/d3kokuk/OpIpft087/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176690775981"
                },
                "content_raw": "<p>This is what I do at 2:09 am instead of fucking sleeping, enjoy.</p>",
                "content": "<p>This is what I do at 2:09 am instead of fucking sleeping, enjoy.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://the-spectacular-spider-bi.tumblr.com/image/176690775981",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/8551b2f3968cddb48c64084b983cf18e/tumblr_pd1880db2R1va5wmeo1_1280.png",
                    "width": 720,
                    "height": 1280
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/8551b2f3968cddb48c64084b983cf18e/tumblr_pd1880db2R1va5wmeo1_1280.png",
                        "width": 720,
                        "height": 1280
                    },
                    {
                        "url": "https://66.media.tumblr.com/8551b2f3968cddb48c64084b983cf18e/tumblr_pd1880db2R1va5wmeo1_640.png",
                        "width": 540,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/8551b2f3968cddb48c64084b983cf18e/tumblr_pd1880db2R1va5wmeo1_540.png",
                        "width": 456,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/8551b2f3968cddb48c64084b983cf18e/tumblr_pd1880db2R1va5wmeo1_500.png",
                        "width": 422,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/8551b2f3968cddb48c64084b983cf18e/tumblr_pd1880db2R1va5wmeo1_400.png",
                        "width": 338,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/8551b2f3968cddb48c64084b983cf18e/tumblr_pd1880db2R1va5wmeo1_250.png",
                        "width": 225,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/8551b2f3968cddb48c64084b983cf18e/tumblr_pd1880db2R1va5wmeo1_100.png",
                        "width": 100,
                        "height": 178
                    },
                    {
                        "url": "https://66.media.tumblr.com/8551b2f3968cddb48c64084b983cf18e/tumblr_pd1880db2R1va5wmeo1_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "maryxglz",
        "blog": {
            "name": "maryxglz",
            "title": "Just Tom Hiddleston",
            "description": "Hiddlestoner.\nFan blog dedicated to the awesome British actor Tom Hiddleston.",
            "url": "https://maryxglz.tumblr.com/",
            "uuid": "t:crcnRdV0H3jZKmaaRHnIKw",
            "updated": 1558433714
        },
        "id": 176690458897,
        "post_url": "https://maryxglz.tumblr.com/post/176690458897/x",
        "slug": "x",
        "date": "2018-08-06 08:54:32 GMT",
        "timestamp": 1533545672,
        "state": "published",
        "format": "html",
        "reblog_key": "adukTpFn",
        "tags": [
            "tom hiddleston",
            "avengers",
            "loki",
            "man crush monday",
            "tom hiddleston smile",
            "hiddlesmile"
        ],
        "short_url": "https://tmblr.co/ZXwDKs2aZad4H",
        "summary": "(x)",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 678,
        "caption": "<p>(<a href=\"https://www.youtube.com/watch?v=GxrJnWstKAU\">x</a>)<br/></p>",
        "reblog": {
            "comment": "<p>(<a href=\"https://www.youtube.com/watch?v=GxrJnWstKAU\">x</a>)<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "maryxglz",
                    "active": true,
                    "theme": {
                        "header_full_width": 4927,
                        "header_full_height": 3285,
                        "header_focus_width": 2048,
                        "header_focus_height": 1152,
                        "avatar_shape": "circle",
                        "background_color": "#282828",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "256,4927,3028,0",
                        "header_image": "https://static.tumblr.com/eacd24b0c56ac7dd7bf940ecb72265da/hajpvdp/HLApobpgd/tumblr_static_6qfq6afxqjgg4kksscgs8kg48.jpg",
                        "header_image_focused": "https://static.tumblr.com/590001590b97cadf5b71136f72592b4a/hajpvdp/QN9pobpgn/tumblr_static_tumblr_static_6qfq6afxqjgg4kksscgs8kg48_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/eacd24b0c56ac7dd7bf940ecb72265da/hajpvdp/HLApobpgd/tumblr_static_6qfq6afxqjgg4kksscgs8kg48_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#2a7c9a",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#f8f6f6",
                        "title_font": "Avalon",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176690458897"
                },
                "content_raw": "<p>(<a href=\"https://www.youtube.com/watch?v=GxrJnWstKAU\">x</a>)<br></p>",
                "content": "<p>(<a href=\"https://www.youtube.com/watch?v=GxrJnWstKAU\">x</a>)<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "11",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/25913359540d8dfeef71743d3089329f/tumblr_pd17ewWoQI1spgwzwo1_540.gif",
                    "width": 540,
                    "height": 400
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/25913359540d8dfeef71743d3089329f/tumblr_pd17ewWoQI1spgwzwo1_540.gif",
                        "width": 540,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/25913359540d8dfeef71743d3089329f/tumblr_pd17ewWoQI1spgwzwo1_500.gif",
                        "width": 500,
                        "height": 370
                    },
                    {
                        "url": "https://66.media.tumblr.com/25913359540d8dfeef71743d3089329f/tumblr_pd17ewWoQI1spgwzwo1_400.gif",
                        "width": 400,
                        "height": 296
                    },
                    {
                        "url": "https://66.media.tumblr.com/25913359540d8dfeef71743d3089329f/tumblr_pd17ewWoQI1spgwzwo1_250.gif",
                        "width": 250,
                        "height": 185
                    },
                    {
                        "url": "https://66.media.tumblr.com/25913359540d8dfeef71743d3089329f/tumblr_pd17ewWoQI1spgwzwo1_100.gif",
                        "width": 100,
                        "height": 74
                    },
                    {
                        "url": "https://66.media.tumblr.com/25913359540d8dfeef71743d3089329f/tumblr_pd17ewWoQI1spgwzwo1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/23f86e498159253494ea678bed35b612/tumblr_pd17ewWoQI1spgwzwo2_540.gif",
                    "width": 540,
                    "height": 400
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/23f86e498159253494ea678bed35b612/tumblr_pd17ewWoQI1spgwzwo2_540.gif",
                        "width": 540,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/23f86e498159253494ea678bed35b612/tumblr_pd17ewWoQI1spgwzwo2_500.gif",
                        "width": 500,
                        "height": 370
                    },
                    {
                        "url": "https://66.media.tumblr.com/23f86e498159253494ea678bed35b612/tumblr_pd17ewWoQI1spgwzwo2_400.gif",
                        "width": 400,
                        "height": 296
                    },
                    {
                        "url": "https://66.media.tumblr.com/23f86e498159253494ea678bed35b612/tumblr_pd17ewWoQI1spgwzwo2_250.gif",
                        "width": 250,
                        "height": 185
                    },
                    {
                        "url": "https://66.media.tumblr.com/23f86e498159253494ea678bed35b612/tumblr_pd17ewWoQI1spgwzwo2_100.gif",
                        "width": 100,
                        "height": 74
                    },
                    {
                        "url": "https://66.media.tumblr.com/23f86e498159253494ea678bed35b612/tumblr_pd17ewWoQI1spgwzwo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "kirbyfemur",
        "blog": {
            "name": "kirbyfemur",
            "title": "Kirbyfemur",
            "description": "I've been a Musician for 10+ years, and a music producer for 4+ years. I'll likely talk about music and video games.",
            "url": "https://kirbyfemur.tumblr.com/",
            "uuid": "t:lOjbFMcb9Hk8GBzzLobXGQ",
            "updated": 1557955549
        },
        "id": 176690167109,
        "post_url": "https://kirbyfemur.tumblr.com/post/176690167109/if-thanos-was-true-in-his-word-about-half-of-the",
        "slug": "if-thanos-was-true-in-his-word-about-half-of-the",
        "date": "2018-08-06 08:39:11 GMT",
        "timestamp": 1533544751,
        "state": "published",
        "format": "html",
        "reblog_key": "AF1gJ0IU",
        "tags": [
            "infinity war",
            "avengers",
            "thanos",
            "oh",
            "whoopsie",
            "marvel",
            "comics",
            "movies"
        ],
        "short_url": "https://tmblr.co/Z0abKt2aZZVr5",
        "summary": "If Thanos was true in his word about half of the universe dying as random. There is a good chance that in the vastness of the...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 2,
        "title": null,
        "body": "<p>If Thanos was true in his word about half of the universe dying as random. There is a good chance that in the vastness of the universe one-many civilizations may have lost enough of people in their reproductive cycle to cause irreparable damage and lead to their doom well before their resources might have run dry.</p><p><br/></p><p>(Assuming that at least one in however many civilizations are similar in how they reproduce of course)</p>",
        "reblog": {
            "comment": "<p>If Thanos was true in his word about half of the universe dying as random. There is a good chance that in the vastness of the universe one-many civilizations may have lost enough of people in their reproductive cycle to cause irreparable damage and lead to their doom well before their resources might have run dry.</p><p><br></p><p>(Assuming that at least one in however many civilizations are similar in how they reproduce of course)</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "kirbyfemur",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_11.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_11_focused_v3.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_11_focused_v3.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176690167109"
                },
                "content_raw": "<p>If Thanos was true in his word about half of the universe dying as random. There is a good chance that in the vastness of the universe one-many civilizations may have lost enough of people in their reproductive cycle to cause irreparable damage and lead to their doom well before their resources might have run dry.</p><p><br></p><p>(Assuming that at least one in however many civilizations are similar in how they reproduce of course)</p>",
                "content": "<p>If Thanos was true in his word about half of the universe dying as random. There is a good chance that in the vastness of the universe one-many civilizations may have lost enough of people in their reproductive cycle to cause irreparable damage and lead to their doom well before their resources might have run dry.</p><p><br /></p><p>(Assuming that at least one in however many civilizations are similar in how they reproduce of course)</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "pyjamas89",
        "blog": {
            "name": "pyjamas89",
            "title": "Untitled",
            "description": "",
            "url": "https://pyjamas89.tumblr.com/",
            "uuid": "t:nkjm7I8CIheNR4N8Vveyow",
            "updated": 1556172716
        },
        "id": 176690091990,
        "post_url": "https://pyjamas89.tumblr.com/post/176690091990/went-to-see-ant-man-and-the-wasp-last-night-and",
        "slug": "went-to-see-ant-man-and-the-wasp-last-night-and",
        "date": "2018-08-06 08:35:24 GMT",
        "timestamp": 1533544524,
        "state": "published",
        "format": "html",
        "reblog_key": "PAjLFH5Y",
        "tags": [
            "ant man and the wasp",
            "ghost",
            "marvel",
            "avengers"
        ],
        "short_url": "https://tmblr.co/Z_3jdm2aZZDVM",
        "summary": "Went to see ant man and the wasp last night and was not dissapointed. Ghost was a fantastic non-villain and hope to see more of...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 4,
        "title": null,
        "body": "<h1>Went to see ant man and the wasp last night and was not dissapointed. Ghost was a fantastic non-villain and hope to see more of her in the future 😁</h1>",
        "reblog": {
            "comment": "<p><h1>Went to see ant man and the wasp last night and was not dissapointed. Ghost was a fantastic non-villain and hope to see more of her in the future 😁</h1></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "pyjamas89",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#5BBC8C",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_11.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_11.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_11.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176690091990"
                },
                "content_raw": "<p><h1>Went to see ant man and the wasp last night and was not dissapointed. Ghost was a fantastic non-villain and hope to see more of her in the future 😁</h1></p>",
                "content": "<p><h1>Went to see ant man and the wasp last night and was not dissapointed. Ghost was a fantastic non-villain and hope to see more of her in the future &#128513;</h1></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "hey-its-grey",
        "blog": {
            "name": "hey-its-grey",
            "title": "Just a bit otter than normal",
            "description": "Writer | Slytherin | Australian | Proud Latter-Day Saint | Too many feelings | I love my Tumblr family | Big Soft Energy | Iconic | The Chaotic Cutie™ | Soft Sass | what suits you best, suits you - ju",
            "url": "https://hey-its-grey.tumblr.com/",
            "uuid": "t:f1pCKGoCnhe_mN8rsmdTMg",
            "updated": 1558428155
        },
        "id": 176689908881,
        "post_url": "https://hey-its-grey.tumblr.com/post/176689908881/okay-so-i-have-been-given-permission-to-enter-the",
        "slug": "okay-so-i-have-been-given-permission-to-enter-the",
        "date": "2018-08-06 08:25:40 GMT",
        "timestamp": 1533543940,
        "state": "published",
        "format": "html",
        "reblog_key": "y7kINQyW",
        "tags": [
            "thanks",
            "tom holland",
            "avengers 4",
            "avengers4",
            "avengers",
            "the brothers trust",
            "thebrotherstrust",
            "edward charles foundation"
        ],
        "short_url": "https://tmblr.co/Z3sC7a2aZYWoH",
        "summary": "Okay so I have been given permission to enter the competition for the Tom Holland set thing run by The Brothers Trust. However,...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 5,
        "title": null,
        "body": "<p>Okay so I have been given permission to enter the competition for the Tom Holland set thing run by The Brothers Trust. However, mum wants me to do a full check on where my money is going. It is going to the Edward Charles Foundation. I can&rsquo;t find much information and while I really want to enter, I&rsquo;m apprehensive. </p><p>So, if you know anything about it, or can find a reason I shouldn&rsquo;t donate, please let me know either through this post or PM me.</p><p>Thanks ☺️</p>",
        "reblog": {
            "comment": "<p>Okay so I have been given permission to enter the competition for the Tom Holland set thing run by The Brothers Trust. However, mum wants me to do a full check on where my money is going. It is going to the Edward Charles Foundation. I can’t find much information and while I really want to enter, I’m apprehensive. </p><p>So, if you know anything about it, or can find a reason I shouldn’t donate, please let me know either through this post or PM me.</p><p>Thanks ☺️</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "hey-its-grey",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#CCCCCC",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/ceeda0d8163c1660b74a14fe6c9f2ad6/s6gjo1k/xmNpp9lll/tumblr_static_1112890769-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/ceeda0d8163c1660b74a14fe6c9f2ad6/s6gjo1k/xmNpp9lll/tumblr_static_1112890769-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/ceeda0d8163c1660b74a14fe6c9f2ad6/s6gjo1k/xmNpp9lll/tumblr_static_1112890769-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#2A546C",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176689908881"
                },
                "content_raw": "<p>Okay so I have been given permission to enter the competition for the Tom Holland set thing run by The Brothers Trust. However, mum wants me to do a full check on where my money is going. It is going to the Edward Charles Foundation. I can’t find much information and while I really want to enter, I’m apprehensive. </p><p>So, if you know anything about it, or can find a reason I shouldn’t donate, please let me know either through this post or PM me.</p><p>Thanks ☺️</p>",
                "content": "<p>Okay so I have been given permission to enter the competition for the Tom Holland set thing run by The Brothers Trust. However, mum wants me to do a full check on where my money is going. It is going to the Edward Charles Foundation. I can&rsquo;t find much information and while I really want to enter, I&rsquo;m apprehensive. </p><p>So, if you know anything about it, or can find a reason I shouldn&rsquo;t donate, please let me know either through this post or PM me.</p><p>Thanks &#9786;&#65039;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "thisboythatboy",
        "blog": {
            "name": "thisboythatboy",
            "title": "Stanley",
            "description": "<p>a big hoe for the Beatles, Queen, and anything that Damon Albarn has created </p>",
            "url": "https://thisboythatboy.tumblr.com/",
            "uuid": "t:3qckABs0jz6B99PUJq_IVQ",
            "updated": 1558335022
        },
        "id": 176689868410,
        "post_url": "https://thisboythatboy.tumblr.com/post/176689868410/my-dad-said-human-vision-looks-like-a-person-from",
        "slug": "my-dad-said-human-vision-looks-like-a-person-from",
        "date": "2018-08-06 08:23:40 GMT",
        "timestamp": 1533543820,
        "state": "published",
        "format": "html",
        "reblog_key": "GIDURQXe",
        "tags": [
            "vision",
            "marvel",
            "coldplay",
            "meme",
            "avengers"
        ],
        "short_url": "https://tmblr.co/ZLqLGb2aZYMvw",
        "summary": "my dad said human vision looks like a person from Coldplay and I don’t know what to do with this information ",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 7,
        "title": null,
        "body": "<p>my dad said human vision looks like a person from Coldplay and I don’t know what to do with this information </p>",
        "reblog": {
            "comment": "<p>my dad said human vision looks like a person from Coldplay and I don’t know what to do with this information </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thisboythatboy",
                    "active": true,
                    "theme": {
                        "header_full_width": 390,
                        "header_full_height": 390,
                        "header_focus_width": 390,
                        "header_focus_height": 220,
                        "avatar_shape": "square",
                        "background_color": "#0A0000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "62,390,282,0",
                        "header_image": "https://static.tumblr.com/36a6651cb09e7c4a7e0b08fa88280346/i5jibsf/BKupfcdar/tumblr_static_-2094752983-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/36a6651cb09e7c4a7e0b08fa88280346/i5jibsf/6Iipfcdar/tumblr_static_tumblr_static_-2094752983-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/36a6651cb09e7c4a7e0b08fa88280346/i5jibsf/BKupfcdar/tumblr_static_-2094752983-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#72C59C",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#346B50",
                        "title_font": "Clarendon Text Pro",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176689868410"
                },
                "content_raw": "<p>my dad said human vision looks like a person from Coldplay and I don’t know what to do with this information </p>",
                "content": "<p>my dad said human vision looks like a person from Coldplay&nbsp;and I don&rsquo;t know what to do with this information&nbsp;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "chat",
        "blog_name": "gokuma",
        "blog": {
            "name": "gokuma",
            "title": "Gokuma",
            "description": "© All copyrighted materials posted on this personal blog are for the sole purposes of documenting and illustrating my interests. All rights are reserved and respected to their original copyright owners. No copyright infringement of any kind is intended.",
            "url": "https://gokuma.tumblr.com/",
            "uuid": "t:aX8g8ZrEBqJhCioueHtPRA",
            "updated": 1558379273
        },
        "id": 176689858000,
        "post_url": "https://gokuma.tumblr.com/post/176689858000/thanos-snaps-his-fingers-thanos-starts",
        "slug": "thanos-snaps-his-fingers-thanos-starts",
        "date": "2018-08-06 08:23:07 GMT",
        "timestamp": 1533543787,
        "state": "published",
        "format": "html",
        "reblog_key": "DRIrcQ3L",
        "tags": [
            "infinity war",
            "thanos",
            "avengers"
        ],
        "short_url": "https://tmblr.co/Zo-PBx2aZYKNG",
        "summary": "Thanos: *snaps his fingers*\nThanos: *starts turning into ash*\nThanos: okay fair enough",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 3,
        "title": null,
        "body": "Thanos: *snaps his fingers*\nThanos: *starts turning into ash*\nThanos: okay fair enough",
        "dialogue": [
            {
                "name": "Thanos",
                "label": "Thanos:",
                "phrase": "*snaps his fingers*"
            },
            {
                "name": "Thanos",
                "label": "Thanos:",
                "phrase": "*starts turning into ash*"
            },
            {
                "name": "Thanos",
                "label": "Thanos:",
                "phrase": "okay fair enough"
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "marvnight",
        "blog": {
            "name": "marvnight",
            "title": "⋆ alexia ⋆",
            "description": "<p>qυєєи, вσянαρ ¢αѕт, &amp; мαяνєℓ ιѕ ωну ι’м αℓινє.</p>",
            "url": "https://marvnight.tumblr.com/",
            "uuid": "t:KtTMVUyKvU49Zh1yuN-61w",
            "updated": 1558151790
        },
        "id": 176689755909,
        "post_url": "https://marvnight.tumblr.com/post/176689755909/strange-peacefully-drinking-a-cup-of-tea-tony",
        "slug": "strange-peacefully-drinking-a-cup-of-tea-tony",
        "date": "2018-08-06 08:17:51 GMT",
        "timestamp": 1533543471,
        "state": "published",
        "format": "html",
        "reblog_key": "eo5fOJxF",
        "tags": [
            "doctor strange",
            "tony stark",
            "avengers",
            "ironstrange",
            "iron man",
            "dctrstrng",
            "stephen strange"
        ],
        "short_url": "https://tmblr.co/ZGAGlf2aZXxS5",
        "summary": "Strange: *peacefully drinking a cup of tea*\nTony: *breaks the silence* Do you like me?\nStrange: .. *Sets tea down* Tony. We’ve...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Strange:</b> *peacefully drinking a cup of tea*</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b><b>Tony:</b></b> *breaks the silence* Do you like me?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Strange:</b> .. *Sets tea down* Tony. We’ve been together for 2 years now—</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony:</b> I know but you like me?</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Strange:</b> *peacefully drinking a cup of tea*</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b><b>Tony:</b></b> *breaks the silence* Do you like me?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Strange:</b> .. *Sets tea down* Tony. We’ve been together for 2 years now—</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony:</b> I know but you like me?</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "marvnight",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 640,
                        "header_focus_width": 640,
                        "header_focus_height": 360,
                        "avatar_shape": "circle",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "280,640,640,0",
                        "header_image": "https://static.tumblr.com/dc2d9b1aa5d5a3f6160d136ba55b5f56/megtx1q/i14pr6282/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/de2553df1884b0a5772f8ecc1ab39c19/megtx1q/2Mrpr6283/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/dc2d9b1aa5d5a3f6160d136ba55b5f56/megtx1q/i14pr6282/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#EEEEEE",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#F6F6F6",
                        "title_font": "Alternate Gothic",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176689755909"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Strange:</b> *peacefully drinking a cup of tea*</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b><b>Tony:</b></b> *breaks the silence* Do you like me?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Strange:</b> .. *Sets tea down* Tony. We’ve been together for 2 years now—</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony:</b> I know but you like me?</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Strange:</b> *peacefully drinking a cup of tea*</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b><b>Tony:</b></b> *breaks the silence* Do you like me?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Strange:</b> .. *Sets tea down* Tony. We&rsquo;ve been together for 2 years now&mdash;</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Tony:</b> I know but you like me?</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "billyskingdom",
        "blog": {
            "name": "billyskingdom",
            "title": "Untitled",
            "description": "",
            "url": "https://billyskingdom.tumblr.com/",
            "uuid": "t:g-iZcrR8Bq-ctCRKLzcAGQ",
            "updated": 1545333948
        },
        "id": 176689686028,
        "post_url": "https://billyskingdom.tumblr.com/post/176689686028/chrissamnee-blackwidow-natasharomanoff",
        "slug": "chrissamnee-blackwidow-natasharomanoff",
        "date": "2018-08-06 08:14:15 GMT",
        "timestamp": 1533543255,
        "state": "published",
        "format": "html",
        "reblog_key": "lvA2Ji2K",
        "tags": [
            "blackwidow",
            "natasharomanoff",
            "avengers",
            "marvelcomics"
        ],
        "short_url": "https://tmblr.co/Z93ukq2aZXgOC",
        "summary": "@chrissamnee #blackwidow #natasharomanoff #avengers #marvelcomics",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "caption": "<p>@chrissamnee #blackwidow #natasharomanoff #avengers #marvelcomics</p>",
        "reblog": {
            "comment": "<p>@chrissamnee #blackwidow #natasharomanoff #avengers #marvelcomics</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "billyskingdom",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/77a29de51bd849d135923bc4f0b04c0c/fknav0n/Ko7mpsail/tumblr_static_circlestack.gif",
                        "header_image_focused": "https://static.tumblr.com/77a29de51bd849d135923bc4f0b04c0c/fknav0n/Ko7mpsail/tumblr_static_circlestack.gif",
                        "header_image_scaled": "https://static.tumblr.com/77a29de51bd849d135923bc4f0b04c0c/fknav0n/Ko7mpsail/tumblr_static_circlestack.gif",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176689686028"
                },
                "content_raw": "<p>@chrissamnee #blackwidow #natasharomanoff #avengers #marvelcomics</p>",
                "content": "<p>@chrissamnee #blackwidow #natasharomanoff #avengers #marvelcomics</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "https://www.instagram.com/p/BmIV03qhAb_hM9Qa9aNXUVyId8K32HxXRMghnY0/?utm_source=ig_tumblr_share&igshid=r1redd1cxt8f",
        "image_permalink": "https://billyskingdom.tumblr.com/image/176689686028",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/2cc1c54599300532eb07c49aa21648a2/tumblr_pd15jrqB7k1sfzl5io1_1280.jpg",
                    "width": 773,
                    "height": 791
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/2cc1c54599300532eb07c49aa21648a2/tumblr_pd15jrqB7k1sfzl5io1_1280.jpg",
                        "width": 773,
                        "height": 791
                    },
                    {
                        "url": "https://66.media.tumblr.com/2cc1c54599300532eb07c49aa21648a2/tumblr_pd15jrqB7k1sfzl5io1_640.jpg",
                        "width": 640,
                        "height": 655
                    },
                    {
                        "url": "https://66.media.tumblr.com/2cc1c54599300532eb07c49aa21648a2/tumblr_pd15jrqB7k1sfzl5io1_540.jpg",
                        "width": 540,
                        "height": 553
                    },
                    {
                        "url": "https://66.media.tumblr.com/2cc1c54599300532eb07c49aa21648a2/tumblr_pd15jrqB7k1sfzl5io1_500.jpg",
                        "width": 500,
                        "height": 512
                    },
                    {
                        "url": "https://66.media.tumblr.com/2cc1c54599300532eb07c49aa21648a2/tumblr_pd15jrqB7k1sfzl5io1_400.jpg",
                        "width": 400,
                        "height": 409
                    },
                    {
                        "url": "https://66.media.tumblr.com/2cc1c54599300532eb07c49aa21648a2/tumblr_pd15jrqB7k1sfzl5io1_250.jpg",
                        "width": 250,
                        "height": 256
                    },
                    {
                        "url": "https://66.media.tumblr.com/2cc1c54599300532eb07c49aa21648a2/tumblr_pd15jrqB7k1sfzl5io1_100.jpg",
                        "width": 100,
                        "height": 102
                    },
                    {
                        "url": "https://66.media.tumblr.com/2cc1c54599300532eb07c49aa21648a2/tumblr_pd15jrqB7k1sfzl5io1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "pyjamas89",
        "blog": {
            "name": "pyjamas89",
            "title": "Untitled",
            "description": "",
            "url": "https://pyjamas89.tumblr.com/",
            "uuid": "t:nkjm7I8CIheNR4N8Vveyow",
            "updated": 1556172716
        },
        "id": 176689475785,
        "post_url": "https://pyjamas89.tumblr.com/post/176689475785/well-thats-rude",
        "slug": "well-thats-rude",
        "date": "2018-08-06 08:03:28 GMT",
        "timestamp": 1533542608,
        "state": "published",
        "format": "html",
        "reblog_key": "LIWEzM6u",
        "tags": [
            "thor",
            "thor ragnarok",
            "thor odinson",
            "marvel",
            "avengers"
        ],
        "short_url": "https://tmblr.co/Z_3jdm2aZWt39",
        "summary": "Well...... thats rude",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1,
        "caption": "<p>Well&hellip;&hellip; thats rude</p>",
        "reblog": {
            "comment": "<p>Well…… thats rude</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "pyjamas89",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#5BBC8C",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_11.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_11.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_11.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176689475785"
                },
                "content_raw": "<p>Well…… thats rude</p>",
                "content": "<p>Well&hellip;&hellip; thats rude</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://pyjamas89.tumblr.com/image/176689475785",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/e9b20d69e47f683090c8fcbe9a1a1a0b/tumblr_pd151sW9aO1tkczovo1_1280.jpg",
                    "width": 1067,
                    "height": 415
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/e9b20d69e47f683090c8fcbe9a1a1a0b/tumblr_pd151sW9aO1tkczovo1_1280.jpg",
                        "width": 1067,
                        "height": 415
                    },
                    {
                        "url": "https://66.media.tumblr.com/e9b20d69e47f683090c8fcbe9a1a1a0b/tumblr_pd151sW9aO1tkczovo1_640.jpg",
                        "width": 640,
                        "height": 249
                    },
                    {
                        "url": "https://66.media.tumblr.com/e9b20d69e47f683090c8fcbe9a1a1a0b/tumblr_pd151sW9aO1tkczovo1_540.jpg",
                        "width": 540,
                        "height": 210
                    },
                    {
                        "url": "https://66.media.tumblr.com/e9b20d69e47f683090c8fcbe9a1a1a0b/tumblr_pd151sW9aO1tkczovo1_500.jpg",
                        "width": 500,
                        "height": 194
                    },
                    {
                        "url": "https://66.media.tumblr.com/e9b20d69e47f683090c8fcbe9a1a1a0b/tumblr_pd151sW9aO1tkczovo1_400.jpg",
                        "width": 400,
                        "height": 156
                    },
                    {
                        "url": "https://66.media.tumblr.com/e9b20d69e47f683090c8fcbe9a1a1a0b/tumblr_pd151sW9aO1tkczovo1_250.jpg",
                        "width": 250,
                        "height": 97
                    },
                    {
                        "url": "https://66.media.tumblr.com/e9b20d69e47f683090c8fcbe9a1a1a0b/tumblr_pd151sW9aO1tkczovo1_100.jpg",
                        "width": 100,
                        "height": 39
                    },
                    {
                        "url": "https://66.media.tumblr.com/e9b20d69e47f683090c8fcbe9a1a1a0b/tumblr_pd151sW9aO1tkczovo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "thestarsintheknight",
        "blog": {
            "name": "thestarsintheknight",
            "title": "Let's Explore the Stars Now, Shall We?",
            "description": "All of time and space, everywhere and anywhere, every star that ever was... Where do you want to start? <br> Avridell || she/her || lithro/queer || multi-fandom || <a href=\"https://thestarsintheknight.tumblr.com/post/176105759778/taggingsystem\">Tagging System</a> || <a href=\"http://ko-fi.com/amethystkw\">Buy me a Ko-Fi?</a>",
            "url": "https://thestarsintheknight.tumblr.com/",
            "uuid": "t:sb1NbyhxskzMnry6CnTuWw",
            "updated": 1558434027
        },
        "id": 176689427733,
        "post_url": "https://thestarsintheknight.tumblr.com/post/176689427733/does-anyone-remember-this-where-youd-put-it-on",
        "slug": "does-anyone-remember-this-where-youd-put-it-on",
        "date": "2018-08-06 08:00:58 GMT",
        "timestamp": 1533542458,
        "state": "published",
        "format": "html",
        "reblog_key": "pGWHVedC",
        "tags": [
            "marvel",
            "avengers",
            "my post",
            "the good old days",
            "tony stark",
            "steve rogers",
            "iron man",
            "captain america",
            "peter parker",
            "spider-man",
            "ant-man and the wasp",
            "peter parker x reader",
            "bucky barnes",
            "sam wilson",
            "falcon",
            "Guardians of the Galaxy",
            "hulk",
            "thor",
            "bruce banner",
            "loki",
            "im too lazy to tag to get more attention lol"
        ],
        "short_url": "https://tmblr.co/Z1Zp9o2aZWhKL",
        "summary": "does anyone remember this. where you’d put it on your profile to show your fandoms ╔═══════════╗ _DON'T LABEL ME_ ║▌█│║▌║│█║▌║▌...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 29,
        "title": null,
        "body": "<p>does anyone remember this. where you’d put it on your profile to show your fandoms</p><p>╔═══════════╗<br/>_DON&rsquo;T LABEL ME_<br/>║▌█│║▌║│█║▌║▌<br/>║▌█│║▌║│█║▌║▌<br/> ..I&rsquo;M AN AVENGER..<br/>╚═══════════╝<br/><br/></p>",
        "reblog": {
            "comment": "<p>does anyone remember this. where you’d put it on your profile to show your fandoms</p><p>╔═══════════╗<br>_DON’T LABEL ME_<br>║▌█│║▌║│█║▌║▌<br>║▌█│║▌║│█║▌║▌<br> ..I’M AN AVENGER..<br>╚═══════════╝<br><br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thestarsintheknight",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 1280,
                        "header_focus_width": 1090,
                        "header_focus_height": 613,
                        "avatar_shape": "square",
                        "background_color": "#8F6DA5",
                        "body_font": "Futura",
                        "header_bounds": "31,1172,644,82",
                        "header_image": "https://static.tumblr.com/5dd179329f180f9dfcdd3ef3f43e88bc/mh1iq9j/VC5pbrjrj/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/5dd179329f180f9dfcdd3ef3f43e88bc/mh1iq9j/blKplgpsq/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_06_focused_v3.png?_v=c5e9c9bdca5f67be80d91514a36509cc",
                        "header_stretch": true,
                        "link_color": "#D9C8E4",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#D9C8E4",
                        "title_font": "Quadrat",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176689427733"
                },
                "content_raw": "<p>does anyone remember this. where you’d put it on your profile to show your fandoms</p><p>╔═══════════╗<br>_DON’T LABEL ME_<br>║▌█│║▌║│█║▌║▌<br>║▌█│║▌║│█║▌║▌<br> ..I’M AN AVENGER..<br>╚═══════════╝<br><br></p>",
                "content": "<p>does anyone remember this. where you&rsquo;d put it on your profile to show your fandoms</p><p>&#9556;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9559;<br />_DON&rsquo;T LABEL ME_<br />&#9553;&#9612;&#9608;&#9474;&#9553;&#9612;&#9553;&#9474;&#9608;&#9553;&#9612;&#9553;&#9612;<br />&#9553;&#9612;&#9608;&#9474;&#9553;&#9612;&#9553;&#9474;&#9608;&#9553;&#9612;&#9553;&#9612;<br />&nbsp;..I&rsquo;M AN AVENGER..<br />&#9562;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9565;<br /><br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "mesoquatic",
        "blog": {
            "name": "mesoquatic",
            "title": "dirk snap: i did it",
            "description": "<p>he/him•josh•ao3: mesoquatic</p>",
            "url": "https://mesoquatic.tumblr.com/",
            "uuid": "t:kC0OaRMcTS8QZ9mPJIeHnA",
            "updated": 1548093043
        },
        "id": 176689353905,
        "post_url": "https://mesoquatic.tumblr.com/post/176689353905/enter-witty-quote-from-homecoming-here",
        "slug": "enter-witty-quote-from-homecoming-here",
        "date": "2018-08-06 07:57:36 GMT",
        "timestamp": 1533542256,
        "state": "published",
        "format": "html",
        "reblog_key": "DddN585x",
        "tags": [
            "spiderman",
            "marvel",
            "infinity war",
            "avengers",
            "mcu",
            "spiderman homecoming",
            "spiderman far from home",
            "peter parker",
            "spider-man",
            "my art",
            "aug 2018",
            "peterparker",
            "avengers infinity war"
        ],
        "short_url": "https://tmblr.co/ZlVNJh2aZWPIn",
        "summary": "enter witty quote from homecoming here",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 5,
        "caption": "<p>enter witty quote from homecoming here</p>",
        "reblog": {
            "comment": "<p>enter witty quote from homecoming here</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "mesoquatic",
                    "active": true,
                    "theme": {
                        "header_full_width": 719,
                        "header_full_height": 1280,
                        "header_focus_width": 615,
                        "header_focus_height": 346,
                        "avatar_shape": "circle",
                        "background_color": "#B4D5E9",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "419,719,765,104",
                        "header_image": "https://static.tumblr.com/07d5f782c8b1d3464aa8f33637f89a6a/6cj0nmm/CyJp7k7h0/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/07d5f782c8b1d3464aa8f33637f89a6a/6cj0nmm/hyep7k7h4/tumblr_static_tumblr_static__focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/07d5f782c8b1d3464aa8f33637f89a6a/6cj0nmm/CyJp7k7h0/tumblr_static__2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#A1D8BD",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#ffffff",
                        "title_font": "Lorimer No 2",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176689353905"
                },
                "content_raw": "<p>enter witty quote from homecoming here</p>",
                "content": "<p>enter witty quote from homecoming here</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://mesoquatic.tumblr.com/image/176689353905",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/371e179f03b7568aca3927246c62c812/tumblr_pd14s0whsl1vrghgco1_500.png",
                    "width": 441,
                    "height": 500
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/371e179f03b7568aca3927246c62c812/tumblr_pd14s0whsl1vrghgco1_500.png",
                        "width": 441,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/371e179f03b7568aca3927246c62c812/tumblr_pd14s0whsl1vrghgco1_400.png",
                        "width": 400,
                        "height": 454
                    },
                    {
                        "url": "https://66.media.tumblr.com/371e179f03b7568aca3927246c62c812/tumblr_pd14s0whsl1vrghgco1_250.png",
                        "width": 250,
                        "height": 283
                    },
                    {
                        "url": "https://66.media.tumblr.com/371e179f03b7568aca3927246c62c812/tumblr_pd14s0whsl1vrghgco1_100.png",
                        "width": 100,
                        "height": 113
                    },
                    {
                        "url": "https://66.media.tumblr.com/371e179f03b7568aca3927246c62c812/tumblr_pd14s0whsl1vrghgco1_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "just--joana",
        "blog": {
            "name": "just--joana",
            "title": "Heartbreak Girl",
            "description": "♥ This is my bipolar blog ♥",
            "url": "https://just--joana.tumblr.com/",
            "uuid": "t:Rjjg_R65axjZIcWYBiVyww",
            "updated": 1557947080
        },
        "id": 176688744549,
        "post_url": "https://just--joana.tumblr.com/post/176688744549/have-you-ever-thought-that-cw-wouldnt-have",
        "slug": "have-you-ever-thought-that-cw-wouldnt-have",
        "date": "2018-08-06 07:27:13 GMT",
        "timestamp": 1533540433,
        "state": "published",
        "format": "html",
        "reblog_key": "TYgHkMyg",
        "tags": [
            "avengers",
            "captain america",
            "civil war",
            "iron man",
            "steve rogers",
            "tony stark",
            "marvel",
            "mcu",
            "team cap",
            "team iron man"
        ],
        "short_url": "https://tmblr.co/ZFPX-s2aZU4Xb",
        "summary": "Have you ever thought that CW wouldn't have happened if there was someone that would close Tony and Steve in a room and say...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 5,
        "title": null,
        "body": "<p>Have you ever thought that CW wouldn&rsquo;t have happened if there was someone that would close Tony and Steve in a room and say &ldquo;BITCHES YOU&rsquo;RE BOTH RIGHT. NOW WORK YOUR DIFFERENCESSSSSS&rdquo; </p>",
        "reblog": {
            "comment": "<p>Have you ever thought that CW wouldn’t have happened if there was someone that would close Tony and Steve in a room and say “BITCHES YOU’RE BOTH RIGHT. NOW WORK YOUR DIFFERENCESSSSSS” </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "just--joana",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFCFD",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/90cd4299fb9fc9d51a4569c730f3f5ad/ejzykig/WPVpah2go/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/90cd4299fb9fc9d51a4569c730f3f5ad/ejzykig/WPVpah2go/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/90cd4299fb9fc9d51a4569c730f3f5ad/ejzykig/WPVpah2go/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176688744549"
                },
                "content_raw": "<p>Have you ever thought that CW wouldn’t have happened if there was someone that would close Tony and Steve in a room and say “BITCHES YOU’RE BOTH RIGHT. NOW WORK YOUR DIFFERENCESSSSSS” </p>",
                "content": "<p>Have you ever thought that CW wouldn&rsquo;t have happened if there was someone that would close Tony and Steve in a room and say &ldquo;BITCHES YOU&rsquo;RE BOTH RIGHT. NOW WORK YOUR DIFFERENCESSSSSS&rdquo; </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "anotheronebitesthedick",
        "blog": {
            "name": "anotheronebitesthedick",
            "title": "1 Dump 1 Turd 2 Tits John Deacon",
            "description": "<p>Hi, it’s Fiona: 18, cis-bi, taken. Posts about Queen, Marvel, Lord of the Rings and other random shit. My favorite drink is the tears of whiny Reylo shippers lol</p>",
            "url": "https://anotheronebitesthedick.tumblr.com/",
            "uuid": "t:vOasXNk8RXkfYbgsqDQFzA",
            "updated": 1558422435
        },
        "id": 176688592728,
        "post_url": "https://anotheronebitesthedick.tumblr.com/post/176688592728/in-this-house-we-love",
        "slug": "in-this-house-we-love",
        "date": "2018-08-06 07:20:07 GMT",
        "timestamp": 1533540007,
        "state": "published",
        "format": "html",
        "reblog_key": "tQCOxGDd",
        "tags": [
            "marvel",
            "mcu",
            "avengers",
            "guardians of the galaxy",
            "iron man",
            "thor",
            "captain america",
            "hulk",
            "black widow",
            "hawkeye",
            "ant man",
            "wasp",
            "spider man",
            "scarlet witch",
            "vision",
            "falcon",
            "war machine",
            "bucky barnes",
            "doctor strange",
            "black panther",
            "star lord",
            "gamora",
            "drax the destroyer",
            "rocket raccoon",
            "groot",
            "mantis",
            "nebula",
            "loki",
            "valkyrie",
            "heimdall"
        ],
        "short_url": "https://tmblr.co/Zkk09b2aZTVTO",
        "summary": "┓ \n┃┃╱╲ In this \n┃╱╱╲╲ house \n╱╱╭╮╲╲ we love \n▔▏┗┛▕▔ & appreciate \n╱▔▔▔▔▔▔▔▔▔▔╲ \nEvery single Avenger, Guardian           and...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 143,
        "title": null,
        "body": "<p>┓ </p><p>┃┃╱╲ In this </p><p>┃╱╱╲╲ house </p><p>╱╱╭╮╲╲ we love </p><p>▔▏┗┛▕▔ &amp; appreciate </p><p>╱▔▔▔▔▔▔▔▔▔▔╲ </p><p>Every single Avenger, Guardian           and hero of the MCU</p><p>╱╱┏┳┓╭╮┏┳┓ ╲╲ </p><p>▔▏┗┻┛┃┃┗┻┛▕▔</p>",
        "reblog": {
            "comment": "<p>┓ </p><p>┃┃╱╲ In this </p><p>┃╱╱╲╲ house </p><p>╱╱╭╮╲╲ we love </p><p>▔▏┗┛▕▔ &amp; appreciate </p><p>╱▔▔▔▔▔▔▔▔▔▔╲ </p><p>Every single Avenger, Guardian           and hero of the MCU</p><p>╱╱┏┳┓╭╮┏┳┓ ╲╲ </p><p>▔▏┗┻┛┃┃┗┻┛▕▔</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "anotheronebitesthedick",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 673,
                        "header_focus_width": 640,
                        "header_focus_height": 360,
                        "avatar_shape": "circle",
                        "background_color": "#FF0000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "173,640,533,0",
                        "header_image": "https://static.tumblr.com/71e5df16157b0611670f9a103a5ed7a9/ysmpvw7/0trp9totk/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/71e5df16157b0611670f9a103a5ed7a9/ysmpvw7/kR6p9totl/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/71e5df16157b0611670f9a103a5ed7a9/ysmpvw7/0trp9totk/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#B500FF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "176688592728"
                },
                "content_raw": "<p>┓ </p><p>┃┃╱╲ In this </p><p>┃╱╱╲╲ house </p><p>╱╱╭╮╲╲ we love </p><p>▔▏┗┛▕▔ &amp; appreciate </p><p>╱▔▔▔▔▔▔▔▔▔▔╲ </p><p>Every single Avenger, Guardian           and hero of the MCU</p><p>╱╱┏┳┓╭╮┏┳┓ ╲╲ </p><p>▔▏┗┻┛┃┃┗┻┛▕▔</p>",
                "content": "<p>&#9491; </p><p>&#9475;&#9475;&#9585;&#9586; In this </p><p>&#9475;&#9585;&#9585;&#9586;&#9586; house </p><p>&#9585;&#9585;&#9581;&#9582;&#9586;&#9586; we love </p><p>&#9620;&#9615;&#9495;&#9499;&#9621;&#9620; &amp; appreciate </p><p>&#9585;&#9620;&#9620;&#9620;&#9620;&#9620;&#9620;&#9620;&#9620;&#9620;&#9620;&#9586; </p><p>Every single Avenger, Guardian           and hero of the MCU</p><p>&#9585;&#9585;&#9487;&#9523;&#9491;&#9581;&#9582;&#9487;&#9523;&#9491; &#9586;&#9586; </p><p>&#9620;&#9615;&#9495;&#9531;&#9499;&#9475;&#9475;&#9495;&#9531;&#9499;&#9621;&#9620;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]