[
    {
        "type": "text",
        "blog_name": "jungkookahsaranghae",
        "blog": {
            "name": "jungkookahsaranghae",
            "title": "Jungkook-ah",
            "description": "<p>insta: jungsh00k_o.o</p>",
            "url": "https://jungkookahsaranghae.tumblr.com/",
            "uuid": "t:f_HT3YSHcxNPRU2vfz_RyA",
            "updated": 1554808418
        },
        "id": 182376731406,
        "post_url": "https://jungkookahsaranghae.tumblr.com/post/182376731406/been-making-moodboards-and-lockscreens-here",
        "slug": "been-making-moodboards-and-lockscreens-here",
        "date": "2019-01-28 18:18:24 GMT",
        "timestamp": 1548699504,
        "state": "published",
        "format": "html",
        "reblog_key": "ZrwQvqXE",
        "tags": [
            "bts",
            "lockscreens",
            "aesthetic",
            "bts lockscreens",
            "bts jungkook",
            "bts jimin",
            "bts army",
            "moodboards",
            "bts edits",
            "edits"
        ],
        "short_url": "https://tmblr.co/ZYsnrX2fsW1CE",
        "summary": "been making moodboards and lockscreens here recently",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 2,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"734\"><img src=\"https://66.media.tumblr.com/f91dbee232cae02c73fb7b29bdcb8662/tumblr_pm206lX29X1tsmav0_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"734\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/f01895f32e6822bc78599927b08f8c8d/tumblr_pm206m7xlJ1tsmav0_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"720\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/81682eaa7e142bb5cf4dc60e93b0f3dd/tumblr_pm206nSQqy1tsmav0_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/7347df06522a0224013e8ed8de86256a/tumblr_pm206nNa8W1tsmav0_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"/></figure></div><p>been making moodboards and lockscreens here recently </p>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"734\"><img src=\"https://66.media.tumblr.com/f91dbee232cae02c73fb7b29bdcb8662/tumblr_pm206lX29X1tsmav0_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"734\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/f01895f32e6822bc78599927b08f8c8d/tumblr_pm206m7xlJ1tsmav0_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"720\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/81682eaa7e142bb5cf4dc60e93b0f3dd/tumblr_pm206nSQqy1tsmav0_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/7347df06522a0224013e8ed8de86256a/tumblr_pm206nNa8W1tsmav0_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"></figure></div><p>been making moodboards and lockscreens here recently </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jungkookahsaranghae",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#A1D8BD",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/28f47bfa7ac02a9fc7bb2b66a199c352/i3qqwiq/s4rpj17f4/tumblr_static_.gif",
                        "header_image_focused": "https://static.tumblr.com/28f47bfa7ac02a9fc7bb2b66a199c352/i3qqwiq/s4rpj17f4/tumblr_static__2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/28f47bfa7ac02a9fc7bb2b66a199c352/i3qqwiq/s4rpj17f4/tumblr_static__2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#FFE694",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376731406"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"734\"><img src=\"https://66.media.tumblr.com/f91dbee232cae02c73fb7b29bdcb8662/tumblr_pm206lX29X1tsmav0_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"734\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/f01895f32e6822bc78599927b08f8c8d/tumblr_pm206m7xlJ1tsmav0_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"720\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/81682eaa7e142bb5cf4dc60e93b0f3dd/tumblr_pm206nSQqy1tsmav0_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/7347df06522a0224013e8ed8de86256a/tumblr_pm206nNa8W1tsmav0_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"></figure></div><p>been making moodboards and lockscreens here recently </p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f91dbee232cae02c73fb7b29bdcb8662/tumblr_pm206lX29X1tsmav0_1280.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f01895f32e6822bc78599927b08f8c8d/tumblr_pm206m7xlJ1tsmav0_1280.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/81682eaa7e142bb5cf4dc60e93b0f3dd/tumblr_pm206nSQqy1tsmav0_1280.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/7347df06522a0224013e8ed8de86256a/tumblr_pm206nNa8W1tsmav0_1280.jpg\" class=\"\"/></figure><p>been making moodboards and lockscreens here recently </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "writingbtsthings",
        "blog": {
            "name": "writingbtsthings",
            "title": "writingbtsthings",
            "description": "I like to write whatever I'm thinking. \n<p><a\nhref=\"https://writingbtsthings.tumblr.com/masterlist\">Masterlist</a>\n<p><a href=\"https://writingbtsthings.tumblr.com/post/183773265609/mobile-masterlist\">Mobile Masterlist</a>",
            "url": "https://writingbtsthings.tumblr.com/",
            "uuid": "t:EXA1czeEMADeTkljqrsF4g",
            "updated": 1558633326
        },
        "id": 182376699584,
        "post_url": "https://writingbtsthings.tumblr.com/post/182376699584/chapter-seven-ive-missed-you",
        "slug": "chapter-seven-ive-missed-you",
        "date": "2019-01-28 18:16:56 GMT",
        "timestamp": 1548699416,
        "state": "published",
        "format": "html",
        "reblog_key": "6jdckqhD",
        "tags": [
            "bts",
            "bts writing",
            "bts scenarios",
            "bts reactions",
            "bts series",
            "bts oneshots",
            "bts imagines",
            "bts fluff",
            "bts smut",
            "bts angst",
            "bts fanfic",
            "bts fanfiction",
            "bts x reader",
            "bts taehyung",
            "bts jimin",
            "bts jin",
            "bts jungkook",
            "bts yoongi",
            "bts hoseok",
            "bts namjoon",
            "bts v",
            "bts suga",
            "bts rm",
            "bts hobi",
            "bts jhope",
            "kim taehyung",
            "v",
            "tae x reader",
            "taehyung x reader",
            "v x reader"
        ],
        "short_url": "https://tmblr.co/ZLjrfX2fsVvR0",
        "summary": "Chapter Seven: I’ve Missed You",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 106,
        "title": "Chapter Seven: I’ve Missed You",
        "body": "<p><b>Authors Note: </b>I can’t help but feel so soft every time I write a chapter for this series, this is one of my favourite chapters so far! Enjoy everyone.</p><p><b>Genre:</b> Fluff and Smut.<br/><b>Pairing: </b>Taehyung x Reader<br/><i>Credit given for all media used.</i></p><p><b>Previous Chapters: </b>[<b><a href=\"https://writingbtsthings.tumblr.com/post/182008691234/chapter-one-youre-not-worthless\" target=\"_blank\">1</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182042410064/chapter-two-if-you-were-a-painting\" target=\"_blank\">2</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182059162514/chapter-three-hello-stranger\" target=\"_blank\">3</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182092193289/chapter-four-a-good-morning-kiss\" target=\"_blank\">4</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182161453064/chapter-five-let-me-be-yours\" target=\"_blank\">5</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182347061539/chapter-six-im-not-saying-goodbye-to-you-again\" target=\"_blank\">6</a></b>]</p><p>Taehyung’s busy schedule had ended, he was finally returning to Seoul after being away for five months. You had not spoken to one another since you had let each other go, silence on either side, both hoping that the other would take the first step and reach out, but neither of you had. Gi was nearing nine months old, she was standing up, crawling, even trying to walk unaided, she made you proud every day. It had been awful for the both of you, it felt as though you were walking around with a limb missing. You missed his voice, his caring and loving nature and the way he was always looking out for you. He missed your laugh and the way your face lit up the minute you talked about Gi, the way that you updated him on her progress and how fast she was growing. The silence was killing you both, destroying your souls. </p><p>Tae was crouched to the ground, unpacking his clothes from various suitcases, sorting through the piles of clothes, deciding what needed to be washed first. He stood up from his crouched position, stretching his cramped body. Rubbing his chest, a photograph caught the corner of his eye, it was the photo of you both on your 21<sup>st</sup> birthday. One arm was around his neck pulling him into your side, the other hand place onto his chest, laughing joyfully into him. Both his arms were wrapped around your body, forehead pressed against your temple, him too laughing. Glancing down at his watch, the time was 2pm, would you be home? He knew you hadn’t spoken, it killed him not knowing what the pair of you were getting up to or how the both of you were doing. Deciding to be the bigger person, he picked up his coat, heading out of his bedroom towards the front door. “Where are you going?” shouted Jimin from the sofa, peering over to his friend by the door who was curious to know where he was heading in such a rush. “Just for a walk” Taehyung lied, not wanting him to know what he was up to, he didn’t want to get his hopes up. </p><p>He was right to not get his hopes up. Arriving at your familiar front door, he knocked onto the wood, signalling his presence. He waited a few moments, biting his gum nervously, hoping that you would answer his call and welcome him with open arms, however, this was not the case. A man that Tae did not recognise answered the door, who was now looking at him with confusion. “Can I help you?” asked the man, who began to look him up and down, trying to suss where he knew him from. “Oh, I was just wondering if y/n is home? This was her apartment last time I checked” he admitted, still biting his gum. “Oh y/n, yeah she doesn’t live here anymore, she moved out about three months ago, sorry” apologised the man, who was beginning to close the door. Taehyung gave him a kind smile, turning back towards the lifts, his soul felt as though it had been sucked out of him. He leant against the mirror of the lift, rubbing his forehead out of frustration, why had he let you slip through his fingers so easily? It was then that he remembered what you had said that night… “<i>I think it’ll be best for me to move in with my parents for a while</i>”. Your parents, that’s where you were. He hadn’t seen them since the night of your 21<sup>st </sup>birthday, why was that night always haunting the both of you? </p><p>Suddenly regretting not bringing his car, he managed to grab a taxi, telling the driver the address of your parents’ home. The journey was half an hour, he had 30 minutes to think of what he’d say to you, 30 minutes to keep his tears at bay. The taxi arrived at the destination, he took a deep breath before leaving the car, not knowing what to do next. He walked up to the door, coughing into his fist before he knocked, hoping that you weren’t the one to answer. Moments later, your mother opened the door, she hadn’t changed, you were exactly like her, such beautiful women. “Taehyung? Is that you?” said your mother, cocking her head to the side. “It’s nice to see you again” he replied, trying to reduce his chin from wobbling. “Come on in love, y/n is just showering” she stated, ushering him into the house as though she had saw him the previous. He began to take off his coat, to which your mother immediately took from his grasp, hanging it onto the coat hook in the hallway. “Come into the kitchen” she suggested, hoping that he would follow, “Tell me what you’ve been up to”. You hadn’t told your mum about how things had ended with Taehyung, she would only scold you, she had always hinted how the two of you were perfect for one another. Tae loved the way your mother treat him, it was always with such respect and kindness. </p><p>He was leant against the kitchen worktop, now holding a mug of tea beginning to take a sip, he was talking to your mother about their busy schedule when he was interrupted by your presence. “Gi is finally napping-” you paused, looking over at your friend, “Tae”, the ever so familiar nickname making his heart sink. “Hi sweetheart” he mumbled, biting his gum. You didn’t know how to react, didn’t know what to say or even think. “Mum, can you give us a minute please?” you asked, hoping she would take the hint, to which she did. She turned her pans on a low heat, beginning to head out of the kitchen to find your father. “What are you doing here?” you questioned him, walking over to him slowly. “I could say the same for you” he replied, crossing his foot over the other. “Don’t do this Tae, not now” you hissed, standing in front of him, “How dare you just turn up here, thinking that you can just arrive home after five months, acting as though everything is okay”. He shook his head, tongue prodding the inside of his mouth with frustration. “Oh yes, how dare I y/n, I think you’ve forgotten you were the one that ended things before they had even started” he snapped back, as though he wanted you to know that he didn’t want to let you go. “Yeah well, I guess we’re even aren’t we. You ended it first and I’ll end it a second” you answered, turning your head away from him. “There was nothing to end the first time” he whispered, not wanting your parents to hear you argue. “You really believe that?” you interrogated, your head close to his, “That night meant nothing to you, is that what you’re saying?”, you could feel him breathing against your face. He shook his head once more, nudging your nose with his own, before leading his head towards your jaw, his lips brushing the rim of your ear. “You know that night meant everything to me” he whispered, his breath tickling your ear, the words making your breath shake. He nudged you once more, his hands cupping either side of your face, lips pressing delicately to your own, however, was interrupted by your mother coming into the kitchen. “This doesn’t change anything” you mumbled, walking away from his embrace. “Taehyung, are you staying for dinner?” your mother asked as she was taking the pans off the hobs, before you could answer for him he interjected. “Yes, that’d be lovely thank you” he replied, glaring over at you with a smirk across his face. </p><p>You had all finished dinner, casually talking sat around the dining room table, your parents catching up with Taehyung, praising him for his achievements. Mid conversation you heard Gi crying from upstairs, alerting you that she was awake from her nap. “I won’t be long, sorry” you said as you stood up from your chair, heading upstairs. Opening the door, you could see your frustrated daughter in her crib, kicking her legs frantically. “Hey, what’s wrong gorgeous girl?” you whispered as you picked her out of the cot, kissing her head softly. She cuddled immediately into your neck, finding comfort in your scent. You swayed from side to side, rubbing her back soothingly, her cries had stopped now that she was safe in your arms. You heard a subtle knock to the bedroom door, turning towards it you could see Tae stood against the door frame, hands tucked into his pockets. “She’s beautiful” he mumbled, looking down at his feet, heart breaking into two, “She’s so big now”. You had to swallow the lump forming in your throat, you knew how much she meant to him. “Why don’t you go and see Tae, hmm?” you suggested to your daughter, walking over to the door frame. He was shocked when her arms reached towards him, as though she could remember him. Taking her from your grasp he wrapped his arms around her tiny frame, placing a kiss to her head, a thankful smile spreading across his face. “Hi baby” he whispered, rubbing his cheek against her head, “I’ve missed you”. You watched him hold her lovingly for a few moments, the feelings rushing back to you, the memories replaying in your head. You shook them away, knowing all too well that it wasn’t a good idea to be thinking this way, you knew it would never work, he never had time for the both of you. “Come on, let’s go and see grandma and grandad?” you suggested, walking out of the bedroom towards the stairs, hoping Tae and your daughter would follow. </p><p>The night was relaxed, Gi didn’t leave Taehyung’s side all night. She was constantly crawling over to him, passing him her favourite toys, laughing at every funny face he pulled. You were sat next to him, your head naturally resting against his shoulder out of habit, his arm draped around your shoulders. He bounced Gi up and down on his knees, the motion making her chuckle, her laugh echoing throughout the room. Your mother observed the three of you in awe, noticing how effortlessly you all interacted with one another, noticing how perfect you fit together. “We’ll leave you kids in peace, we’re going to head to bed, I’ll make breakfast for us all in the morning, sleep well” your mother informed, kissing yours and Gi’s heads. She cupped Tae’s cheek with her hand, smiling endearingly at him, “It’s nice to have you home Kim Taehyung”, the comment making your heart sink. Tae didn’t know what to do but smile as a response, scared that if he opened his mouth he’d begin to cry. </p><p>It was an hour later and Gi had fallen asleep on Tae’s chest, her hand randomly clutching his ear. “I’ll get her up to bed” you announced, standing up from the sofa, “Think I’ll head to bed myself”. Tae nodded, knowing how tired you must be, trying to earn a living and look after your daughter. “I’ll just sleep on the sofa” he stated, rubbing his thighs. “You can share my bed it’s fine” you told him as you exited the living room. He watched you gently put Gi down in her crib, watching you both adoringly. You tiptoed away from the sleeping child, closing the door to her room slightly, leaving it ajar so you could hear her during the night. You both wandered to your room, suddenly feeling like teenagers once more. The last time he was in your old bedroom was the night of your 21<sup>st</sup> birthday, a night that he’d never forget. He began to take off his clothes, both of you stood in the darkness. You held the hem of your t-shirt in your hands, ready to take it off. “I’ll give you some privacy” Taehyung stated, heading towards the bedroom door. “Please Taehyung, it’s not something you haven’t seen before”. He nodded to himself, still stood by the door. Lights from the street lamps outside were producing a glow into the room, creating a silhouette of your body. You slipped the top over your head, your frame somehow looking smaller than usual. Your eyes caught Tae’s, both looking at each other with lust. “Y/N” he whispered, his breath shaking, now walking towards you. His hands trailed around your waist slowly, his fingertips dancing delicately over your skin, a single finger tracing the outline of your spine, his movements making your head fall back slightly. Bending his head towards you, his nose nudged your ear, pressing a kiss underneath it. “I know we can’t be together, but please let me be in your life, her life, I need you both” he admitted, kissing your neck tenderly. “We need you too” you replied, your hand clutching around the back of his neck. He nudged your nose, lips brushing yours slightly as he brought your body closer to his, feeling each other’s flesh against one another. “Have me one last time, just for tonight” you suggested, your fingertips trailing down his chest and stomach. He didn’t answer you, instead he kissed you, his tongue parting your lips, both of you moaning into each other’s mouths, it was obvious how much you had missed each other, it was obvious how much you still loved one another, the thoughts pushed into the corner of the room, scared to admit it. </p><p>The sex between you both was slow and intimate, as though you were savouring each touch, knowing that it would be the last time. His forearms were either side of your head, his mouth open against yours, both panting into each other’s mouths. One of your hands pulled the hair at the back of his head, the action making him moan into your mouth as he pressed a kiss to your lips. “I’ve missed you” he moaned, his head nuzzling into your neck, trying to mute his moans against your skin, not wanting to wake the others, “I’ve missed you too” you groaned back, your other hand gripping to his bum cheek. You could feel his thrusts becoming sloppy, indicating that he was close. You began to thrust your own hips upwards, your hips bones meeting his skin with every plunge. “Keep doing that” he moaned, nudging your nose with his before kissing you lovingly, his tongue caressing yours. One of his arms moved from the side of your head, hooking underneath your thigh, creating a deeper thrust, the feeling making you both groan out in pleasure. “There” you moaned, squeezing his bicep, you could see the concentration on his face, he wanted you to feel good. “Tae” you whined, your head going back into the pillow, he took this moment to pepper your neck with kisses, “Cum for me sweetheart” he whispered in your ear, taking the lobe between your teeth. It was as though his words had spurred your climax, you took his chin with your finger, pressing a kiss to his lips, “Cum with me” you gasped against his mouth. There you both were, climaxing in unison, both of moaning into one another’s mouths. He laid in-between your legs for a few moments, still inside of you, looking down at your endearingly. You brushed his sweat ridden hair out of his face, your thumb stroking his cheek. He leant down, pressing a soft kiss against your lips before removing himself and heading towards the bathroom to clean himself up. </p><p>He returned to the bedroom, slipping back under the covers, your back now facing his direction, his foot discreetly brushing your own once he was immersed into the covers. “Tae?” you spoke, glancing over your shoulder. “Hmm?” he responded, his foot still stroking yours soothingly. “Even though it’s not going to work between us, you won’t lose us, I promise” you told him, turning your head back to its original position, rubbing your cheek against the pillow in attempts to get comfortable. Silence took over the room for a moment, the sound of each other breathing was all that could be heard. The covers began to rustle, suddenly feeling Tae’s arm wrap around your waist, pulling your back into his chest. Your hand clasped around his hand that was pressed against your stomach, his thumb brushing the skin below your belly button comfortingly. The silence was broken by your daughter crying in the next room. You went to lift yourself out of the covers when the hand that was pressed to your stomach held you back down, realising that Tae wasn’t letting you leave the bed. “I’ll go, get some rest” he assured, giving your stomach a slight squeeze before leaving you alone in the sheets. He put his boxers and a t-shirt on before leaving the bedroom, heading towards your daughter’s bedroom. “Oh, sweetheart what’s wrong?” was what you heard him say, his words bringing a smile to your face, but it was his next sentence that made you feel the most secure and content for the first time in many months.</p><p> “It’s okay baby, Tae’s got you, I’m not going anywhere I promise”. </p><figure data-orig-width=\"268\" data-orig-height=\"338\" data-tumblr-attribution=\"sin-taehyung:MyKOonkp6-xbTMWv8G3iYQ:ZKv_cb2fr3HQA\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/576ff7d51696e4c9e9ccfaa758fc3ccf/tumblr_plum053QXu1wmc7sfo1_400.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"338\"/></figure>",
        "reblog": {
            "comment": "<p><p><b>Authors Note: </b>I can’t help but feel so soft every time I write a chapter for this series, this is one of my favourite chapters so far! Enjoy everyone.</p><p><b>Genre:</b> Fluff and Smut.<br><b>Pairing: </b>Taehyung x Reader<br><i>Credit given for all media used.</i></p><p><b>Previous Chapters: </b>[<b><a href=\"https://writingbtsthings.tumblr.com/post/182008691234/chapter-one-youre-not-worthless\" target=\"_blank\">1</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182042410064/chapter-two-if-you-were-a-painting\" target=\"_blank\">2</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182059162514/chapter-three-hello-stranger\" target=\"_blank\">3</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182092193289/chapter-four-a-good-morning-kiss\" target=\"_blank\">4</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182161453064/chapter-five-let-me-be-yours\" target=\"_blank\">5</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182347061539/chapter-six-im-not-saying-goodbye-to-you-again\" target=\"_blank\">6</a></b>]</p><p>Taehyung’s busy schedule had ended, he was finally returning to Seoul after being away for five months. You had not spoken to one another since you had let each other go, silence on either side, both hoping that the other would take the first step and reach out, but neither of you had. Gi was nearing nine months old, she was standing up, crawling, even trying to walk unaided, she made you proud every day. It had been awful for the both of you, it felt as though you were walking around with a limb missing. You missed his voice, his caring and loving nature and the way he was always looking out for you. He missed your laugh and the way your face lit up the minute you talked about Gi, the way that you updated him on her progress and how fast she was growing. The silence was killing you both, destroying your souls. </p><p>Tae was crouched to the ground, unpacking his clothes from various suitcases, sorting through the piles of clothes, deciding what needed to be washed first. He stood up from his crouched position, stretching his cramped body. Rubbing his chest, a photograph caught the corner of his eye, it was the photo of you both on your 21<sup>st</sup> birthday. One arm was around his neck pulling him into your side, the other hand place onto his chest, laughing joyfully into him. Both his arms were wrapped around your body, forehead pressed against your temple, him too laughing. Glancing down at his watch, the time was 2pm, would you be home? He knew you hadn’t spoken, it killed him not knowing what the pair of you were getting up to or how the both of you were doing. Deciding to be the bigger person, he picked up his coat, heading out of his bedroom towards the front door. “Where are you going?” shouted Jimin from the sofa, peering over to his friend by the door who was curious to know where he was heading in such a rush. “Just for a walk” Taehyung lied, not wanting him to know what he was up to, he didn’t want to get his hopes up. </p><p>He was right to not get his hopes up. Arriving at your familiar front door, he knocked onto the wood, signalling his presence. He waited a few moments, biting his gum nervously, hoping that you would answer his call and welcome him with open arms, however, this was not the case. A man that Tae did not recognise answered the door, who was now looking at him with confusion. “Can I help you?” asked the man, who began to look him up and down, trying to suss where he knew him from. “Oh, I was just wondering if y/n is home? This was her apartment last time I checked” he admitted, still biting his gum. “Oh y/n, yeah she doesn’t live here anymore, she moved out about three months ago, sorry” apologised the man, who was beginning to close the door. Taehyung gave him a kind smile, turning back towards the lifts, his soul felt as though it had been sucked out of him. He leant against the mirror of the lift, rubbing his forehead out of frustration, why had he let you slip through his fingers so easily? It was then that he remembered what you had said that night… “<i>I think it’ll be best for me to move in with my parents for a while</i>”. Your parents, that’s where you were. He hadn’t seen them since the night of your 21<sup>st </sup>birthday, why was that night always haunting the both of you? </p><p>Suddenly regretting not bringing his car, he managed to grab a taxi, telling the driver the address of your parents’ home. The journey was half an hour, he had 30 minutes to think of what he’d say to you, 30 minutes to keep his tears at bay. The taxi arrived at the destination, he took a deep breath before leaving the car, not knowing what to do next. He walked up to the door, coughing into his fist before he knocked, hoping that you weren’t the one to answer. Moments later, your mother opened the door, she hadn’t changed, you were exactly like her, such beautiful women. “Taehyung? Is that you?” said your mother, cocking her head to the side. “It’s nice to see you again” he replied, trying to reduce his chin from wobbling. “Come on in love, y/n is just showering” she stated, ushering him into the house as though she had saw him the previous. He began to take off his coat, to which your mother immediately took from his grasp, hanging it onto the coat hook in the hallway. “Come into the kitchen” she suggested, hoping that he would follow, “Tell me what you’ve been up to”. You hadn’t told your mum about how things had ended with Taehyung, she would only scold you, she had always hinted how the two of you were perfect for one another. Tae loved the way your mother treat him, it was always with such respect and kindness. </p><p>He was leant against the kitchen worktop, now holding a mug of tea beginning to take a sip, he was talking to your mother about their busy schedule when he was interrupted by your presence. “Gi is finally napping-” you paused, looking over at your friend, “Tae”, the ever so familiar nickname making his heart sink. “Hi sweetheart” he mumbled, biting his gum. You didn’t know how to react, didn’t know what to say or even think. “Mum, can you give us a minute please?” you asked, hoping she would take the hint, to which she did. She turned her pans on a low heat, beginning to head out of the kitchen to find your father. “What are you doing here?” you questioned him, walking over to him slowly. “I could say the same for you” he replied, crossing his foot over the other. “Don’t do this Tae, not now” you hissed, standing in front of him, “How dare you just turn up here, thinking that you can just arrive home after five months, acting as though everything is okay”. He shook his head, tongue prodding the inside of his mouth with frustration. “Oh yes, how dare I y/n, I think you’ve forgotten you were the one that ended things before they had even started” he snapped back, as though he wanted you to know that he didn’t want to let you go. “Yeah well, I guess we’re even aren’t we. You ended it first and I’ll end it a second” you answered, turning your head away from him. “There was nothing to end the first time” he whispered, not wanting your parents to hear you argue. “You really believe that?” you interrogated, your head close to his, “That night meant nothing to you, is that what you’re saying?”, you could feel him breathing against your face. He shook his head once more, nudging your nose with his own, before leading his head towards your jaw, his lips brushing the rim of your ear. “You know that night meant everything to me” he whispered, his breath tickling your ear, the words making your breath shake. He nudged you once more, his hands cupping either side of your face, lips pressing delicately to your own, however, was interrupted by your mother coming into the kitchen. “This doesn’t change anything” you mumbled, walking away from his embrace. “Taehyung, are you staying for dinner?” your mother asked as she was taking the pans off the hobs, before you could answer for him he interjected. “Yes, that’d be lovely thank you” he replied, glaring over at you with a smirk across his face. </p><p>You had all finished dinner, casually talking sat around the dining room table, your parents catching up with Taehyung, praising him for his achievements. Mid conversation you heard Gi crying from upstairs, alerting you that she was awake from her nap. “I won’t be long, sorry” you said as you stood up from your chair, heading upstairs. Opening the door, you could see your frustrated daughter in her crib, kicking her legs frantically. “Hey, what’s wrong gorgeous girl?” you whispered as you picked her out of the cot, kissing her head softly. She cuddled immediately into your neck, finding comfort in your scent. You swayed from side to side, rubbing her back soothingly, her cries had stopped now that she was safe in your arms. You heard a subtle knock to the bedroom door, turning towards it you could see Tae stood against the door frame, hands tucked into his pockets. “She’s beautiful” he mumbled, looking down at his feet, heart breaking into two, “She’s so big now”. You had to swallow the lump forming in your throat, you knew how much she meant to him. “Why don’t you go and see Tae, hmm?” you suggested to your daughter, walking over to the door frame. He was shocked when her arms reached towards him, as though she could remember him. Taking her from your grasp he wrapped his arms around her tiny frame, placing a kiss to her head, a thankful smile spreading across his face. “Hi baby” he whispered, rubbing his cheek against her head, “I’ve missed you”. You watched him hold her lovingly for a few moments, the feelings rushing back to you, the memories replaying in your head. You shook them away, knowing all too well that it wasn’t a good idea to be thinking this way, you knew it would never work, he never had time for the both of you. “Come on, let’s go and see grandma and grandad?” you suggested, walking out of the bedroom towards the stairs, hoping Tae and your daughter would follow. </p><p>The night was relaxed, Gi didn’t leave Taehyung’s side all night. She was constantly crawling over to him, passing him her favourite toys, laughing at every funny face he pulled. You were sat next to him, your head naturally resting against his shoulder out of habit, his arm draped around your shoulders. He bounced Gi up and down on his knees, the motion making her chuckle, her laugh echoing throughout the room. Your mother observed the three of you in awe, noticing how effortlessly you all interacted with one another, noticing how perfect you fit together. “We’ll leave you kids in peace, we’re going to head to bed, I’ll make breakfast for us all in the morning, sleep well” your mother informed, kissing yours and Gi’s heads. She cupped Tae’s cheek with her hand, smiling endearingly at him, “It’s nice to have you home Kim Taehyung”, the comment making your heart sink. Tae didn’t know what to do but smile as a response, scared that if he opened his mouth he’d begin to cry. </p><p>It was an hour later and Gi had fallen asleep on Tae’s chest, her hand randomly clutching his ear. “I’ll get her up to bed” you announced, standing up from the sofa, “Think I’ll head to bed myself”. Tae nodded, knowing how tired you must be, trying to earn a living and look after your daughter. “I’ll just sleep on the sofa” he stated, rubbing his thighs. “You can share my bed it’s fine” you told him as you exited the living room. He watched you gently put Gi down in her crib, watching you both adoringly. You tiptoed away from the sleeping child, closing the door to her room slightly, leaving it ajar so you could hear her during the night. You both wandered to your room, suddenly feeling like teenagers once more. The last time he was in your old bedroom was the night of your 21<sup>st</sup> birthday, a night that he’d never forget. He began to take off his clothes, both of you stood in the darkness. You held the hem of your t-shirt in your hands, ready to take it off. “I’ll give you some privacy” Taehyung stated, heading towards the bedroom door. “Please Taehyung, it’s not something you haven’t seen before”. He nodded to himself, still stood by the door. Lights from the street lamps outside were producing a glow into the room, creating a silhouette of your body. You slipped the top over your head, your frame somehow looking smaller than usual. Your eyes caught Tae’s, both looking at each other with lust. “Y/N” he whispered, his breath shaking, now walking towards you. His hands trailed around your waist slowly, his fingertips dancing delicately over your skin, a single finger tracing the outline of your spine, his movements making your head fall back slightly. Bending his head towards you, his nose nudged your ear, pressing a kiss underneath it. “I know we can’t be together, but please let me be in your life, her life, I need you both” he admitted, kissing your neck tenderly. “We need you too” you replied, your hand clutching around the back of his neck. He nudged your nose, lips brushing yours slightly as he brought your body closer to his, feeling each other’s flesh against one another. “Have me one last time, just for tonight” you suggested, your fingertips trailing down his chest and stomach. He didn’t answer you, instead he kissed you, his tongue parting your lips, both of you moaning into each other’s mouths, it was obvious how much you had missed each other, it was obvious how much you still loved one another, the thoughts pushed into the corner of the room, scared to admit it. </p><p>The sex between you both was slow and intimate, as though you were savouring each touch, knowing that it would be the last time. His forearms were either side of your head, his mouth open against yours, both panting into each other’s mouths. One of your hands pulled the hair at the back of his head, the action making him moan into your mouth as he pressed a kiss to your lips. “I’ve missed you” he moaned, his head nuzzling into your neck, trying to mute his moans against your skin, not wanting to wake the others, “I’ve missed you too” you groaned back, your other hand gripping to his bum cheek. You could feel his thrusts becoming sloppy, indicating that he was close. You began to thrust your own hips upwards, your hips bones meeting his skin with every plunge. “Keep doing that” he moaned, nudging your nose with his before kissing you lovingly, his tongue caressing yours. One of his arms moved from the side of your head, hooking underneath your thigh, creating a deeper thrust, the feeling making you both groan out in pleasure. “There” you moaned, squeezing his bicep, you could see the concentration on his face, he wanted you to feel good. “Tae” you whined, your head going back into the pillow, he took this moment to pepper your neck with kisses, “Cum for me sweetheart” he whispered in your ear, taking the lobe between your teeth. It was as though his words had spurred your climax, you took his chin with your finger, pressing a kiss to his lips, “Cum with me” you gasped against his mouth. There you both were, climaxing in unison, both of moaning into one another’s mouths. He laid in-between your legs for a few moments, still inside of you, looking down at your endearingly. You brushed his sweat ridden hair out of his face, your thumb stroking his cheek. He leant down, pressing a soft kiss against your lips before removing himself and heading towards the bathroom to clean himself up. </p><p>He returned to the bedroom, slipping back under the covers, your back now facing his direction, his foot discreetly brushing your own once he was immersed into the covers. “Tae?” you spoke, glancing over your shoulder. “Hmm?” he responded, his foot still stroking yours soothingly. “Even though it’s not going to work between us, you won’t lose us, I promise” you told him, turning your head back to its original position, rubbing your cheek against the pillow in attempts to get comfortable. Silence took over the room for a moment, the sound of each other breathing was all that could be heard. The covers began to rustle, suddenly feeling Tae’s arm wrap around your waist, pulling your back into his chest. Your hand clasped around his hand that was pressed against your stomach, his thumb brushing the skin below your belly button comfortingly. The silence was broken by your daughter crying in the next room. You went to lift yourself out of the covers when the hand that was pressed to your stomach held you back down, realising that Tae wasn’t letting you leave the bed. “I’ll go, get some rest” he assured, giving your stomach a slight squeeze before leaving you alone in the sheets. He put his boxers and a t-shirt on before leaving the bedroom, heading towards your daughter’s bedroom. “Oh, sweetheart what’s wrong?” was what you heard him say, his words bringing a smile to your face, but it was his next sentence that made you feel the most secure and content for the first time in many months.</p><p> “It’s okay baby, Tae’s got you, I’m not going anywhere I promise”. </p><figure data-orig-width=\"268\" data-orig-height=\"338\" data-tumblr-attribution=\"sin-taehyung:MyKOonkp6-xbTMWv8G3iYQ:ZKv_cb2fr3HQA\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/576ff7d51696e4c9e9ccfaa758fc3ccf/tumblr_plum053QXu1wmc7sfo1_400.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"338\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "writingbtsthings",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/b509456253fb0f5aab135f51f9868e10/hpaohb6/R2cpq2i38/tumblr_static_deaojc84ei0oggowkg4sg0gss.gif",
                        "header_image_focused": "https://static.tumblr.com/b509456253fb0f5aab135f51f9868e10/hpaohb6/R2cpq2i38/tumblr_static_deaojc84ei0oggowkg4sg0gss_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/b509456253fb0f5aab135f51f9868e10/hpaohb6/R2cpq2i38/tumblr_static_deaojc84ei0oggowkg4sg0gss_2048_v2.gif",
                        "header_stretch": false,
                        "link_color": "#edb2c6",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#f33b78",
                        "title_font": "Bodoni Recut FS",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376699584"
                },
                "content_raw": "<p><p><b>Authors Note: </b>I can’t help but feel so soft every time I write a chapter for this series, this is one of my favourite chapters so far! Enjoy everyone.</p><p><b>Genre:</b> Fluff and Smut.<br><b>Pairing: </b>Taehyung x Reader<br><i>Credit given for all media used.</i></p><p><b>Previous Chapters: </b>[<b><a href=\"https://writingbtsthings.tumblr.com/post/182008691234/chapter-one-youre-not-worthless\" target=\"_blank\">1</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182042410064/chapter-two-if-you-were-a-painting\" target=\"_blank\">2</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182059162514/chapter-three-hello-stranger\" target=\"_blank\">3</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182092193289/chapter-four-a-good-morning-kiss\" target=\"_blank\">4</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182161453064/chapter-five-let-me-be-yours\" target=\"_blank\">5</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182347061539/chapter-six-im-not-saying-goodbye-to-you-again\" target=\"_blank\">6</a></b>]</p><p>Taehyung’s busy schedule had ended, he was finally returning to Seoul after being away for five months. You had not spoken to one another since you had let each other go, silence on either side, both hoping that the other would take the first step and reach out, but neither of you had. Gi was nearing nine months old, she was standing up, crawling, even trying to walk unaided, she made you proud every day. It had been awful for the both of you, it felt as though you were walking around with a limb missing. You missed his voice, his caring and loving nature and the way he was always looking out for you. He missed your laugh and the way your face lit up the minute you talked about Gi, the way that you updated him on her progress and how fast she was growing. The silence was killing you both, destroying your souls. </p><p>Tae was crouched to the ground, unpacking his clothes from various suitcases, sorting through the piles of clothes, deciding what needed to be washed first. He stood up from his crouched position, stretching his cramped body. Rubbing his chest, a photograph caught the corner of his eye, it was the photo of you both on your 21<sup>st</sup> birthday. One arm was around his neck pulling him into your side, the other hand place onto his chest, laughing joyfully into him. Both his arms were wrapped around your body, forehead pressed against your temple, him too laughing. Glancing down at his watch, the time was 2pm, would you be home? He knew you hadn’t spoken, it killed him not knowing what the pair of you were getting up to or how the both of you were doing. Deciding to be the bigger person, he picked up his coat, heading out of his bedroom towards the front door. “Where are you going?” shouted Jimin from the sofa, peering over to his friend by the door who was curious to know where he was heading in such a rush. “Just for a walk” Taehyung lied, not wanting him to know what he was up to, he didn’t want to get his hopes up. </p><p>He was right to not get his hopes up. Arriving at your familiar front door, he knocked onto the wood, signalling his presence. He waited a few moments, biting his gum nervously, hoping that you would answer his call and welcome him with open arms, however, this was not the case. A man that Tae did not recognise answered the door, who was now looking at him with confusion. “Can I help you?” asked the man, who began to look him up and down, trying to suss where he knew him from. “Oh, I was just wondering if y/n is home? This was her apartment last time I checked” he admitted, still biting his gum. “Oh y/n, yeah she doesn’t live here anymore, she moved out about three months ago, sorry” apologised the man, who was beginning to close the door. Taehyung gave him a kind smile, turning back towards the lifts, his soul felt as though it had been sucked out of him. He leant against the mirror of the lift, rubbing his forehead out of frustration, why had he let you slip through his fingers so easily? It was then that he remembered what you had said that night… “<i>I think it’ll be best for me to move in with my parents for a while</i>”. Your parents, that’s where you were. He hadn’t seen them since the night of your 21<sup>st </sup>birthday, why was that night always haunting the both of you? </p><p>Suddenly regretting not bringing his car, he managed to grab a taxi, telling the driver the address of your parents’ home. The journey was half an hour, he had 30 minutes to think of what he’d say to you, 30 minutes to keep his tears at bay. The taxi arrived at the destination, he took a deep breath before leaving the car, not knowing what to do next. He walked up to the door, coughing into his fist before he knocked, hoping that you weren’t the one to answer. Moments later, your mother opened the door, she hadn’t changed, you were exactly like her, such beautiful women. “Taehyung? Is that you?” said your mother, cocking her head to the side. “It’s nice to see you again” he replied, trying to reduce his chin from wobbling. “Come on in love, y/n is just showering” she stated, ushering him into the house as though she had saw him the previous. He began to take off his coat, to which your mother immediately took from his grasp, hanging it onto the coat hook in the hallway. “Come into the kitchen” she suggested, hoping that he would follow, “Tell me what you’ve been up to”. You hadn’t told your mum about how things had ended with Taehyung, she would only scold you, she had always hinted how the two of you were perfect for one another. Tae loved the way your mother treat him, it was always with such respect and kindness. </p><p>He was leant against the kitchen worktop, now holding a mug of tea beginning to take a sip, he was talking to your mother about their busy schedule when he was interrupted by your presence. “Gi is finally napping-” you paused, looking over at your friend, “Tae”, the ever so familiar nickname making his heart sink. “Hi sweetheart” he mumbled, biting his gum. You didn’t know how to react, didn’t know what to say or even think. “Mum, can you give us a minute please?” you asked, hoping she would take the hint, to which she did. She turned her pans on a low heat, beginning to head out of the kitchen to find your father. “What are you doing here?” you questioned him, walking over to him slowly. “I could say the same for you” he replied, crossing his foot over the other. “Don’t do this Tae, not now” you hissed, standing in front of him, “How dare you just turn up here, thinking that you can just arrive home after five months, acting as though everything is okay”. He shook his head, tongue prodding the inside of his mouth with frustration. “Oh yes, how dare I y/n, I think you’ve forgotten you were the one that ended things before they had even started” he snapped back, as though he wanted you to know that he didn’t want to let you go. “Yeah well, I guess we’re even aren’t we. You ended it first and I’ll end it a second” you answered, turning your head away from him. “There was nothing to end the first time” he whispered, not wanting your parents to hear you argue. “You really believe that?” you interrogated, your head close to his, “That night meant nothing to you, is that what you’re saying?”, you could feel him breathing against your face. He shook his head once more, nudging your nose with his own, before leading his head towards your jaw, his lips brushing the rim of your ear. “You know that night meant everything to me” he whispered, his breath tickling your ear, the words making your breath shake. He nudged you once more, his hands cupping either side of your face, lips pressing delicately to your own, however, was interrupted by your mother coming into the kitchen. “This doesn’t change anything” you mumbled, walking away from his embrace. “Taehyung, are you staying for dinner?” your mother asked as she was taking the pans off the hobs, before you could answer for him he interjected. “Yes, that’d be lovely thank you” he replied, glaring over at you with a smirk across his face. </p><p>You had all finished dinner, casually talking sat around the dining room table, your parents catching up with Taehyung, praising him for his achievements. Mid conversation you heard Gi crying from upstairs, alerting you that she was awake from her nap. “I won’t be long, sorry” you said as you stood up from your chair, heading upstairs. Opening the door, you could see your frustrated daughter in her crib, kicking her legs frantically. “Hey, what’s wrong gorgeous girl?” you whispered as you picked her out of the cot, kissing her head softly. She cuddled immediately into your neck, finding comfort in your scent. You swayed from side to side, rubbing her back soothingly, her cries had stopped now that she was safe in your arms. You heard a subtle knock to the bedroom door, turning towards it you could see Tae stood against the door frame, hands tucked into his pockets. “She’s beautiful” he mumbled, looking down at his feet, heart breaking into two, “She’s so big now”. You had to swallow the lump forming in your throat, you knew how much she meant to him. “Why don’t you go and see Tae, hmm?” you suggested to your daughter, walking over to the door frame. He was shocked when her arms reached towards him, as though she could remember him. Taking her from your grasp he wrapped his arms around her tiny frame, placing a kiss to her head, a thankful smile spreading across his face. “Hi baby” he whispered, rubbing his cheek against her head, “I’ve missed you”. You watched him hold her lovingly for a few moments, the feelings rushing back to you, the memories replaying in your head. You shook them away, knowing all too well that it wasn’t a good idea to be thinking this way, you knew it would never work, he never had time for the both of you. “Come on, let’s go and see grandma and grandad?” you suggested, walking out of the bedroom towards the stairs, hoping Tae and your daughter would follow. </p><p>The night was relaxed, Gi didn’t leave Taehyung’s side all night. She was constantly crawling over to him, passing him her favourite toys, laughing at every funny face he pulled. You were sat next to him, your head naturally resting against his shoulder out of habit, his arm draped around your shoulders. He bounced Gi up and down on his knees, the motion making her chuckle, her laugh echoing throughout the room. Your mother observed the three of you in awe, noticing how effortlessly you all interacted with one another, noticing how perfect you fit together. “We’ll leave you kids in peace, we’re going to head to bed, I’ll make breakfast for us all in the morning, sleep well” your mother informed, kissing yours and Gi’s heads. She cupped Tae’s cheek with her hand, smiling endearingly at him, “It’s nice to have you home Kim Taehyung”, the comment making your heart sink. Tae didn’t know what to do but smile as a response, scared that if he opened his mouth he’d begin to cry. </p><p>It was an hour later and Gi had fallen asleep on Tae’s chest, her hand randomly clutching his ear. “I’ll get her up to bed” you announced, standing up from the sofa, “Think I’ll head to bed myself”. Tae nodded, knowing how tired you must be, trying to earn a living and look after your daughter. “I’ll just sleep on the sofa” he stated, rubbing his thighs. “You can share my bed it’s fine” you told him as you exited the living room. He watched you gently put Gi down in her crib, watching you both adoringly. You tiptoed away from the sleeping child, closing the door to her room slightly, leaving it ajar so you could hear her during the night. You both wandered to your room, suddenly feeling like teenagers once more. The last time he was in your old bedroom was the night of your 21<sup>st</sup> birthday, a night that he’d never forget. He began to take off his clothes, both of you stood in the darkness. You held the hem of your t-shirt in your hands, ready to take it off. “I’ll give you some privacy” Taehyung stated, heading towards the bedroom door. “Please Taehyung, it’s not something you haven’t seen before”. He nodded to himself, still stood by the door. Lights from the street lamps outside were producing a glow into the room, creating a silhouette of your body. You slipped the top over your head, your frame somehow looking smaller than usual. Your eyes caught Tae’s, both looking at each other with lust. “Y/N” he whispered, his breath shaking, now walking towards you. His hands trailed around your waist slowly, his fingertips dancing delicately over your skin, a single finger tracing the outline of your spine, his movements making your head fall back slightly. Bending his head towards you, his nose nudged your ear, pressing a kiss underneath it. “I know we can’t be together, but please let me be in your life, her life, I need you both” he admitted, kissing your neck tenderly. “We need you too” you replied, your hand clutching around the back of his neck. He nudged your nose, lips brushing yours slightly as he brought your body closer to his, feeling each other’s flesh against one another. “Have me one last time, just for tonight” you suggested, your fingertips trailing down his chest and stomach. He didn’t answer you, instead he kissed you, his tongue parting your lips, both of you moaning into each other’s mouths, it was obvious how much you had missed each other, it was obvious how much you still loved one another, the thoughts pushed into the corner of the room, scared to admit it. </p><p>The sex between you both was slow and intimate, as though you were savouring each touch, knowing that it would be the last time. His forearms were either side of your head, his mouth open against yours, both panting into each other’s mouths. One of your hands pulled the hair at the back of his head, the action making him moan into your mouth as he pressed a kiss to your lips. “I’ve missed you” he moaned, his head nuzzling into your neck, trying to mute his moans against your skin, not wanting to wake the others, “I’ve missed you too” you groaned back, your other hand gripping to his bum cheek. You could feel his thrusts becoming sloppy, indicating that he was close. You began to thrust your own hips upwards, your hips bones meeting his skin with every plunge. “Keep doing that” he moaned, nudging your nose with his before kissing you lovingly, his tongue caressing yours. One of his arms moved from the side of your head, hooking underneath your thigh, creating a deeper thrust, the feeling making you both groan out in pleasure. “There” you moaned, squeezing his bicep, you could see the concentration on his face, he wanted you to feel good. “Tae” you whined, your head going back into the pillow, he took this moment to pepper your neck with kisses, “Cum for me sweetheart” he whispered in your ear, taking the lobe between your teeth. It was as though his words had spurred your climax, you took his chin with your finger, pressing a kiss to his lips, “Cum with me” you gasped against his mouth. There you both were, climaxing in unison, both of moaning into one another’s mouths. He laid in-between your legs for a few moments, still inside of you, looking down at your endearingly. You brushed his sweat ridden hair out of his face, your thumb stroking his cheek. He leant down, pressing a soft kiss against your lips before removing himself and heading towards the bathroom to clean himself up. </p><p>He returned to the bedroom, slipping back under the covers, your back now facing his direction, his foot discreetly brushing your own once he was immersed into the covers. “Tae?” you spoke, glancing over your shoulder. “Hmm?” he responded, his foot still stroking yours soothingly. “Even though it’s not going to work between us, you won’t lose us, I promise” you told him, turning your head back to its original position, rubbing your cheek against the pillow in attempts to get comfortable. Silence took over the room for a moment, the sound of each other breathing was all that could be heard. The covers began to rustle, suddenly feeling Tae’s arm wrap around your waist, pulling your back into his chest. Your hand clasped around his hand that was pressed against your stomach, his thumb brushing the skin below your belly button comfortingly. The silence was broken by your daughter crying in the next room. You went to lift yourself out of the covers when the hand that was pressed to your stomach held you back down, realising that Tae wasn’t letting you leave the bed. “I’ll go, get some rest” he assured, giving your stomach a slight squeeze before leaving you alone in the sheets. He put his boxers and a t-shirt on before leaving the bedroom, heading towards your daughter’s bedroom. “Oh, sweetheart what’s wrong?” was what you heard him say, his words bringing a smile to your face, but it was his next sentence that made you feel the most secure and content for the first time in many months.</p><p> “It’s okay baby, Tae’s got you, I’m not going anywhere I promise”. </p><figure data-orig-width=\"268\" data-orig-height=\"338\" data-tumblr-attribution=\"sin-taehyung:MyKOonkp6-xbTMWv8G3iYQ:ZKv_cb2fr3HQA\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/576ff7d51696e4c9e9ccfaa758fc3ccf/tumblr_plum053QXu1wmc7sfo1_400.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"338\"></figure></p>",
                "content": "<p><p><b>Authors Note: </b>I can&rsquo;t help but feel so soft every time I write a chapter for this series, this is one of my favourite chapters so far! Enjoy everyone.</p><p><b>Genre:</b> Fluff and Smut.<br /><b>Pairing: </b>Taehyung x Reader<br /><i>Credit given for all media used.</i></p><p><b>Previous Chapters: </b>[<b><a href=\"https://writingbtsthings.tumblr.com/post/182008691234/chapter-one-youre-not-worthless\" target=\"_blank\">1</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182042410064/chapter-two-if-you-were-a-painting\" target=\"_blank\">2</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182059162514/chapter-three-hello-stranger\" target=\"_blank\">3</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182092193289/chapter-four-a-good-morning-kiss\" target=\"_blank\">4</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182161453064/chapter-five-let-me-be-yours\" target=\"_blank\">5</a></b>] [<b><a href=\"https://writingbtsthings.tumblr.com/post/182347061539/chapter-six-im-not-saying-goodbye-to-you-again\" target=\"_blank\">6</a></b>]</p><p>Taehyung&rsquo;s busy schedule had ended, he was finally returning to Seoul after being away for five months. You had not spoken to one another since you had let each other go, silence on either side, both hoping that the other would take the first step and reach out, but neither of you had. Gi was nearing nine months old, she was standing up, crawling, even trying to walk unaided, she made you proud every day. It had been awful for the both of you, it felt as though you were walking around with a limb missing. You missed his voice, his caring and loving nature and the way he was always looking out for you. He missed your laugh and the way your face lit up the minute you talked about Gi, the way that you updated him on her progress and how fast she was growing. The silence was killing you both, destroying your souls. </p><p>Tae was crouched to the ground, unpacking his clothes from various suitcases, sorting through the piles of clothes, deciding what needed to be washed first. He stood up from his crouched position, stretching his cramped body. Rubbing his chest, a photograph caught the corner of his eye, it was the photo of you both on your 21<sup>st</sup> birthday. One arm was around his neck pulling him into your side, the other hand place onto his chest, laughing joyfully into him. Both his arms were wrapped around your body, forehead pressed against your temple, him too laughing. Glancing down at his watch, the time was 2pm, would you be home? He knew you hadn&rsquo;t spoken, it killed him not knowing what the pair of you were getting up to or how the both of you were doing. Deciding to be the bigger person, he picked up his coat, heading out of his bedroom towards the front door. &ldquo;Where are you going?&rdquo; shouted Jimin from the sofa, peering over to his friend by the door who was curious to know where he was heading in such a rush. &ldquo;Just for a walk&rdquo; Taehyung lied, not wanting him to know what he was up to, he didn&rsquo;t want to get his hopes up. </p><p>He was right to not get his hopes up. Arriving at your familiar front door, he knocked onto the wood, signalling his presence. He waited a few moments, biting his gum nervously, hoping that you would answer his call and welcome him with open arms, however, this was not the case. A man that Tae did not recognise answered the door, who was now looking at him with confusion. &ldquo;Can I help you?&rdquo; asked the man, who began to look him up and down, trying to suss where he knew him from. &ldquo;Oh, I was just wondering if y/n is home? This was her apartment last time I checked&rdquo; he admitted, still biting his gum. &ldquo;Oh y/n, yeah she doesn&rsquo;t live here anymore, she moved out about three months ago, sorry&rdquo; apologised the man, who was beginning to close the door. Taehyung gave him a kind smile, turning back towards the lifts, his soul felt as though it had been sucked out of him. He leant against the mirror of the lift, rubbing his forehead out of frustration, why had he let you slip through his fingers so easily? It was then that he remembered what you had said that night&hellip; &ldquo;<i>I think it&rsquo;ll be best for me to move in with my parents for a while</i>&rdquo;. Your parents, that&rsquo;s where you were. He hadn&rsquo;t seen them since the night of your 21<sup>st </sup>birthday, why was that night always haunting the both of you? </p><p>Suddenly regretting not bringing his car, he managed to grab a taxi, telling the driver the address of your parents&rsquo; home. The journey was half an hour, he had 30 minutes to think of what he&rsquo;d say to you, 30 minutes to keep his tears at bay. The taxi arrived at the destination, he took a deep breath before leaving the car, not knowing what to do next. He walked up to the door, coughing into his fist before he knocked, hoping that you weren&rsquo;t the one to answer. Moments later, your mother opened the door, she hadn&rsquo;t changed, you were exactly like her, such beautiful women. &ldquo;Taehyung? Is that you?&rdquo; said your mother, cocking her head to the side. &ldquo;It&rsquo;s nice to see you again&rdquo; he replied, trying to reduce his chin from wobbling. &ldquo;Come on in love, y/n is just showering&rdquo; she stated, ushering him into the house as though she had saw him the previous. He began to take off his coat, to which your mother immediately took from his grasp, hanging it onto the coat hook in the hallway. &ldquo;Come into the kitchen&rdquo; she suggested, hoping that he would follow, &ldquo;Tell me what you&rsquo;ve been up to&rdquo;. You hadn&rsquo;t told your mum about how things had ended with Taehyung, she would only scold you, she had always hinted how the two of you were perfect for one another. Tae loved the way your mother treat him, it was always with such respect and kindness. </p><p>He was leant against the kitchen worktop, now holding a mug of tea beginning to take a sip, he was talking to your mother about their busy schedule when he was interrupted by your presence. &ldquo;Gi is finally napping-&rdquo; you paused, looking over at your friend, &ldquo;Tae&rdquo;, the ever so familiar nickname making his heart sink. &ldquo;Hi sweetheart&rdquo; he mumbled, biting his gum. You didn&rsquo;t know how to react, didn&rsquo;t know what to say or even think. &ldquo;Mum, can you give us a minute please?&rdquo; you asked, hoping she would take the hint, to which she did. She turned her pans on a low heat, beginning to head out of the kitchen to find your father. &ldquo;What are you doing here?&rdquo; you questioned him, walking over to him slowly. &ldquo;I could say the same for you&rdquo; he replied, crossing his foot over the other. &ldquo;Don&rsquo;t do this Tae, not now&rdquo; you hissed, standing in front of him, &ldquo;How dare you just turn up here, thinking that you can just arrive home after five months, acting as though everything is okay&rdquo;. He shook his head, tongue prodding the inside of his mouth with frustration. &ldquo;Oh yes, how dare I y/n, I think you&rsquo;ve forgotten you were the one that ended things before they had even started&rdquo; he snapped back, as though he wanted you to know that he didn&rsquo;t want to let you go. &ldquo;Yeah well, I guess we&rsquo;re even aren&rsquo;t we. You ended it first and I&rsquo;ll end it a second&rdquo; you answered, turning your head away from him. &ldquo;There was nothing to end the first time&rdquo; he whispered, not wanting your parents to hear you argue. &ldquo;You really believe that?&rdquo; you interrogated, your head close to his, &ldquo;That night meant nothing to you, is that what you&rsquo;re saying?&rdquo;, you could feel him breathing against your face. He shook his head once more, nudging your nose with his own, before leading his head towards your jaw, his lips brushing the rim of your ear. &ldquo;You know that night meant everything to me&rdquo; he whispered, his breath tickling your ear, the words making your breath shake. He nudged you once more, his hands cupping either side of your face, lips pressing delicately to your own, however, was interrupted by your mother coming into the kitchen. &ldquo;This doesn&rsquo;t change anything&rdquo; you mumbled, walking away from his embrace. &ldquo;Taehyung, are you staying for dinner?&rdquo; your mother asked as she was taking the pans off the hobs, before you could answer for him he interjected. &ldquo;Yes, that&rsquo;d be lovely thank you&rdquo; he replied, glaring over at you with a smirk across his face. </p><p>You had all finished dinner, casually talking sat around the dining room table, your parents catching up with Taehyung, praising him for his achievements. Mid conversation you heard Gi crying from upstairs, alerting you that she was awake from her nap. &ldquo;I won&rsquo;t be long, sorry&rdquo; you said as you stood up from your chair, heading upstairs. Opening the door, you could see your frustrated daughter in her crib, kicking her legs frantically. &ldquo;Hey, what&rsquo;s wrong gorgeous girl?&rdquo; you whispered as you picked her out of the cot, kissing her head softly. She cuddled immediately into your neck, finding comfort in your scent. You swayed from side to side, rubbing her back soothingly, her cries had stopped now that she was safe in your arms. You heard a subtle knock to the bedroom door, turning towards it you could see Tae stood against the door frame, hands tucked into his pockets. &ldquo;She&rsquo;s beautiful&rdquo; he mumbled, looking down at his feet, heart breaking into two, &ldquo;She&rsquo;s so big now&rdquo;. You had to swallow the lump forming in your throat, you knew how much she meant to him. &ldquo;Why don&rsquo;t you go and see Tae, hmm?&rdquo; you suggested to your daughter, walking over to the door frame. He was shocked when her arms reached towards him, as though she could remember him. Taking her from your grasp he wrapped his arms around her tiny frame, placing a kiss to her head, a thankful smile spreading across his face. &ldquo;Hi baby&rdquo; he whispered, rubbing his cheek against her head, &ldquo;I&rsquo;ve missed you&rdquo;. You watched him hold her lovingly for a few moments, the feelings rushing back to you, the memories replaying in your head. You shook them away, knowing all too well that it wasn&rsquo;t a good idea to be thinking this way, you knew it would never work, he never had time for the both of you. &ldquo;Come on, let&rsquo;s go and see grandma and grandad?&rdquo; you suggested, walking out of the bedroom towards the stairs, hoping Tae and your daughter would follow. </p><p>The night was relaxed, Gi didn&rsquo;t leave Taehyung&rsquo;s side all night. She was constantly crawling over to him, passing him her favourite toys, laughing at every funny face he pulled. You were sat next to him, your head naturally resting against his shoulder out of habit, his arm draped around your shoulders. He bounced Gi up and down on his knees, the motion making her chuckle, her laugh echoing throughout the room. Your mother observed the three of you in awe, noticing how effortlessly you all interacted with one another, noticing how perfect you fit together. &ldquo;We&rsquo;ll leave you kids in peace, we&rsquo;re going to head to bed, I&rsquo;ll make breakfast for us all in the morning, sleep well&rdquo; your mother informed, kissing yours and Gi&rsquo;s heads. She cupped Tae&rsquo;s cheek with her hand, smiling endearingly at him, &ldquo;It&rsquo;s nice to have you home Kim Taehyung&rdquo;, the comment making your heart sink. Tae didn&rsquo;t know what to do but smile as a response, scared that if he opened his mouth he&rsquo;d begin to cry. </p><p>It was an hour later and Gi had fallen asleep on Tae&rsquo;s chest, her hand randomly clutching his ear. &ldquo;I&rsquo;ll get her up to bed&rdquo; you announced, standing up from the sofa, &ldquo;Think I&rsquo;ll head to bed myself&rdquo;. Tae nodded, knowing how tired you must be, trying to earn a living and look after your daughter. &ldquo;I&rsquo;ll just sleep on the sofa&rdquo; he stated, rubbing his thighs. &ldquo;You can share my bed it&rsquo;s fine&rdquo; you told him as you exited the living room. He watched you gently put Gi down in her crib, watching you both adoringly. You tiptoed away from the sleeping child, closing the door to her room slightly, leaving it ajar so you could hear her during the night. You both wandered to your room, suddenly feeling like teenagers once more. The last time he was in your old bedroom was the night of your 21<sup>st</sup> birthday, a night that he&rsquo;d never forget. He began to take off his clothes, both of you stood in the darkness. You held the hem of your t-shirt in your hands, ready to take it off. &ldquo;I&rsquo;ll give you some privacy&rdquo; Taehyung stated, heading towards the bedroom door. &ldquo;Please Taehyung, it&rsquo;s not something you haven&rsquo;t seen before&rdquo;. He nodded to himself, still stood by the door. Lights from the street lamps outside were producing a glow into the room, creating a silhouette of your body. You slipped the top over your head, your frame somehow looking smaller than usual. Your eyes caught Tae&rsquo;s, both looking at each other with lust. &ldquo;Y/N&rdquo; he whispered, his breath shaking, now walking towards you. His hands trailed around your waist slowly, his fingertips dancing delicately over your skin, a single finger tracing the outline of your spine, his movements making your head fall back slightly. Bending his head towards you, his nose nudged your ear, pressing a kiss underneath it. &ldquo;I know we can&rsquo;t be together, but please let me be in your life, her life, I need you both&rdquo; he admitted, kissing your neck tenderly. &ldquo;We need you too&rdquo; you replied, your hand clutching around the back of his neck. He nudged your nose, lips brushing yours slightly as he brought your body closer to his, feeling each other&rsquo;s flesh against one another. &ldquo;Have me one last time, just for tonight&rdquo; you suggested, your fingertips trailing down his chest and stomach. He didn&rsquo;t answer you, instead he kissed you, his tongue parting your lips, both of you moaning into each other&rsquo;s mouths, it was obvious how much you had missed each other, it was obvious how much you still loved one another, the thoughts pushed into the corner of the room, scared to admit it. </p><p>The sex between you both was slow and intimate, as though you were savouring each touch, knowing that it would be the last time. His forearms were either side of your head, his mouth open against yours, both panting into each other&rsquo;s mouths. One of your hands pulled the hair at the back of his head, the action making him moan into your mouth as he pressed a kiss to your lips. &ldquo;I&rsquo;ve missed you&rdquo; he moaned, his head nuzzling into your neck, trying to mute his moans against your skin, not wanting to wake the others, &ldquo;I&rsquo;ve missed you too&rdquo; you groaned back, your other hand gripping to his bum cheek. You could feel his thrusts becoming sloppy, indicating that he was close. You began to thrust your own hips upwards, your hips bones meeting his skin with every plunge. &ldquo;Keep doing that&rdquo; he moaned, nudging your nose with his before kissing you lovingly, his tongue caressing yours. One of his arms moved from the side of your head, hooking underneath your thigh, creating a deeper thrust, the feeling making you both groan out in pleasure. &ldquo;There&rdquo; you moaned, squeezing his bicep, you could see the concentration on his face, he wanted you to feel good. &ldquo;Tae&rdquo; you whined, your head going back into the pillow, he took this moment to pepper your neck with kisses, &ldquo;Cum for me sweetheart&rdquo; he whispered in your ear, taking the lobe between your teeth. It was as though his words had spurred your climax, you took his chin with your finger, pressing a kiss to his lips, &ldquo;Cum with me&rdquo; you gasped against his mouth. There you both were, climaxing in unison, both of moaning into one another&rsquo;s mouths. He laid in-between your legs for a few moments, still inside of you, looking down at your endearingly. You brushed his sweat ridden hair out of his face, your thumb stroking his cheek. He leant down, pressing a soft kiss against your lips before removing himself and heading towards the bathroom to clean himself up. </p><p>He returned to the bedroom, slipping back under the covers, your back now facing his direction, his foot discreetly brushing your own once he was immersed into the covers. &ldquo;Tae?&rdquo; you spoke, glancing over your shoulder. &ldquo;Hmm?&rdquo; he responded, his foot still stroking yours soothingly. &ldquo;Even though it&rsquo;s not going to work between us, you won&rsquo;t lose us, I promise&rdquo; you told him, turning your head back to its original position, rubbing your cheek against the pillow in attempts to get comfortable. Silence took over the room for a moment, the sound of each other breathing was all that could be heard. The covers began to rustle, suddenly feeling Tae&rsquo;s arm wrap around your waist, pulling your back into his chest. Your hand clasped around his hand that was pressed against your stomach, his thumb brushing the skin below your belly button comfortingly. The silence was broken by your daughter crying in the next room. You went to lift yourself out of the covers when the hand that was pressed to your stomach held you back down, realising that Tae wasn&rsquo;t letting you leave the bed. &ldquo;I&rsquo;ll go, get some rest&rdquo; he assured, giving your stomach a slight squeeze before leaving you alone in the sheets. He put his boxers and a t-shirt on before leaving the bedroom, heading towards your daughter&rsquo;s bedroom. &ldquo;Oh, sweetheart what&rsquo;s wrong?&rdquo; was what you heard him say, his words bringing a smile to your face, but it was his next sentence that made you feel the most secure and content for the first time in many months.</p><p> &ldquo;It&rsquo;s okay baby, Tae&rsquo;s got you, I&rsquo;m not going anywhere I promise&rdquo;. </p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "goldenclosetkook",
        "blog": {
            "name": "goldenclosetkook",
            "title": "약속",
            "description": "<p>A multifandom AU blog. </p><p>Updated every day: 6pm BST If the link doesn't work, search 'Masterlist1’☺️❤️ <a href=\"https://goldenclosetkook.tumblr.com/post/174700056699/m-a-s-t-e-r-l-i-s-t\">Masterlist</a></p>",
            "url": "https://goldenclosetkook.tumblr.com/",
            "uuid": "t:yjVUOLij_l1EfTW0byP40w",
            "updated": 1558635562
        },
        "id": 182376678531,
        "post_url": "https://goldenclosetkook.tumblr.com/post/182376678531/summary-star-of-the-school-baseball-team-jeon",
        "slug": "summary-star-of-the-school-baseball-team-jeon",
        "date": "2019-01-28 18:15:54 GMT",
        "timestamp": 1548699354,
        "state": "published",
        "format": "html",
        "reblog_key": "UwcZcaJM",
        "tags": [
            "jikook",
            "bts",
            "jikook au",
            "bts au",
            "jikook social media au",
            "bts social media au",
            "jikook fanfic",
            "jikook fic",
            "bts imagines",
            "bts fake snaps",
            "bts fake texts",
            "bts aus",
            "jeon jungkook",
            "min yoongi",
            "kim namjoon",
            "kim taehyung",
            "park jimin",
            "jung hoseok",
            "kim seokjin"
        ],
        "short_url": "https://tmblr.co/Z_22_Z2fsVqI3",
        "summary": "Summary:\nStar of the school baseball team, Jeon Jungkook spends his lunchtimes in the art rooms with cute nerd, Park Jimin.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 265,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"867\"><img src=\"https://66.media.tumblr.com/b0971622b60295b9ecc977596810b175/tumblr_plr6j7ubic1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"867\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"591\"><img src=\"https://66.media.tumblr.com/42fb6e1c43cd7fa6a9b14918058184b7/tumblr_plr6j7rUno1s1iqtf_540.png\" data-orig-height=\"1280\" data-orig-width=\"591\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"627\"><img src=\"https://66.media.tumblr.com/500dfac10dc9ccf0d563304c28a92ea7/tumblr_plr6ja2V9f1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"627\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"626\"><img src=\"https://66.media.tumblr.com/b255ecfb3c0de6b534f7314360be655e/tumblr_plr6jaWUFH1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"626\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"923\"><img src=\"https://66.media.tumblr.com/6ea634aa541465a3d27607ed09396b5f/tumblr_plr6jbExmD1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"923\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"625\"><img src=\"https://66.media.tumblr.com/45b6a77e1490c0e8411cdefbcd206ea3/tumblr_plr6jbrbQr1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"625\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"626\"><img src=\"https://66.media.tumblr.com/fddfdb6b4edc8635bb3a7af2e4dfe992/tumblr_plr6jcnEeU1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"626\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1003\"><img src=\"https://66.media.tumblr.com/b3192324ec1d585a6ea719983c25b9b0/tumblr_plr6jc1FG11s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1003\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"879\"><img src=\"https://66.media.tumblr.com/c63892fa5f627fa090fd1eed06de59e8/tumblr_plr6jd5Qhr1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"879\"/></figure></div><p>Summary:</p><p><i>Star of the school baseball team, Jeon Jungkook spends his lunchtimes in the art rooms with cute nerd, Park Jimin.</i></p><p>&lt;&lt; / 4 / ?</p>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"867\"><img src=\"https://66.media.tumblr.com/b0971622b60295b9ecc977596810b175/tumblr_plr6j7ubic1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"867\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"591\"><img src=\"https://66.media.tumblr.com/42fb6e1c43cd7fa6a9b14918058184b7/tumblr_plr6j7rUno1s1iqtf_540.png\" data-orig-height=\"1280\" data-orig-width=\"591\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"627\"><img src=\"https://66.media.tumblr.com/500dfac10dc9ccf0d563304c28a92ea7/tumblr_plr6ja2V9f1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"627\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"626\"><img src=\"https://66.media.tumblr.com/b255ecfb3c0de6b534f7314360be655e/tumblr_plr6jaWUFH1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"626\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"923\"><img src=\"https://66.media.tumblr.com/6ea634aa541465a3d27607ed09396b5f/tumblr_plr6jbExmD1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"923\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"625\"><img src=\"https://66.media.tumblr.com/45b6a77e1490c0e8411cdefbcd206ea3/tumblr_plr6jbrbQr1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"625\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"626\"><img src=\"https://66.media.tumblr.com/fddfdb6b4edc8635bb3a7af2e4dfe992/tumblr_plr6jcnEeU1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"626\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1003\"><img src=\"https://66.media.tumblr.com/b3192324ec1d585a6ea719983c25b9b0/tumblr_plr6jc1FG11s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1003\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"879\"><img src=\"https://66.media.tumblr.com/c63892fa5f627fa090fd1eed06de59e8/tumblr_plr6jd5Qhr1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"879\"></figure></div><p>Summary:</p><p><i>Star of the school baseball team, Jeon Jungkook spends his lunchtimes in the art rooms with cute nerd, Park Jimin.</i></p><p><< / 4 / ?</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "goldenclosetkook",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 477,
                        "header_focus_width": 500,
                        "header_focus_height": 281,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "54,500,335,0",
                        "header_image": "https://static.tumblr.com/2b06cc2c444e2aa07708d83923ff88d1/657k4yh/liPpk7blf/tumblr_static_.gif",
                        "header_image_focused": "https://static.tumblr.com/2b06cc2c444e2aa07708d83923ff88d1/657k4yh/BiUpk7blh/tumblr_static_tumblr_static__focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/2b06cc2c444e2aa07708d83923ff88d1/657k4yh/liPpk7blf/tumblr_static__2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376678531"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"867\"><img src=\"https://66.media.tumblr.com/b0971622b60295b9ecc977596810b175/tumblr_plr6j7ubic1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"867\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"591\"><img src=\"https://66.media.tumblr.com/42fb6e1c43cd7fa6a9b14918058184b7/tumblr_plr6j7rUno1s1iqtf_540.png\" data-orig-height=\"1280\" data-orig-width=\"591\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"627\"><img src=\"https://66.media.tumblr.com/500dfac10dc9ccf0d563304c28a92ea7/tumblr_plr6ja2V9f1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"627\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"626\"><img src=\"https://66.media.tumblr.com/b255ecfb3c0de6b534f7314360be655e/tumblr_plr6jaWUFH1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"626\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"923\"><img src=\"https://66.media.tumblr.com/6ea634aa541465a3d27607ed09396b5f/tumblr_plr6jbExmD1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"923\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"625\"><img src=\"https://66.media.tumblr.com/45b6a77e1490c0e8411cdefbcd206ea3/tumblr_plr6jbrbQr1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"625\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"626\"><img src=\"https://66.media.tumblr.com/fddfdb6b4edc8635bb3a7af2e4dfe992/tumblr_plr6jcnEeU1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"626\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1003\"><img src=\"https://66.media.tumblr.com/b3192324ec1d585a6ea719983c25b9b0/tumblr_plr6jc1FG11s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1003\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"879\"><img src=\"https://66.media.tumblr.com/c63892fa5f627fa090fd1eed06de59e8/tumblr_plr6jd5Qhr1s1iqtf_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"879\"></figure></div><p>Summary:</p><p><i>Star of the school baseball team, Jeon Jungkook spends his lunchtimes in the art rooms with cute nerd, Park Jimin.</i></p><p><< / 4 / ?</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/b0971622b60295b9ecc977596810b175/tumblr_plr6j7ubic1s1iqtf_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/42fb6e1c43cd7fa6a9b14918058184b7/tumblr_plr6j7rUno1s1iqtf_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/500dfac10dc9ccf0d563304c28a92ea7/tumblr_plr6ja2V9f1s1iqtf_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/b255ecfb3c0de6b534f7314360be655e/tumblr_plr6jaWUFH1s1iqtf_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/6ea634aa541465a3d27607ed09396b5f/tumblr_plr6jbExmD1s1iqtf_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/45b6a77e1490c0e8411cdefbcd206ea3/tumblr_plr6jbrbQr1s1iqtf_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/fddfdb6b4edc8635bb3a7af2e4dfe992/tumblr_plr6jcnEeU1s1iqtf_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/b3192324ec1d585a6ea719983c25b9b0/tumblr_plr6jc1FG11s1iqtf_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c63892fa5f627fa090fd1eed06de59e8/tumblr_plr6jd5Qhr1s1iqtf_540.jpg\" class=\"\"/></figure><p>Summary:</p><p><i>Star of the school baseball team, Jeon Jungkook spends his lunchtimes in the art rooms with cute nerd, Park Jimin.</i></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "bangtan-wine-aunt",
        "blog": {
            "name": "bangtan-wine-aunt",
            "title": "Let Me Be In Your Story",
            "description": "I can be your hero",
            "url": "https://bangtan-wine-aunt.tumblr.com/",
            "uuid": "t:7CFTTDCXWVb7M5FRTSTVZA",
            "updated": 1558476693
        },
        "id": 182376676150,
        "post_url": "https://bangtan-wine-aunt.tumblr.com/post/182376676150/hobi-deliberately-dresses-like-he-made-his-first",
        "slug": "hobi-deliberately-dresses-like-he-made-his-first",
        "date": "2019-01-28 18:15:53 GMT",
        "timestamp": 1548699353,
        "state": "published",
        "format": "html",
        "reblog_key": "37PBZ4xL",
        "tags": [
            "bts",
            "hobi",
            "j hope"
        ],
        "short_url": "https://tmblr.co/ZlevJb2fsVpis",
        "summary": "Hobi deliberately dresses like he made his first million 30 seconds ago ugh what a legend",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 2,
        "title": null,
        "body": "<p>Hobi deliberately dresses like he made his first million 30 seconds ago ugh what a legend</p>",
        "reblog": {
            "comment": "<p>Hobi deliberately dresses like he made his first million 30 seconds ago ugh what a legend</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "bangtan-wine-aunt",
                    "active": true,
                    "theme": {
                        "header_full_width": 683,
                        "header_full_height": 1025,
                        "header_focus_width": 683,
                        "header_focus_height": 385,
                        "avatar_shape": "circle",
                        "background_color": "#FFF9FE",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "5,683,390,0",
                        "header_image": "https://static.tumblr.com/9c1c40149efb6f7b39bd471f01f01655/fykn7ze/6oupp2wn5/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/1086b7e6f4ea544b98b7901fa7439479/fykn7ze/zO9pp2wn6/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/9c1c40149efb6f7b39bd471f01f01655/fykn7ze/6oupp2wn5/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#222222",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "News Gothic FS",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376676150"
                },
                "content_raw": "<p>Hobi deliberately dresses like he made his first million 30 seconds ago ugh what a legend</p>",
                "content": "<p>Hobi deliberately dresses like he made his first million 30 seconds ago ugh what a legend</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "kochtaes",
        "blog": {
            "name": "kochtaes",
            "title": "taehyung",
            "description": "<p>🇹🇷</p>",
            "url": "https://kochtaes.tumblr.com/",
            "uuid": "t:9GDAkPFUh3UOW2KzGDUEHw",
            "updated": 1558631025
        },
        "id": 182376675410,
        "post_url": "https://kochtaes.tumblr.com/post/182376675410/wtf",
        "slug": "wtf",
        "date": "2019-01-28 18:15:51 GMT",
        "timestamp": 1548699351,
        "state": "published",
        "format": "html",
        "reblog_key": "6f6alpxa",
        "tags": [
            "kim taehyung",
            "taehyung",
            "bts",
            "bts v",
            "bts taehyung",
            "bangtan",
            "army",
            "kpop",
            "taetae",
            "tae",
            "kimtae",
            "sexy",
            "man",
            "taekook",
            "vkook",
            "vmin",
            "vminkook",
            "taegi",
            "taejin",
            "vhope",
            "vmon",
            "jungkook",
            "jimin",
            "jin",
            "rm",
            "jhope",
            "suga"
        ],
        "short_url": "https://tmblr.co/ZHBaLj2fsVpXI",
        "summary": "WTF !",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 335,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"480\" data-orig-width=\"592\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pm201fRyOn1uhvosi.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pm201fRyOn1uhvosi.mp4\",\"type\":\"video/mp4\",\"width\":592,\"height\":480},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pm201fRyOn1uhvosi_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":592,\"height\":480}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pm201fRyOn1uhvosi_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pm201fRyOn1uhvosi.mp4\" type=\"video/mp4\"></source></video></figure><p>WTF !</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"480\" data-orig-width=\"592\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pm201fRyOn1uhvosi.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pm201fRyOn1uhvosi.mp4\",\"type\":\"video/mp4\",\"width\":592,\"height\":480},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pm201fRyOn1uhvosi_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":592,\"height\":480}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pm201fRyOn1uhvosi_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pm201fRyOn1uhvosi.mp4\" type=\"video/mp4\"></source></video></figure><p>WTF !</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "kochtaes",
                    "active": true,
                    "theme": {
                        "header_full_width": 719,
                        "header_full_height": 1280,
                        "header_focus_width": 311,
                        "header_focus_height": 175,
                        "avatar_shape": "circle",
                        "background_color": "#666666",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "797,621,972,310",
                        "header_image": "https://static.tumblr.com/6cea9200a3c78adcc8ece18cc31c8099/d8wrek6/8yEpcvptb/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/6cea9200a3c78adcc8ece18cc31c8099/d8wrek6/ymtpcvpte/tumblr_static_tumblr_static__focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/6cea9200a3c78adcc8ece18cc31c8099/d8wrek6/8yEpcvptb/tumblr_static__2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#666666",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Avalon",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376675410"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"480\" data-orig-width=\"592\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pm201fRyOn1uhvosi.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pm201fRyOn1uhvosi.mp4\",\"type\":\"video/mp4\",\"width\":592,\"height\":480},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pm201fRyOn1uhvosi_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":592,\"height\":480}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pm201fRyOn1uhvosi_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pm201fRyOn1uhvosi.mp4\" type=\"video/mp4\"></source></video></figure><p>WTF !</p></p>",
                "content": "<p><figure class=\"tmblr-full\" data-npf=\"{&quot;type&quot;:&quot;video&quot;,&quot;provider&quot;:&quot;tumblr&quot;,&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pm201fRyOn1uhvosi.mp4&quot;,&quot;media&quot;:{&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pm201fRyOn1uhvosi.mp4&quot;,&quot;type&quot;:&quot;video/mp4&quot;,&quot;width&quot;:592,&quot;height&quot;:480},&quot;poster&quot;:[{&quot;url&quot;:&quot;https://66.media.tumblr.com/tumblr_pm201fRyOn1uhvosi_frame1.jpg&quot;,&quot;type&quot;:&quot;image/jpeg&quot;,&quot;width&quot;:592,&quot;height&quot;:480}]}\"></figure><p>WTF !</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "taesthetically-bangtan",
        "blog": {
            "name": "taesthetically-bangtan",
            "title": "Taesthetically Bangtan",
            "description": "<p>Jess • 19 • she/her • OT7 • Stop hating on ships please • <a href= \"https://taesthetically-bangtan.tumblr.com/post/184773849466/masterlist\">Masterlist </a> • </p>",
            "url": "https://taesthetically-bangtan.tumblr.com/",
            "uuid": "t:U_jS5x_TrF5zCbPWaMivew",
            "updated": 1558327436
        },
        "id": 182376657216,
        "post_url": "https://taesthetically-bangtan.tumblr.com/post/182376657216/bts-social-media-youtube-au-pt-8",
        "slug": "bts-social-media-youtube-au-pt-8",
        "date": "2019-01-28 18:14:55 GMT",
        "timestamp": 1548699295,
        "state": "published",
        "format": "html",
        "reblog_key": "LYBpHDqk",
        "tags": [
            "bts",
            "bts jhope",
            "bts social media au",
            "bts taehyung",
            "namjin",
            "taekook",
            "vkook",
            "yoonmin",
            "bts jimin",
            "bts jin",
            "bts suga",
            "bts rm",
            "bts jungkook",
            "yoonmin social media au"
        ],
        "short_url": "https://tmblr.co/Zo8bWX2fsVl50",
        "summary": "BTS Social Media/ YouTube AU\n< Pt. 8 >",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 46,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/12cb894add6e8ac5da21a36770766373/tumblr_pm200qqQZr1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/f2ad6d9fef78271ceb68020eb6da8111/tumblr_pm200rghnv1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/190c39750d33e7142cba2ed2968a4bad/tumblr_pm200rXBZx1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/0a9f567a1000dc9bf58260555af1fa07/tumblr_pm200sg9st1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/95c35924a3eea24739e8e083ffabfcaf/tumblr_pm200srIiS1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/b4ee72af778b56efaae8f09421338d2d/tumblr_pm200tdnkV1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/c2863f1c1255c9f53e5bc52b295ca66e/tumblr_pm200uvJp41tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/0879f51cbf6658dd98159b1b0c9fa5af/tumblr_pm200u3ABv1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"/></figure></div><p>BTS Social Media/ YouTube AU</p><p><a href=\"https://taesthetically-bangtan.tumblr.com/post/182282783871/bts-social-media-youtube-au-pt-7\">&lt;</a> Pt. 8 <a href=\"https://taesthetically-bangtan.tumblr.com/post/183058033626/bts-social-media-youtube-au-pt-9\">&gt;</a></p>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/12cb894add6e8ac5da21a36770766373/tumblr_pm200qqQZr1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/f2ad6d9fef78271ceb68020eb6da8111/tumblr_pm200rghnv1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/190c39750d33e7142cba2ed2968a4bad/tumblr_pm200rXBZx1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/0a9f567a1000dc9bf58260555af1fa07/tumblr_pm200sg9st1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/95c35924a3eea24739e8e083ffabfcaf/tumblr_pm200srIiS1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/b4ee72af778b56efaae8f09421338d2d/tumblr_pm200tdnkV1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/c2863f1c1255c9f53e5bc52b295ca66e/tumblr_pm200uvJp41tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/0879f51cbf6658dd98159b1b0c9fa5af/tumblr_pm200u3ABv1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure></div><p>BTS Social Media/ YouTube AU</p><p><a href=\"https://taesthetically-bangtan.tumblr.com/post/182282783871/bts-social-media-youtube-au-pt-7\"><</a> Pt. 8 <a href=\"https://taesthetically-bangtan.tumblr.com/post/183058033626/bts-social-media-youtube-au-pt-9\">></a></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "taesthetically-bangtan",
                    "active": true,
                    "theme": {
                        "header_full_width": 1024,
                        "header_full_height": 512,
                        "header_focus_width": 700,
                        "header_focus_height": 394,
                        "avatar_shape": "square",
                        "background_color": "#FFB790",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "59,862,453,162",
                        "header_image": "https://static.tumblr.com/b01ca18a31a62e04a4783e653c754a92/5qmguvo/Bcapkzel1/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/1462e56192d1174bcb93da000afa2b86/5qmguvo/YJFpkzel2/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/b01ca18a31a62e04a4783e653c754a92/5qmguvo/Bcapkzel1/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#D85F46",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Spade",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376657216"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/12cb894add6e8ac5da21a36770766373/tumblr_pm200qqQZr1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/f2ad6d9fef78271ceb68020eb6da8111/tumblr_pm200rghnv1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/190c39750d33e7142cba2ed2968a4bad/tumblr_pm200rXBZx1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/0a9f567a1000dc9bf58260555af1fa07/tumblr_pm200sg9st1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/95c35924a3eea24739e8e083ffabfcaf/tumblr_pm200srIiS1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/b4ee72af778b56efaae8f09421338d2d/tumblr_pm200tdnkV1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/c2863f1c1255c9f53e5bc52b295ca66e/tumblr_pm200uvJp41tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/0879f51cbf6658dd98159b1b0c9fa5af/tumblr_pm200u3ABv1tc8j6r_1280.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure></div><p>BTS Social Media/ YouTube AU</p><p><a href=\"https://taesthetically-bangtan.tumblr.com/post/182282783871/bts-social-media-youtube-au-pt-7\"><</a> Pt. 8 <a href=\"https://taesthetically-bangtan.tumblr.com/post/183058033626/bts-social-media-youtube-au-pt-9\">></a></p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/12cb894add6e8ac5da21a36770766373/tumblr_pm200qqQZr1tc8j6r_1280.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f2ad6d9fef78271ceb68020eb6da8111/tumblr_pm200rghnv1tc8j6r_1280.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/190c39750d33e7142cba2ed2968a4bad/tumblr_pm200rXBZx1tc8j6r_1280.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0a9f567a1000dc9bf58260555af1fa07/tumblr_pm200sg9st1tc8j6r_1280.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/95c35924a3eea24739e8e083ffabfcaf/tumblr_pm200srIiS1tc8j6r_1280.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/b4ee72af778b56efaae8f09421338d2d/tumblr_pm200tdnkV1tc8j6r_1280.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c2863f1c1255c9f53e5bc52b295ca66e/tumblr_pm200uvJp41tc8j6r_1280.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0879f51cbf6658dd98159b1b0c9fa5af/tumblr_pm200u3ABv1tc8j6r_1280.png\" class=\"\"/></figure><p>BTS Social Media/ YouTube AU</p><p><a href=\"https://taesthetically-bangtan.tumblr.com/post/182282783871/bts-social-media-youtube-au-pt-7\"> Pt. 8 </a><a href=\"https://taesthetically-bangtan.tumblr.com/post/183058033626/bts-social-media-youtube-au-pt-9\">&gt;</a></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "video",
        "blog_name": "fhwubytts",
        "blog": {
            "name": "fhwubytts",
            "title": "thruEDwinseyes",
            "description": "Artist",
            "url": "https://fhwubytts.tumblr.com/",
            "uuid": "t:2Gsfqa1cT32_Qr8qgIfryA",
            "updated": 1558185564
        },
        "id": 182376632501,
        "post_url": "https://fhwubytts.tumblr.com/post/182376632501/artbyed-presents-blakk-liberation-more-then-a",
        "slug": "artbyed-presents-blakk-liberation-more-then-a",
        "date": "2019-01-28 18:13:48 GMT",
        "timestamp": 1548699228,
        "state": "published",
        "format": "html",
        "reblog_key": "C7Bdpe6X",
        "tags": [
            "thruedwinseyes",
            "blakkliberation",
            "bts",
            "commercial",
            "movement",
            "brand",
            "yungedot",
            "siriusb",
            "commission",
            "art",
            "life",
            "albumart",
            "love",
            "peace",
            "unity"
        ],
        "short_url": "https://tmblr.co/ZHSLVv2fsVf2r",
        "summary": "ArtByED presents: Blakk Liberation “More Then a Brand, It’s a Movement” Campaign Commercial \n🎥 by @thruedwinseyes...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "caption": "<p>ArtByED presents: Blakk Liberation “More Then a Brand, It’s a Movement” Campaign Commercial <br/>\n🎥 by @thruedwinseyes @blakkliberation • BTS OUT NOW•<br/>\n•<br/>\n#thruedwinseyes #blakkliberation #bts #commercial #movement #brand #yungedot #siriusb #commission #art #life #albumart #love #peace #unity  (at Charlotte, North Carolina)<br/>\n<a href=\"https://www.instagram.com/thruedwinseyes/p/BtMA-MjBm30/?utm_source=ig_tumblr_share&amp;igshid=1d4ea29j25udi\">https://www.instagram.com/thruedwinseyes/p/BtMA-MjBm30/?utm_source=ig_tumblr_share&amp;igshid=1d4ea29j25udi</a></p>",
        "reblog": {
            "comment": "<p>ArtByED presents: Blakk Liberation “More Then a Brand, It’s a Movement” Campaign Commercial <br>\n🎥 by @thruedwinseyes @blakkliberation • BTS OUT NOW•<br>\n•<br>\n#thruedwinseyes #blakkliberation #bts #commercial #movement #brand #yungedot #siriusb #commission #art #life #albumart #love #peace #unity  (at Charlotte, North Carolina)<br><a href=\"https://www.instagram.com/thruedwinseyes/p/BtMA-MjBm30/?utm_source=ig_tumblr_share&amp;igshid=1d4ea29j25udi\">https://www.instagram.com/thruedwinseyes/p/BtMA-MjBm30/?utm_source=ig_tumblr_share&amp;igshid=1d4ea29j25udi</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fhwubytts",
                    "active": true,
                    "theme": {
                        "header_full_width": 1565,
                        "header_full_height": 1037,
                        "header_focus_width": 1565,
                        "header_focus_height": 880,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "78,1565,958,0",
                        "header_image": "https://static.tumblr.com/11cf4d73b5f28bc86185eb9c3959b53d/0sozmnm/lcFphwtqb/tumblr_static_6v46wsbzj58o0gsk08s8484kc.jpg",
                        "header_image_focused": "https://static.tumblr.com/11cf4d73b5f28bc86185eb9c3959b53d/0sozmnm/Y4Xphwtqd/tumblr_static_tumblr_static_6v46wsbzj58o0gsk08s8484kc_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/11cf4d73b5f28bc86185eb9c3959b53d/0sozmnm/lcFphwtqb/tumblr_static_6v46wsbzj58o0gsk08s8484kc_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#888888",
                        "title_font": "Garamond Classic FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376632501"
                },
                "content_raw": "<p>ArtByED presents: Blakk Liberation “More Then a Brand, It’s a Movement” Campaign Commercial <br>\n🎥 by @thruedwinseyes @blakkliberation • BTS OUT NOW•<br>\n•<br>\n#thruedwinseyes #blakkliberation #bts #commercial #movement #brand #yungedot #siriusb #commission #art #life #albumart #love #peace #unity  (at Charlotte, North Carolina)<br><a href=\"https://www.instagram.com/thruedwinseyes/p/BtMA-MjBm30/?utm_source=ig_tumblr_share&amp;igshid=1d4ea29j25udi\">https://www.instagram.com/thruedwinseyes/p/BtMA-MjBm30/?utm_source=ig_tumblr_share&amp;igshid=1d4ea29j25udi</a></p>",
                "content": "<p>ArtByED presents: Blakk Liberation &ldquo;More Then a Brand, It&rsquo;s a Movement&rdquo; Campaign Commercial <br />\n&#127909; by @thruedwinseyes @blakkliberation &bull; BTS OUT NOW&bull;<br />\n&bull;<br />\n#thruedwinseyes #blakkliberation #bts #commercial #movement #brand #yungedot #siriusb #commission #art #life #albumart #love #peace #unity  (at Charlotte, North Carolina)<br /><a href=\"https://www.instagram.com/thruedwinseyes/p/BtMA-MjBm30/?utm_source=ig_tumblr_share&amp;igshid=1d4ea29j25udi\">https://www.instagram.com/thruedwinseyes/p/BtMA-MjBm30/?utm_source=ig_tumblr_share&amp;igshid=1d4ea29j25udi</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "html5_capable": false,
        "thumbnail_url": "",
        "thumbnail_width": 0,
        "thumbnail_height": 0,
        "player": [
            {
                "width": 250,
                "embed_code": "<iframe src=\"//www.instagram.com/thruedwinseyes/p/BtMA-MjBm30/embed/\" width=\"250\" height=\"290\" frameborder=\"0\" scrolling=\"no\" allowtransparency=\"true\"></iframe>"
            },
            {
                "width": 400,
                "embed_code": "<iframe src=\"//www.instagram.com/thruedwinseyes/p/BtMA-MjBm30/embed/\" width=\"400\" height=\"464\" frameborder=\"0\" scrolling=\"no\" allowtransparency=\"true\"></iframe>"
            },
            {
                "width": 500,
                "embed_code": "<iframe src=\"//www.instagram.com/thruedwinseyes/p/BtMA-MjBm30/embed/\" width=\"500\" height=\"580\" frameborder=\"0\" scrolling=\"no\" allowtransparency=\"true\"></iframe>"
            }
        ],
        "video_type": "unknown",
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "btsqualityy",
        "blog": {
            "name": "btsqualityy",
            "title": "You Like Tupac, I Like Biggie Biggie",
            "description": "<p>She/her. / 20. / A member of <a href=\"http://bangtanarmynet.tumblr.com///\">BangtanArmyNet</a> / BTS reactions, imagines, and fanfics / Requests are CLOSED!! <a href=\"https://btsqualityy.tumblr.com/post/184552168428/faqs-and-need-to-know-things/\">FAQs and Other Need To Know Things Here</a> / <a href=\"https://btsqualityy.tumblr.com/post/177354013561/masterlist-est-8242018-smut-fluff-angst\">Masterlist</a></p>",
            "url": "https://btsqualityy.tumblr.com/",
            "uuid": "t:lmUB4lfaDfWga2U_-ynIdw",
            "updated": 1558628201
        },
        "id": 182376603971,
        "post_url": "https://btsqualityy.tumblr.com/post/182376603971/bts-baby-series-q-a-5",
        "slug": "bts-baby-series-q-a-5",
        "date": "2019-01-28 18:12:23 GMT",
        "timestamp": 1548699143,
        "state": "published",
        "format": "html",
        "reblog_key": "dWB0Vamy",
        "tags": [
            "bts",
            "bts reactions",
            "bts scenarios",
            "bts imagines",
            "bts jimin",
            "bts baby series q&a",
            "bts jin",
            "bts jungkook",
            "bts rm",
            "bts rap monster",
            "bts namjoon",
            "bts suga",
            "bts yoongi",
            "bts v",
            "bts taehyung",
            "bts jhope",
            "bts hoseok"
        ],
        "short_url": "https://tmblr.co/ZhsD_j2fsVY53",
        "summary": "BTS Baby Series Q & A #5",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 331,
        "title": "BTS Baby Series Q & A #5",
        "body": "<p><b>Jimin x Reader</b></p><figure class=\"tmblr-full\" data-orig-height=\"324\" data-orig-width=\"500\" data-tumblr-attribution=\"nj:HVkXYOvss58Dcp-ackb1gA:ZU6zXt2d7QSd3\"><img src=\"https://66.media.tumblr.com/7d6b06c00b621a3ea8f77bd3497d296b/tumblr_ph6sz73iz71s0bexho1_500.gif\" data-orig-height=\"324\" data-orig-width=\"500\"/></figure><figure data-orig-width=\"500\" data-orig-height=\"324\" data-tumblr-attribution=\"nj:HVkXYOvss58Dcp-ackb1gA:ZU6zXt2d7QSd3\" class=\"tmblr-full\"></figure><figure data-orig-width=\"500\" data-orig-height=\"324\" data-tumblr-attribution=\"nj:HVkXYOvss58Dcp-ackb1gA:ZU6zXt2d7QSd3\" class=\"tmblr-full\"></figure><p>You and Jimin are in the backyard of your house, with Noah sitting in your lap.</p><p><b><b><b><b><i>How long have you two been together? Have you two ever broken up?</i></b></b><br/></b></b></p><p>“Four years,” Jimin giggled. “Weird to think that it’s been that long.”<br/></p><p>“It really is because so much has happened,” you nodded in agreement as you motioned down at Noah. “As for break ups, we broke up like twice when we were still just dating.”<br/></p><p>“Both of those times, we broke up over not being able to see each other much and spend time together,” Jimin mumbled. “But I didn’t want to lose her so I did what I had to do, in terms of making time for her, and now here we are.”</p><p><b><i>Pregnancy sex?</i></b></p><p>“Oh yeah,” Jimin smirked and you blushed harshly.<br/></p><p>“It was my pregnancy hormones,” you lamely said.<br/></p><p><b><i>What was your weirdest pregnancy craving?</i></b></p><p>“The stereotypical pickles,” you laughed. “We always had to have a jar of them in the house.”<br/></p><p><b><i>Describe Noah, personality and looks wise. Does Noah crave affection like Jimin?</i></b></p><p>“Jimin doesn’t call Noah ‘mini-me’ for no reason,” you state. “Looks just like him and acts just like him too.”<br/></p><p>“He can be a little shy sometimes and he tends to need a lot of reassurance to try new things, but he’s a sweet kid,” Jimin added. <br/></p><p>“He does crave affection like Jimin, which I love because I get lots of baby cuddles,” you laughed.<br/></p><p>“We both do,” Jimin corrected.</p><p><b><i>\n\nWhat was it like to going back to work after the baby was born?\n\n<br/></i></b></p><p>“It was hard because Noah didn’t adjust well to daycare at first,” you revealed. “Because he’s shy, he has a hard time being around new people.”<br/></p><p>“Thankfully, he got used to it after about two weeks and he loves it now,” Jimin said. “As for me personally, I didn’t like going back to work after he was born.”<br/></p><p>“You didn’t?” You looked over at Jimin with a raised eyebrow and he shook his head. “You never told me that.”<br/></p><p>“Because I knew that I had to just get used to it,” Jimin confessed. “I couldn’t just drop my commitments to the group but anytime I went to work after Noah was born, I just wanted to be back here at home with him and you.”<br/></p><p>“Aw Jimin-ssi,” you cooed, reaching over and patting his cheek with your hand. “For me, it was reliving to go back to work because I missed it. I also loved the feeling of getting to come home after a long but good day at work and getting to see not only Jimin, but this beautiful little face too,” you grinned as you pressed a kiss to Noah’s chubby cheek, making him squeal.</p><p><b><i>How do you manage when he’s on tour?</i></b></p><p>“I hate it when he has to leave,” you blurt out, making Jimin look over at you with a frown on his face. “Even though Noah is still young, he definitely notices when Jimin is gone and that makes him sad. In turn, I become even more upset because not only is Jimin gone, but now Noah’s sad,” you explain. <br/></p><p>“Jagiya,” Jimin murmurs as he moves closer to you. He wraps an arm around your shoulder, pulling you into his side. “I know, I hate having to leave you guys too.”<br/></p><p>“I usually just try to keep myself, and Noah, occupied until he gets back. Things like taking Noah to the park, play dates with the boys’ other kids, anything really,” you listed. “That usually helps the time pass faster.”</p><p><b><i>Has Noah been to the BigHit building? If so, how do you keep him occupied?</i></b></p><p>\n\n“He’s been a few times, the rare days where we don’t want to send him to daycare but Y/N-ah has to go into work for a few hours so he comes with me,” Jimin nods. “Noah loves watching us perform so I never really struggle to keep his attention. Plus, he loves the members and our staff as well so there’s always someone to keep him occupied if need be.”\n\n<br/></p><p><b><i>Do you guys post lots of photos of Noah, or do you prefer to maintain some privacy when it comes to him?</i></b></p><p>“We love posting photos of Noah,” you answered. “Especially these cute little photo collages comparing him to old photos of Jimin, since they look so much alike.”</p><p>“While Y/N was still pregnant, we discussed how much we’d post him and we decided that we wouldn’t let any potential trolls stop us from posting things about our child, who we love very much and are insanely proud of,” Jimin explained. </p><p><b><i>How do you deal with tantrums?</i></b></p><p>“Jimin doesn’t,” you answered immediately, making him look over at you.<br/></p><p>“What do you mean? I do deal with his tantrums,” Jimin refuted.<br/></p><p>“Giving him what he wants is not ‘dealing with it’,” you chuckled.<br/></p><p>“Well, it’s not my fault I have a soft spot for him,” Jimin murmured and you rolled your eyes playfully.<br/></p><p>“Since Noah is so sweet, he doesn&rsquo;t like being yelled at so if I just gently scold him, that does the trick,” you said.<br/></p><p><b><i>How often do you and Jimin get to spend time together? Sexually too? Favorite sex position?</i></b></p><p>“We make it a point to spend at least an hour together every night, if we can,” you articulated. “After having Noah, we made an agreement to make sure that our relationship doesn’t get lost in the busyness that is our everyday lives.”<br/></p><p>“Between her job, my job, and taking care of Noah, it would be way too easy to let our relationship fall to the wayside,” Jimin elaborated. “We love and value each other way too much to let that happen.”<br/></p><p>“As for sex, we still haven’t perfected that yet,” you blushed. “Sometimes, we’ll go three weeks without more than a kiss; other times, we’ll have sex every night so it really just depends.”<br/></p><p>“For favorite sex position, I’d say cowgirl for me,” Jimin smirked. “I love being able to look at her.”<br/></p><p>“You say that as if I don’t catch you staring at me all the time anyways,” you teased, making him blush and bury his face in your neck. “It’d be cowgirl or doggy for me.”</p><p><b><i>What’s something that he does that gets on your nerves? And vice versa?</i></b></p><p>“Sometimes, I don’t like the fact that he has such a soft spot for Noah,” you mutter. “That soft spot makes it damn near impossible for Jimin to reprimand him or scold him effectively, which leads to me having to do it and I feel like it makes me look like the bad guy all the time.”<br/></p><p>“And I’ve apologized for that and it’s something I’m working on,” Jimin chimed in and you nodded in confirmation. “For me, I don’t like how she has a tendency to not tell me when she’s struggling with things. She can walk around and pretend that everything is fine and then all of a sudden, she has an outburst about things that happened three weeks ago,” he stated.<br/></p><p>“I just never want to bother you,” you whisper.<br/></p><p>“But we’re a team,” Jimin reminded you. “Your problems are my problems and vice versa. If you’re struggling, then so am I. That’s a part of my job as your husband and partner, to be your support system, ok?” You nodded and pressed a soft kiss to his lips.</p><p><b><i>Jimin, has Noah ever copied anything that you’ve done? And how did you react?</i></b></p><p>“Oh, tell them about that time when you took him to rehearsals for the tour,” you interjected and Jimin laughed as he remembered what you were referring to.<br/></p><p>“So, there was a day where Y/N had to go to work so I took Noah to rehearsal with me. We were practicing for our tour so there’s a section where I perform Serendipity. The time came for me to rehearse that section and Noah was off on the side of the stage with Hobi hyung,” Jimin explained. “When the part comes that I kind of grind onto the floor, Noah tried to copy me and ended up falling right on his face.”<br/></p><p>“He still has the little bruise on his forehead to prove it,” you chimed in, laughing softly.<br/></p><p>“I felt so bad because he was really trying,” Jimin pouted. “But I also was insanely proud because not only had he been watching me but he understood the concept of what I was doing, which makes me hopeful that he’ll pick up dancing someday.”</p><p><b><i>How do you feel about Y/N after watching her give birth? How has it changed your bond/connection?</i></b></p><p>“She was already my favorite person before she got pregnant but after watching her go through that whole process, especially her labor, it just made me value and respect her so much more than I already did,” Jimin confessed. “Her labor was so hard for her and she handled it like a pro.”<br/></p><p>“And I’d do it all over again for Noah,” you assured, smiling down at Noah.</p><p>“As for our bond or connection, I don’t think much has changed,” Jimin said. “We’ve always valued each other so I think having Noah and parenting him together has only strengthened it.”<br/></p><p>“I think the real reason he hasn’t noticed a change in our bond or connection is because Jimin has always treated me as if I was a princess,” you smiled, making him blush lightly. <br/></p><p><b><i>What’s something that you love most about being a parent? Or something that you wish you knew before becoming a parent?</i></b></p><p>“I wish I had known how kids literally take over your life,” you giggled. “Everything we do now, from making big family decisions to things as simple as what to have for dinner, Noah is always the first thing that comes to both of our minds.”<br/></p><p>“Definitely,” Jimin nodded. “Plus, when you have a kid, you become known as only that child’s parent. I mean, my parents don’t call me just to talk to me anymore. They’ll literally facetime me to see Noah and then hang up once they’re done.”<br/></p><p>“My family is the same way,” you agreed. “The text threads between me and my mom and dad are literally only pictures and videos of Noah, and nothing else.”<br/></p><p><b><i>Have you ever had a moment when you’ve looked at Y/N and Noah and been amazed? Or just felt so in love? </i></b></p><p>“Now that Noah is crawling and is about to start walking, he follows Y/N around the house a lot,” Jimin smiled. “The other day, I was in the kitchen finishing dinner and when I went out into the living room to get them, she was walking around the living room and letting Noah chase after her. He was giggling so loudly and they both had the biggest smiles on their faces. That’s something that I’ll always remember.”<br/></p><p><b><i>Do you want more kids? What would you name a girl?</i></b></p><p>“We would love more kids,” Jimin answers and you nod in agreement. <br/></p><p>“Jimin owes me a kid that looks like me,” you joke, making Jimin giggle loudly. “As for what we would name a girl, I think we’d still go with Emma. That’s the name that we had for Noah, had he been a girl. Right?” You looked at Jimin and he nodded.</p><p><b><i>Hopes for the future?</i></b></p><p>“I’d love to teach Noah how to dance once he learns to walk and is a little more coordinated,” Jimin replied as he grinned widely. <br/></p><p>“Um, I’m pretty happy with how our lives have been going so far. I think the only thing I’d add is another kid soon but besides that, I’m good,” you nodded.<br/></p><p>“Yeah, I’d say that life is pretty damn amazing right now,” Jimin added. “I have Y/N, I have Noah. What more could I really need?” You leaned over and kissed his cheek as Noah squealed loudly at the sight. <br/></p>",
        "reblog": {
            "comment": "<p><b>Jimin x Reader</b></p><figure class=\"tmblr-full\" data-orig-height=\"324\" data-orig-width=\"500\" data-tumblr-attribution=\"nj:HVkXYOvss58Dcp-ackb1gA:ZU6zXt2d7QSd3\"><img src=\"https://66.media.tumblr.com/7d6b06c00b621a3ea8f77bd3497d296b/tumblr_ph6sz73iz71s0bexho1_500.gif\" data-orig-height=\"324\" data-orig-width=\"500\"></figure><figure data-orig-width=\"500\" data-orig-height=\"324\" data-tumblr-attribution=\"nj:HVkXYOvss58Dcp-ackb1gA:ZU6zXt2d7QSd3\" class=\"tmblr-full\"></figure><figure data-orig-width=\"500\" data-orig-height=\"324\" data-tumblr-attribution=\"nj:HVkXYOvss58Dcp-ackb1gA:ZU6zXt2d7QSd3\" class=\"tmblr-full\"></figure><p>You and Jimin are in the backyard of your house, with Noah sitting in your lap.</p><p><b><b><b><b><i>How long have you two been together? Have you two ever broken up?</i></b></b><br></b></b></p><p>“Four years,” Jimin giggled. “Weird to think that it’s been that long.”<br></p><p>“It really is because so much has happened,” you nodded in agreement as you motioned down at Noah. “As for break ups, we broke up like twice when we were still just dating.”<br></p><p>“Both of those times, we broke up over not being able to see each other much and spend time together,” Jimin mumbled. “But I didn’t want to lose her so I did what I had to do, in terms of making time for her, and now here we are.”</p><p><b><i>Pregnancy sex?</i></b></p><p>“Oh yeah,” Jimin smirked and you blushed harshly.<br></p><p>“It was my pregnancy hormones,” you lamely said.<br></p><p><b><i>What was your weirdest pregnancy craving?</i></b></p><p>“The stereotypical pickles,” you laughed. “We always had to have a jar of them in the house.”<br></p><p><b><i>Describe Noah, personality and looks wise. Does Noah crave affection like Jimin?</i></b></p><p>“Jimin doesn’t call Noah ‘mini-me’ for no reason,” you state. “Looks just like him and acts just like him too.”<br></p><p>“He can be a little shy sometimes and he tends to need a lot of reassurance to try new things, but he’s a sweet kid,” Jimin added. <br></p><p>“He does crave affection like Jimin, which I love because I get lots of baby cuddles,” you laughed.<br></p><p>“We both do,” Jimin corrected.</p><p><b><i>\n\nWhat was it like to going back to work after the baby was born?\n\n<br></i></b></p><p>“It was hard because Noah didn’t adjust well to daycare at first,” you revealed. “Because he’s shy, he has a hard time being around new people.”<br></p><p>“Thankfully, he got used to it after about two weeks and he loves it now,” Jimin said. “As for me personally, I didn’t like going back to work after he was born.”<br></p><p>“You didn’t?” You looked over at Jimin with a raised eyebrow and he shook his head. “You never told me that.”<br></p><p>“Because I knew that I had to just get used to it,” Jimin confessed. “I couldn’t just drop my commitments to the group but anytime I went to work after Noah was born, I just wanted to be back here at home with him and you.”<br></p><p>“Aw Jimin-ssi,” you cooed, reaching over and patting his cheek with your hand. “For me, it was reliving to go back to work because I missed it. I also loved the feeling of getting to come home after a long but good day at work and getting to see not only Jimin, but this beautiful little face too,” you grinned as you pressed a kiss to Noah’s chubby cheek, making him squeal.</p><p><b><i>How do you manage when he’s on tour?</i></b></p><p>“I hate it when he has to leave,” you blurt out, making Jimin look over at you with a frown on his face. “Even though Noah is still young, he definitely notices when Jimin is gone and that makes him sad. In turn, I become even more upset because not only is Jimin gone, but now Noah’s sad,” you explain. <br></p><p>“Jagiya,” Jimin murmurs as he moves closer to you. He wraps an arm around your shoulder, pulling you into his side. “I know, I hate having to leave you guys too.”<br></p><p>“I usually just try to keep myself, and Noah, occupied until he gets back. Things like taking Noah to the park, play dates with the boys’ other kids, anything really,” you listed. “That usually helps the time pass faster.”</p><p><b><i>Has Noah been to the BigHit building? If so, how do you keep him occupied?</i></b></p><p>\n\n“He’s been a few times, the rare days where we don’t want to send him to daycare but Y/N-ah has to go into work for a few hours so he comes with me,” Jimin nods. “Noah loves watching us perform so I never really struggle to keep his attention. Plus, he loves the members and our staff as well so there’s always someone to keep him occupied if need be.”\n\n<br></p><p><b><i>Do you guys post lots of photos of Noah, or do you prefer to maintain some privacy when it comes to him?</i></b></p><p>“We love posting photos of Noah,” you answered. “Especially these cute little photo collages comparing him to old photos of Jimin, since they look so much alike.”</p><p>“While Y/N was still pregnant, we discussed how much we’d post him and we decided that we wouldn’t let any potential trolls stop us from posting things about our child, who we love very much and are insanely proud of,” Jimin explained. </p><p><b><i>How do you deal with tantrums?</i></b></p><p>“Jimin doesn’t,” you answered immediately, making him look over at you.<br></p><p>“What do you mean? I do deal with his tantrums,” Jimin refuted.<br></p><p>“Giving him what he wants is not ‘dealing with it’,” you chuckled.<br></p><p>“Well, it’s not my fault I have a soft spot for him,” Jimin murmured and you rolled your eyes playfully.<br></p><p>“Since Noah is so sweet, he doesn’t like being yelled at so if I just gently scold him, that does the trick,” you said.<br></p><p><b><i>How often do you and Jimin get to spend time together? Sexually too? Favorite sex position?</i></b></p><p>“We make it a point to spend at least an hour together every night, if we can,” you articulated. “After having Noah, we made an agreement to make sure that our relationship doesn’t get lost in the busyness that is our everyday lives.”<br></p><p>“Between her job, my job, and taking care of Noah, it would be way too easy to let our relationship fall to the wayside,” Jimin elaborated. “We love and value each other way too much to let that happen.”<br></p><p>“As for sex, we still haven’t perfected that yet,” you blushed. “Sometimes, we’ll go three weeks without more than a kiss; other times, we’ll have sex every night so it really just depends.”<br></p><p>“For favorite sex position, I’d say cowgirl for me,” Jimin smirked. “I love being able to look at her.”<br></p><p>“You say that as if I don’t catch you staring at me all the time anyways,” you teased, making him blush and bury his face in your neck. “It’d be cowgirl or doggy for me.”</p><p><b><i>What’s something that he does that gets on your nerves? And vice versa?</i></b></p><p>“Sometimes, I don’t like the fact that he has such a soft spot for Noah,” you mutter. “That soft spot makes it damn near impossible for Jimin to reprimand him or scold him effectively, which leads to me having to do it and I feel like it makes me look like the bad guy all the time.”<br></p><p>“And I’ve apologized for that and it’s something I’m working on,” Jimin chimed in and you nodded in confirmation. “For me, I don’t like how she has a tendency to not tell me when she’s struggling with things. She can walk around and pretend that everything is fine and then all of a sudden, she has an outburst about things that happened three weeks ago,” he stated.<br></p><p>“I just never want to bother you,” you whisper.<br></p><p>“But we’re a team,” Jimin reminded you. “Your problems are my problems and vice versa. If you’re struggling, then so am I. That’s a part of my job as your husband and partner, to be your support system, ok?” You nodded and pressed a soft kiss to his lips.</p><p><b><i>Jimin, has Noah ever copied anything that you’ve done? And how did you react?</i></b></p><p>“Oh, tell them about that time when you took him to rehearsals for the tour,” you interjected and Jimin laughed as he remembered what you were referring to.<br></p><p>“So, there was a day where Y/N had to go to work so I took Noah to rehearsal with me. We were practicing for our tour so there’s a section where I perform Serendipity. The time came for me to rehearse that section and Noah was off on the side of the stage with Hobi hyung,” Jimin explained. “When the part comes that I kind of grind onto the floor, Noah tried to copy me and ended up falling right on his face.”<br></p><p>“He still has the little bruise on his forehead to prove it,” you chimed in, laughing softly.<br></p><p>“I felt so bad because he was really trying,” Jimin pouted. “But I also was insanely proud because not only had he been watching me but he understood the concept of what I was doing, which makes me hopeful that he’ll pick up dancing someday.”</p><p><b><i>How do you feel about Y/N after watching her give birth? How has it changed your bond/connection?</i></b></p><p>“She was already my favorite person before she got pregnant but after watching her go through that whole process, especially her labor, it just made me value and respect her so much more than I already did,” Jimin confessed. “Her labor was so hard for her and she handled it like a pro.”<br></p><p>“And I’d do it all over again for Noah,” you assured, smiling down at Noah.</p><p>“As for our bond or connection, I don’t think much has changed,” Jimin said. “We’ve always valued each other so I think having Noah and parenting him together has only strengthened it.”<br></p><p>“I think the real reason he hasn’t noticed a change in our bond or connection is because Jimin has always treated me as if I was a princess,” you smiled, making him blush lightly. <br></p><p><b><i>What’s something that you love most about being a parent? Or something that you wish you knew before becoming a parent?</i></b></p><p>“I wish I had known how kids literally take over your life,” you giggled. “Everything we do now, from making big family decisions to things as simple as what to have for dinner, Noah is always the first thing that comes to both of our minds.”<br></p><p>“Definitely,” Jimin nodded. “Plus, when you have a kid, you become known as only that child’s parent. I mean, my parents don’t call me just to talk to me anymore. They’ll literally facetime me to see Noah and then hang up once they’re done.”<br></p><p>“My family is the same way,” you agreed. “The text threads between me and my mom and dad are literally only pictures and videos of Noah, and nothing else.”<br></p><p><b><i>Have you ever had a moment when you’ve looked at Y/N and Noah and been amazed? Or just felt so in love? </i></b></p><p>“Now that Noah is crawling and is about to start walking, he follows Y/N around the house a lot,” Jimin smiled. “The other day, I was in the kitchen finishing dinner and when I went out into the living room to get them, she was walking around the living room and letting Noah chase after her. He was giggling so loudly and they both had the biggest smiles on their faces. That’s something that I’ll always remember.”<br></p><p><b><i>Do you want more kids? What would you name a girl?</i></b></p><p>“We would love more kids,” Jimin answers and you nod in agreement. <br></p><p>“Jimin owes me a kid that looks like me,” you joke, making Jimin giggle loudly. “As for what we would name a girl, I think we’d still go with Emma. That’s the name that we had for Noah, had he been a girl. Right?” You looked at Jimin and he nodded.</p><p><b><i>Hopes for the future?</i></b></p><p>“I’d love to teach Noah how to dance once he learns to walk and is a little more coordinated,” Jimin replied as he grinned widely. <br></p><p>“Um, I’m pretty happy with how our lives have been going so far. I think the only thing I’d add is another kid soon but besides that, I’m good,” you nodded.<br></p><p>“Yeah, I’d say that life is pretty damn amazing right now,” Jimin added. “I have Y/N, I have Noah. What more could I really need?” You leaned over and kissed his cheek as Noah squealed loudly at the sight. <br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "btsqualityy",
                    "active": true,
                    "theme": {
                        "header_full_width": 540,
                        "header_full_height": 229,
                        "header_focus_width": 407,
                        "header_focus_height": 229,
                        "avatar_shape": "square",
                        "background_color": "#81858D",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,465,229,58",
                        "header_image": "https://static.tumblr.com/5219e5b0ff2b477f390d84c8a64c8f6c/1hdhyoj/kX7po306q/tumblr_static_.gif",
                        "header_image_focused": "https://static.tumblr.com/5219e5b0ff2b477f390d84c8a64c8f6c/1hdhyoj/jI7po306s/tumblr_static_tumblr_static__focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/5219e5b0ff2b477f390d84c8a64c8f6c/1hdhyoj/kX7po306q/tumblr_static__2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#F0F0F0",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Spade",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376603971"
                },
                "content_raw": "<p><b>Jimin x Reader</b></p><figure class=\"tmblr-full\" data-orig-height=\"324\" data-orig-width=\"500\" data-tumblr-attribution=\"nj:HVkXYOvss58Dcp-ackb1gA:ZU6zXt2d7QSd3\"><img src=\"https://66.media.tumblr.com/7d6b06c00b621a3ea8f77bd3497d296b/tumblr_ph6sz73iz71s0bexho1_500.gif\" data-orig-height=\"324\" data-orig-width=\"500\"></figure><figure data-orig-width=\"500\" data-orig-height=\"324\" data-tumblr-attribution=\"nj:HVkXYOvss58Dcp-ackb1gA:ZU6zXt2d7QSd3\" class=\"tmblr-full\"></figure><figure data-orig-width=\"500\" data-orig-height=\"324\" data-tumblr-attribution=\"nj:HVkXYOvss58Dcp-ackb1gA:ZU6zXt2d7QSd3\" class=\"tmblr-full\"></figure><p>You and Jimin are in the backyard of your house, with Noah sitting in your lap.</p><p><b><b><b><b><i>How long have you two been together? Have you two ever broken up?</i></b></b><br></b></b></p><p>“Four years,” Jimin giggled. “Weird to think that it’s been that long.”<br></p><p>“It really is because so much has happened,” you nodded in agreement as you motioned down at Noah. “As for break ups, we broke up like twice when we were still just dating.”<br></p><p>“Both of those times, we broke up over not being able to see each other much and spend time together,” Jimin mumbled. “But I didn’t want to lose her so I did what I had to do, in terms of making time for her, and now here we are.”</p><p><b><i>Pregnancy sex?</i></b></p><p>“Oh yeah,” Jimin smirked and you blushed harshly.<br></p><p>“It was my pregnancy hormones,” you lamely said.<br></p><p><b><i>What was your weirdest pregnancy craving?</i></b></p><p>“The stereotypical pickles,” you laughed. “We always had to have a jar of them in the house.”<br></p><p><b><i>Describe Noah, personality and looks wise. Does Noah crave affection like Jimin?</i></b></p><p>“Jimin doesn’t call Noah ‘mini-me’ for no reason,” you state. “Looks just like him and acts just like him too.”<br></p><p>“He can be a little shy sometimes and he tends to need a lot of reassurance to try new things, but he’s a sweet kid,” Jimin added. <br></p><p>“He does crave affection like Jimin, which I love because I get lots of baby cuddles,” you laughed.<br></p><p>“We both do,” Jimin corrected.</p><p><b><i>\n\nWhat was it like to going back to work after the baby was born?\n\n<br></i></b></p><p>“It was hard because Noah didn’t adjust well to daycare at first,” you revealed. “Because he’s shy, he has a hard time being around new people.”<br></p><p>“Thankfully, he got used to it after about two weeks and he loves it now,” Jimin said. “As for me personally, I didn’t like going back to work after he was born.”<br></p><p>“You didn’t?” You looked over at Jimin with a raised eyebrow and he shook his head. “You never told me that.”<br></p><p>“Because I knew that I had to just get used to it,” Jimin confessed. “I couldn’t just drop my commitments to the group but anytime I went to work after Noah was born, I just wanted to be back here at home with him and you.”<br></p><p>“Aw Jimin-ssi,” you cooed, reaching over and patting his cheek with your hand. “For me, it was reliving to go back to work because I missed it. I also loved the feeling of getting to come home after a long but good day at work and getting to see not only Jimin, but this beautiful little face too,” you grinned as you pressed a kiss to Noah’s chubby cheek, making him squeal.</p><p><b><i>How do you manage when he’s on tour?</i></b></p><p>“I hate it when he has to leave,” you blurt out, making Jimin look over at you with a frown on his face. “Even though Noah is still young, he definitely notices when Jimin is gone and that makes him sad. In turn, I become even more upset because not only is Jimin gone, but now Noah’s sad,” you explain. <br></p><p>“Jagiya,” Jimin murmurs as he moves closer to you. He wraps an arm around your shoulder, pulling you into his side. “I know, I hate having to leave you guys too.”<br></p><p>“I usually just try to keep myself, and Noah, occupied until he gets back. Things like taking Noah to the park, play dates with the boys’ other kids, anything really,” you listed. “That usually helps the time pass faster.”</p><p><b><i>Has Noah been to the BigHit building? If so, how do you keep him occupied?</i></b></p><p>\n\n“He’s been a few times, the rare days where we don’t want to send him to daycare but Y/N-ah has to go into work for a few hours so he comes with me,” Jimin nods. “Noah loves watching us perform so I never really struggle to keep his attention. Plus, he loves the members and our staff as well so there’s always someone to keep him occupied if need be.”\n\n<br></p><p><b><i>Do you guys post lots of photos of Noah, or do you prefer to maintain some privacy when it comes to him?</i></b></p><p>“We love posting photos of Noah,” you answered. “Especially these cute little photo collages comparing him to old photos of Jimin, since they look so much alike.”</p><p>“While Y/N was still pregnant, we discussed how much we’d post him and we decided that we wouldn’t let any potential trolls stop us from posting things about our child, who we love very much and are insanely proud of,” Jimin explained. </p><p><b><i>How do you deal with tantrums?</i></b></p><p>“Jimin doesn’t,” you answered immediately, making him look over at you.<br></p><p>“What do you mean? I do deal with his tantrums,” Jimin refuted.<br></p><p>“Giving him what he wants is not ‘dealing with it’,” you chuckled.<br></p><p>“Well, it’s not my fault I have a soft spot for him,” Jimin murmured and you rolled your eyes playfully.<br></p><p>“Since Noah is so sweet, he doesn’t like being yelled at so if I just gently scold him, that does the trick,” you said.<br></p><p><b><i>How often do you and Jimin get to spend time together? Sexually too? Favorite sex position?</i></b></p><p>“We make it a point to spend at least an hour together every night, if we can,” you articulated. “After having Noah, we made an agreement to make sure that our relationship doesn’t get lost in the busyness that is our everyday lives.”<br></p><p>“Between her job, my job, and taking care of Noah, it would be way too easy to let our relationship fall to the wayside,” Jimin elaborated. “We love and value each other way too much to let that happen.”<br></p><p>“As for sex, we still haven’t perfected that yet,” you blushed. “Sometimes, we’ll go three weeks without more than a kiss; other times, we’ll have sex every night so it really just depends.”<br></p><p>“For favorite sex position, I’d say cowgirl for me,” Jimin smirked. “I love being able to look at her.”<br></p><p>“You say that as if I don’t catch you staring at me all the time anyways,” you teased, making him blush and bury his face in your neck. “It’d be cowgirl or doggy for me.”</p><p><b><i>What’s something that he does that gets on your nerves? And vice versa?</i></b></p><p>“Sometimes, I don’t like the fact that he has such a soft spot for Noah,” you mutter. “That soft spot makes it damn near impossible for Jimin to reprimand him or scold him effectively, which leads to me having to do it and I feel like it makes me look like the bad guy all the time.”<br></p><p>“And I’ve apologized for that and it’s something I’m working on,” Jimin chimed in and you nodded in confirmation. “For me, I don’t like how she has a tendency to not tell me when she’s struggling with things. She can walk around and pretend that everything is fine and then all of a sudden, she has an outburst about things that happened three weeks ago,” he stated.<br></p><p>“I just never want to bother you,” you whisper.<br></p><p>“But we’re a team,” Jimin reminded you. “Your problems are my problems and vice versa. If you’re struggling, then so am I. That’s a part of my job as your husband and partner, to be your support system, ok?” You nodded and pressed a soft kiss to his lips.</p><p><b><i>Jimin, has Noah ever copied anything that you’ve done? And how did you react?</i></b></p><p>“Oh, tell them about that time when you took him to rehearsals for the tour,” you interjected and Jimin laughed as he remembered what you were referring to.<br></p><p>“So, there was a day where Y/N had to go to work so I took Noah to rehearsal with me. We were practicing for our tour so there’s a section where I perform Serendipity. The time came for me to rehearse that section and Noah was off on the side of the stage with Hobi hyung,” Jimin explained. “When the part comes that I kind of grind onto the floor, Noah tried to copy me and ended up falling right on his face.”<br></p><p>“He still has the little bruise on his forehead to prove it,” you chimed in, laughing softly.<br></p><p>“I felt so bad because he was really trying,” Jimin pouted. “But I also was insanely proud because not only had he been watching me but he understood the concept of what I was doing, which makes me hopeful that he’ll pick up dancing someday.”</p><p><b><i>How do you feel about Y/N after watching her give birth? How has it changed your bond/connection?</i></b></p><p>“She was already my favorite person before she got pregnant but after watching her go through that whole process, especially her labor, it just made me value and respect her so much more than I already did,” Jimin confessed. “Her labor was so hard for her and she handled it like a pro.”<br></p><p>“And I’d do it all over again for Noah,” you assured, smiling down at Noah.</p><p>“As for our bond or connection, I don’t think much has changed,” Jimin said. “We’ve always valued each other so I think having Noah and parenting him together has only strengthened it.”<br></p><p>“I think the real reason he hasn’t noticed a change in our bond or connection is because Jimin has always treated me as if I was a princess,” you smiled, making him blush lightly. <br></p><p><b><i>What’s something that you love most about being a parent? Or something that you wish you knew before becoming a parent?</i></b></p><p>“I wish I had known how kids literally take over your life,” you giggled. “Everything we do now, from making big family decisions to things as simple as what to have for dinner, Noah is always the first thing that comes to both of our minds.”<br></p><p>“Definitely,” Jimin nodded. “Plus, when you have a kid, you become known as only that child’s parent. I mean, my parents don’t call me just to talk to me anymore. They’ll literally facetime me to see Noah and then hang up once they’re done.”<br></p><p>“My family is the same way,” you agreed. “The text threads between me and my mom and dad are literally only pictures and videos of Noah, and nothing else.”<br></p><p><b><i>Have you ever had a moment when you’ve looked at Y/N and Noah and been amazed? Or just felt so in love? </i></b></p><p>“Now that Noah is crawling and is about to start walking, he follows Y/N around the house a lot,” Jimin smiled. “The other day, I was in the kitchen finishing dinner and when I went out into the living room to get them, she was walking around the living room and letting Noah chase after her. He was giggling so loudly and they both had the biggest smiles on their faces. That’s something that I’ll always remember.”<br></p><p><b><i>Do you want more kids? What would you name a girl?</i></b></p><p>“We would love more kids,” Jimin answers and you nod in agreement. <br></p><p>“Jimin owes me a kid that looks like me,” you joke, making Jimin giggle loudly. “As for what we would name a girl, I think we’d still go with Emma. That’s the name that we had for Noah, had he been a girl. Right?” You looked at Jimin and he nodded.</p><p><b><i>Hopes for the future?</i></b></p><p>“I’d love to teach Noah how to dance once he learns to walk and is a little more coordinated,” Jimin replied as he grinned widely. <br></p><p>“Um, I’m pretty happy with how our lives have been going so far. I think the only thing I’d add is another kid soon but besides that, I’m good,” you nodded.<br></p><p>“Yeah, I’d say that life is pretty damn amazing right now,” Jimin added. “I have Y/N, I have Noah. What more could I really need?” You leaned over and kissed his cheek as Noah squealed loudly at the sight. <br></p>",
                "content": "<p><b>Jimin x Reader</b></p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><figure data-tumblr-attribution=\"nj:HVkXYOvss58Dcp-ackb1gA:ZU6zXt2d7QSd3\" class=\"tmblr-full\"></figure><figure data-tumblr-attribution=\"nj:HVkXYOvss58Dcp-ackb1gA:ZU6zXt2d7QSd3\" class=\"tmblr-full\"></figure><p>You and Jimin are in the backyard of your house, with Noah sitting in your lap.</p><p><b><b><b><b><i>How long have you two been together? Have you two ever broken up?</i></b></b><br /></b></b></p><p>&ldquo;Four years,&rdquo; Jimin giggled. &ldquo;Weird to think that it&rsquo;s been that long.&rdquo;<br /></p><p>&ldquo;It really is because so much has happened,&rdquo; you nodded in agreement as you motioned down at Noah. &ldquo;As for break ups, we broke up like twice when we were still just dating.&rdquo;<br /></p><p>&ldquo;Both of those times, we broke up over not being able to see each other much and spend time together,&rdquo; Jimin mumbled. &ldquo;But I didn&rsquo;t want to lose her so I did what I had to do, in terms of making time for her, and now here we are.&rdquo;</p><p><b><i>Pregnancy sex?</i></b></p><p>&ldquo;Oh yeah,&rdquo; Jimin smirked and you blushed harshly.<br /></p><p>&ldquo;It was my pregnancy hormones,&rdquo; you lamely said.<br /></p><p><b><i>What was your weirdest pregnancy craving?</i></b></p><p>&ldquo;The stereotypical&nbsp;pickles,&rdquo; you laughed.&nbsp;&ldquo;We always had to have a jar of them in the house.&rdquo;<br /></p><p><b><i>Describe Noah, personality and looks wise.&nbsp;Does Noah crave affection like Jimin?</i></b></p><p>&ldquo;Jimin doesn&rsquo;t call Noah &lsquo;mini-me&rsquo; for no reason,&rdquo; you state. &ldquo;Looks just like him and acts just like him too.&rdquo;<br /></p><p>&ldquo;He can be a little shy sometimes and he tends to need a lot of reassurance to try new things, but he&rsquo;s a sweet kid,&rdquo; Jimin added. <br /></p><p>&ldquo;He does crave affection like Jimin, which I love because I get lots of baby cuddles,&rdquo; you laughed.<br /></p><p>&ldquo;We both do,&rdquo; Jimin corrected.</p><p><b><i>\n\nWhat was it like to going back to work after the baby was born?\n\n<br /></i></b></p><p>&ldquo;It was hard because Noah didn&rsquo;t adjust well to daycare at first,&rdquo; you revealed. &ldquo;Because he&rsquo;s shy, he has a hard time being around new people.&rdquo;<br /></p><p>&ldquo;Thankfully, he got used to it after about two weeks and he loves it now,&rdquo; Jimin said. &ldquo;As for me personally, I didn&rsquo;t like going back to work after he was born.&rdquo;<br /></p><p>&ldquo;You didn&rsquo;t?&rdquo; You looked over at Jimin with a raised eyebrow and he shook his head. &ldquo;You never told me that.&rdquo;<br /></p><p>&ldquo;Because I knew that I had to just get used to it,&rdquo; Jimin confessed. &ldquo;I couldn&rsquo;t just drop my commitments to the group but anytime I went to work after Noah was born, I just wanted to be back here at home with him and you.&rdquo;<br /></p><p>&ldquo;Aw Jimin-ssi,&rdquo; you cooed, reaching over and patting his cheek with your hand. &ldquo;For me, it was reliving to go back to work because I missed it. I also loved the feeling of getting to come home after a long but good day at work and getting to see not only Jimin, but this beautiful little face too,&rdquo; you grinned as you pressed a kiss to Noah&rsquo;s chubby cheek, making him squeal.</p><p><b><i>How do you manage when he&rsquo;s on tour?</i></b></p><p>&ldquo;I hate it when he has to leave,&rdquo; you blurt out, making Jimin look over at you with a frown on his face. &ldquo;Even though Noah is still young, he definitely notices when Jimin is gone and that makes him sad. In turn, I become even more upset because not only is Jimin gone, but now Noah&rsquo;s sad,&rdquo; you explain. <br /></p><p>&ldquo;Jagiya,&rdquo; Jimin murmurs as he moves closer to you. He wraps an arm around your shoulder, pulling you into his side. &ldquo;I know, I hate having to leave you guys too.&rdquo;<br /></p><p>&ldquo;I usually just try to keep myself, and Noah, occupied until he gets back. Things like taking Noah to the park, play dates with the boys&rsquo; other kids, anything really,&rdquo; you listed. &ldquo;That usually helps the time pass faster.&rdquo;</p><p><b><i>Has Noah been to the BigHit building? If so, how do you keep him occupied?</i></b></p><p>\n\n&ldquo;He&rsquo;s been a few times, the rare days where we don&rsquo;t want to send him to daycare but Y/N-ah has to go into work for a few hours so he comes with me,&rdquo; Jimin nods. &ldquo;Noah loves watching us perform so I never really struggle to keep his attention. Plus, he loves the members and our staff as well so there&rsquo;s always someone to keep him occupied if need be.&rdquo;\n\n<br /></p><p><b><i>Do you guys post lots of photos of Noah, or do you prefer to maintain some privacy when it comes to him?</i></b></p><p>&ldquo;We love posting photos of Noah,&rdquo; you answered. &ldquo;Especially these cute little photo collages comparing him to old photos of Jimin, since they look so much alike.&rdquo;</p><p>&ldquo;While Y/N was still pregnant, we discussed how much we&rsquo;d post him and we decided that we wouldn&rsquo;t let any potential trolls stop us from posting things about our child, who we love very much and are insanely proud of,&rdquo; Jimin explained. </p><p><b><i>How do you deal with tantrums?</i></b></p><p>&ldquo;Jimin doesn&rsquo;t,&rdquo; you answered immediately, making him look over at you.<br /></p><p>&ldquo;What do you mean? I do deal with his tantrums,&rdquo; Jimin refuted.<br /></p><p>&ldquo;Giving him what he wants is not&nbsp;&lsquo;dealing with it&rsquo;,&rdquo; you chuckled.<br /></p><p>&ldquo;Well, it&rsquo;s not my fault I have a soft spot for him,&rdquo; Jimin murmured and you rolled your eyes playfully.<br /></p><p>&ldquo;Since Noah is so sweet, he doesn&rsquo;t like being yelled at so if I just gently scold him, that does the trick,&rdquo; you said.<br /></p><p><b><i>How often do you and Jimin get to spend time together? Sexually too? Favorite sex position?</i></b></p><p>&ldquo;We make it a point to spend at least an hour together every night, if we can,&rdquo; you articulated. &ldquo;After having Noah, we made an agreement to make sure that our relationship doesn&rsquo;t get lost in the busyness that is our everyday lives.&rdquo;<br /></p><p>&ldquo;Between her job, my job, and taking care of Noah, it would be way too easy to let our relationship fall to the wayside,&rdquo; Jimin elaborated. &ldquo;We love and value each other way too much to let that happen.&rdquo;<br /></p><p>&ldquo;As for sex, we still haven&rsquo;t perfected that yet,&rdquo; you blushed. &ldquo;Sometimes, we&rsquo;ll go three weeks without more than a kiss; other times, we&rsquo;ll have sex every night so it really just depends.&rdquo;<br /></p><p>&ldquo;For favorite sex position, I&rsquo;d say cowgirl for me,&rdquo; Jimin smirked. &ldquo;I love being able to look at her.&rdquo;<br /></p><p>&ldquo;You say that as if I don&rsquo;t catch you staring at me all the time anyways,&rdquo; you teased, making him blush and bury his face in your neck. &ldquo;It&rsquo;d be cowgirl or doggy for me.&rdquo;</p><p><b><i>What&rsquo;s something that he does that gets on your nerves? And vice versa?</i></b></p><p>&ldquo;Sometimes, I don&rsquo;t like the fact that he has such a soft spot for Noah,&rdquo; you mutter. &ldquo;That soft spot makes it damn near impossible for Jimin to reprimand him or scold him effectively, which leads to me having to do it and I feel like it makes me look like the bad guy all the time.&rdquo;<br /></p><p>&ldquo;And I&rsquo;ve apologized for that and it&rsquo;s something I&rsquo;m working on,&rdquo; Jimin chimed in and you nodded in confirmation. &ldquo;For me, I don&rsquo;t like how she has a tendency to not tell me when she&rsquo;s struggling with things. She can walk around and pretend that everything is fine and then all of a sudden, she has an outburst about things that happened three weeks ago,&rdquo; he stated.<br /></p><p>&ldquo;I just never want to bother you,&rdquo; you whisper.<br /></p><p>&ldquo;But we&rsquo;re a team,&rdquo; Jimin reminded you. &ldquo;Your problems are my problems and vice versa. If you&rsquo;re struggling, then so am I. That&rsquo;s a part of my job as your husband and partner, to be your support system, ok?&rdquo; You nodded and pressed a soft kiss to his lips.</p><p><b><i>Jimin, has Noah ever copied anything that you&rsquo;ve done? And how did you react?</i></b></p><p>&ldquo;Oh, tell them about that time when you took him to rehearsals for the tour,&rdquo; you interjected and Jimin laughed as he remembered what you were referring to.<br /></p><p>&ldquo;So, there was a day where Y/N had to go to work so I took Noah to rehearsal with me. We were practicing for our tour so there&rsquo;s a section where I perform Serendipity. The time came for me to rehearse that section and Noah was off on the side of the stage with Hobi hyung,&rdquo; Jimin explained. &ldquo;When the part comes that I kind of grind onto the floor, Noah tried to copy me and ended up falling right on his face.&rdquo;<br /></p><p>&ldquo;He still has the little bruise on his forehead to prove it,&rdquo; you chimed in, laughing softly.<br /></p><p>&ldquo;I felt so bad because he was really trying,&rdquo; Jimin pouted. &ldquo;But I also was insanely proud because not only had he been watching me but he understood the concept of what I was doing, which makes me hopeful that he&rsquo;ll pick up dancing someday.&rdquo;</p><p><b><i>How do you feel about Y/N after watching her give birth? How has it changed your bond/connection?</i></b></p><p>&ldquo;She was already my favorite person before she got pregnant but after watching her go through that whole process, especially her labor, it just made me value and respect her so much more than I already did,&rdquo; Jimin confessed.&nbsp;&ldquo;Her labor was so hard for her and she handled it like a pro.&rdquo;<br /></p><p>&ldquo;And I&rsquo;d do it all over again for Noah,&rdquo; you assured, smiling down at Noah.</p><p>&ldquo;As for our bond or connection, I don&rsquo;t think much has changed,&rdquo; Jimin said.&nbsp;&ldquo;We&rsquo;ve always valued each other so I think having Noah and parenting him together has only strengthened it.&rdquo;<br /></p><p>&ldquo;I think the real reason he hasn&rsquo;t noticed a change in our bond or connection is because Jimin has always treated me as if I was a princess,&rdquo; you smiled, making him blush lightly.&nbsp;<br /></p><p><b><i>What&rsquo;s something that you love most about being a parent? Or something that you wish you knew before becoming a parent?</i></b></p><p>&ldquo;I wish I had known how kids literally take over your life,&rdquo; you giggled.&nbsp;&ldquo;Everything we do now, from making big family decisions to things as simple as what to have for dinner, Noah is always the first thing that comes to both of our minds.&rdquo;<br /></p><p>&ldquo;Definitely,&rdquo; Jimin nodded.&nbsp;&ldquo;Plus, when you have a kid, you become known as only that child&rsquo;s parent. I mean, my parents don&rsquo;t call me just to talk to me anymore. They&rsquo;ll literally facetime me to see Noah and then hang up once they&rsquo;re done.&rdquo;<br /></p><p>&ldquo;My family is the same way,&rdquo; you agreed.&nbsp;&ldquo;The text threads between me and my mom and dad are literally only pictures and videos of Noah, and nothing else.&rdquo;<br /></p><p><b><i>Have you ever had a moment when you&rsquo;ve looked at Y/N and Noah and been amazed? Or just felt so in love? </i></b></p><p>&ldquo;Now that Noah is crawling and is about to start walking, he follows Y/N around the house a lot,&rdquo; Jimin smiled.&nbsp;&ldquo;The other day, I was in the kitchen finishing dinner and when I went out into the living room to get them, she was walking around the living room and letting Noah chase after her. He was giggling so loudly and they both had the biggest smiles on their faces. That&rsquo;s something that I&rsquo;ll always remember.&rdquo;<br /></p><p><b><i>Do you want more kids? What would you name a girl?</i></b></p><p>&ldquo;We would love more kids,&rdquo; Jimin answers and you nod in agreement. <br /></p><p>&ldquo;Jimin owes me a kid that looks like me,&rdquo; you joke, making Jimin giggle loudly. &ldquo;As for what we would name a girl, I think we&rsquo;d still go with Emma. That&rsquo;s the name that we had for Noah, had he been a girl. Right?&rdquo; You looked at Jimin and he nodded.</p><p><b><i>Hopes for the future?</i></b></p><p>&ldquo;I&rsquo;d love to teach Noah how to dance once he learns to walk and is a little more coordinated,&rdquo; Jimin replied as he grinned widely.&nbsp;<br /></p><p>&ldquo;Um, I&rsquo;m pretty happy with how our lives have been going so far. I think the only thing I&rsquo;d add is another kid soon but besides that, I&rsquo;m good,&rdquo; you nodded.<br /></p><p>&ldquo;Yeah, I&rsquo;d say that life is pretty damn amazing right now,&rdquo; Jimin added.&nbsp;&ldquo;I have Y/N, I have Noah. What more could I really need?&rdquo; You leaned over and kissed his cheek as Noah squealed loudly at the sight.&nbsp;<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "fypjm",
        "blog": {
            "name": "fypjm",
            "title": "for jimin",
            "description": "This blog is dedicated to posting the latest news and updates regarding Park Jimin, the dancer and vocalist of 방탄소년단 also known as BTS. Please remember that the editing of fantakens is strictly prohibited unless stated otherwise.２차 가공 허용되지 않습니다.２次加工は禁止となります｡  ",
            "url": "https://fypjm.tumblr.com/",
            "uuid": "t:zawADvETUXt9SfMNoIXpxg",
            "updated": 1558479138
        },
        "id": 182376594956,
        "post_url": "https://fypjm.tumblr.com/post/182376594956/look-at-min-do-not-edit",
        "slug": "look-at-min-do-not-edit",
        "date": "2019-01-28 18:11:58 GMT",
        "timestamp": 1548699118,
        "state": "published",
        "format": "html",
        "reblog_key": "X5ADEGcn",
        "tags": [
            "190112",
            "jimin",
            "taehyung",
            "bangtan",
            "bts",
            "p:fantaken",
            "e:concert",
            "e:love yourself",
            "c:japan",
            "kth",
            "look at min"
        ],
        "short_url": "https://tmblr.co/ZUA-mj2fsVVuC",
        "summary": "© LOOK AT MIN! | Do not edit.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 22,
        "caption": "<blockquote>\n<small>© <a href=\"https://twitter.com/lookatmin1013\">LOOK AT MIN!</a> | Do not edit.</small></blockquote>",
        "reblog": {
            "comment": "<p><blockquote>\n<small>© <a href=\"https://twitter.com/lookatmin1013\">LOOK AT MIN!</a> | Do not edit.</small></blockquote></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fypjm",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#fcb6d2",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_05.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_05.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_05.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#f96793",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376594956"
                },
                "content_raw": "<p><blockquote>\n<small>© <a href=\"https://twitter.com/lookatmin1013\">LOOK AT MIN!</a> | Do not edit.</small></blockquote></p>",
                "content": "<p><blockquote>\n<p><small>&copy; <a href=\"https://twitter.com/lookatmin1013\">LOOK AT MIN!</a> | Do not edit.</small></p></blockquote></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "https://pbs.twimg.com/media/Dxmw_mUVYAAu0l3.jpg:orig",
        "image_permalink": "https://fypjm.tumblr.com/image/182376594956",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/beacbadd259106a295df4fb16037f574/tumblr_pm1zvyY5ga1ud88gno1_1280.jpg",
                    "width": 801,
                    "height": 1200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/beacbadd259106a295df4fb16037f574/tumblr_pm1zvyY5ga1ud88gno1_1280.jpg",
                        "width": 801,
                        "height": 1200
                    },
                    {
                        "url": "https://66.media.tumblr.com/beacbadd259106a295df4fb16037f574/tumblr_pm1zvyY5ga1ud88gno1_640.jpg",
                        "width": 640,
                        "height": 959
                    },
                    {
                        "url": "https://66.media.tumblr.com/beacbadd259106a295df4fb16037f574/tumblr_pm1zvyY5ga1ud88gno1_540.jpg",
                        "width": 540,
                        "height": 809
                    },
                    {
                        "url": "https://66.media.tumblr.com/beacbadd259106a295df4fb16037f574/tumblr_pm1zvyY5ga1ud88gno1_500.jpg",
                        "width": 500,
                        "height": 749
                    },
                    {
                        "url": "https://66.media.tumblr.com/beacbadd259106a295df4fb16037f574/tumblr_pm1zvyY5ga1ud88gno1_400.jpg",
                        "width": 400,
                        "height": 599
                    },
                    {
                        "url": "https://66.media.tumblr.com/beacbadd259106a295df4fb16037f574/tumblr_pm1zvyY5ga1ud88gno1_250.jpg",
                        "width": 250,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/beacbadd259106a295df4fb16037f574/tumblr_pm1zvyY5ga1ud88gno1_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/beacbadd259106a295df4fb16037f574/tumblr_pm1zvyY5ga1ud88gno1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "video",
        "blog_name": "mookiejones",
        "blog": {
            "name": "mookiejones",
            "title": "Oran \"Juice\" Jones II",
            "description": "#SupremeAutoooo ",
            "url": "https://mookiejones.tumblr.com/",
            "uuid": "t:U4N_mdf30n7FfQPTs-EQgA",
            "updated": 1551968763
        },
        "id": 182376575071,
        "post_url": "https://mookiejones.tumblr.com/post/182376575071/albeback-oneminuteshow-bts-shot-by-eudisjr",
        "slug": "albeback-oneminuteshow-bts-shot-by-eudisjr",
        "date": "2019-01-28 18:11:06 GMT",
        "timestamp": 1548699066,
        "state": "published",
        "format": "html",
        "reblog_key": "Iw0bqfYj",
        "tags": [
            "oneminuteshow",
            "bts",
            "germancar",
            "germanshepherd",
            "supremeautoooo",
            "mood",
            "show",
            "video",
            "music",
            "artist",
            "rap",
            "hiphop",
            "38strategiesofraw"
        ],
        "short_url": "https://tmblr.co/Zniffx2fsVR1V",
        "summary": "@albeback #oneminuteshow #bts shot by @eudis.jr #germancar #germanshepherd directed by @redmangilla artist @oranjuicejonesii...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "caption": "<p>@albeback #oneminuteshow #bts shot by @eudis.jr #germancar #germanshepherd directed by @redmangilla artist @oranjuicejonesii shot by @chrispinset #SupremeAutoooo #Mood #Oneminuteshow #show #video #music #artist #rap #hiphop ( huge shout out to my brother @iamspesh for coming out  &amp; showing love can’t wait for that #38strategiesofraw ) #SupremeAutoooo  (at Bronx, New York)<br/>\n<a href=\"https://www.instagram.com/p/BtMA6nLlC0c/?utm_source=ig_tumblr_share&amp;igshid=1rpcplupe7sse\">https://www.instagram.com/p/BtMA6nLlC0c/?utm_source=ig_tumblr_share&amp;igshid=1rpcplupe7sse</a></p>",
        "reblog": {
            "comment": "<p>@albeback #oneminuteshow #bts shot by @eudis.jr #germancar #germanshepherd directed by @redmangilla artist @oranjuicejonesii shot by @chrispinset #SupremeAutoooo #Mood #Oneminuteshow #show #video #music #artist #rap #hiphop ( huge shout out to my brother @iamspesh for coming out  &amp; showing love can’t wait for that #38strategiesofraw ) #SupremeAutoooo  (at Bronx, New York)<br><a href=\"https://www.instagram.com/p/BtMA6nLlC0c/?utm_source=ig_tumblr_share&amp;igshid=1rpcplupe7sse\">https://www.instagram.com/p/BtMA6nLlC0c/?utm_source=ig_tumblr_share&amp;igshid=1rpcplupe7sse</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "mookiejones",
                    "active": true,
                    "theme": {
                        "header_full_width": 4096,
                        "header_full_height": 4096,
                        "header_focus_width": 2048,
                        "header_focus_height": 1151,
                        "avatar_shape": "circle",
                        "background_color": "#F2992E",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "511,3889,1844,1519",
                        "header_image": "https://static.tumblr.com/a3a8f1aa188179b8d09d2fe28cd84a45/pdtpx8q/dUwoxafwq/tumblr_static_b4nc9iaxd3k8s0440gkcckscw.jpg",
                        "header_image_focused": "https://static.tumblr.com/a3a8f1aa188179b8d09d2fe28cd84a45/pdtpx8q/XKDoxafx0/tumblr_static_tumblr_static_b4nc9iaxd3k8s0440gkcckscw_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/a3a8f1aa188179b8d09d2fe28cd84a45/pdtpx8q/dUwoxafwq/tumblr_static_b4nc9iaxd3k8s0440gkcckscw_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#301f09",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376575071"
                },
                "content_raw": "<p>@albeback #oneminuteshow #bts shot by @eudis.jr #germancar #germanshepherd directed by @redmangilla artist @oranjuicejonesii shot by @chrispinset #SupremeAutoooo #Mood #Oneminuteshow #show #video #music #artist #rap #hiphop ( huge shout out to my brother @iamspesh for coming out  &amp; showing love can’t wait for that #38strategiesofraw ) #SupremeAutoooo  (at Bronx, New York)<br><a href=\"https://www.instagram.com/p/BtMA6nLlC0c/?utm_source=ig_tumblr_share&amp;igshid=1rpcplupe7sse\">https://www.instagram.com/p/BtMA6nLlC0c/?utm_source=ig_tumblr_share&amp;igshid=1rpcplupe7sse</a></p>",
                "content": "<p>@albeback #oneminuteshow #bts shot by @eudis.jr #germancar #germanshepherd directed by @redmangilla artist @oranjuicejonesii shot by @chrispinset #SupremeAutoooo #Mood #Oneminuteshow #show #video #music #artist #rap #hiphop ( huge shout out to my brother @iamspesh for coming out  &amp; showing love can&rsquo;t wait for that #38strategiesofraw ) #SupremeAutoooo  (at Bronx, New York)<br /><a href=\"https://www.instagram.com/p/BtMA6nLlC0c/?utm_source=ig_tumblr_share&amp;igshid=1rpcplupe7sse\">https://www.instagram.com/p/BtMA6nLlC0c/?utm_source=ig_tumblr_share&amp;igshid=1rpcplupe7sse</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "html5_capable": false,
        "thumbnail_url": "",
        "thumbnail_width": 0,
        "thumbnail_height": 0,
        "player": [
            {
                "width": 250,
                "embed_code": "<iframe src=\"//www.instagram.com/p/BtMA6nLlC0c/embed/\" width=\"250\" height=\"290\" frameborder=\"0\" scrolling=\"no\" allowtransparency=\"true\"></iframe>"
            },
            {
                "width": 400,
                "embed_code": "<iframe src=\"//www.instagram.com/p/BtMA6nLlC0c/embed/\" width=\"400\" height=\"464\" frameborder=\"0\" scrolling=\"no\" allowtransparency=\"true\"></iframe>"
            },
            {
                "width": 500,
                "embed_code": "<iframe src=\"//www.instagram.com/p/BtMA6nLlC0c/embed/\" width=\"500\" height=\"580\" frameborder=\"0\" scrolling=\"no\" allowtransparency=\"true\"></iframe>"
            }
        ],
        "video_type": "unknown",
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "springeditss",
        "blog": {
            "name": "springeditss",
            "title": "‎-‏-ࡇ",
            "description": "<p>★ pt-br/eng !! messy bios nd messy layouts for bts nd kgirls only :DD ★</p>",
            "url": "https://springeditss.tumblr.com/",
            "uuid": "t:IU9Gh9yNXn7kvl4qach6xg",
            "updated": 1558634488
        },
        "id": 182376558122,
        "post_url": "https://springeditss.tumblr.com/post/182376558122/taehyung-bts-messy-layouts",
        "slug": "taehyung-bts-messy-layouts",
        "date": "2019-01-28 18:10:15 GMT",
        "timestamp": 1548699015,
        "state": "published",
        "format": "html",
        "reblog_key": "PbHUYq5I",
        "tags": [
            "bts",
            "bts icons",
            "bts headers",
            "bts layouts",
            "bts packs",
            "bts messy",
            "bts v",
            "bts taehyung",
            "taehyung",
            "taehyung icons",
            "taehyung headers",
            "taehyung layouts",
            "taehyung packs",
            "taehyung messy",
            "taehyung lq",
            "v icons",
            "v headers",
            "v layouts",
            "v packs",
            "v messy",
            "messy icons",
            "messy layouts",
            "messy headers",
            "kpop"
        ],
        "short_url": "https://tmblr.co/ZMJJPX2fsVMug",
        "summary": "➭ ♡ taehyung ( bts ) messy layouts !! [request]\nlike/reblog if you save pls ^~^",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 259,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"642\" data-orig-width=\"642\"><img src=\"https://66.media.tumblr.com/056e0fca3f4a89de164e90f39f8fe1b6/tumblr_pm1zt1ngcK1venm0o_540.jpg\" data-orig-height=\"642\" data-orig-width=\"642\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"717\" data-orig-width=\"717\"><img src=\"https://66.media.tumblr.com/9844c93c18f44f6fbdfab44870cbb40e/tumblr_pm1zt1tpqO1venm0o_540.jpg\" data-orig-height=\"717\" data-orig-width=\"717\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"539\" data-orig-width=\"539\"><img src=\"https://66.media.tumblr.com/e7210b5acb8c433d6f3ca98f7f7e99c8/tumblr_pm1zt2RmiW1venm0o_540.jpg\" data-orig-height=\"539\" data-orig-width=\"539\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"238\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/600f28848c78dbbdb5c2260b26a69cdf/tumblr_pm1zt2aqUr1venm0o_540.jpg\" data-orig-height=\"238\" data-orig-width=\"750\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/b87a5ae2fee786e734094a4533ee55a5/tumblr_pm1zt2Lt3t1venm0o_540.jpg\" data-orig-height=\"250\" data-orig-width=\"750\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"244\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/016c02a4a2ba4abfb1b28e8fd239e383/tumblr_pm1zt273hq1venm0o_540.jpg\" data-orig-height=\"244\" data-orig-width=\"750\"/></figure></div><p>➭ ♡ taehyung ( bts ) messy layouts !! [request]</p><p>like/reblog if you save pls ^~^</p>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"642\" data-orig-width=\"642\"><img src=\"https://66.media.tumblr.com/056e0fca3f4a89de164e90f39f8fe1b6/tumblr_pm1zt1ngcK1venm0o_540.jpg\" data-orig-height=\"642\" data-orig-width=\"642\"></figure><figure class=\"tmblr-full\" data-orig-height=\"717\" data-orig-width=\"717\"><img src=\"https://66.media.tumblr.com/9844c93c18f44f6fbdfab44870cbb40e/tumblr_pm1zt1tpqO1venm0o_540.jpg\" data-orig-height=\"717\" data-orig-width=\"717\"></figure><figure class=\"tmblr-full\" data-orig-height=\"539\" data-orig-width=\"539\"><img src=\"https://66.media.tumblr.com/e7210b5acb8c433d6f3ca98f7f7e99c8/tumblr_pm1zt2RmiW1venm0o_540.jpg\" data-orig-height=\"539\" data-orig-width=\"539\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"238\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/600f28848c78dbbdb5c2260b26a69cdf/tumblr_pm1zt2aqUr1venm0o_540.jpg\" data-orig-height=\"238\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/b87a5ae2fee786e734094a4533ee55a5/tumblr_pm1zt2Lt3t1venm0o_540.jpg\" data-orig-height=\"250\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"244\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/016c02a4a2ba4abfb1b28e8fd239e383/tumblr_pm1zt273hq1venm0o_540.jpg\" data-orig-height=\"244\" data-orig-width=\"750\"></figure></div><p>➭ ♡ taehyung ( bts ) messy layouts !! [request]</p><p>like/reblog if you save pls ^~^</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "springeditss",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 852,
                        "header_focus_width": 1280,
                        "header_focus_height": 720,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "38,1280,758,0",
                        "header_image": "https://static.tumblr.com/e82dfe418f6776378c7d6f9fe69fa8a8/ay4buto/sxwpp2tyq/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/9744e0d65de1a4a98666f04d09c77f27/ay4buto/Y7Xpp2tyr/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e82dfe418f6776378c7d6f9fe69fa8a8/ay4buto/sxwpp2tyq/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FB9983",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#FB9983",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376558122"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"642\" data-orig-width=\"642\"><img src=\"https://66.media.tumblr.com/056e0fca3f4a89de164e90f39f8fe1b6/tumblr_pm1zt1ngcK1venm0o_540.jpg\" data-orig-height=\"642\" data-orig-width=\"642\"></figure><figure class=\"tmblr-full\" data-orig-height=\"717\" data-orig-width=\"717\"><img src=\"https://66.media.tumblr.com/9844c93c18f44f6fbdfab44870cbb40e/tumblr_pm1zt1tpqO1venm0o_540.jpg\" data-orig-height=\"717\" data-orig-width=\"717\"></figure><figure class=\"tmblr-full\" data-orig-height=\"539\" data-orig-width=\"539\"><img src=\"https://66.media.tumblr.com/e7210b5acb8c433d6f3ca98f7f7e99c8/tumblr_pm1zt2RmiW1venm0o_540.jpg\" data-orig-height=\"539\" data-orig-width=\"539\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"238\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/600f28848c78dbbdb5c2260b26a69cdf/tumblr_pm1zt2aqUr1venm0o_540.jpg\" data-orig-height=\"238\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/b87a5ae2fee786e734094a4533ee55a5/tumblr_pm1zt2Lt3t1venm0o_540.jpg\" data-orig-height=\"250\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"244\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/016c02a4a2ba4abfb1b28e8fd239e383/tumblr_pm1zt273hq1venm0o_540.jpg\" data-orig-height=\"244\" data-orig-width=\"750\"></figure></div><p>➭ ♡ taehyung ( bts ) messy layouts !! [request]</p><p>like/reblog if you save pls ^~^</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/056e0fca3f4a89de164e90f39f8fe1b6/tumblr_pm1zt1ngcK1venm0o_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/9844c93c18f44f6fbdfab44870cbb40e/tumblr_pm1zt1tpqO1venm0o_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/e7210b5acb8c433d6f3ca98f7f7e99c8/tumblr_pm1zt2RmiW1venm0o_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/600f28848c78dbbdb5c2260b26a69cdf/tumblr_pm1zt2aqUr1venm0o_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/b87a5ae2fee786e734094a4533ee55a5/tumblr_pm1zt2Lt3t1venm0o_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/016c02a4a2ba4abfb1b28e8fd239e383/tumblr_pm1zt273hq1venm0o_540.jpg\" class=\"\"/></figure><p>&#10157; &#9825; taehyung ( bts ) messy layouts !! [request]</p><p>like/reblog if you save pls ^~^</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "yodoo307",
        "blog": {
            "name": "yodoo307",
            "title": "Untitled",
            "description": "",
            "url": "https://yodoo307.tumblr.com/",
            "uuid": "t:by0ueTIOtk3kQ31EiyNM7Q",
            "updated": 1558551764
        },
        "id": 182376550625,
        "post_url": "https://yodoo307.tumblr.com/post/182376550625/repost-alilarter-back-when-life-was-just",
        "slug": "repost-alilarter-back-when-life-was-just",
        "date": "2019-01-28 18:09:58 GMT",
        "timestamp": 1548698998,
        "state": "published",
        "format": "html",
        "reblog_key": "AqNBHlJI",
        "tags": [
            "repost",
            "fbf",
            "bts"
        ],
        "short_url": "https://tmblr.co/ZJK2kr2fsVL3X",
        "summary": "#Repost @alilarter\n・・・\nBack when life was just all too much... 😂 #fbf #bts...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "caption": "<p>#Repost @alilarter<br/>\n・・・<br/>\nBack when life was just all too much&hellip; 😂 #fbf #bts @brianbowensmith<br/>\n<a href=\"https://www.instagram.com/p/BtMBHKigyX2/?utm_source=ig_tumblr_share&amp;igshid=1hzzowvdvne3i\">https://www.instagram.com/p/BtMBHKigyX2/?utm_source=ig_tumblr_share&amp;igshid=1hzzowvdvne3i</a></p>",
        "reblog": {
            "comment": "<p>#Repost @alilarter<br>\n・・・<br>\nBack when life was just all too much… 😂 #fbf #bts @brianbowensmith<br><a href=\"https://www.instagram.com/p/BtMBHKigyX2/?utm_source=ig_tumblr_share&amp;igshid=1hzzowvdvne3i\">https://www.instagram.com/p/BtMBHKigyX2/?utm_source=ig_tumblr_share&amp;igshid=1hzzowvdvne3i</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "yodoo307",
                    "active": true,
                    "theme": {
                        "header_full_width": 3000,
                        "header_full_height": 1055,
                        "header_focus_width": 1874,
                        "header_focus_height": 1054,
                        "avatar_shape": "square",
                        "background_color": "#89468F",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,2437,1054,563",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_12.png?_v=66d5962d3469ecad376c5ae8c13d5a27",
                        "header_image_focused": "https://static.tumblr.com/135c295f6f77d1a7a92c5364ce1e9d26/sh6wb74/tFMng9l6v/tumblr_static_optica_pattern_12_focused_v3.png",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_12_focused_v3.png?_v=66d5962d3469ecad376c5ae8c13d5a27",
                        "header_stretch": true,
                        "link_color": "#BAFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376550625"
                },
                "content_raw": "<p>#Repost @alilarter<br>\n・・・<br>\nBack when life was just all too much… 😂 #fbf #bts @brianbowensmith<br><a href=\"https://www.instagram.com/p/BtMBHKigyX2/?utm_source=ig_tumblr_share&amp;igshid=1hzzowvdvne3i\">https://www.instagram.com/p/BtMBHKigyX2/?utm_source=ig_tumblr_share&amp;igshid=1hzzowvdvne3i</a></p>",
                "content": "<p>#Repost @alilarter<br />\n&#12539;&#12539;&#12539;<br />\nBack when life was just all too much&hellip; &#128514; #fbf #bts @brianbowensmith<br /><a href=\"https://www.instagram.com/p/BtMBHKigyX2/?utm_source=ig_tumblr_share&amp;igshid=1hzzowvdvne3i\">https://www.instagram.com/p/BtMBHKigyX2/?utm_source=ig_tumblr_share&amp;igshid=1hzzowvdvne3i</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "https://www.instagram.com/p/BtMBHKigyX2/?utm_source=ig_tumblr_share&igshid=1hzzowvdvne3i",
        "image_permalink": "https://yodoo307.tumblr.com/image/182376550625",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/65c986c2d60251efefa4a0a27742a9e5/tumblr_pm1zsmqZA21svf2yyo1_1280.jpg",
                    "width": 1080,
                    "height": 1080
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/65c986c2d60251efefa4a0a27742a9e5/tumblr_pm1zsmqZA21svf2yyo1_1280.jpg",
                        "width": 1080,
                        "height": 1080
                    },
                    {
                        "url": "https://66.media.tumblr.com/65c986c2d60251efefa4a0a27742a9e5/tumblr_pm1zsmqZA21svf2yyo1_640.jpg",
                        "width": 640,
                        "height": 640
                    },
                    {
                        "url": "https://66.media.tumblr.com/65c986c2d60251efefa4a0a27742a9e5/tumblr_pm1zsmqZA21svf2yyo1_540.jpg",
                        "width": 540,
                        "height": 540
                    },
                    {
                        "url": "https://66.media.tumblr.com/65c986c2d60251efefa4a0a27742a9e5/tumblr_pm1zsmqZA21svf2yyo1_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/65c986c2d60251efefa4a0a27742a9e5/tumblr_pm1zsmqZA21svf2yyo1_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/65c986c2d60251efefa4a0a27742a9e5/tumblr_pm1zsmqZA21svf2yyo1_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/65c986c2d60251efefa4a0a27742a9e5/tumblr_pm1zsmqZA21svf2yyo1_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/65c986c2d60251efefa4a0a27742a9e5/tumblr_pm1zsmqZA21svf2yyo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "fykook",
        "blog": {
            "name": "fykook",
            "title": "LOVE IS NOT OVER",
            "description": "a blog dedicated to the talented main vocalist and maknae of bangtan boys, jungkook! please do not edit fansite data unless permission is explicitly stated in the caption!",
            "url": "https://fykook.tumblr.com/",
            "uuid": "t:OhaNq03MPnCKpMj67tesaw",
            "updated": 1558631773
        },
        "id": 182376541059,
        "post_url": "https://fykook.tumblr.com/post/182376541059/dear-bunny-do-not-edit",
        "slug": "dear-bunny-do-not-edit",
        "date": "2019-01-28 18:09:30 GMT",
        "timestamp": 1548698970,
        "state": "published",
        "format": "html",
        "reblog_key": "OQBorivz",
        "tags": [
            "190105",
            "bts",
            "jungkook",
            "p:fantaken",
            "e:golden disc awards 2019",
            "dear bunny"
        ],
        "short_url": "https://tmblr.co/ZRfKpl2fsVIk3",
        "summary": "© Dear Bunny | Do not edit.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 18,
        "source_url": "https://t.umblr.com/redirect?z=https%3A%2F%2Ftwitter.com%2FDear_Bunny_jk&t=OTgxMDY0NDdkMzUyMmE2N2IxYzhiYmUyZjYxMzBhZjZiYTA0NmZmMSwxODIzNzY1NDEwNTk%3D&b=t%3AOhaNq03MPnCKpMj67tesaw&p=https%3A%2F%2Ffykook.tumblr.com%2Fpost%2F182376541059%2Fdear-bunny-do-not-edit&m=0",
        "source_title": "twitter.com",
        "caption": "<p><small>© <a href=\"https://twitter.com/Dear_Bunny_jk\" target=\"_blank\">Dear Bunny</a> | Do not edit.</small></p>",
        "reblog": {
            "comment": "<p><small>© <a href=\"https://twitter.com/Dear_Bunny_jk\" target=\"_blank\">Dear Bunny</a> | Do not edit.</small></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fykook",
                    "active": true,
                    "theme": {
                        "header_full_width": 708,
                        "header_full_height": 398,
                        "header_focus_width": 707,
                        "header_focus_height": 398,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,707,398,0",
                        "header_image": "https://static.tumblr.com/b03f4e812eb07a302f248bdb526ecfa4/wupwnyt/7H9njffc2/tumblr_static_4ve867m9b02sw88ks04go0cck.png",
                        "header_image_focused": "https://static.tumblr.com/b03f4e812eb07a302f248bdb526ecfa4/wupwnyt/7Qgnjffc3/tumblr_static_tumblr_static_4ve867m9b02sw88ks04go0cck_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/b03f4e812eb07a302f248bdb526ecfa4/wupwnyt/7H9njffc2/tumblr_static_4ve867m9b02sw88ks04go0cck_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#df7f79",
                        "title_font": "Alternate Gothic",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376541059"
                },
                "content_raw": "<p><small>© <a href=\"https://twitter.com/Dear_Bunny_jk\" target=\"_blank\">Dear Bunny</a> | Do not edit.</small></p>",
                "content": "<p><small>&copy; <a href=\"https://twitter.com/Dear_Bunny_jk\" target=\"_blank\">Dear Bunny</a> | Do not edit.</small></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "https://pbs.twimg.com/media/Dx-qEknVsAA4um5.jpg:orig",
        "image_permalink": "https://fykook.tumblr.com/image/182376541059",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/55f1fb197de4bb1309cae47ec3c10ba5/tumblr_pm1zruenxC1u5ikygo1_1280.jpg",
                    "width": 682,
                    "height": 1024
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/55f1fb197de4bb1309cae47ec3c10ba5/tumblr_pm1zruenxC1u5ikygo1_1280.jpg",
                        "width": 682,
                        "height": 1024
                    },
                    {
                        "url": "https://66.media.tumblr.com/55f1fb197de4bb1309cae47ec3c10ba5/tumblr_pm1zruenxC1u5ikygo1_640.jpg",
                        "width": 639,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/55f1fb197de4bb1309cae47ec3c10ba5/tumblr_pm1zruenxC1u5ikygo1_540.jpg",
                        "width": 539,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/55f1fb197de4bb1309cae47ec3c10ba5/tumblr_pm1zruenxC1u5ikygo1_500.jpg",
                        "width": 500,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/55f1fb197de4bb1309cae47ec3c10ba5/tumblr_pm1zruenxC1u5ikygo1_400.jpg",
                        "width": 400,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/55f1fb197de4bb1309cae47ec3c10ba5/tumblr_pm1zruenxC1u5ikygo1_250.jpg",
                        "width": 250,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/55f1fb197de4bb1309cae47ec3c10ba5/tumblr_pm1zruenxC1u5ikygo1_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/55f1fb197de4bb1309cae47ec3c10ba5/tumblr_pm1zruenxC1u5ikygo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "honeyedyoonmin",
        "blog": {
            "name": "honeyedyoonmin",
            "title": "Some Light Is Rebellion",
            "description": "Asher // They/Them // <a href=\"http://lunejpeg.tumblr.com/\">Main</a> // <a href=\"https://honeyedyoonmin.tumblr.com/tagged/my gifs/\">My Gifs</a> // <a href=\"http://twitter.com/queeryoongis/\">My Twitter</a>",
            "url": "https://honeyedyoonmin.tumblr.com/",
            "uuid": "t:QSjh041Xn99oraoufiJbrQ",
            "updated": 1558634809
        },
        "id": 182376538439,
        "post_url": "https://honeyedyoonmin.tumblr.com/post/182376538439",
        "slug": "",
        "date": "2019-01-28 18:09:23 GMT",
        "timestamp": 1548698963,
        "state": "published",
        "format": "html",
        "reblog_key": "PrDPwLrJ",
        "tags": [
            "my gifs",
            "bts",
            "min yoongi",
            "yoongi",
            "suga",
            "bangtan",
            "kpop",
            "honey"
        ],
        "short_url": "https://tmblr.co/Z_DZCb2fsVI57",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 9,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "image_permalink": "https://honeyedyoonmin.tumblr.com/image/182376538439",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/10b3a2425db51fda201816f4477c87db/tumblr_pm1zf9gT0j1x3gcm2o2_500.gif",
                    "width": 405,
                    "height": 304
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/10b3a2425db51fda201816f4477c87db/tumblr_pm1zf9gT0j1x3gcm2o2_500.gif",
                        "width": 405,
                        "height": 304
                    },
                    {
                        "url": "https://66.media.tumblr.com/10b3a2425db51fda201816f4477c87db/tumblr_pm1zf9gT0j1x3gcm2o2_400.gif",
                        "width": 400,
                        "height": 300
                    },
                    {
                        "url": "https://66.media.tumblr.com/10b3a2425db51fda201816f4477c87db/tumblr_pm1zf9gT0j1x3gcm2o2_250.gif",
                        "width": 250,
                        "height": 188
                    },
                    {
                        "url": "https://66.media.tumblr.com/10b3a2425db51fda201816f4477c87db/tumblr_pm1zf9gT0j1x3gcm2o2_100.gif",
                        "width": 100,
                        "height": 75
                    },
                    {
                        "url": "https://66.media.tumblr.com/10b3a2425db51fda201816f4477c87db/tumblr_pm1zf9gT0j1x3gcm2o2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "fykook",
        "blog": {
            "name": "fykook",
            "title": "LOVE IS NOT OVER",
            "description": "a blog dedicated to the talented main vocalist and maknae of bangtan boys, jungkook! please do not edit fansite data unless permission is explicitly stated in the caption!",
            "url": "https://fykook.tumblr.com/",
            "uuid": "t:OhaNq03MPnCKpMj67tesaw",
            "updated": 1558631773
        },
        "id": 182376528239,
        "post_url": "https://fykook.tumblr.com/post/182376528239/dear-bunny-do-not-edit",
        "slug": "dear-bunny-do-not-edit",
        "date": "2019-01-28 18:08:52 GMT",
        "timestamp": 1548698932,
        "state": "published",
        "format": "html",
        "reblog_key": "sfFVER9b",
        "tags": [
            "190105",
            "bts",
            "jungkook",
            "p:fantaken",
            "e:golden disk awards 2019",
            "dear bunny"
        ],
        "short_url": "https://tmblr.co/ZRfKpl2fsVFbl",
        "summary": "© Dear Bunny | Do not edit.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 19,
        "source_url": "https://t.umblr.com/redirect?z=https%3A%2F%2Ftwitter.com%2FDear_Bunny_jk&t=MmJmNzFjMjhhODkzZTMzN2MyNTBjNTY3NDlkMTdlNzAxYmM2ODcyNywxODIzNzY1MjgyMzk%3D&b=t%3AOhaNq03MPnCKpMj67tesaw&p=https%3A%2F%2Ffykook.tumblr.com%2Fpost%2F182376528239%2Fdear-bunny-do-not-edit&m=0",
        "source_title": "twitter.com",
        "caption": "<p><small>© <a href=\"https://twitter.com/Dear_Bunny_jk\" target=\"_blank\">Dear Bunny</a> | Do not edit.</small></p>",
        "reblog": {
            "comment": "<p><small>© <a href=\"https://twitter.com/Dear_Bunny_jk\" target=\"_blank\">Dear Bunny</a> | Do not edit.</small></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fykook",
                    "active": true,
                    "theme": {
                        "header_full_width": 708,
                        "header_full_height": 398,
                        "header_focus_width": 707,
                        "header_focus_height": 398,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,707,398,0",
                        "header_image": "https://static.tumblr.com/b03f4e812eb07a302f248bdb526ecfa4/wupwnyt/7H9njffc2/tumblr_static_4ve867m9b02sw88ks04go0cck.png",
                        "header_image_focused": "https://static.tumblr.com/b03f4e812eb07a302f248bdb526ecfa4/wupwnyt/7Qgnjffc3/tumblr_static_tumblr_static_4ve867m9b02sw88ks04go0cck_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/b03f4e812eb07a302f248bdb526ecfa4/wupwnyt/7H9njffc2/tumblr_static_4ve867m9b02sw88ks04go0cck_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#df7f79",
                        "title_font": "Alternate Gothic",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376528239"
                },
                "content_raw": "<p><small>© <a href=\"https://twitter.com/Dear_Bunny_jk\" target=\"_blank\">Dear Bunny</a> | Do not edit.</small></p>",
                "content": "<p><small>&copy; <a href=\"https://twitter.com/Dear_Bunny_jk\" target=\"_blank\">Dear Bunny</a> | Do not edit.</small></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "https://pbs.twimg.com/media/Dx-qEkoU0AAkLYz.jpg:orig",
        "image_permalink": "https://fykook.tumblr.com/image/182376528239",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/eaa07a4a8bc08cf5fcda9849fe450155/tumblr_pm1zqsEwb31u5ikygo1_1280.jpg",
                    "width": 682,
                    "height": 1024
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/eaa07a4a8bc08cf5fcda9849fe450155/tumblr_pm1zqsEwb31u5ikygo1_1280.jpg",
                        "width": 682,
                        "height": 1024
                    },
                    {
                        "url": "https://66.media.tumblr.com/eaa07a4a8bc08cf5fcda9849fe450155/tumblr_pm1zqsEwb31u5ikygo1_640.jpg",
                        "width": 639,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/eaa07a4a8bc08cf5fcda9849fe450155/tumblr_pm1zqsEwb31u5ikygo1_540.jpg",
                        "width": 539,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/eaa07a4a8bc08cf5fcda9849fe450155/tumblr_pm1zqsEwb31u5ikygo1_500.jpg",
                        "width": 500,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/eaa07a4a8bc08cf5fcda9849fe450155/tumblr_pm1zqsEwb31u5ikygo1_400.jpg",
                        "width": 400,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/eaa07a4a8bc08cf5fcda9849fe450155/tumblr_pm1zqsEwb31u5ikygo1_250.jpg",
                        "width": 250,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/eaa07a4a8bc08cf5fcda9849fe450155/tumblr_pm1zqsEwb31u5ikygo1_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/eaa07a4a8bc08cf5fcda9849fe450155/tumblr_pm1zqsEwb31u5ikygo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "aflowersintheattic",
        "blog": {
            "name": "aflowersintheattic",
            "title": "a flowers in the attic",
            "description": "",
            "url": "https://aflowersintheattic.tumblr.com/",
            "uuid": "t:hhfoA2GnDVK9QCc3Dy02ag",
            "updated": 1548698924
        },
        "id": 182376526383,
        "post_url": "https://aflowersintheattic.tumblr.com/post/182376526383/please-give-credits-if-you-take-my-work",
        "slug": "please-give-credits-if-you-take-my-work",
        "date": "2019-01-28 18:08:43 GMT",
        "timestamp": 1548698923,
        "state": "published",
        "format": "html",
        "reblog_key": "DWJbTqu3",
        "tags": [
            "bts",
            "bangtan",
            "suga",
            "min yoongi",
            "j-hope",
            "jung hoseok",
            "bts edit"
        ],
        "short_url": "https://tmblr.co/ZxScOX2fsVF8l",
        "summary": "please give credits if you take my work / пожалуйста, сохраняйте кредиты если берете мои работы",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "caption": "<p>\n\n<i>please give credits if you take my work / пожалуйста, сохраняйте кредиты если берете мои работы</i>\n\n<br/></p>",
        "reblog": {
            "comment": "<p>\n\n<i>please give credits if you take my work / пожалуйста, сохраняйте кредиты если берете мои работы</i>\n\n<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "aflowersintheattic",
                    "active": true,
                    "theme": {
                        "header_full_width": 523,
                        "header_full_height": 294,
                        "header_focus_width": 522,
                        "header_focus_height": 294,
                        "avatar_shape": "circle",
                        "background_color": "#181818",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,522,294,0",
                        "header_image": "https://static.tumblr.com/fc6ea8136c242a0ae00923213ebebb22/vwtztwl/yXgplzlow/tumblr_static_e41g0p3actkog444os08k88ss.png",
                        "header_image_focused": "https://static.tumblr.com/e0bde488e21a40fc4345c6fbfa5f55cc/vwtztwl/eZZplzloy/tumblr_static_tumblr_static_e41g0p3actkog444os08k88ss_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/fc6ea8136c242a0ae00923213ebebb22/vwtztwl/yXgplzlow/tumblr_static_e41g0p3actkog444os08k88ss_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#ebece9",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ebece9",
                        "title_font": "Baskerville",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376526383"
                },
                "content_raw": "<p>\n\n<i>please give credits if you take my work / пожалуйста, сохраняйте кредиты если берете мои работы</i>\n\n<br></p>",
                "content": "<p>\n\n<i>please give credits if you take my work / &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1081;&#1090;&#1077; &#1082;&#1088;&#1077;&#1076;&#1080;&#1090;&#1099; &#1077;&#1089;&#1083;&#1080; &#1073;&#1077;&#1088;&#1077;&#1090;&#1077; &#1084;&#1086;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</i>\n\n<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "11",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/5bf7784fc2c183940c689f9e69ff8f49/tumblr_pm1zqj5Ueu1y5jr0ko1_1280.png",
                    "width": 715,
                    "height": 330
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/5bf7784fc2c183940c689f9e69ff8f49/tumblr_pm1zqj5Ueu1y5jr0ko1_1280.png",
                        "width": 715,
                        "height": 330
                    },
                    {
                        "url": "https://66.media.tumblr.com/5bf7784fc2c183940c689f9e69ff8f49/tumblr_pm1zqj5Ueu1y5jr0ko1_640.png",
                        "width": 640,
                        "height": 295
                    },
                    {
                        "url": "https://66.media.tumblr.com/5bf7784fc2c183940c689f9e69ff8f49/tumblr_pm1zqj5Ueu1y5jr0ko1_540.png",
                        "width": 540,
                        "height": 249
                    },
                    {
                        "url": "https://66.media.tumblr.com/5bf7784fc2c183940c689f9e69ff8f49/tumblr_pm1zqj5Ueu1y5jr0ko1_500.png",
                        "width": 500,
                        "height": 231
                    },
                    {
                        "url": "https://66.media.tumblr.com/5bf7784fc2c183940c689f9e69ff8f49/tumblr_pm1zqj5Ueu1y5jr0ko1_400.png",
                        "width": 400,
                        "height": 185
                    },
                    {
                        "url": "https://66.media.tumblr.com/5bf7784fc2c183940c689f9e69ff8f49/tumblr_pm1zqj5Ueu1y5jr0ko1_250.png",
                        "width": 250,
                        "height": 115
                    },
                    {
                        "url": "https://66.media.tumblr.com/5bf7784fc2c183940c689f9e69ff8f49/tumblr_pm1zqj5Ueu1y5jr0ko1_100.png",
                        "width": 100,
                        "height": 46
                    },
                    {
                        "url": "https://66.media.tumblr.com/5bf7784fc2c183940c689f9e69ff8f49/tumblr_pm1zqj5Ueu1y5jr0ko1_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/42f444fb8977e6174573a7defd47936b/tumblr_pm1zqj5Ueu1y5jr0ko2_1280.png",
                    "width": 715,
                    "height": 330
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/42f444fb8977e6174573a7defd47936b/tumblr_pm1zqj5Ueu1y5jr0ko2_1280.png",
                        "width": 715,
                        "height": 330
                    },
                    {
                        "url": "https://66.media.tumblr.com/42f444fb8977e6174573a7defd47936b/tumblr_pm1zqj5Ueu1y5jr0ko2_640.png",
                        "width": 640,
                        "height": 295
                    },
                    {
                        "url": "https://66.media.tumblr.com/42f444fb8977e6174573a7defd47936b/tumblr_pm1zqj5Ueu1y5jr0ko2_540.png",
                        "width": 540,
                        "height": 249
                    },
                    {
                        "url": "https://66.media.tumblr.com/42f444fb8977e6174573a7defd47936b/tumblr_pm1zqj5Ueu1y5jr0ko2_500.png",
                        "width": 500,
                        "height": 231
                    },
                    {
                        "url": "https://66.media.tumblr.com/42f444fb8977e6174573a7defd47936b/tumblr_pm1zqj5Ueu1y5jr0ko2_400.png",
                        "width": 400,
                        "height": 185
                    },
                    {
                        "url": "https://66.media.tumblr.com/42f444fb8977e6174573a7defd47936b/tumblr_pm1zqj5Ueu1y5jr0ko2_250.png",
                        "width": 250,
                        "height": 115
                    },
                    {
                        "url": "https://66.media.tumblr.com/42f444fb8977e6174573a7defd47936b/tumblr_pm1zqj5Ueu1y5jr0ko2_100.png",
                        "width": 100,
                        "height": 46
                    },
                    {
                        "url": "https://66.media.tumblr.com/42f444fb8977e6174573a7defd47936b/tumblr_pm1zqj5Ueu1y5jr0ko2_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "fykook",
        "blog": {
            "name": "fykook",
            "title": "LOVE IS NOT OVER",
            "description": "a blog dedicated to the talented main vocalist and maknae of bangtan boys, jungkook! please do not edit fansite data unless permission is explicitly stated in the caption!",
            "url": "https://fykook.tumblr.com/",
            "uuid": "t:OhaNq03MPnCKpMj67tesaw",
            "updated": 1558631773
        },
        "id": 182376510489,
        "post_url": "https://fykook.tumblr.com/post/182376510489/dear-bunny-do-not-edit-12",
        "slug": "dear-bunny-do-not-edit-12",
        "date": "2019-01-28 18:08:01 GMT",
        "timestamp": 1548698881,
        "state": "published",
        "format": "html",
        "reblog_key": "B6Rm5QZI",
        "tags": [
            "190105",
            "bts",
            "jungkook",
            "p:fantaken",
            "e:golden disk awards 2019",
            "dear bunny"
        ],
        "short_url": "https://tmblr.co/ZRfKpl2fsVBGP",
        "summary": "© Dear Bunny | Do not edit. (1,2)",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 39,
        "source_url": "https://t.umblr.com/redirect?z=https%3A%2F%2Ftwitter.com%2FDear_Bunny_jk&t=YzgxOTlmZDU2MzVhZjVkZDZkMmI0YTE1YjBkNGE2YmU1YjExN2U3MywxODIzNzY1MTA0ODk%3D&b=t%3AOhaNq03MPnCKpMj67tesaw&p=https%3A%2F%2Ffykook.tumblr.com%2Fpost%2F182376510489%2Fdear-bunny-do-not-edit-12&m=0",
        "source_title": "twitter.com",
        "caption": "<p><small>© <a href=\"https://twitter.com/Dear_Bunny_jk\" target=\"_blank\">Dear Bunny</a> | Do not edit. (<a href=\"https://pbs.twimg.com/media/Dx-qEklUUAA7pqT.jpg:orig\" target=\"_blank\">1</a>,<a href=\"https://pbs.twimg.com/media/Dx-qEkpVsAAGfHR.jpg:orig\" target=\"_blank\">2</a>)</small></p>",
        "reblog": {
            "comment": "<p><small>© <a href=\"https://twitter.com/Dear_Bunny_jk\" target=\"_blank\">Dear Bunny</a> | Do not edit. (<a href=\"https://pbs.twimg.com/media/Dx-qEklUUAA7pqT.jpg:orig\" target=\"_blank\">1</a>,<a href=\"https://pbs.twimg.com/media/Dx-qEkpVsAAGfHR.jpg:orig\" target=\"_blank\">2</a>)</small></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fykook",
                    "active": true,
                    "theme": {
                        "header_full_width": 708,
                        "header_full_height": 398,
                        "header_focus_width": 707,
                        "header_focus_height": 398,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,707,398,0",
                        "header_image": "https://static.tumblr.com/b03f4e812eb07a302f248bdb526ecfa4/wupwnyt/7H9njffc2/tumblr_static_4ve867m9b02sw88ks04go0cck.png",
                        "header_image_focused": "https://static.tumblr.com/b03f4e812eb07a302f248bdb526ecfa4/wupwnyt/7Qgnjffc3/tumblr_static_tumblr_static_4ve867m9b02sw88ks04go0cck_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/b03f4e812eb07a302f248bdb526ecfa4/wupwnyt/7H9njffc2/tumblr_static_4ve867m9b02sw88ks04go0cck_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#df7f79",
                        "title_font": "Alternate Gothic",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376510489"
                },
                "content_raw": "<p><small>© <a href=\"https://twitter.com/Dear_Bunny_jk\" target=\"_blank\">Dear Bunny</a> | Do not edit. (<a href=\"https://pbs.twimg.com/media/Dx-qEklUUAA7pqT.jpg:orig\" target=\"_blank\">1</a>,<a href=\"https://pbs.twimg.com/media/Dx-qEkpVsAAGfHR.jpg:orig\" target=\"_blank\">2</a>)</small></p>",
                "content": "<p><small>&copy; <a href=\"https://twitter.com/Dear_Bunny_jk\" target=\"_blank\">Dear Bunny</a> | Do not edit. (<a href=\"https://pbs.twimg.com/media/Dx-qEklUUAA7pqT.jpg:orig\" target=\"_blank\">1</a>,<a href=\"https://pbs.twimg.com/media/Dx-qEkpVsAAGfHR.jpg:orig\" target=\"_blank\">2</a>)</small></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "2",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/fdf402a7f8ba2414424e305e727804bd/tumblr_pm1zpdSEqj1u5ikygo1_1280.jpg",
                    "width": 682,
                    "height": 1024
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/fdf402a7f8ba2414424e305e727804bd/tumblr_pm1zpdSEqj1u5ikygo1_1280.jpg",
                        "width": 682,
                        "height": 1024
                    },
                    {
                        "url": "https://66.media.tumblr.com/fdf402a7f8ba2414424e305e727804bd/tumblr_pm1zpdSEqj1u5ikygo1_640.jpg",
                        "width": 639,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/fdf402a7f8ba2414424e305e727804bd/tumblr_pm1zpdSEqj1u5ikygo1_540.jpg",
                        "width": 539,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/fdf402a7f8ba2414424e305e727804bd/tumblr_pm1zpdSEqj1u5ikygo1_500.jpg",
                        "width": 500,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/fdf402a7f8ba2414424e305e727804bd/tumblr_pm1zpdSEqj1u5ikygo1_400.jpg",
                        "width": 400,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/fdf402a7f8ba2414424e305e727804bd/tumblr_pm1zpdSEqj1u5ikygo1_250.jpg",
                        "width": 250,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/fdf402a7f8ba2414424e305e727804bd/tumblr_pm1zpdSEqj1u5ikygo1_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/fdf402a7f8ba2414424e305e727804bd/tumblr_pm1zpdSEqj1u5ikygo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/f53a986e420c461d5a6de19f4d483ca5/tumblr_pm1zpdSEqj1u5ikygo2_1280.jpg",
                    "width": 682,
                    "height": 1024
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/f53a986e420c461d5a6de19f4d483ca5/tumblr_pm1zpdSEqj1u5ikygo2_1280.jpg",
                        "width": 682,
                        "height": 1024
                    },
                    {
                        "url": "https://66.media.tumblr.com/f53a986e420c461d5a6de19f4d483ca5/tumblr_pm1zpdSEqj1u5ikygo2_640.jpg",
                        "width": 639,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/f53a986e420c461d5a6de19f4d483ca5/tumblr_pm1zpdSEqj1u5ikygo2_540.jpg",
                        "width": 539,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/f53a986e420c461d5a6de19f4d483ca5/tumblr_pm1zpdSEqj1u5ikygo2_500.jpg",
                        "width": 500,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/f53a986e420c461d5a6de19f4d483ca5/tumblr_pm1zpdSEqj1u5ikygo2_400.jpg",
                        "width": 400,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/f53a986e420c461d5a6de19f4d483ca5/tumblr_pm1zpdSEqj1u5ikygo2_250.jpg",
                        "width": 250,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/f53a986e420c461d5a6de19f4d483ca5/tumblr_pm1zpdSEqj1u5ikygo2_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/f53a986e420c461d5a6de19f4d483ca5/tumblr_pm1zpdSEqj1u5ikygo2_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "fypjm",
        "blog": {
            "name": "fypjm",
            "title": "for jimin",
            "description": "This blog is dedicated to posting the latest news and updates regarding Park Jimin, the dancer and vocalist of 방탄소년단 also known as BTS. Please remember that the editing of fantakens is strictly prohibited unless stated otherwise.２차 가공 허용되지 않습니다.２次加工は禁止となります｡  ",
            "url": "https://fypjm.tumblr.com/",
            "uuid": "t:zawADvETUXt9SfMNoIXpxg",
            "updated": 1558479138
        },
        "id": 182376491851,
        "post_url": "https://fypjm.tumblr.com/post/182376491851/jamjam-do-not-edit",
        "slug": "jamjam-do-not-edit",
        "date": "2019-01-28 18:07:07 GMT",
        "timestamp": 1548698827,
        "state": "published",
        "format": "html",
        "reblog_key": "F2PipJTa",
        "tags": [
            "190112",
            "jimin",
            "bangtan",
            "bts",
            "p:fantaken",
            "e:concert",
            "e:love yourself",
            "c:japan",
            "kth",
            "jamjam"
        ],
        "short_url": "https://tmblr.co/ZUA-mj2fsV6jB",
        "summary": "© JAMJAM | Do not edit.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 257,
        "caption": "<blockquote>\n<small>© <a href=\"https://twitter.com/parkjamjam_kr\">JAMJAM</a> | Do not edit.</small></blockquote>",
        "reblog": {
            "comment": "<p><blockquote>\n<small>© <a href=\"https://twitter.com/parkjamjam_kr\">JAMJAM</a> | Do not edit.</small></blockquote></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fypjm",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#fcb6d2",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_05.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_05.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_05.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#f96793",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376491851"
                },
                "content_raw": "<p><blockquote>\n<small>© <a href=\"https://twitter.com/parkjamjam_kr\">JAMJAM</a> | Do not edit.</small></blockquote></p>",
                "content": "<p><blockquote>\n<p><small>&copy; <a href=\"https://twitter.com/parkjamjam_kr\">JAMJAM</a> | Do not edit.</small></p></blockquote></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "https://pbs.twimg.com/media/DxmvhKRUcAAjTC9.jpg:orig",
        "image_permalink": "https://fypjm.tumblr.com/image/182376491851",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/c9d828635ffc74acf5083bbd5aacbb73/tumblr_pm1znvPQRU1ud88gno1_1280.jpg",
                    "width": 800,
                    "height": 1200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/c9d828635ffc74acf5083bbd5aacbb73/tumblr_pm1znvPQRU1ud88gno1_1280.jpg",
                        "width": 800,
                        "height": 1200
                    },
                    {
                        "url": "https://66.media.tumblr.com/c9d828635ffc74acf5083bbd5aacbb73/tumblr_pm1znvPQRU1ud88gno1_640.jpg",
                        "width": 640,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/c9d828635ffc74acf5083bbd5aacbb73/tumblr_pm1znvPQRU1ud88gno1_540.jpg",
                        "width": 540,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/c9d828635ffc74acf5083bbd5aacbb73/tumblr_pm1znvPQRU1ud88gno1_500.jpg",
                        "width": 500,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/c9d828635ffc74acf5083bbd5aacbb73/tumblr_pm1znvPQRU1ud88gno1_400.jpg",
                        "width": 400,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/c9d828635ffc74acf5083bbd5aacbb73/tumblr_pm1znvPQRU1ud88gno1_250.jpg",
                        "width": 250,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/c9d828635ffc74acf5083bbd5aacbb73/tumblr_pm1znvPQRU1ud88gno1_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/c9d828635ffc74acf5083bbd5aacbb73/tumblr_pm1znvPQRU1ud88gno1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "fypjm",
        "blog": {
            "name": "fypjm",
            "title": "for jimin",
            "description": "This blog is dedicated to posting the latest news and updates regarding Park Jimin, the dancer and vocalist of 방탄소년단 also known as BTS. Please remember that the editing of fantakens is strictly prohibited unless stated otherwise.２차 가공 허용되지 않습니다.２次加工は禁止となります｡  ",
            "url": "https://fypjm.tumblr.com/",
            "uuid": "t:zawADvETUXt9SfMNoIXpxg",
            "updated": 1558479138
        },
        "id": 182376480896,
        "post_url": "https://fypjm.tumblr.com/post/182376480896/jamjam-do-not-edit",
        "slug": "jamjam-do-not-edit",
        "date": "2019-01-28 18:06:34 GMT",
        "timestamp": 1548698794,
        "state": "published",
        "format": "html",
        "reblog_key": "zpCt5IlC",
        "tags": [
            "190112",
            "jimin",
            "bangtan",
            "bts",
            "p:fantaken",
            "e:concert",
            "e;love yourself",
            "c:japan",
            "kth",
            "jamjam"
        ],
        "short_url": "https://tmblr.co/ZUA-mj2fsV420",
        "summary": "© JAMJAM | Do not edit.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 43,
        "caption": "<blockquote>\n<small>© <a href=\"https://twitter.com/parkjamjam_kr\">JAMJAM</a> | Do not edit.</small></blockquote>",
        "reblog": {
            "comment": "<p><blockquote>\n<small>© <a href=\"https://twitter.com/parkjamjam_kr\">JAMJAM</a> | Do not edit.</small></blockquote></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fypjm",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#fcb6d2",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_05.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_05.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_05.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#f96793",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376480896"
                },
                "content_raw": "<p><blockquote>\n<small>© <a href=\"https://twitter.com/parkjamjam_kr\">JAMJAM</a> | Do not edit.</small></blockquote></p>",
                "content": "<p><blockquote>\n<p><small>&copy; <a href=\"https://twitter.com/parkjamjam_kr\">JAMJAM</a> | Do not edit.</small></p></blockquote></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "https://pbs.twimg.com/media/DxmvgmJUwAAxsWK.jpg:orig",
        "image_permalink": "https://fypjm.tumblr.com/image/182376480896",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/4ab374a634e6ff541fce05ddba2aca08/tumblr_pm1zmy2Nxp1ud88gno1_1280.jpg",
                    "width": 800,
                    "height": 1200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/4ab374a634e6ff541fce05ddba2aca08/tumblr_pm1zmy2Nxp1ud88gno1_1280.jpg",
                        "width": 800,
                        "height": 1200
                    },
                    {
                        "url": "https://66.media.tumblr.com/4ab374a634e6ff541fce05ddba2aca08/tumblr_pm1zmy2Nxp1ud88gno1_640.jpg",
                        "width": 640,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/4ab374a634e6ff541fce05ddba2aca08/tumblr_pm1zmy2Nxp1ud88gno1_540.jpg",
                        "width": 540,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/4ab374a634e6ff541fce05ddba2aca08/tumblr_pm1zmy2Nxp1ud88gno1_500.jpg",
                        "width": 500,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/4ab374a634e6ff541fce05ddba2aca08/tumblr_pm1zmy2Nxp1ud88gno1_400.jpg",
                        "width": 400,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/4ab374a634e6ff541fce05ddba2aca08/tumblr_pm1zmy2Nxp1ud88gno1_250.jpg",
                        "width": 250,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/4ab374a634e6ff541fce05ddba2aca08/tumblr_pm1zmy2Nxp1ud88gno1_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/4ab374a634e6ff541fce05ddba2aca08/tumblr_pm1zmy2Nxp1ud88gno1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "lqjeonicons",
        "blog": {
            "name": "lqjeonicons",
            "title": "",
            "description": "enjoy",
            "url": "https://lqjeonicons.tumblr.com/",
            "uuid": "t:UQe7bTrTGbJVeHEv3fYxsg",
            "updated": 1555548066
        },
        "id": 182376470275,
        "post_url": "https://lqjeonicons.tumblr.com/post/182376470275",
        "slug": "",
        "date": "2019-01-28 18:06:02 GMT",
        "timestamp": 1548698762,
        "state": "published",
        "format": "html",
        "reblog_key": "PYPlEy6G",
        "tags": [
            "jeongguk",
            "jungkook",
            "jeon jungkook",
            "bts",
            "lq icons",
            "icons",
            "lq jungkook",
            "jungkook icons",
            "jeongguk icons",
            "jeon jungkook icons",
            "kpop icons",
            "bts icons"
        ],
        "short_url": "https://tmblr.co/Zf6s1Z2fsV1S3",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 209,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/f2cca8e9e1edbdd656e4047d7cb924f5/tumblr_pm1zm1fWf91ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/7b0c709635b5e114d0e208eeeeeebf84/tumblr_pm1zm1tIDB1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/61ef3429057745374b9490983f05f31d/tumblr_pm1zm1uuA71ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/51a5c542d07e5780812c39398d095be3/tumblr_pm1zm1Olee1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/a2eac9f07a0ecfce064a19c11b505eaf/tumblr_pm1zm1hnHU1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/3ee46f313e33159931e1f03dcf7d9aab/tumblr_pm1zm1teXb1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/08a5d812307551c1734abdeb6757f0c0/tumblr_pm1zm2KLsQ1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/870f637ca522aeb8dc16e1fdf0fc809e/tumblr_pm1zm2WwHw1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/0fc5533077204067056ce19eda45c268/tumblr_pm1zm1sNGq1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"/></figure></div>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/f2cca8e9e1edbdd656e4047d7cb924f5/tumblr_pm1zm1fWf91ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/7b0c709635b5e114d0e208eeeeeebf84/tumblr_pm1zm1tIDB1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/61ef3429057745374b9490983f05f31d/tumblr_pm1zm1uuA71ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/51a5c542d07e5780812c39398d095be3/tumblr_pm1zm1Olee1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/a2eac9f07a0ecfce064a19c11b505eaf/tumblr_pm1zm1hnHU1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/3ee46f313e33159931e1f03dcf7d9aab/tumblr_pm1zm1teXb1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/08a5d812307551c1734abdeb6757f0c0/tumblr_pm1zm2KLsQ1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/870f637ca522aeb8dc16e1fdf0fc809e/tumblr_pm1zm2WwHw1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/0fc5533077204067056ce19eda45c268/tumblr_pm1zm1sNGq1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure></div></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "lqjeonicons",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#F5DBD6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_07.png?_v=c52eb3e7fd4be5c98b8970b4c330d172",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_07.png?_v=c52eb3e7fd4be5c98b8970b4c330d172",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_07.png?_v=c52eb3e7fd4be5c98b8970b4c330d172",
                        "header_stretch": true,
                        "link_color": "#5F5747",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": false,
                        "title_color": "#666666",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182376470275"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/f2cca8e9e1edbdd656e4047d7cb924f5/tumblr_pm1zm1fWf91ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/7b0c709635b5e114d0e208eeeeeebf84/tumblr_pm1zm1tIDB1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/61ef3429057745374b9490983f05f31d/tumblr_pm1zm1uuA71ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/51a5c542d07e5780812c39398d095be3/tumblr_pm1zm1Olee1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/a2eac9f07a0ecfce064a19c11b505eaf/tumblr_pm1zm1hnHU1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/3ee46f313e33159931e1f03dcf7d9aab/tumblr_pm1zm1teXb1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/08a5d812307551c1734abdeb6757f0c0/tumblr_pm1zm2KLsQ1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/870f637ca522aeb8dc16e1fdf0fc809e/tumblr_pm1zm2WwHw1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"250\"><img src=\"https://66.media.tumblr.com/0fc5533077204067056ce19eda45c268/tumblr_pm1zm1sNGq1ud0jev_540.png\" data-orig-height=\"250\" data-orig-width=\"250\"></figure></div></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f2cca8e9e1edbdd656e4047d7cb924f5/tumblr_pm1zm1fWf91ud0jev_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/7b0c709635b5e114d0e208eeeeeebf84/tumblr_pm1zm1tIDB1ud0jev_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/61ef3429057745374b9490983f05f31d/tumblr_pm1zm1uuA71ud0jev_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/51a5c542d07e5780812c39398d095be3/tumblr_pm1zm1Olee1ud0jev_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/a2eac9f07a0ecfce064a19c11b505eaf/tumblr_pm1zm1hnHU1ud0jev_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/3ee46f313e33159931e1f03dcf7d9aab/tumblr_pm1zm1teXb1ud0jev_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/08a5d812307551c1734abdeb6757f0c0/tumblr_pm1zm2KLsQ1ud0jev_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/870f637ca522aeb8dc16e1fdf0fc809e/tumblr_pm1zm2WwHw1ud0jev_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0fc5533077204067056ce19eda45c268/tumblr_pm1zm1sNGq1ud0jev_540.png\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    }
]