[
    {
        "type": "text",
        "blog_name": "harryff",
        "blog": {
            "name": "harryff",
            "title": "Basically fan fiction",
            "description": "Just Harry Styles Fan Fiction",
            "url": "https://harryff.tumblr.com/",
            "uuid": "t:nE6c04BuJLN40LvOlU3pmA",
            "updated": 1558318262
        },
        "id": 178818848652,
        "post_url": "https://harryff.tumblr.com/post/178818848652/holiday",
        "slug": "holiday",
        "date": "2018-10-07 13:03:01 GMT",
        "timestamp": 1538917381,
        "state": "published",
        "format": "html",
        "reblog_key": "07o2sqDh",
        "tags": [
            "Harry Styles",
            "Harry Styles Fan Fiction",
            "Harry",
            "Hazza",
            "harry styles fanfic",
            "harry styles fic",
            "harry imagine",
            "imagine",
            "harry styles imagine",
            "harry styles angst",
            "harry angsty",
            "one direction fan fiction",
            "one direction fanfiction",
            "one direction angst",
            "one direction fic",
            "one direction imagine",
            "1d fan fiction",
            "1D FanFic"
        ],
        "short_url": "https://tmblr.co/ZcQMVc2cYRnUC",
        "summary": "Holiday",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 106,
        "title": "Holiday",
        "body": "<p>I feel bad that I seriously suck at posting. I just over analyze everything. I wrote this LAST year during holiday season and we are right around the corner from that. But here you go </p><p>All day Harry had been\ndoing it. <i>All</i> damn day! It was your first holiday together and you and\nHarry had decided to host dinner. You had the recipes from your mother and his.\nYou followed the recipes to a ‘T’ ;however all day Harry kept interjecting.</p><p><i>“lets add a little brown sugar!”,</i><i>“take the cookies out luv might burn the bottom,\ndon wan tha”,</i><i>“add more salt not there yet kinda bland”,</i><i>“dice them smaller want the <u>taste</u> not the\n<u>chunks</u>”, </i><i>“You have to baste it often or it would dry up\nup top”, </i><i>“lets add this(wine) make the taste more bold!”</i></p><p>And <i>now</i> he had just hip bumped you over\nto the side complaining the sauce was burning and you weren&rsquo;t stirring it fast\nenough turning down the  heat even after you said you got it he was still\nmicromanaging, taking over. You huffed grabbing a bottle of water from the\nfridge, before going up the stairs to get ready they were arriving in 2 hours\nyou were so angry you slam the door behind you. It was the slam that caught his\nattention quickly he jogged up the  stairs “Pet re yeh alright?”</p><p>“Yes!” you yell from inside the closet</p><p>“Wha’ re yeh doin’?”</p><p>“Getting ready!”</p><p>“K m gonna head down i added some red wine to\nthe sauce it tastes amazing!” he said excitedly </p><p>“Ok!” you say disinterested. You wanted this to be perfect you wanted his\nfamily to know you could be a great home keeper and take care of him. More\nimportantly you wanted everyone to know you would be a great wife when the time\ncame but Harry proved you wrong. You worried that maybe his micromanaging was\nbecause you were a terrible home keeper the readjustment of pillows and table\nscaping on the dining table and trinkets around your shared home. He\nthought you didn&rsquo;t realize but you did, you thought nothing of it at first but,\nnow it was like a sign a subliminal loud bright neon sign ‘you are shit at\nthis!’</p><p>You get ready on a simple dress with a floor\nlength cardigan on. </p><p>“Ready?” Harry asks walking into the bathroom</p><p>“Yes” you answer</p><p>He wraps his arms around you “wow babe yeh look\namazin’ ” </p><p>“Thanks” you say flatly pushing him off</p><p> He doesn&rsquo;t catch on he&rsquo;s too excited. Excited to\nsee his family. </p><p>When everyone arrived they greet you both with loving arms and\nmessages bringing you  both gifts. Immediately you usher them to the\ndining room as they admire the new décor around the house. You go to open a\nbottle of wine only for Harry to grab it out of your hand</p><p>“I got this have a seat babe, know there&rsquo;s a way\nto pour wine” he fills the glasses before raising his “to family nd luv’ ”</p><p>You all repeat  “to family and love”\nclanking each others glasses </p><p>“lets eat!” 5 minutes pass by and there&rsquo;s the first\ncompliment</p><p>“This chicken is soo good have you tried it\nmum?”  Gemma asks</p><p>“Not yet still eating the risotto it&rsquo;s amazing!” </p><p>“Yea Y/N you did a good job!” your mom speaks to\nyou</p><p>You shake your head “I didn&rsquo;t cook Harry did, good job babe”\nand honestly it really was good </p><p>“Harry you cook!?” your mom asks surprised</p><p>“Yes Mrs. Y/L/N” he says proudly </p><p>“Oh good! Is there nothing you can’t do?”</p><p>He smiles in response loving the compliment </p><p>“Anyway we were worried Y/N would be\nfeeding you box dinners and take out everyday!”  she jokes making everyone else laugh. You give a tight lipped smile </p><p>“Oh no she did most of the work I just helped”  </p><p>“Really is it true butterfly (your nickname)?”\nyour mom asks you </p><p>You sigh “No Harry cooked” you say once again\nshaking your head </p><p>“You know I always got on her on learning to\ncook! Back in my day women had to know how to cook or you wouldn&rsquo;t get\nmarried!” </p><p>“That’s very true Hazza your mimi would get on me all the time” Anne chimes in<br/></p><p>“Oh silly tradition” Harry reasons </p><p>“Yea but i still think she should learn\nsomething if she wants to be a mother” your father scolds “mac and cheese even”</p><p>“I’ll learn dad so i can feed you when you&rsquo;re\nold” you try to joke back making the table laugh a little</p><p>“Oh i don&rsquo;t mind..”  </p><p>“Harry what did you put in this chicken?”\nGemma&rsquo;s Boyfriend Sean asks</p><p> He smiles “I’ll give you the recipe mate ” </p><p>“Please do so i can impress your sister”\n he jokes</p><p>The rest of dinner went without  much word\nfrom you and afterwards you all stay seated around the dining table eating\ndessert drinking more wine and coffee </p><p>&ldquo;Oh my god Hazza! Yeh baked the cookies\ntoo?!” Anne asks after her first  bite</p><p>“Yes” you answer flatly for him </p><p>“Damn did you do <i>anything</i> today?” your father\nasks you</p><p>“No she..” Harry tries to answer for you </p><p>“I cleaned” you respond </p><p>“Wha’s in this?” Gemma  asks as she holds up a piece of cake on her fork</p><p>“So  good!” your mom comments</p><p> “And soft!” his mom adds</p><p>He shrugs smirking loving the compliments “can&rsquo;t\ngive away all my recipes!”  </p><p>“Yea but this is my recipe what did yeh add?”\nhis mom asks </p><p>He draws his lips together before imitating a\nzipper being closed on them with his fingers .You want this night to be over already by now. Your pride is defeated. Nothing that you did went right and everyone knows you can&rsquo;t do much of anything. Your\nmom was relentless about your lack of cooking skills the alcohol getting to her\nwhich makes everyone laugh all night at you. When they start leaving you smile and say your\ngoodbyes kissing away any hopes of being Mrs. Styles  because there&rsquo;s no way Anne Twist is  going to let you marry her son not when you\ncouldn&rsquo;t even bake cookies! </p><p>You rush to the kitchen to clean up the dishes. Harry walks into the kitchen happily sighing\n“you&rsquo;re dad is funny!” </p><p>“Yea!” you say focusing all your negative energy\non the spots on the dishes</p><p>“Do they really call you butterfly?” he asks\namused</p><p>“Yea” you say flatly </p><p>“Cute!” he says with a boyish grin </p><p>You plug away going through the dishes quickly</p><p>“Oh don&rsquo;t clean those we can do it tomorrow” he\n tries to stop you from cleaning the pots </p><p>“I would rather do it tonight” you say not\nstopping </p><p>“Well m tired from all that cooking<i> I</i>\ndid” he jokes “mind  if i watch some tele?” </p><p>“No!” you say feeling your anger coming to a\nboil. Your feet were sore all he did all day was sit by the island\nmicromanaging only getting up to fix your mistakes. He kisses you on the cheek\nbefore walking away. You spend about an hour cleaning up. </p><p>“I’m done going upstairs” you say to Harry as you dry your hands</p><p> “ ‘M coming wait’f me” he says turning off the\nTV. He hums walking up with you</p><p>You&rsquo;re so irritated at this point you&rsquo;re rolling your eyes at the littlest things as you walk into the closet as he follows</p><p>He chuckles &quot;Gem is crazy!” he says\nremembering a joke she told </p><p>You look around ignoring him “And your mum calling me ‘great’ that was\nendearing of her, she&rsquo;s such a darling ” he says smiling watching you</p><p>“Yea” you respond not paying attention to him. Finally  he realizes you&rsquo;re  in a sour\nmood</p><p>“Yeh ok pet?” he asks staring at you angrily\nshuffle through things in the drawer</p><p>“Yea!” you say sarcastically  </p><p>“Harry the <i>great</i>!”\nyou grunt pulling open the drawer </p><p>“What?”  he chuckles slightly </p><p>“Harry the great!” you start as you undress\naggressively  </p><p>“Harry the great singer! Harry the great musician! Harry the\ngreat producer! Harry the great actor! Harry  the great chef!” you slam\nthe drawer closed</p><p>He laughs at your antics “where&rsquo;s this comin from?”</p><p>&quot;Y/N the walking sack of shit who cant even\nboil water” you speak walking around picking up your discarded clothes</p><p>His laughter quickly dies down realizing what\nyou said “wait what?”</p><p>You sigh walking into bathroom mumbling ”Y/N the\nterrible! Y/N the terrible chef eat her food and you might die!” you&rsquo;re being\ntheatrical and sarcastic waving your hands in the air to keep from  crying</p><p> “Babe” his brow furrows. Unsure if you&rsquo;re joking\nor not</p><p>“Y/N the shitty homemaker! Y/N waste of space!” </p><p>“Oi!” he yells “stop it! wha&rsquo;s gotten yeh in\nthis pissy mood?” he asks realizing you were very serious </p><p>“Nothing!” you say walking past him </p><p>“Wha do yeh mean nothin?  wha’s up with the\nattitude?” He asks following you into the bedroom</p><p>“I’m fine, good night” you answer softly He watches you yank the covers back before\ngetting in bed. He stares before going into the closet to change clothes. He\nhas no idea why you are in such a bad mood you seemed fine earlier. He gets in bed and looks at you one more time“Y/N” he calls moving closer to you  </p><p>“<i>Good</i> <i>night</i> Harry” you stress\nsoftly turning away from him hiding your tears, he sighs turning the\n other way.</p><p>In the morning you&rsquo;re gone without good morning</p><p><i>Harry: no good morning today?</i> he texts you </p><p><i>Y/N: sorry big meeting today</i></p><p>He  knows you&rsquo;re lying you would have told\nhim earlier that week if it was true</p><p><i>Harry: whats wrong pet</i></p><p><i>Y/N: nothing. im cool as a cucumber</i></p><p><i> Y/N: gotta go text later love you</i></p><p>He still can&rsquo;t understand what happened so he\ncalls Alexa his best friend to figure things out </p><p>“Harold!</p><p>”“Aallleeeexaaaa!” he says </p><p>She  laughs “up early” </p><p>“Well couldn&rsquo;t sleep” </p><p>“Please Harry  my precious ears don&rsquo;t need\nto hear that!” she  complains </p><p>He chuckles “no i think Y/N is mad at me” </p><p>“What did you do?”</p><p>“Nothing!”</p><p>“Uh huh so shes mad for no reason?” she asks “</p><p>Yes!”</p><p>“Harry” she doesn&rsquo;t  believe him </p><p>“I did nothing i promise!” </p><p>“Well lets just  figure out where you went\nwrong”</p><p>He sighed in response </p><p>“Oh how was the  dinner by the way?” </p><p>“Amazing everyone had a blast!” he said smiling</p><p>“Good. Sooo did you call her fat?” </p><p>“Really? no”</p><p>“Just asking&hellip;.insult her cooking?”  </p><p>“ M not stupid no” Alexa laughed “But she kept telling everyone i cooked don&rsquo; kno\nwhy”</p><p>“Did you?”</p><p>“Well&hellip;”</p><p>“Seriously?” she said in a flat tone </p><p>“I didn&rsquo;t cook <i>that much</i> she did majority of\nit!” he argued</p><p>*So let me guess you did the Harry thing\novershadowed?” </p><p>“No i didnt!” he defends himself</p><p>“So you didn&rsquo;t  <i>add</i> your own\ningredients?” He remained silent </p><p>“Uh huh! i see told her to do it <i>your</i> way\ninstead” </p><p>He  sighed “just trying to help” he mumbled  </p><p>“Not like that you idiot!”</p><p>“Oi!” </p><p>“You do that shit to me all the time  its\nreally annoying can’t  imagine being your\ngirlfriend and trying to impress your family” she sang the last part </p><p>“Oooh” he responded softly</p><p>“Yea oooh”</p><p>“Fuck” he whispered “i was just”</p><p>“Just nothing you fucked up” she teased</p><p>He sighed  “now what do i do?”</p><p>“I don&rsquo;t know thats a doozy, i gotta run text me\nwhen you come up with a resolution maybe i can save you more trouble!”</p><p>He honestly was just trying to help. He could\napologize plus your cooking wasn&rsquo;t <i>that</i> bad. He had no time to think of\nother ideas because he was to be at the studio soon. </p><p>Even though he was in the\nstudio his mind drifted to you often so he snuck away to call you.“Hello?”  you answer </p><p>“Hi butterfly” he speaks softly </p><p>“Hi Harry” you greet. “Are you ok?” he never\ncalls when he’s in the studio</p><p>“Yea&hellip;.hows your day?”</p><p>You shrug “just work..” its awkward “how&rsquo;s\nyours?”</p><p>“Good ok i guess&hellip; can we talk bout last\nnight?”</p><p>“No” you say in a flat tone</p><p>“Come on pet i&hellip;” </p><p>You interrupt him “im not talking about it so if\nyou have nothing to say im hanging up” you’re beyond irritated </p><p>“No don&rsquo;t!”&hellip;  he  remained \nsilent “Y/N” </p><p>“Harry” your tone  warns him</p><p>He feels worse “pet please”</p><p>“Go back you have things to do” you reason  “see you at home I love you” </p><p>He sighed deeply “love you too” He did his best rushed through songs. You\nhowever didn&rsquo;t get  home till late and you met a sleeping Harry. You did\nyour best to be silent and sneak into bed but he felt the dip in the mattress.</p><p>“Pet?” he asks turning his head to face you </p><p>“Yes good night” you say  kissing his lips\nand laying  down</p><p>He sighs turning on his lamp “Y/N” </p><p>“Go back to sleep Harry” you stress </p><p>“No not good night!” he says turning you around\nto face him “Now we&rsquo;re gonna talk about this whether yeh like it or not!”</p><p>“Harry” you fuss</p><p>“Seriously over dinner?” You look at him with a blank  face “I didn’t even do anything was jus’ trying to\nhelp I&rsquo;m sorry if i offended yeh” now he was the one that was irritated  You still say nothing as he is looking at you\nfor a response  “Yeh could have said yeh cooked i wouldn&rsquo;t have\nminded its just food!” You still give him a blank stare “Oh for the luv of! Bloody say something!” he\ncommands </p><p>You sigh and turn to look at the ceiling “it\nwasn’t a stupid dinner maybe to you it was but it meant more than that to me”\nyou feel the tears well up. “I was supposed to make it perfect the whole house\nbut you kept <i>fixing</i> things.” The first  tear rolled down your face\n“then you wouldn&rsquo;t let me cook i had the recipes i was doing exactly what was\nwritten down. Then here you come correcting and adding shit. You undermined <i>everything\n</i>i did that day, like you didn’t trust that i could make anything good\nenough for your family.” You now dig the heels of your hands to your eyes\ntrying to stop the flow</p><p>“Pet” he said softly feeling awful about his\nactions </p><p>“What mother wants her son to be with a woman\nwho can’t even cook Harry?!”. </p><p>He frowned “my mum” </p><p>“You wouldn&rsquo;t even let me pour a glass of wine!”</p><p>He remained silent “I blew my chances” you turn over “good night Harry”</p><p>He goes to open his mouth but can&rsquo;t find the\nright words any words to make things better</p><p>You sigh when you feel him lay back down wiping your tears</p><p>The next morning it&rsquo;s Friday and you drag your\nbody out of bed before the alarm goes off not like you slept, you have been battling\na tension headache. You get ready and go to the kitchen and make Harry&rsquo;s\nsmoothie before leaving resuming your routine. You go back upstairs and  push his hair out\nof his face he shifts around “Good morning” you whisper before kissing his\ncheek signaling his que to wake-up and you&rsquo;re out the door. At work your productive enough so you leave\nearly. Your headache finally calmed down after 4 Advil pills. You grab your\nthings and drive home it&rsquo;s 2 o'clock so Harry should still be in the studio.\nWhen you pull up to your driveway you don&rsquo;t see his car so you sigh in relief,\nyou did  not wish to recap last night your emotions got the best of you,\nyou don&rsquo;t even know why you complained about the wine situation he always\npoured wine for your guests. </p><p>As you walk in the door however you almost\nfreeze seeing Harry sitting by the couch listening to his music writing.</p><p>“Pet home early!” he says with a smile on his\nface </p><p>“Yea got finished early” you speak softly “why\nare you home? thought you had studio time” </p><p>“Eh Jeff ‘nd I got into a heated discussion” he\njokes “thought it’d be best if we cooled off” He was lying he spent all day at\nhome waiting for you making calls and the fact that you were early made it\nperfect because now you couldn&rsquo;t say no. “Glad yeh’r home early! Would like to\ntake yeh on a date”</p><p>“Why?” you ask suspicious of his motives </p><p>He stands up “Yeh’r my girlfriend and its been 2\nweeks too long”</p><p>“Oh i didn’t mean like that sorry” </p><p>“Don’ worry bout it&hellip;So can i?” he asks you </p><p>“What am i supposed to wear?”</p><p>“Anything yeh look amazing in anything!” he\nsmiles </p><p>“Yea but i don&rsquo;t know,  where we are\ngoing?”</p><p>“A cute dress!” he solved your riddle </p><p>You nod walking away. He hates the fact that you had become insecure\nabout <i>everything</i>. You stood there with your puppy eyes and slightly pouty\nlip playing nervously with your fingers looking at him which was killing him to\nnot hug you and give you reassuring kisses. You take 2 hours to get ready the outfit was the\nissue finally deciding on a bodycon maxi dress and you threw your hair up into\na low messy updo.</p><p>You walk down the stairs barefoot “Ready?” Harry asks </p><p>You shake your head “which shoes?” you ask\n holding up 2 pairs of heel sandals</p><p>“Hmmm”  he smiles tapping his lip and\nstands up walking over to you he looks at them “try them on let me see” he\nanalyzes and judges and picks his favorite </p><p>“Ok\nready” you say after putting on the shoes </p><p>“You look amazing as always” he compliments </p><p>“Thank you” You drive in silence to a high end Restaurant on\nthe rooftop  of a tower down town You already know what you want as you both skim\nthe menu but right now going over every single item included in each meal is\nbetter than addressing the issue. He clears his throat and you look up and smile.\nHe places his hand on the table and you gently place yours in his. </p><p>“So..” he begins He is interrupted by the waiter </p><p>“Welcome to\nBequoia!  Would you like to try our Cabernet?”  <br/></p><p>\nHarry answers “Yes we would thank you!” He walked away and returned promptly “Do you know what you would like?”</p><p> “Salmon” you say </p><p>“Steak”  </p><p>“How would you like that cooked sir?”</p><p>“Medium”</p><p>“Ok I will have that right out for you” </p><p>“Can yeh also bring another bottle of Cabernet\nplease?” </p><p>“Absolutely!”</p><p> He looked at you and rubbed the back of your\nhand with his thumb “Pet i apologize for how i behaved” You smile “S not that i didn&rsquo;t think yeh would be good\nenough its a problem of mine’nd if yeh want i will eat all your cooking!” he\noffers up a smile to make you feel better You barely smile in response “Never meant to. I just have a serious\nproblem&hellip; perfectionist.” </p><p>“Its ok Harry, shouldn’t have been so sensitive”  you say softly and wipe\nyour tears away </p><p>“No its not pet” he moves towards you “i&rsquo;m sorry\nplease don’t cry” he wraps his arm around you pulling you closer You nod and fight against the tears </p><p>“Im sorry pet please” he begs</p><p>“It&rsquo;s ok Harry you apologized”  </p><p>“But you&rsquo;re crying” </p><p>You giggle “Because I&rsquo;m weird” you joke </p>",
        "reblog": {
            "comment": "<p>I feel bad that I seriously suck at posting. I just over analyze everything. I wrote this LAST year during holiday season and we are right around the corner from that. But here you go </p><p>All day Harry had been\ndoing it. <i>All</i> damn day! It was your first holiday together and you and\nHarry had decided to host dinner. You had the recipes from your mother and his.\nYou followed the recipes to a ‘T’ ;however all day Harry kept interjecting.</p><p><i>“lets add a little brown sugar!”,</i><i>“take the cookies out luv might burn the bottom,\ndon wan tha”,</i><i>“add more salt not there yet kinda bland”,</i><i>“dice them smaller want the <u>taste</u> not the\n<u>chunks</u>”, </i><i>“You have to baste it often or it would dry up\nup top”, </i><i>“lets add this(wine) make the taste more bold!”</i></p><p>And <i>now</i> he had just hip bumped you over\nto the side complaining the sauce was burning and you weren’t stirring it fast\nenough turning down the  heat even after you said you got it he was still\nmicromanaging, taking over. You huffed grabbing a bottle of water from the\nfridge, before going up the stairs to get ready they were arriving in 2 hours\nyou were so angry you slam the door behind you. It was the slam that caught his\nattention quickly he jogged up the  stairs “Pet re yeh alright?”</p><p>“Yes!” you yell from inside the closet</p><p>“Wha’ re yeh doin’?”</p><p>“Getting ready!”</p><p>“K m gonna head down i added some red wine to\nthe sauce it tastes amazing!” he said excitedly </p><p>“Ok!” you say disinterested. You wanted this to be perfect you wanted his\nfamily to know you could be a great home keeper and take care of him. More\nimportantly you wanted everyone to know you would be a great wife when the time\ncame but Harry proved you wrong. You worried that maybe his micromanaging was\nbecause you were a terrible home keeper the readjustment of pillows and table\nscaping on the dining table and trinkets around your shared home. He\nthought you didn’t realize but you did, you thought nothing of it at first but,\nnow it was like a sign a subliminal loud bright neon sign ‘you are shit at\nthis!’</p><p>You get ready on a simple dress with a floor\nlength cardigan on. </p><p>“Ready?” Harry asks walking into the bathroom</p><p>“Yes” you answer</p><p>He wraps his arms around you “wow babe yeh look\namazin’ ” </p><p>“Thanks” you say flatly pushing him off</p><p> He doesn’t catch on he’s too excited. Excited to\nsee his family. </p><p>When everyone arrived they greet you both with loving arms and\nmessages bringing you  both gifts. Immediately you usher them to the\ndining room as they admire the new décor around the house. You go to open a\nbottle of wine only for Harry to grab it out of your hand</p><p>“I got this have a seat babe, know there’s a way\nto pour wine” he fills the glasses before raising his “to family nd luv’ ”</p><p>You all repeat  “to family and love”\nclanking each others glasses </p><p>“lets eat!” 5 minutes pass by and there’s the first\ncompliment</p><p>“This chicken is soo good have you tried it\nmum?”  Gemma asks</p><p>“Not yet still eating the risotto it’s amazing!” </p><p>“Yea Y/N you did a good job!” your mom speaks to\nyou</p><p>You shake your head “I didn’t cook Harry did, good job babe”\nand honestly it really was good </p><p>“Harry you cook!?” your mom asks surprised</p><p>“Yes Mrs. Y/L/N” he says proudly </p><p>“Oh good! Is there nothing you can’t do?”</p><p>He smiles in response loving the compliment </p><p>“Anyway we were worried Y/N would be\nfeeding you box dinners and take out everyday!”  she jokes making everyone else laugh. You give a tight lipped smile </p><p>“Oh no she did most of the work I just helped”  </p><p>“Really is it true butterfly (your nickname)?”\nyour mom asks you </p><p>You sigh “No Harry cooked” you say once again\nshaking your head </p><p>“You know I always got on her on learning to\ncook! Back in my day women had to know how to cook or you wouldn’t get\nmarried!” </p><p>“That’s very true Hazza your mimi would get on me all the time” Anne chimes in<br></p><p>“Oh silly tradition” Harry reasons </p><p>“Yea but i still think she should learn\nsomething if she wants to be a mother” your father scolds “mac and cheese even”</p><p>“I’ll learn dad so i can feed you when you’re\nold” you try to joke back making the table laugh a little</p><p>“Oh i don’t mind..”  </p><p>“Harry what did you put in this chicken?”\nGemma’s Boyfriend Sean asks</p><p> He smiles “I’ll give you the recipe mate ” </p><p>“Please do so i can impress your sister”\n he jokes</p><p>The rest of dinner went without  much word\nfrom you and afterwards you all stay seated around the dining table eating\ndessert drinking more wine and coffee </p><p>“Oh my god Hazza! Yeh baked the cookies\ntoo?!” Anne asks after her first  bite</p><p>“Yes” you answer flatly for him </p><p>“Damn did you do <i>anything</i> today?” your father\nasks you</p><p>“No she..” Harry tries to answer for you </p><p>“I cleaned” you respond </p><p>“Wha’s in this?” Gemma  asks as she holds up a piece of cake on her fork</p><p>“So  good!” your mom comments</p><p> “And soft!” his mom adds</p><p>He shrugs smirking loving the compliments “can’t\ngive away all my recipes!”  </p><p>“Yea but this is my recipe what did yeh add?”\nhis mom asks </p><p>He draws his lips together before imitating a\nzipper being closed on them with his fingers .You want this night to be over already by now. Your pride is defeated. Nothing that you did went right and everyone knows you can’t do much of anything. Your\nmom was relentless about your lack of cooking skills the alcohol getting to her\nwhich makes everyone laugh all night at you. When they start leaving you smile and say your\ngoodbyes kissing away any hopes of being Mrs. Styles  because there’s no way Anne Twist is  going to let you marry her son not when you\ncouldn’t even bake cookies! </p><p>You rush to the kitchen to clean up the dishes. Harry walks into the kitchen happily sighing\n“you’re dad is funny!” </p><p>“Yea!” you say focusing all your negative energy\non the spots on the dishes</p><p>“Do they really call you butterfly?” he asks\namused</p><p>“Yea” you say flatly </p><p>“Cute!” he says with a boyish grin </p><p>You plug away going through the dishes quickly</p><p>“Oh don’t clean those we can do it tomorrow” he\n tries to stop you from cleaning the pots </p><p>“I would rather do it tonight” you say not\nstopping </p><p>“Well m tired from all that cooking<i> I</i>\ndid” he jokes “mind  if i watch some tele?” </p><p>“No!” you say feeling your anger coming to a\nboil. Your feet were sore all he did all day was sit by the island\nmicromanaging only getting up to fix your mistakes. He kisses you on the cheek\nbefore walking away. You spend about an hour cleaning up. </p><p>“I’m done going upstairs” you say to Harry as you dry your hands</p><p> “ ‘M coming wait’f me” he says turning off the\nTV. He hums walking up with you</p><p>You’re so irritated at this point you’re rolling your eyes at the littlest things as you walk into the closet as he follows</p><p>He chuckles \"Gem is crazy!” he says\nremembering a joke she told </p><p>You look around ignoring him “And your mum calling me ‘great’ that was\nendearing of her, she’s such a darling ” he says smiling watching you</p><p>“Yea” you respond not paying attention to him. Finally  he realizes you’re  in a sour\nmood</p><p>“Yeh ok pet?” he asks staring at you angrily\nshuffle through things in the drawer</p><p>“Yea!” you say sarcastically  </p><p>“Harry the <i>great</i>!”\nyou grunt pulling open the drawer </p><p>“What?”  he chuckles slightly </p><p>“Harry the great!” you start as you undress\naggressively  </p><p>“Harry the great singer! Harry the great musician! Harry the\ngreat producer! Harry the great actor! Harry  the great chef!” you slam\nthe drawer closed</p><p>He laughs at your antics “where’s this comin from?”</p><p>\"Y/N the walking sack of shit who cant even\nboil water” you speak walking around picking up your discarded clothes</p><p>His laughter quickly dies down realizing what\nyou said “wait what?”</p><p>You sigh walking into bathroom mumbling ”Y/N the\nterrible! Y/N the terrible chef eat her food and you might die!” you’re being\ntheatrical and sarcastic waving your hands in the air to keep from  crying</p><p> “Babe” his brow furrows. Unsure if you’re joking\nor not</p><p>“Y/N the shitty homemaker! Y/N waste of space!” </p><p>“Oi!” he yells “stop it! wha’s gotten yeh in\nthis pissy mood?” he asks realizing you were very serious </p><p>“Nothing!” you say walking past him </p><p>“Wha do yeh mean nothin?  wha’s up with the\nattitude?” He asks following you into the bedroom</p><p>“I’m fine, good night” you answer softly He watches you yank the covers back before\ngetting in bed. He stares before going into the closet to change clothes. He\nhas no idea why you are in such a bad mood you seemed fine earlier. He gets in bed and looks at you one more time“Y/N” he calls moving closer to you  </p><p>“<i>Good</i> <i>night</i> Harry” you stress\nsoftly turning away from him hiding your tears, he sighs turning the\n other way.</p><p>In the morning you’re gone without good morning</p><p><i>Harry: no good morning today?</i> he texts you </p><p><i>Y/N: sorry big meeting today</i></p><p>He  knows you’re lying you would have told\nhim earlier that week if it was true</p><p><i>Harry: whats wrong pet</i></p><p><i>Y/N: nothing. im cool as a cucumber</i></p><p><i> Y/N: gotta go text later love you</i></p><p>He still can’t understand what happened so he\ncalls Alexa his best friend to figure things out </p><p>“Harold!</p><p>”“Aallleeeexaaaa!” he says </p><p>She  laughs “up early” </p><p>“Well couldn’t sleep” </p><p>“Please Harry  my precious ears don’t need\nto hear that!” she  complains </p><p>He chuckles “no i think Y/N is mad at me” </p><p>“What did you do?”</p><p>“Nothing!”</p><p>“Uh huh so shes mad for no reason?” she asks “</p><p>Yes!”</p><p>“Harry” she doesn’t  believe him </p><p>“I did nothing i promise!” </p><p>“Well lets just  figure out where you went\nwrong”</p><p>He sighed in response </p><p>“Oh how was the  dinner by the way?” </p><p>“Amazing everyone had a blast!” he said smiling</p><p>“Good. Sooo did you call her fat?” </p><p>“Really? no”</p><p>“Just asking….insult her cooking?”  </p><p>“ M not stupid no” Alexa laughed “But she kept telling everyone i cooked don’ kno\nwhy”</p><p>“Did you?”</p><p>“Well…”</p><p>“Seriously?” she said in a flat tone </p><p>“I didn’t cook <i>that much</i> she did majority of\nit!” he argued</p><p>*So let me guess you did the Harry thing\novershadowed?” </p><p>“No i didnt!” he defends himself</p><p>“So you didn’t  <i>add</i> your own\ningredients?” He remained silent </p><p>“Uh huh! i see told her to do it <i>your</i> way\ninstead” </p><p>He  sighed “just trying to help” he mumbled  </p><p>“Not like that you idiot!”</p><p>“Oi!” </p><p>“You do that shit to me all the time  its\nreally annoying can’t  imagine being your\ngirlfriend and trying to impress your family” she sang the last part </p><p>“Oooh” he responded softly</p><p>“Yea oooh”</p><p>“Fuck” he whispered “i was just”</p><p>“Just nothing you fucked up” she teased</p><p>He sighed  “now what do i do?”</p><p>“I don’t know thats a doozy, i gotta run text me\nwhen you come up with a resolution maybe i can save you more trouble!”</p><p>He honestly was just trying to help. He could\napologize plus your cooking wasn’t <i>that</i> bad. He had no time to think of\nother ideas because he was to be at the studio soon. </p><p>Even though he was in the\nstudio his mind drifted to you often so he snuck away to call you.“Hello?”  you answer </p><p>“Hi butterfly” he speaks softly </p><p>“Hi Harry” you greet. “Are you ok?” he never\ncalls when he’s in the studio</p><p>“Yea….hows your day?”</p><p>You shrug “just work..” its awkward “how’s\nyours?”</p><p>“Good ok i guess… can we talk bout last\nnight?”</p><p>“No” you say in a flat tone</p><p>“Come on pet i…” </p><p>You interrupt him “im not talking about it so if\nyou have nothing to say im hanging up” you’re beyond irritated </p><p>“No don’t!”…  he  remained \nsilent “Y/N” </p><p>“Harry” your tone  warns him</p><p>He feels worse “pet please”</p><p>“Go back you have things to do” you reason  “see you at home I love you” </p><p>He sighed deeply “love you too” He did his best rushed through songs. You\nhowever didn’t get  home till late and you met a sleeping Harry. You did\nyour best to be silent and sneak into bed but he felt the dip in the mattress.</p><p>“Pet?” he asks turning his head to face you </p><p>“Yes good night” you say  kissing his lips\nand laying  down</p><p>He sighs turning on his lamp “Y/N” </p><p>“Go back to sleep Harry” you stress </p><p>“No not good night!” he says turning you around\nto face him “Now we’re gonna talk about this whether yeh like it or not!”</p><p>“Harry” you fuss</p><p>“Seriously over dinner?” You look at him with a blank  face “I didn’t even do anything was jus’ trying to\nhelp I’m sorry if i offended yeh” now he was the one that was irritated  You still say nothing as he is looking at you\nfor a response  “Yeh could have said yeh cooked i wouldn’t have\nminded its just food!” You still give him a blank stare “Oh for the luv of! Bloody say something!” he\ncommands </p><p>You sigh and turn to look at the ceiling “it\nwasn’t a stupid dinner maybe to you it was but it meant more than that to me”\nyou feel the tears well up. “I was supposed to make it perfect the whole house\nbut you kept <i>fixing</i> things.” The first  tear rolled down your face\n“then you wouldn’t let me cook i had the recipes i was doing exactly what was\nwritten down. Then here you come correcting and adding shit. You undermined <i>everything\n</i>i did that day, like you didn’t trust that i could make anything good\nenough for your family.” You now dig the heels of your hands to your eyes\ntrying to stop the flow</p><p>“Pet” he said softly feeling awful about his\nactions </p><p>“What mother wants her son to be with a woman\nwho can’t even cook Harry?!”. </p><p>He frowned “my mum” </p><p>“You wouldn’t even let me pour a glass of wine!”</p><p>He remained silent “I blew my chances” you turn over “good night Harry”</p><p>He goes to open his mouth but can’t find the\nright words any words to make things better</p><p>You sigh when you feel him lay back down wiping your tears</p><p>The next morning it’s Friday and you drag your\nbody out of bed before the alarm goes off not like you slept, you have been battling\na tension headache. You get ready and go to the kitchen and make Harry’s\nsmoothie before leaving resuming your routine. You go back upstairs and  push his hair out\nof his face he shifts around “Good morning” you whisper before kissing his\ncheek signaling his que to wake-up and you’re out the door. At work your productive enough so you leave\nearly. Your headache finally calmed down after 4 Advil pills. You grab your\nthings and drive home it’s 2 o'clock so Harry should still be in the studio.\nWhen you pull up to your driveway you don’t see his car so you sigh in relief,\nyou did  not wish to recap last night your emotions got the best of you,\nyou don’t even know why you complained about the wine situation he always\npoured wine for your guests. </p><p>As you walk in the door however you almost\nfreeze seeing Harry sitting by the couch listening to his music writing.</p><p>“Pet home early!” he says with a smile on his\nface </p><p>“Yea got finished early” you speak softly “why\nare you home? thought you had studio time” </p><p>“Eh Jeff ‘nd I got into a heated discussion” he\njokes “thought it’d be best if we cooled off” He was lying he spent all day at\nhome waiting for you making calls and the fact that you were early made it\nperfect because now you couldn’t say no. “Glad yeh’r home early! Would like to\ntake yeh on a date”</p><p>“Why?” you ask suspicious of his motives </p><p>He stands up “Yeh’r my girlfriend and its been 2\nweeks too long”</p><p>“Oh i didn’t mean like that sorry” </p><p>“Don’ worry bout it…So can i?” he asks you </p><p>“What am i supposed to wear?”</p><p>“Anything yeh look amazing in anything!” he\nsmiles </p><p>“Yea but i don’t know,  where we are\ngoing?”</p><p>“A cute dress!” he solved your riddle </p><p>You nod walking away. He hates the fact that you had become insecure\nabout <i>everything</i>. You stood there with your puppy eyes and slightly pouty\nlip playing nervously with your fingers looking at him which was killing him to\nnot hug you and give you reassuring kisses. You take 2 hours to get ready the outfit was the\nissue finally deciding on a bodycon maxi dress and you threw your hair up into\na low messy updo.</p><p>You walk down the stairs barefoot “Ready?” Harry asks </p><p>You shake your head “which shoes?” you ask\n holding up 2 pairs of heel sandals</p><p>“Hmmm”  he smiles tapping his lip and\nstands up walking over to you he looks at them “try them on let me see” he\nanalyzes and judges and picks his favorite </p><p>“Ok\nready” you say after putting on the shoes </p><p>“You look amazing as always” he compliments </p><p>“Thank you” You drive in silence to a high end Restaurant on\nthe rooftop  of a tower down town You already know what you want as you both skim\nthe menu but right now going over every single item included in each meal is\nbetter than addressing the issue. He clears his throat and you look up and smile.\nHe places his hand on the table and you gently place yours in his. </p><p>“So..” he begins He is interrupted by the waiter </p><p>“Welcome to\nBequoia!  Would you like to try our Cabernet?”  <br></p><p>\nHarry answers “Yes we would thank you!” He walked away and returned promptly “Do you know what you would like?”</p><p> “Salmon” you say </p><p>“Steak”  </p><p>“How would you like that cooked sir?”</p><p>“Medium”</p><p>“Ok I will have that right out for you” </p><p>“Can yeh also bring another bottle of Cabernet\nplease?” </p><p>“Absolutely!”</p><p> He looked at you and rubbed the back of your\nhand with his thumb “Pet i apologize for how i behaved” You smile “S not that i didn’t think yeh would be good\nenough its a problem of mine’nd if yeh want i will eat all your cooking!” he\noffers up a smile to make you feel better You barely smile in response “Never meant to. I just have a serious\nproblem… perfectionist.” </p><p>“Its ok Harry, shouldn’t have been so sensitive”  you say softly and wipe\nyour tears away </p><p>“No its not pet” he moves towards you “i’m sorry\nplease don’t cry” he wraps his arm around you pulling you closer You nod and fight against the tears </p><p>“Im sorry pet please” he begs</p><p>“It’s ok Harry you apologized”  </p><p>“But you’re crying” </p><p>You giggle “Because I’m weird” you joke </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "harryff",
                    "active": true,
                    "theme": {
                        "header_full_width": 750,
                        "header_full_height": 1129,
                        "header_focus_width": 750,
                        "header_focus_height": 421,
                        "avatar_shape": "square",
                        "background_color": "#FFF796",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "7,750,428,0",
                        "header_image": "https://static.tumblr.com/c11c238be1171ce0ccfdc274f4010f58/fhatiu1/1fPoxjj77/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/c11c238be1171ce0ccfdc274f4010f58/fhatiu1/LZjoxjj78/tumblr_static_tumblr_static_filename_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/c11c238be1171ce0ccfdc274f4010f58/fhatiu1/1fPoxjj77/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#602C82",
                        "show_avatar": true,
                        "show_description": false,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178818848652"
                },
                "content_raw": "<p>I feel bad that I seriously suck at posting. I just over analyze everything. I wrote this LAST year during holiday season and we are right around the corner from that. But here you go </p><p>All day Harry had been\ndoing it. <i>All</i> damn day! It was your first holiday together and you and\nHarry had decided to host dinner. You had the recipes from your mother and his.\nYou followed the recipes to a ‘T’ ;however all day Harry kept interjecting.</p><p><i>“lets add a little brown sugar!”,</i><i>“take the cookies out luv might burn the bottom,\ndon wan tha”,</i><i>“add more salt not there yet kinda bland”,</i><i>“dice them smaller want the <u>taste</u> not the\n<u>chunks</u>”, </i><i>“You have to baste it often or it would dry up\nup top”, </i><i>“lets add this(wine) make the taste more bold!”</i></p><p>And <i>now</i> he had just hip bumped you over\nto the side complaining the sauce was burning and you weren’t stirring it fast\nenough turning down the  heat even after you said you got it he was still\nmicromanaging, taking over. You huffed grabbing a bottle of water from the\nfridge, before going up the stairs to get ready they were arriving in 2 hours\nyou were so angry you slam the door behind you. It was the slam that caught his\nattention quickly he jogged up the  stairs “Pet re yeh alright?”</p><p>“Yes!” you yell from inside the closet</p><p>“Wha’ re yeh doin’?”</p><p>“Getting ready!”</p><p>“K m gonna head down i added some red wine to\nthe sauce it tastes amazing!” he said excitedly </p><p>“Ok!” you say disinterested. You wanted this to be perfect you wanted his\nfamily to know you could be a great home keeper and take care of him. More\nimportantly you wanted everyone to know you would be a great wife when the time\ncame but Harry proved you wrong. You worried that maybe his micromanaging was\nbecause you were a terrible home keeper the readjustment of pillows and table\nscaping on the dining table and trinkets around your shared home. He\nthought you didn’t realize but you did, you thought nothing of it at first but,\nnow it was like a sign a subliminal loud bright neon sign ‘you are shit at\nthis!’</p><p>You get ready on a simple dress with a floor\nlength cardigan on. </p><p>“Ready?” Harry asks walking into the bathroom</p><p>“Yes” you answer</p><p>He wraps his arms around you “wow babe yeh look\namazin’ ” </p><p>“Thanks” you say flatly pushing him off</p><p> He doesn’t catch on he’s too excited. Excited to\nsee his family. </p><p>When everyone arrived they greet you both with loving arms and\nmessages bringing you  both gifts. Immediately you usher them to the\ndining room as they admire the new décor around the house. You go to open a\nbottle of wine only for Harry to grab it out of your hand</p><p>“I got this have a seat babe, know there’s a way\nto pour wine” he fills the glasses before raising his “to family nd luv’ ”</p><p>You all repeat  “to family and love”\nclanking each others glasses </p><p>“lets eat!” 5 minutes pass by and there’s the first\ncompliment</p><p>“This chicken is soo good have you tried it\nmum?”  Gemma asks</p><p>“Not yet still eating the risotto it’s amazing!” </p><p>“Yea Y/N you did a good job!” your mom speaks to\nyou</p><p>You shake your head “I didn’t cook Harry did, good job babe”\nand honestly it really was good </p><p>“Harry you cook!?” your mom asks surprised</p><p>“Yes Mrs. Y/L/N” he says proudly </p><p>“Oh good! Is there nothing you can’t do?”</p><p>He smiles in response loving the compliment </p><p>“Anyway we were worried Y/N would be\nfeeding you box dinners and take out everyday!”  she jokes making everyone else laugh. You give a tight lipped smile </p><p>“Oh no she did most of the work I just helped”  </p><p>“Really is it true butterfly (your nickname)?”\nyour mom asks you </p><p>You sigh “No Harry cooked” you say once again\nshaking your head </p><p>“You know I always got on her on learning to\ncook! Back in my day women had to know how to cook or you wouldn’t get\nmarried!” </p><p>“That’s very true Hazza your mimi would get on me all the time” Anne chimes in<br></p><p>“Oh silly tradition” Harry reasons </p><p>“Yea but i still think she should learn\nsomething if she wants to be a mother” your father scolds “mac and cheese even”</p><p>“I’ll learn dad so i can feed you when you’re\nold” you try to joke back making the table laugh a little</p><p>“Oh i don’t mind..”  </p><p>“Harry what did you put in this chicken?”\nGemma’s Boyfriend Sean asks</p><p> He smiles “I’ll give you the recipe mate ” </p><p>“Please do so i can impress your sister”\n he jokes</p><p>The rest of dinner went without  much word\nfrom you and afterwards you all stay seated around the dining table eating\ndessert drinking more wine and coffee </p><p>“Oh my god Hazza! Yeh baked the cookies\ntoo?!” Anne asks after her first  bite</p><p>“Yes” you answer flatly for him </p><p>“Damn did you do <i>anything</i> today?” your father\nasks you</p><p>“No she..” Harry tries to answer for you </p><p>“I cleaned” you respond </p><p>“Wha’s in this?” Gemma  asks as she holds up a piece of cake on her fork</p><p>“So  good!” your mom comments</p><p> “And soft!” his mom adds</p><p>He shrugs smirking loving the compliments “can’t\ngive away all my recipes!”  </p><p>“Yea but this is my recipe what did yeh add?”\nhis mom asks </p><p>He draws his lips together before imitating a\nzipper being closed on them with his fingers .You want this night to be over already by now. Your pride is defeated. Nothing that you did went right and everyone knows you can’t do much of anything. Your\nmom was relentless about your lack of cooking skills the alcohol getting to her\nwhich makes everyone laugh all night at you. When they start leaving you smile and say your\ngoodbyes kissing away any hopes of being Mrs. Styles  because there’s no way Anne Twist is  going to let you marry her son not when you\ncouldn’t even bake cookies! </p><p>You rush to the kitchen to clean up the dishes. Harry walks into the kitchen happily sighing\n“you’re dad is funny!” </p><p>“Yea!” you say focusing all your negative energy\non the spots on the dishes</p><p>“Do they really call you butterfly?” he asks\namused</p><p>“Yea” you say flatly </p><p>“Cute!” he says with a boyish grin </p><p>You plug away going through the dishes quickly</p><p>“Oh don’t clean those we can do it tomorrow” he\n tries to stop you from cleaning the pots </p><p>“I would rather do it tonight” you say not\nstopping </p><p>“Well m tired from all that cooking<i> I</i>\ndid” he jokes “mind  if i watch some tele?” </p><p>“No!” you say feeling your anger coming to a\nboil. Your feet were sore all he did all day was sit by the island\nmicromanaging only getting up to fix your mistakes. He kisses you on the cheek\nbefore walking away. You spend about an hour cleaning up. </p><p>“I’m done going upstairs” you say to Harry as you dry your hands</p><p> “ ‘M coming wait’f me” he says turning off the\nTV. He hums walking up with you</p><p>You’re so irritated at this point you’re rolling your eyes at the littlest things as you walk into the closet as he follows</p><p>He chuckles \"Gem is crazy!” he says\nremembering a joke she told </p><p>You look around ignoring him “And your mum calling me ‘great’ that was\nendearing of her, she’s such a darling ” he says smiling watching you</p><p>“Yea” you respond not paying attention to him. Finally  he realizes you’re  in a sour\nmood</p><p>“Yeh ok pet?” he asks staring at you angrily\nshuffle through things in the drawer</p><p>“Yea!” you say sarcastically  </p><p>“Harry the <i>great</i>!”\nyou grunt pulling open the drawer </p><p>“What?”  he chuckles slightly </p><p>“Harry the great!” you start as you undress\naggressively  </p><p>“Harry the great singer! Harry the great musician! Harry the\ngreat producer! Harry the great actor! Harry  the great chef!” you slam\nthe drawer closed</p><p>He laughs at your antics “where’s this comin from?”</p><p>\"Y/N the walking sack of shit who cant even\nboil water” you speak walking around picking up your discarded clothes</p><p>His laughter quickly dies down realizing what\nyou said “wait what?”</p><p>You sigh walking into bathroom mumbling ”Y/N the\nterrible! Y/N the terrible chef eat her food and you might die!” you’re being\ntheatrical and sarcastic waving your hands in the air to keep from  crying</p><p> “Babe” his brow furrows. Unsure if you’re joking\nor not</p><p>“Y/N the shitty homemaker! Y/N waste of space!” </p><p>“Oi!” he yells “stop it! wha’s gotten yeh in\nthis pissy mood?” he asks realizing you were very serious </p><p>“Nothing!” you say walking past him </p><p>“Wha do yeh mean nothin?  wha’s up with the\nattitude?” He asks following you into the bedroom</p><p>“I’m fine, good night” you answer softly He watches you yank the covers back before\ngetting in bed. He stares before going into the closet to change clothes. He\nhas no idea why you are in such a bad mood you seemed fine earlier. He gets in bed and looks at you one more time“Y/N” he calls moving closer to you  </p><p>“<i>Good</i> <i>night</i> Harry” you stress\nsoftly turning away from him hiding your tears, he sighs turning the\n other way.</p><p>In the morning you’re gone without good morning</p><p><i>Harry: no good morning today?</i> he texts you </p><p><i>Y/N: sorry big meeting today</i></p><p>He  knows you’re lying you would have told\nhim earlier that week if it was true</p><p><i>Harry: whats wrong pet</i></p><p><i>Y/N: nothing. im cool as a cucumber</i></p><p><i> Y/N: gotta go text later love you</i></p><p>He still can’t understand what happened so he\ncalls Alexa his best friend to figure things out </p><p>“Harold!</p><p>”“Aallleeeexaaaa!” he says </p><p>She  laughs “up early” </p><p>“Well couldn’t sleep” </p><p>“Please Harry  my precious ears don’t need\nto hear that!” she  complains </p><p>He chuckles “no i think Y/N is mad at me” </p><p>“What did you do?”</p><p>“Nothing!”</p><p>“Uh huh so shes mad for no reason?” she asks “</p><p>Yes!”</p><p>“Harry” she doesn’t  believe him </p><p>“I did nothing i promise!” </p><p>“Well lets just  figure out where you went\nwrong”</p><p>He sighed in response </p><p>“Oh how was the  dinner by the way?” </p><p>“Amazing everyone had a blast!” he said smiling</p><p>“Good. Sooo did you call her fat?” </p><p>“Really? no”</p><p>“Just asking….insult her cooking?”  </p><p>“ M not stupid no” Alexa laughed “But she kept telling everyone i cooked don’ kno\nwhy”</p><p>“Did you?”</p><p>“Well…”</p><p>“Seriously?” she said in a flat tone </p><p>“I didn’t cook <i>that much</i> she did majority of\nit!” he argued</p><p>*So let me guess you did the Harry thing\novershadowed?” </p><p>“No i didnt!” he defends himself</p><p>“So you didn’t  <i>add</i> your own\ningredients?” He remained silent </p><p>“Uh huh! i see told her to do it <i>your</i> way\ninstead” </p><p>He  sighed “just trying to help” he mumbled  </p><p>“Not like that you idiot!”</p><p>“Oi!” </p><p>“You do that shit to me all the time  its\nreally annoying can’t  imagine being your\ngirlfriend and trying to impress your family” she sang the last part </p><p>“Oooh” he responded softly</p><p>“Yea oooh”</p><p>“Fuck” he whispered “i was just”</p><p>“Just nothing you fucked up” she teased</p><p>He sighed  “now what do i do?”</p><p>“I don’t know thats a doozy, i gotta run text me\nwhen you come up with a resolution maybe i can save you more trouble!”</p><p>He honestly was just trying to help. He could\napologize plus your cooking wasn’t <i>that</i> bad. He had no time to think of\nother ideas because he was to be at the studio soon. </p><p>Even though he was in the\nstudio his mind drifted to you often so he snuck away to call you.“Hello?”  you answer </p><p>“Hi butterfly” he speaks softly </p><p>“Hi Harry” you greet. “Are you ok?” he never\ncalls when he’s in the studio</p><p>“Yea….hows your day?”</p><p>You shrug “just work..” its awkward “how’s\nyours?”</p><p>“Good ok i guess… can we talk bout last\nnight?”</p><p>“No” you say in a flat tone</p><p>“Come on pet i…” </p><p>You interrupt him “im not talking about it so if\nyou have nothing to say im hanging up” you’re beyond irritated </p><p>“No don’t!”…  he  remained \nsilent “Y/N” </p><p>“Harry” your tone  warns him</p><p>He feels worse “pet please”</p><p>“Go back you have things to do” you reason  “see you at home I love you” </p><p>He sighed deeply “love you too” He did his best rushed through songs. You\nhowever didn’t get  home till late and you met a sleeping Harry. You did\nyour best to be silent and sneak into bed but he felt the dip in the mattress.</p><p>“Pet?” he asks turning his head to face you </p><p>“Yes good night” you say  kissing his lips\nand laying  down</p><p>He sighs turning on his lamp “Y/N” </p><p>“Go back to sleep Harry” you stress </p><p>“No not good night!” he says turning you around\nto face him “Now we’re gonna talk about this whether yeh like it or not!”</p><p>“Harry” you fuss</p><p>“Seriously over dinner?” You look at him with a blank  face “I didn’t even do anything was jus’ trying to\nhelp I’m sorry if i offended yeh” now he was the one that was irritated  You still say nothing as he is looking at you\nfor a response  “Yeh could have said yeh cooked i wouldn’t have\nminded its just food!” You still give him a blank stare “Oh for the luv of! Bloody say something!” he\ncommands </p><p>You sigh and turn to look at the ceiling “it\nwasn’t a stupid dinner maybe to you it was but it meant more than that to me”\nyou feel the tears well up. “I was supposed to make it perfect the whole house\nbut you kept <i>fixing</i> things.” The first  tear rolled down your face\n“then you wouldn’t let me cook i had the recipes i was doing exactly what was\nwritten down. Then here you come correcting and adding shit. You undermined <i>everything\n</i>i did that day, like you didn’t trust that i could make anything good\nenough for your family.” You now dig the heels of your hands to your eyes\ntrying to stop the flow</p><p>“Pet” he said softly feeling awful about his\nactions </p><p>“What mother wants her son to be with a woman\nwho can’t even cook Harry?!”. </p><p>He frowned “my mum” </p><p>“You wouldn’t even let me pour a glass of wine!”</p><p>He remained silent “I blew my chances” you turn over “good night Harry”</p><p>He goes to open his mouth but can’t find the\nright words any words to make things better</p><p>You sigh when you feel him lay back down wiping your tears</p><p>The next morning it’s Friday and you drag your\nbody out of bed before the alarm goes off not like you slept, you have been battling\na tension headache. You get ready and go to the kitchen and make Harry’s\nsmoothie before leaving resuming your routine. You go back upstairs and  push his hair out\nof his face he shifts around “Good morning” you whisper before kissing his\ncheek signaling his que to wake-up and you’re out the door. At work your productive enough so you leave\nearly. Your headache finally calmed down after 4 Advil pills. You grab your\nthings and drive home it’s 2 o'clock so Harry should still be in the studio.\nWhen you pull up to your driveway you don’t see his car so you sigh in relief,\nyou did  not wish to recap last night your emotions got the best of you,\nyou don’t even know why you complained about the wine situation he always\npoured wine for your guests. </p><p>As you walk in the door however you almost\nfreeze seeing Harry sitting by the couch listening to his music writing.</p><p>“Pet home early!” he says with a smile on his\nface </p><p>“Yea got finished early” you speak softly “why\nare you home? thought you had studio time” </p><p>“Eh Jeff ‘nd I got into a heated discussion” he\njokes “thought it’d be best if we cooled off” He was lying he spent all day at\nhome waiting for you making calls and the fact that you were early made it\nperfect because now you couldn’t say no. “Glad yeh’r home early! Would like to\ntake yeh on a date”</p><p>“Why?” you ask suspicious of his motives </p><p>He stands up “Yeh’r my girlfriend and its been 2\nweeks too long”</p><p>“Oh i didn’t mean like that sorry” </p><p>“Don’ worry bout it…So can i?” he asks you </p><p>“What am i supposed to wear?”</p><p>“Anything yeh look amazing in anything!” he\nsmiles </p><p>“Yea but i don’t know,  where we are\ngoing?”</p><p>“A cute dress!” he solved your riddle </p><p>You nod walking away. He hates the fact that you had become insecure\nabout <i>everything</i>. You stood there with your puppy eyes and slightly pouty\nlip playing nervously with your fingers looking at him which was killing him to\nnot hug you and give you reassuring kisses. You take 2 hours to get ready the outfit was the\nissue finally deciding on a bodycon maxi dress and you threw your hair up into\na low messy updo.</p><p>You walk down the stairs barefoot “Ready?” Harry asks </p><p>You shake your head “which shoes?” you ask\n holding up 2 pairs of heel sandals</p><p>“Hmmm”  he smiles tapping his lip and\nstands up walking over to you he looks at them “try them on let me see” he\nanalyzes and judges and picks his favorite </p><p>“Ok\nready” you say after putting on the shoes </p><p>“You look amazing as always” he compliments </p><p>“Thank you” You drive in silence to a high end Restaurant on\nthe rooftop  of a tower down town You already know what you want as you both skim\nthe menu but right now going over every single item included in each meal is\nbetter than addressing the issue. He clears his throat and you look up and smile.\nHe places his hand on the table and you gently place yours in his. </p><p>“So..” he begins He is interrupted by the waiter </p><p>“Welcome to\nBequoia!  Would you like to try our Cabernet?”  <br></p><p>\nHarry answers “Yes we would thank you!” He walked away and returned promptly “Do you know what you would like?”</p><p> “Salmon” you say </p><p>“Steak”  </p><p>“How would you like that cooked sir?”</p><p>“Medium”</p><p>“Ok I will have that right out for you” </p><p>“Can yeh also bring another bottle of Cabernet\nplease?” </p><p>“Absolutely!”</p><p> He looked at you and rubbed the back of your\nhand with his thumb “Pet i apologize for how i behaved” You smile “S not that i didn’t think yeh would be good\nenough its a problem of mine’nd if yeh want i will eat all your cooking!” he\noffers up a smile to make you feel better You barely smile in response “Never meant to. I just have a serious\nproblem… perfectionist.” </p><p>“Its ok Harry, shouldn’t have been so sensitive”  you say softly and wipe\nyour tears away </p><p>“No its not pet” he moves towards you “i’m sorry\nplease don’t cry” he wraps his arm around you pulling you closer You nod and fight against the tears </p><p>“Im sorry pet please” he begs</p><p>“It’s ok Harry you apologized”  </p><p>“But you’re crying” </p><p>You giggle “Because I’m weird” you joke </p>",
                "content": "<p>I feel bad that I seriously suck at posting. I just over analyze everything. I wrote this LAST year during holiday season and we are right around the corner from that. But here you go&nbsp;</p><p>All day Harry had been\ndoing it. <i>All</i> damn day! It was your first holiday together and you and\nHarry had decided to host dinner. You had the recipes from your mother and his.\nYou followed the recipes to a &lsquo;T&rsquo; ;however all day Harry kept interjecting.</p><p><i>&ldquo;lets add a little brown sugar!&rdquo;,</i><i>&ldquo;take the cookies out luv might burn the bottom,\ndon wan tha&rdquo;,</i><i>&ldquo;add more salt not there yet kinda bland&rdquo;,</i><i>&ldquo;dice them smaller want the taste not the\nchunks&rdquo;, </i><i>&ldquo;You have to baste it often or it would dry up\nup top&rdquo;, </i><i>&ldquo;lets add this(wine) make the taste more bold!&rdquo;</i></p><p>And <i>now</i> he had just hip bumped you over\nto the side complaining the sauce was burning and you weren&rsquo;t stirring it fast\nenough turning down the &nbsp;heat even after you said you got it he was still\nmicromanaging, taking over. You huffed grabbing a bottle of water from the\nfridge, before going up the stairs to get ready they were arriving in 2 hours\nyou were so angry you slam the door behind you. It was the slam that caught his\nattention quickly he jogged up the &nbsp;stairs &ldquo;Pet re yeh alright?&rdquo;</p><p>&ldquo;Yes!&rdquo; you yell from inside the closet</p><p>&ldquo;Wha&rsquo; re yeh doin&rsquo;?&rdquo;</p><p>&ldquo;Getting ready!&rdquo;</p><p>&ldquo;K m gonna head down i added some red wine to\nthe sauce it tastes amazing!&rdquo; he said excitedly&nbsp;</p><p>&ldquo;Ok!&rdquo; you say disinterested. You wanted this to be perfect you wanted his\nfamily to know you could be a great home keeper and take care of him. More\nimportantly you wanted everyone to know you would be a great wife when the time\ncame but Harry proved you wrong. You worried that maybe his micromanaging was\nbecause you were a terrible home keeper the readjustment of pillows and table\nscaping on the dining table and trinkets around your shared home. He\nthought you didn&rsquo;t realize but you did, you thought nothing of it at first but,\nnow it was like a sign a subliminal loud bright neon sign &lsquo;you are shit at\nthis!&rsquo;</p><p>You get ready on a simple dress with a floor\nlength cardigan on.&nbsp;</p><p>&ldquo;Ready?&rdquo; Harry asks walking into the bathroom</p><p>&ldquo;Yes&rdquo; you answer</p><p>He wraps his arms around you &ldquo;wow babe yeh look\namazin&rsquo; &rdquo;&nbsp;</p><p>&ldquo;Thanks&rdquo; you say flatly pushing him off</p><p>&nbsp;He doesn&rsquo;t catch on he&rsquo;s too excited. Excited to\nsee his family.&nbsp;</p><p>When everyone arrived they greet you both with loving arms and\nmessages bringing you &nbsp;both gifts. Immediately you usher them to the\ndining room as they admire the new d&eacute;cor around the house. You go to open a\nbottle of wine only for Harry to grab it out of your hand</p><p>&ldquo;I got this have a seat babe, know there&rsquo;s a way\nto pour wine&rdquo; he fills the glasses before raising his &ldquo;to family nd luv&rsquo; &rdquo;</p><p>You all repeat &nbsp;&ldquo;to family and love&rdquo;\nclanking each others glasses&nbsp;</p><p>&ldquo;lets eat!&rdquo; 5 minutes pass by and there&rsquo;s the first\ncompliment</p><p>&ldquo;This chicken is soo good have you tried it\nmum?&rdquo; &nbsp;Gemma asks</p><p>&ldquo;Not yet still eating the risotto it&rsquo;s amazing!&rdquo;&nbsp;</p><p>&ldquo;Yea Y/N you did a good job!&rdquo; your mom speaks to\nyou</p><p>You shake your head &ldquo;I didn&rsquo;t cook Harry did, good job babe&rdquo;\nand honestly it really was good&nbsp;</p><p>&ldquo;Harry you cook!?&rdquo; your mom asks surprised</p><p>&ldquo;Yes Mrs. Y/L/N&rdquo; he says proudly&nbsp;</p><p>&ldquo;Oh good! Is there nothing you can&rsquo;t do?&rdquo;</p><p>He smiles in response loving the compliment&nbsp;</p><p>&ldquo;Anyway we were worried Y/N would be\nfeeding you box dinners and take out everyday!&rdquo; &nbsp;she jokes making everyone else laugh. You give a tight lipped smile&nbsp;</p><p>&ldquo;Oh no she did most of the work I just helped&rdquo; &nbsp;</p><p>&ldquo;Really is it true butterfly (your nickname)?&rdquo;\nyour mom asks you&nbsp;</p><p>You sigh &ldquo;No Harry cooked&rdquo; you say once again\nshaking your head&nbsp;</p><p>&ldquo;You know I always got on her on learning to\ncook! Back in my day women had to know how to cook or you wouldn&rsquo;t get\nmarried!&rdquo;&nbsp;</p><p>&ldquo;That&rsquo;s very true Hazza your mimi would get on me all the time&rdquo; Anne chimes in<br /></p><p>&ldquo;Oh silly tradition&rdquo; Harry reasons&nbsp;</p><p>&ldquo;Yea but i still think she should learn\nsomething if she wants to be a mother&rdquo; your father scolds &ldquo;mac and cheese even&rdquo;</p><p>&ldquo;I&rsquo;ll learn dad so i can feed you when you&rsquo;re\nold&rdquo; you try to joke back making the table laugh a little</p><p>&ldquo;Oh i don&rsquo;t mind..&rdquo; &nbsp;</p><p>&ldquo;Harry what did you put in this chicken?&rdquo;\nGemma&rsquo;s Boyfriend Sean asks</p><p>&nbsp;He smiles &ldquo;I&rsquo;ll give you the recipe mate &rdquo;&nbsp;</p><p>&ldquo;Please do so i can impress your sister&rdquo;\n&nbsp;he jokes</p><p>The rest of dinner went without &nbsp;much word\nfrom you and afterwards you all stay seated around the dining table eating\ndessert drinking more wine and coffee&nbsp;</p><p>&ldquo;Oh my god Hazza! Yeh baked the cookies\ntoo?!&rdquo; Anne asks after her first &nbsp;bite</p><p>&ldquo;Yes&rdquo; you answer flatly for him&nbsp;</p><p>&ldquo;Damn did you do <i>anything</i> today?&rdquo; your father\nasks you</p><p>&ldquo;No she..&rdquo; Harry tries to answer for you&nbsp;</p><p>&ldquo;I cleaned&rdquo; you respond&nbsp;</p><p>&ldquo;Wha&rsquo;s in this?&rdquo; Gemma &nbsp;asks as she holds up a piece of cake on her fork</p><p>&ldquo;So &nbsp;good!&rdquo; your mom comments</p><p>&nbsp;&ldquo;And soft!&rdquo; his mom adds</p><p>He shrugs smirking loving the compliments &ldquo;can&rsquo;t\ngive away all my recipes!&rdquo; &nbsp;</p><p>&ldquo;Yea but this is my recipe what did yeh add?&rdquo;\nhis mom asks&nbsp;</p><p>He draws his lips together before imitating a\nzipper being closed on them with his fingers .You want this night to be over already by now. Your pride is defeated. Nothing that you did went right and everyone knows you can&rsquo;t do much of anything. Your\nmom was relentless about your lack of cooking skills the alcohol getting to her\nwhich makes everyone laugh all night at you. When they start leaving you smile and say your\ngoodbyes kissing away any hopes of being Mrs. Styles &nbsp;because there&rsquo;s no way Anne Twist is &nbsp;going to let you marry her son not when you\ncouldn&rsquo;t even bake cookies!&nbsp;</p><p>You rush to the kitchen to clean up the dishes. Harry walks into the kitchen happily sighing\n&ldquo;you&rsquo;re dad is funny!&rdquo;&nbsp;</p><p>&ldquo;Yea!&rdquo; you say focusing all your negative energy\non the spots on the dishes</p><p>&ldquo;Do they really call you butterfly?&rdquo; he asks\namused</p><p>&ldquo;Yea&rdquo; you say flatly&nbsp;</p><p>&ldquo;Cute!&rdquo; he says with a boyish grin&nbsp;</p><p>You plug away going through the dishes quickly</p><p>&ldquo;Oh don&rsquo;t clean those we can do it tomorrow&rdquo; he\n&nbsp;tries to stop you from cleaning the pots&nbsp;</p><p>&ldquo;I would rather do it tonight&rdquo; you say not\nstopping&nbsp;</p><p>&ldquo;Well m tired from all that cooking<i> I</i>\ndid&rdquo; he jokes &ldquo;mind &nbsp;if i watch some tele?&rdquo;&nbsp;</p><p>&ldquo;No!&rdquo; you say feeling your anger coming to a\nboil. Your feet were sore all he did all day was sit by the island\nmicromanaging only getting up to fix your mistakes. He kisses you on the cheek\nbefore walking away. You spend about an hour cleaning up.&nbsp;</p><p>&ldquo;I&rsquo;m done going upstairs&rdquo; you say to Harry as you dry your hands</p><p>&nbsp;&ldquo; &lsquo;M coming wait&rsquo;f me&rdquo; he says turning off the\nTV. He hums walking up with you</p><p>You&rsquo;re so irritated at this point you&rsquo;re rolling your eyes at the littlest things as you walk into the closet as he follows</p><p>He chuckles \"Gem is crazy!&rdquo; he says\nremembering a joke she told&nbsp;</p><p>You look around ignoring him &ldquo;And your mum calling me &lsquo;great&rsquo; that was\nendearing of her, she&rsquo;s such a darling &rdquo; he says smiling watching you</p><p>&ldquo;Yea&rdquo; you respond not paying attention to him. Finally&nbsp; he realizes you&rsquo;re &nbsp;in a sour\nmood</p><p>&ldquo;Yeh ok pet?&rdquo; he asks staring at you angrily\nshuffle through things in the drawer</p><p>&ldquo;Yea!&rdquo; you say sarcastically &nbsp;</p><p>&ldquo;Harry the <i>great</i>!&rdquo;\nyou grunt pulling open the drawer&nbsp;</p><p>&ldquo;What?&rdquo; &nbsp;he chuckles slightly&nbsp;</p><p>&ldquo;Harry the great!&rdquo; you start as you undress\naggressively &nbsp;</p><p>&ldquo;Harry the great singer! Harry the great musician! Harry the\ngreat producer! Harry the great actor! Harry &nbsp;the great chef!&rdquo; you slam\nthe drawer closed</p><p>He laughs at your antics &ldquo;where&rsquo;s this comin from?&rdquo;</p><p>\"Y/N the walking sack of shit who cant even\nboil water&rdquo; you speak walking around picking up your discarded clothes</p><p>His laughter quickly dies down realizing what\nyou said &ldquo;wait what?&rdquo;</p><p>You sigh walking into bathroom mumbling &rdquo;Y/N the\nterrible! Y/N the terrible chef eat her food and you might die!&rdquo; you&rsquo;re being\ntheatrical and sarcastic waving your hands in the air to keep from &nbsp;crying</p><p>&nbsp;&ldquo;Babe&rdquo; his brow furrows. Unsure if you&rsquo;re joking\nor not</p><p>&ldquo;Y/N the shitty homemaker! Y/N waste of space!&rdquo;&nbsp;</p><p>&ldquo;Oi!&rdquo; he yells &ldquo;stop it! wha&rsquo;s gotten yeh in\nthis pissy mood?&rdquo; he asks realizing you were very serious&nbsp;</p><p>&ldquo;Nothing!&rdquo; you say walking past him&nbsp;</p><p>&ldquo;Wha do yeh mean nothin? &nbsp;wha&rsquo;s up with the\nattitude?&rdquo; He asks following you into the bedroom</p><p>&ldquo;I&rsquo;m fine, good night&rdquo; you answer softly He watches you yank the covers back before\ngetting in bed. He stares before going into the closet to change clothes. He\nhas no idea why you are in such a bad mood you seemed fine earlier. He gets in bed and looks at you one more time&ldquo;Y/N&rdquo; he calls moving closer to you &nbsp;</p><p>&ldquo;<i>Good</i> <i>night</i> Harry&rdquo; you stress\nsoftly turning away from him hiding your tears, he sighs turning the\n&nbsp;other way.</p><p>In the morning you&rsquo;re gone without good morning</p><p><i>Harry: no good morning today?</i> he texts you&nbsp;</p><p><i>Y/N: sorry big meeting today</i></p><p>He &nbsp;knows you&rsquo;re lying you would have told\nhim earlier that week if it was true</p><p><i>Harry: whats wrong pet</i></p><p><i>Y/N: nothing. im cool as a cucumber</i></p><p><i>&nbsp;Y/N: gotta go text later love you</i></p><p>He still can&rsquo;t understand what happened so he\ncalls Alexa his best friend to figure things out&nbsp;</p><p>&ldquo;Harold!</p><p>&rdquo;&ldquo;Aallleeeexaaaa!&rdquo; he says&nbsp;</p><p>She &nbsp;laughs &ldquo;up early&rdquo;&nbsp;</p><p>&ldquo;Well couldn&rsquo;t sleep&rdquo;&nbsp;</p><p>&ldquo;Please Harry &nbsp;my precious ears don&rsquo;t need\nto hear that!&rdquo; she &nbsp;complains&nbsp;</p><p>He chuckles &ldquo;no i think Y/N is mad at me&rdquo;&nbsp;</p><p>&ldquo;What did you do?&rdquo;</p><p>&ldquo;Nothing!&rdquo;</p><p>&ldquo;Uh huh so shes mad for no reason?&rdquo; she asks &ldquo;</p><p>Yes!&rdquo;</p><p>&ldquo;Harry&rdquo; she doesn&rsquo;t &nbsp;believe him&nbsp;</p><p>&ldquo;I did nothing i promise!&rdquo;&nbsp;</p><p>&ldquo;Well lets just &nbsp;figure out where you went\nwrong&rdquo;</p><p>He sighed in response&nbsp;</p><p>&ldquo;Oh how was the &nbsp;dinner by the way?&rdquo;&nbsp;</p><p>&ldquo;Amazing everyone had a blast!&rdquo; he said smiling</p><p>&ldquo;Good. Sooo did you call her fat?&rdquo;&nbsp;</p><p>&ldquo;Really? no&rdquo;</p><p>&ldquo;Just asking&hellip;.insult her cooking?&rdquo; &nbsp;</p><p>&ldquo; M not stupid no&rdquo; Alexa laughed &ldquo;But she kept telling everyone i cooked don&rsquo; kno\nwhy&rdquo;</p><p>&ldquo;Did you?&rdquo;</p><p>&ldquo;Well&hellip;&rdquo;</p><p>&ldquo;Seriously?&rdquo; she said in a flat tone&nbsp;</p><p>&ldquo;I didn&rsquo;t cook <i>that much</i> she did majority of\nit!&rdquo; he argued</p><p>*So let me guess you did the Harry thing\novershadowed?&rdquo;&nbsp;</p><p>&ldquo;No i didnt!&rdquo; he defends himself</p><p>&ldquo;So you didn&rsquo;t &nbsp;<i>add</i> your own\ningredients?&rdquo; He remained silent&nbsp;</p><p>&ldquo;Uh huh! i see told her to do it <i>your</i> way\ninstead&rdquo;&nbsp;</p><p>He &nbsp;sighed &ldquo;just trying to help&rdquo; he mumbled &nbsp;</p><p>&ldquo;Not like that you idiot!&rdquo;</p><p>&ldquo;Oi!&rdquo;&nbsp;</p><p>&ldquo;You do that shit to me all the time &nbsp;its\nreally annoying can&rsquo;t &nbsp;imagine being your\ngirlfriend and trying to impress your family&rdquo; she sang the last part&nbsp;</p><p>&ldquo;Oooh&rdquo; he responded softly</p><p>&ldquo;Yea oooh&rdquo;</p><p>&ldquo;Fuck&rdquo; he whispered &ldquo;i was just&rdquo;</p><p>&ldquo;Just nothing you fucked up&rdquo; she teased</p><p>He sighed &nbsp;&ldquo;now what do i do?&rdquo;</p><p>&ldquo;I don&rsquo;t know thats a doozy, i gotta run text me\nwhen you come up with a resolution maybe i can save you more trouble!&rdquo;</p><p>He honestly was just trying to help. He could\napologize plus your cooking wasn&rsquo;t <i>that</i> bad. He had no time to think of\nother ideas because he was to be at the studio soon.&nbsp;</p><p>Even though he was in the\nstudio his mind drifted to you often so he snuck away to call you.&ldquo;Hello?&rdquo; &nbsp;you answer&nbsp;</p><p>&ldquo;Hi butterfly&rdquo; he speaks softly&nbsp;</p><p>&ldquo;Hi Harry&rdquo; you greet. &ldquo;Are you ok?&rdquo; he never\ncalls when he&rsquo;s in the studio</p><p>&ldquo;Yea&hellip;.hows your day?&rdquo;</p><p>You shrug &ldquo;just work..&rdquo; its awkward &ldquo;how&rsquo;s\nyours?&rdquo;</p><p>&ldquo;Good ok i guess&hellip; can we talk bout last\nnight?&rdquo;</p><p>&ldquo;No&rdquo; you say in a flat tone</p><p>&ldquo;Come on pet i&hellip;&rdquo;&nbsp;</p><p>You interrupt him &ldquo;im not talking about it so if\nyou have nothing to say im hanging up&rdquo; you&rsquo;re beyond irritated&nbsp;</p><p>&ldquo;No don&rsquo;t!&rdquo;&hellip; &nbsp;he &nbsp;remained \nsilent &ldquo;Y/N&rdquo;&nbsp;</p><p>&ldquo;Harry&rdquo; your tone &nbsp;warns him</p><p>He feels worse &ldquo;pet please&rdquo;</p><p>&ldquo;Go back you have things to do&rdquo; you reason &nbsp;&ldquo;see you at home I love you&rdquo;&nbsp;</p><p>He sighed deeply &ldquo;love you too&rdquo;&nbsp;He did his best rushed through songs. You\nhowever didn&rsquo;t get &nbsp;home till late and you met a sleeping Harry. You did\nyour best to be silent and sneak into bed but he felt the dip in the mattress.</p><p>&ldquo;Pet?&rdquo; he asks turning his head to face you&nbsp;</p><p>&ldquo;Yes good night&rdquo; you say &nbsp;kissing his lips\nand laying &nbsp;down</p><p>He sighs turning on his lamp &ldquo;Y/N&rdquo;&nbsp;</p><p>&ldquo;Go back to sleep Harry&rdquo; you stress&nbsp;</p><p>&ldquo;No not good night!&rdquo; he says turning you around\nto face him &ldquo;Now we&rsquo;re gonna talk about this whether yeh like it or not!&rdquo;</p><p>&ldquo;Harry&rdquo; you fuss</p><p>&ldquo;Seriously over dinner?&rdquo; You look at him with a blank &nbsp;face &ldquo;I didn&rsquo;t even do anything was jus&rsquo; trying to\nhelp I&rsquo;m sorry if i offended yeh&rdquo; now he was the one that was irritated &nbsp;You still say nothing as he is looking at you\nfor a response&nbsp; &ldquo;Yeh could have said yeh cooked i wouldn&rsquo;t have\nminded its just food!&rdquo; You still give him a blank stare &ldquo;Oh for the luv of! Bloody say something!&rdquo; he\ncommands&nbsp;</p><p>You sigh and turn to look at the ceiling &ldquo;it\nwasn&rsquo;t a stupid dinner maybe to you it was but it meant more than that to me&rdquo;\nyou feel the tears well up. &ldquo;I was supposed to make it perfect the whole house\nbut you kept <i>fixing</i> things.&rdquo; The first &nbsp;tear rolled down your face\n&ldquo;then you wouldn&rsquo;t let me cook i had the recipes i was doing exactly what was\nwritten down. Then here you come correcting and adding shit. You undermined <i>everything\n</i>i did that day, like you didn&rsquo;t trust that i could make anything good\nenough for your family.&rdquo; You now dig the heels of your hands to your eyes\ntrying to stop the flow</p><p>&ldquo;Pet&rdquo; he said softly feeling awful about his\nactions&nbsp;</p><p>&ldquo;What mother wants her son to be with a woman\nwho can&rsquo;t even cook Harry?!&rdquo;.&nbsp;</p><p>He frowned &ldquo;my mum&rdquo;&nbsp;</p><p>&ldquo;You wouldn&rsquo;t even let me pour a glass of wine!&rdquo;</p><p>He remained silent &ldquo;I blew my chances&rdquo; you turn over &ldquo;good night Harry&rdquo;</p><p>He goes to open his mouth but can&rsquo;t find the\nright words any words to make things better</p><p>You sigh when you feel him lay back down wiping your tears</p><p>The next morning it&rsquo;s Friday and you drag your\nbody out of bed before the alarm goes off not like you slept, you have been battling\na tension headache. You get ready and go to the kitchen and make Harry&rsquo;s\nsmoothie before leaving resuming your routine. You go back upstairs and &nbsp;push his hair out\nof his face he shifts around &ldquo;Good morning&rdquo; you whisper before kissing his\ncheek signaling his que to wake-up and you&rsquo;re out the door. At work your productive enough so you leave\nearly. Your headache finally calmed down after 4 Advil pills. You grab your\nthings and drive home it&rsquo;s 2 o'clock so Harry should still be in the studio.\nWhen you pull up to your driveway you don&rsquo;t see his car so you sigh in relief,\nyou did &nbsp;not wish to recap last night your emotions got the best of you,\nyou don&rsquo;t even know why you complained about the wine situation he always\npoured wine for your guests.&nbsp;</p><p>As you walk in the door however you almost\nfreeze seeing Harry sitting by the couch listening to his music writing.</p><p>&ldquo;Pet home early!&rdquo; he says with a smile on his\nface&nbsp;</p><p>&ldquo;Yea got finished early&rdquo; you speak softly &ldquo;why\nare you home? thought you had studio time&rdquo;&nbsp;</p><p>&ldquo;Eh Jeff &lsquo;nd I got into a heated discussion&rdquo; he\njokes &ldquo;thought it&rsquo;d be best if we cooled off&rdquo; He was lying he spent all day at\nhome waiting for you making calls and the fact that you were early made it\nperfect because now you couldn&rsquo;t say no. &ldquo;Glad yeh&rsquo;r home early! Would like to\ntake yeh on a date&rdquo;</p><p>&ldquo;Why?&rdquo; you ask suspicious of his motives&nbsp;</p><p>He stands up &ldquo;Yeh&rsquo;r my girlfriend and its been 2\nweeks too long&rdquo;</p><p>&ldquo;Oh i didn&rsquo;t mean like that sorry&rdquo;&nbsp;</p><p>&ldquo;Don&rsquo; worry bout it&hellip;So can i?&rdquo; he asks you&nbsp;</p><p>&ldquo;What am i supposed to wear?&rdquo;</p><p>&ldquo;Anything yeh look amazing in anything!&rdquo; he\nsmiles&nbsp;</p><p>&ldquo;Yea but i don&rsquo;t know, &nbsp;where we are\ngoing?&rdquo;</p><p>&ldquo;A cute dress!&rdquo; he solved your riddle&nbsp;</p><p>You nod walking away. He hates the fact that you had become insecure\nabout <i>everything</i>. You stood there with your puppy eyes and slightly pouty\nlip playing nervously with your fingers looking at him which was killing him to\nnot hug you and give you reassuring kisses. You take 2 hours to get ready the outfit was the\nissue finally deciding on a bodycon maxi dress and you threw your hair up into\na low messy updo.</p><p>You walk down the stairs barefoot &ldquo;Ready?&rdquo; Harry asks&nbsp;</p><p>You shake your head &ldquo;which shoes?&rdquo; you ask\n&nbsp;holding up 2 pairs of heel sandals</p><p>&ldquo;Hmmm&rdquo; &nbsp;he smiles tapping his lip and\nstands up walking over to you he looks at them &ldquo;try them on let me see&rdquo; he\nanalyzes and judges and picks his favorite&nbsp;</p><p>&ldquo;Ok\nready&rdquo; you say after putting on the shoes&nbsp;</p><p>&ldquo;You look amazing as always&rdquo; he compliments&nbsp;</p><p>&ldquo;Thank you&rdquo; You drive in silence to a high end Restaurant on\nthe rooftop &nbsp;of a tower down town You already know what you want as you both skim\nthe menu but right now going over every single item included in each meal is\nbetter than addressing the issue. He clears his throat and you look up and smile.\nHe places his hand on the table and you gently place yours in his.&nbsp;</p><p>&ldquo;So..&rdquo; he begins He is interrupted by the waiter&nbsp;</p><p>&ldquo;Welcome to\nBequoia! &nbsp;Would you like to try our Cabernet?&rdquo; &nbsp;<br /></p><p>\nHarry answers &ldquo;Yes we would thank you!&rdquo; He walked away and returned promptly &ldquo;Do you know what you would like?&rdquo;</p><p>&nbsp;&ldquo;Salmon&rdquo; you say&nbsp;</p><p>&ldquo;Steak&rdquo; &nbsp;</p><p>&ldquo;How would you like that cooked sir?&rdquo;</p><p>&ldquo;Medium&rdquo;</p><p>&ldquo;Ok I will have that right out for you&rdquo;&nbsp;</p><p>&ldquo;Can yeh also bring another bottle of Cabernet\nplease?&rdquo;&nbsp;</p><p>&ldquo;Absolutely!&rdquo;</p><p>&nbsp;He looked at you and rubbed the back of your\nhand with his thumb &ldquo;Pet i apologize for how i behaved&rdquo; You smile &ldquo;S not that i didn&rsquo;t think yeh would be good\nenough its a problem of mine&rsquo;nd if yeh want i will eat all your cooking!&rdquo; he\noffers up a smile to make you feel better You barely smile in response &ldquo;Never meant to. I just have a serious\nproblem&hellip; perfectionist.&rdquo;&nbsp;</p><p>&ldquo;Its ok Harry, shouldn&rsquo;t have been so sensitive&rdquo; &nbsp;you say softly and wipe\nyour tears away&nbsp;</p><p>&ldquo;No its not pet&rdquo; he moves towards you &ldquo;i&rsquo;m sorry\nplease don&rsquo;t cry&rdquo; he wraps his arm around you pulling you closer You nod and fight against the tears&nbsp;</p><p>&ldquo;Im sorry pet please&rdquo; he begs</p><p>&ldquo;It&rsquo;s ok Harry you apologized&rdquo; &nbsp;</p><p>&ldquo;But you&rsquo;re crying&rdquo;&nbsp;</p><p>You giggle &ldquo;Because I&rsquo;m weird&rdquo;&nbsp;you joke&nbsp;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "thewackywriter",
        "blog": {
            "name": "thewackywriter",
            "title": "thewackywriter",
            "description": "<p>Just a girl in a lot of fandoms living life to the fullest ✹ REQUESTS ARE OPEN!! <a href=\"https://thewackywriter.tumblr.com/tagged/masterpost\">MASTERPOST</a></p> <a href=\"https://thewackywriter.tumblr.com/post/178084823538/fall-writing-challenge\">FALL WRITING CHALLENGE</a></p>",
            "url": "https://thewackywriter.tumblr.com/",
            "uuid": "t:kJOQ9H7F1mXW6dlgL1YqGQ",
            "updated": 1558494735
        },
        "id": 178818816368,
        "post_url": "https://thewackywriter.tumblr.com/post/178818816368/join-my-fall-writing-challenge",
        "slug": "join-my-fall-writing-challenge",
        "date": "2018-10-07 13:01:21 GMT",
        "timestamp": 1538917281,
        "state": "published",
        "format": "html",
        "reblog_key": "fEQZXdSl",
        "tags": [
            "imagine",
            "noah centineo",
            "Harry Styles",
            "5sos",
            "Shawn mendes",
            "tom holland",
            "jordan connor",
            "ross butler"
        ],
        "short_url": "https://tmblr.co/ZAY7qn2cYRfbm",
        "summary": "JOIN MY FALL WRITING CHALLENGE",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 3,
        "title": "JOIN MY FALL WRITING CHALLENGE",
        "body": "<p>Hi everyone, so there’s still more than a month left for you to enter and post for the Fall Writing Challenge that I’m hosting!! IT CAN BE FOR ANY OF THE FANDOMS I WRITE FOR (WHICH IS A LOT)!!! Even if you’!re nervous about writing or don’t have any inspiration, this is the challenge for you!! No judgment or critiques, compliments only!! Shoot me a message/ask/comment with the prompt and fandom you’ll be writing for! Thanks, everyone!</p><p><i><a href=\"https://thewackywriter.tumblr.com/post/175683121303/fandoms-i-write-for\">Fandoms I Write For</a></i></p><h2><b><a href=\"https://thewackywriter.tumblr.com/post/178084823538/hey-everyone-so-i-will-be-doing-a-writing\">FALL WRITING CHALLENGE</a></b></h2>",
        "reblog": {
            "comment": "<p><p>Hi everyone, so there’s still more than a month left for you to enter and post for the Fall Writing Challenge that I’m hosting!! IT CAN BE FOR ANY OF THE FANDOMS I WRITE FOR (WHICH IS A LOT)!!! Even if you’!re nervous about writing or don’t have any inspiration, this is the challenge for you!! No judgment or critiques, compliments only!! Shoot me a message/ask/comment with the prompt and fandom you’ll be writing for! Thanks, everyone!</p><p><i><a href=\"https://thewackywriter.tumblr.com/post/175683121303/fandoms-i-write-for\">Fandoms I Write For</a></i></p><h2><b><a href=\"https://thewackywriter.tumblr.com/post/178084823538/hey-everyone-so-i-will-be-doing-a-writing\">FALL WRITING CHALLENGE</a></b></h2></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thewackywriter",
                    "active": true,
                    "theme": {
                        "header_full_width": 750,
                        "header_full_height": 331,
                        "header_focus_width": 589,
                        "header_focus_height": 331,
                        "avatar_shape": "circle",
                        "background_color": "#B392C9",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,665,331,76",
                        "header_image": "https://static.tumblr.com/86dbf0a7845a8493b95990d8fcccb520/3lskoty/M2Xpbik8h/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/86dbf0a7845a8493b95990d8fcccb520/3lskoty/tF0pbik8i/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/86dbf0a7845a8493b95990d8fcccb520/3lskoty/M2Xpbik8h/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#444444",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178818816368"
                },
                "content_raw": "<p><p>Hi everyone, so there’s still more than a month left for you to enter and post for the Fall Writing Challenge that I’m hosting!! IT CAN BE FOR ANY OF THE FANDOMS I WRITE FOR (WHICH IS A LOT)!!! Even if you’!re nervous about writing or don’t have any inspiration, this is the challenge for you!! No judgment or critiques, compliments only!! Shoot me a message/ask/comment with the prompt and fandom you’ll be writing for! Thanks, everyone!</p><p><i><a href=\"https://thewackywriter.tumblr.com/post/175683121303/fandoms-i-write-for\">Fandoms I Write For</a></i></p><h2><b><a href=\"https://thewackywriter.tumblr.com/post/178084823538/hey-everyone-so-i-will-be-doing-a-writing\">FALL WRITING CHALLENGE</a></b></h2></p>",
                "content": "<p><p>Hi everyone, so there&rsquo;s still more than a month left for you to enter and post for the Fall Writing Challenge that I&rsquo;m hosting!! IT CAN BE FOR ANY OF THE FANDOMS I WRITE FOR (WHICH IS A LOT)!!! Even if you&rsquo;!re nervous about writing&nbsp;or don&rsquo;t have any inspiration, this is the challenge for you!! No judgment or critiques, compliments only!! Shoot me a message/ask/comment with the prompt and fandom you&rsquo;ll be writing for! Thanks, everyone!</p><p><i><a href=\"https://thewackywriter.tumblr.com/post/175683121303/fandoms-i-write-for\">Fandoms I Write For</a></i></p><h2><b><a href=\"https://thewackywriter.tumblr.com/post/178084823538/hey-everyone-so-i-will-be-doing-a-writing\">FALL WRITING CHALLENGE</a></b></h2></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "hstylesgallery",
        "blog": {
            "name": "hstylesgallery",
            "title": "Harry Styles Gallery",
            "description": "",
            "url": "https://hstylesgallery.tumblr.com/",
            "uuid": "t:uu0S-6OxUO8CnG90GgMDtg",
            "updated": 1558305376
        },
        "id": 178818804060,
        "post_url": "https://hstylesgallery.tumblr.com/post/178818804060/dallas-texas-june-5th-2018-photo-by",
        "slug": "dallas-texas-june-5th-2018-photo-by",
        "date": "2018-10-07 13:00:45 GMT",
        "timestamp": 1538917245,
        "state": "published",
        "format": "html",
        "reblog_key": "6posQurE",
        "tags": [
            "2018",
            "5.6.18",
            "harry styles",
            "hst2"
        ],
        "short_url": "https://tmblr.co/ZcNa5Z2cYRcbS",
        "summary": "Dallas, Texas - June 5th, 2018. (photo by srsly.skylar)",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 120,
        "caption": "<p><small>\n\nDallas, Texas - June 5th, 2018. (photo by <b><a href=\"https://www.instagram.com/p/BjsaFqQFLj7/?taken-by=srsly.skylar\">srsly.skylar</a></b>)\n\n<br/></small></p>",
        "reblog": {
            "comment": "<p><small>\n\nDallas, Texas - June 5th, 2018. (photo by <b><a href=\"https://www.instagram.com/p/BjsaFqQFLj7/?taken-by=srsly.skylar\">srsly.skylar</a></b>)\n\n<br></small></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "hstylesgallery",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/043e540f26bb94b25949f83c5ba42c46/ktm2gvk/OBGpcpw1x/tumblr_static_1mhg08nhdx8g8ok84skwgks0c.jpg",
                        "header_image_focused": "https://static.tumblr.com/043e540f26bb94b25949f83c5ba42c46/ktm2gvk/OBGpcpw1x/tumblr_static_1mhg08nhdx8g8ok84skwgks0c.jpg",
                        "header_image_scaled": "https://static.tumblr.com/043e540f26bb94b25949f83c5ba42c46/ktm2gvk/OBGpcpw1x/tumblr_static_1mhg08nhdx8g8ok84skwgks0c.jpg",
                        "header_stretch": true,
                        "link_color": "#222222",
                        "show_avatar": true,
                        "show_description": false,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Sans Serif",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178818804060"
                },
                "content_raw": "<p><small>\n\nDallas, Texas - June 5th, 2018. (photo by <b><a href=\"https://www.instagram.com/p/BjsaFqQFLj7/?taken-by=srsly.skylar\">srsly.skylar</a></b>)\n\n<br></small></p>",
                "content": "<p><small>\n\nDallas, Texas - June 5th, 2018. (photo by <b><a href=\"https://www.instagram.com/p/BjsaFqQFLj7/?taken-by=srsly.skylar\">srsly.skylar</a></b>)\n\n<br /></small></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "http://hstylesgallery.tumblr.com/",
        "image_permalink": "https://hstylesgallery.tumblr.com/image/178818804060",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/2653ff327a4f0224b4c9e53779534904/tumblr_pg5eaxKC8x1xbj506o1_540.jpg",
                    "width": 540,
                    "height": 750
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/2653ff327a4f0224b4c9e53779534904/tumblr_pg5eaxKC8x1xbj506o1_540.jpg",
                        "width": 540,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/2653ff327a4f0224b4c9e53779534904/tumblr_pg5eaxKC8x1xbj506o1_500.jpg",
                        "width": 500,
                        "height": 694
                    },
                    {
                        "url": "https://66.media.tumblr.com/2653ff327a4f0224b4c9e53779534904/tumblr_pg5eaxKC8x1xbj506o1_400.jpg",
                        "width": 400,
                        "height": 556
                    },
                    {
                        "url": "https://66.media.tumblr.com/2653ff327a4f0224b4c9e53779534904/tumblr_pg5eaxKC8x1xbj506o1_250.jpg",
                        "width": 250,
                        "height": 347
                    },
                    {
                        "url": "https://66.media.tumblr.com/2653ff327a4f0224b4c9e53779534904/tumblr_pg5eaxKC8x1xbj506o1_100.jpg",
                        "width": 100,
                        "height": 139
                    },
                    {
                        "url": "https://66.media.tumblr.com/2653ff327a4f0224b4c9e53779534904/tumblr_pg5eaxKC8x1xbj506o1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "alwaysinmyass",
        "blog": {
            "name": "alwaysinmyass",
            "title": "𝐚𝐧𝐝𝐫𝐞𝐚",
            "description": "",
            "url": "https://alwaysinmyass.tumblr.com/",
            "uuid": "t:TM4e9jGw-ZVdBOWfPCp96A",
            "updated": 1558302312
        },
        "id": 178818515060,
        "post_url": "https://alwaysinmyass.tumblr.com/post/178818515060/%CA%9C%E1%B4%87%CA%80%E1%B4%87-%E1%B4%9B%E1%B4%8F-%E1%B4%9B%E1%B4%80%E1%B4%8B%E1%B4%87-%E1%B4%8D%CA%8F-%E1%B4%8D%E1%B4%87%E1%B4%85%C9%AA%E1%B4%84%C9%AA%C9%B4%E1%B4%87-%E1%B4%9B%E1%B4%80%E1%B4%8B%E1%B4%87-%E1%B4%8D%CA%8F-%E1%B4%8D%E1%B4%87%E1%B4%85%C9%AA%E1%B4%84%C9%AA%C9%B4%E1%B4%87-%CA%80%E1%B4%87s%E1%B4%9B-%C9%AA%E1%B4%9B",
        "slug": "ʜᴇʀᴇ-ᴛᴏ-ᴛᴀᴋᴇ-ᴍʏ-ᴍᴇᴅɪᴄɪɴᴇ-ᴛᴀᴋᴇ-ᴍʏ-ᴍᴇᴅɪᴄɪɴᴇ-ʀᴇsᴛ-ɪᴛ",
        "date": "2018-10-07 12:46:19 GMT",
        "timestamp": 1538916379,
        "state": "published",
        "format": "html",
        "reblog_key": "PO0fXnVH",
        "tags": [
            "one direction",
            "harry styles",
            "louis tomlinson",
            "larry",
            "larry stylinson",
            "louis tommo",
            "larry manip",
            "larry fanart",
            "larry is real",
            "larry fic",
            "larry smut",
            "larry stylinson moans",
            "larryproof"
        ],
        "short_url": "https://tmblr.co/Z7jDoi2cYQW1q",
        "summary": "ʜᴇʀᴇ ᴛᴏ ᴛᴀᴋᴇ ᴍʏ ᴍᴇᴅɪᴄɪɴᴇ\nᴛᴀᴋᴇ ᴍʏ ᴍᴇᴅɪᴄɪɴᴇ\nʀᴇsᴛ ɪᴛ ᴏɴ ʏᴏᴜʀ ғɪɴɢᴇʀᴛɪᴘs\nᴜᴘ ᴛᴏ ʏᴏᴜʀ ᴍᴏᴜᴛʜ\nғᴇᴇʟɪɴɢ ɪᴛ ᴏᴜᴛ",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 2,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"360\" data-orig-width=\"720\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pg8bebTosR1v00klg.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pg8bebTosR1v00klg.mp4\",\"type\":\"video/mp4\",\"width\":720,\"height\":360},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pg8bebTosR1v00klg_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":720,\"height\":360}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pg8bebTosR1v00klg_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pg8bebTosR1v00klg.mp4\" type=\"video/mp4\"></source></video></figure><p>ʜᴇʀᴇ ᴛᴏ ᴛᴀᴋᴇ ᴍʏ ᴍᴇᴅɪᴄɪɴᴇ</p><p>ᴛᴀᴋᴇ ᴍʏ ᴍᴇᴅɪᴄɪɴᴇ</p><p>ʀᴇsᴛ ɪᴛ ᴏɴ ʏᴏᴜʀ ғɪɴɢᴇʀᴛɪᴘs</p><p>ᴜᴘ ᴛᴏ ʏᴏᴜʀ ᴍᴏᴜᴛʜ</p><p>ғᴇᴇʟɪɴɢ ɪᴛ ᴏᴜᴛ </p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"360\" data-orig-width=\"720\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pg8bebTosR1v00klg.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pg8bebTosR1v00klg.mp4\",\"type\":\"video/mp4\",\"width\":720,\"height\":360},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pg8bebTosR1v00klg_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":720,\"height\":360}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pg8bebTosR1v00klg_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pg8bebTosR1v00klg.mp4\" type=\"video/mp4\"></source></video></figure><p>ʜᴇʀᴇ ᴛᴏ ᴛᴀᴋᴇ ᴍʏ ᴍᴇᴅɪᴄɪɴᴇ</p><p>ᴛᴀᴋᴇ ᴍʏ ᴍᴇᴅɪᴄɪɴᴇ</p><p>ʀᴇsᴛ ɪᴛ ᴏɴ ʏᴏᴜʀ ғɪɴɢᴇʀᴛɪᴘs</p><p>ᴜᴘ ᴛᴏ ʏᴏᴜʀ ᴍᴏᴜᴛʜ</p><p>ғᴇᴇʟɪɴɢ ɪᴛ ᴏᴜᴛ </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "alwaysinmyass",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 372,
                        "header_focus_width": 640,
                        "header_focus_height": 360,
                        "avatar_shape": "square",
                        "background_color": "#F2F2EA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "5,640,365,0",
                        "header_image": "https://static.tumblr.com/3df2a4f59948b940579212c5373db7a1/kdkf2jg/2zmprtrme/tumblr_static_1113046233-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/da03a6863da95d94247d7f71309579aa/kdkf2jg/W5kprtrsf/tumblr_static_tumblr_static_1113046233-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/3df2a4f59948b940579212c5373db7a1/kdkf2jg/2zmprtrme/tumblr_static_1113046233-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#484030",
                        "show_avatar": true,
                        "show_description": false,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#484030",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178818515060"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"360\" data-orig-width=\"720\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pg8bebTosR1v00klg.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pg8bebTosR1v00klg.mp4\",\"type\":\"video/mp4\",\"width\":720,\"height\":360},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pg8bebTosR1v00klg_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":720,\"height\":360}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pg8bebTosR1v00klg_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pg8bebTosR1v00klg.mp4\" type=\"video/mp4\"></source></video></figure><p>ʜᴇʀᴇ ᴛᴏ ᴛᴀᴋᴇ ᴍʏ ᴍᴇᴅɪᴄɪɴᴇ</p><p>ᴛᴀᴋᴇ ᴍʏ ᴍᴇᴅɪᴄɪɴᴇ</p><p>ʀᴇsᴛ ɪᴛ ᴏɴ ʏᴏᴜʀ ғɪɴɢᴇʀᴛɪᴘs</p><p>ᴜᴘ ᴛᴏ ʏᴏᴜʀ ᴍᴏᴜᴛʜ</p><p>ғᴇᴇʟɪɴɢ ɪᴛ ᴏᴜᴛ </p></p>",
                "content": "<p><figure class=\"tmblr-full\" data-npf=\"{&quot;type&quot;:&quot;video&quot;,&quot;provider&quot;:&quot;tumblr&quot;,&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pg8bebTosR1v00klg.mp4&quot;,&quot;media&quot;:{&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pg8bebTosR1v00klg.mp4&quot;,&quot;type&quot;:&quot;video/mp4&quot;,&quot;width&quot;:720,&quot;height&quot;:360},&quot;poster&quot;:[{&quot;url&quot;:&quot;https://66.media.tumblr.com/tumblr_pg8bebTosR1v00klg_frame1.jpg&quot;,&quot;type&quot;:&quot;image/jpeg&quot;,&quot;width&quot;:720,&quot;height&quot;:360}]}\"></figure><p>&#668;&#7431;&#640;&#7431; &#7451;&#7439; &#7451;&#7424;&#7435;&#7431; &#7437;&#655; &#7437;&#7431;&#7429;&#618;&#7428;&#618;&#628;&#7431;</p><p>&#7451;&#7424;&#7435;&#7431; &#7437;&#655; &#7437;&#7431;&#7429;&#618;&#7428;&#618;&#628;&#7431;</p><p>&#640;&#7431;s&#7451; &#618;&#7451; &#7439;&#628; &#655;&#7439;&#7452;&#640; &#1171;&#618;&#628;&#610;&#7431;&#640;&#7451;&#618;&#7448;s</p><p>&#7452;&#7448; &#7451;&#7439; &#655;&#7439;&#7452;&#640; &#7437;&#7439;&#7452;&#7451;&#668;</p><p>&#1171;&#7431;&#7431;&#671;&#618;&#628;&#610; &#618;&#7451; &#7439;&#7452;&#7451; </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "meetmeinthehallwaydotmp3",
        "blog": {
            "name": "meetmeinthehallwaydotmp3",
            "title": "medicine",
            "description": "chiara, 23, Italy, slytherin, foreign languages student",
            "url": "https://meetmeinthehallwaydotmp3.tumblr.com/",
            "uuid": "t:JSXZSUt_VaaW_ImDNY_H5Q",
            "updated": 1556312432
        },
        "id": 178818466051,
        "post_url": "https://meetmeinthehallwaydotmp3.tumblr.com/post/178818466051",
        "slug": "",
        "date": "2018-10-07 12:43:48 GMT",
        "timestamp": 1538916228,
        "state": "published",
        "format": "html",
        "reblog_key": "wnKRBsVJ",
        "tags": [
            "idk",
            "this kind of happened",
            "harry styles",
            "harrystyles",
            "harrystylesedit",
            "hstyles",
            "hstylesedit",
            "hslot",
            "gucci"
        ],
        "short_url": "https://tmblr.co/ZF7Hsw2cYQK43",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "image_permalink": "https://meetmeinthehallwaydotmp3.tumblr.com/image/178818466051",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/36e04f537cca3e84ec210d1ecc5e3706/tumblr_pg8bd0T1Tx1r3whe1o1_500.gif",
                    "width": 500,
                    "height": 705
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/36e04f537cca3e84ec210d1ecc5e3706/tumblr_pg8bd0T1Tx1r3whe1o1_500.gif",
                        "width": 500,
                        "height": 705
                    },
                    {
                        "url": "https://66.media.tumblr.com/36e04f537cca3e84ec210d1ecc5e3706/tumblr_pg8bd0T1Tx1r3whe1o1_400.gif",
                        "width": 400,
                        "height": 564
                    },
                    {
                        "url": "https://66.media.tumblr.com/36e04f537cca3e84ec210d1ecc5e3706/tumblr_pg8bd0T1Tx1r3whe1o1_250.gif",
                        "width": 250,
                        "height": 353
                    },
                    {
                        "url": "https://66.media.tumblr.com/36e04f537cca3e84ec210d1ecc5e3706/tumblr_pg8bd0T1Tx1r3whe1o1_100.gif",
                        "width": 100,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/36e04f537cca3e84ec210d1ecc5e3706/tumblr_pg8bd0T1Tx1r3whe1o1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "itslikeipayforit",
        "blog": {
            "name": "itslikeipayforit",
            "title": "kiwi",
            "description": "Sara | <a href=\"https://itslikeipayforit.tumblr.com/post/171056296870/master-list\">Masterlist</a>",
            "url": "https://itslikeipayforit.tumblr.com/",
            "uuid": "t:CorwB9Okw3mtciiDes6CqQ",
            "updated": 1558510725
        },
        "id": 178817652350,
        "post_url": "https://itslikeipayforit.tumblr.com/post/178817652350/promises",
        "slug": "promises",
        "date": "2018-10-07 12:00:53 GMT",
        "timestamp": 1538913653,
        "state": "published",
        "format": "html",
        "reblog_key": "urpn1kUD",
        "tags": [
            "harry styles",
            "harry styles imagine",
            "harry styles imagines",
            "harry styles preference",
            "harry styles preferences",
            "harry styles smut",
            "harry styles smuts",
            "harry styles blurb",
            "haery styles blurbs",
            "harry styles one shot",
            "harry styles one shots",
            "one direction",
            "one direction imagine",
            "one direction preference",
            "harry styles dirty imagine",
            "dom! harry"
        ],
        "short_url": "https://tmblr.co/Z9vw2b2cYNDP_",
        "summary": "Promises",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 371,
        "title": "Promises",
        "body": "<p><i><i>- the one where Grammy means more to Harry then Y/N (part thr<i><i>e</i></i><i><i>e</i></i>)</i><br/></i></p><p><b><a href=\"https://itslikeipayforit.tumblr.com/post/178599134915/so-sorry\">Part 1</a></b></p><p>\n\n<a href=\"https://itslikeipayforit.tumblr.com/post/178765700785/one-chance\"><b>Part</b> <b>2</b></a>  <br/></p><p><b><a href=\"https://itslikeipayforit.tumblr.com/post/171056296870/master-list\">Master List</a></b></p><p><i><b>A/N: Quickest update I’ve ever given! But hope you enjoy + it ain’t\nproof-read so yeah.</b></i></p><p>It’s been over three month since Harry met Y/N at Zonko’s and since then Harry\nhadn’t stopped calling her or texting her. Harry knew he was being annoying but\nhe couldn’t stop, he couldn’t let her walk out of his life yet again.</p><p>Harry had even showed up at her place few times but those were nothing but a\nslam of the door on his face. However, the first time he showed up, she had\nactually listened to what he had to say but when he started to show up often\nshe started to shut the door as soon as she saw it was him. He even spent two\nnights at the porch sitting; eventually falling asleep on the small sofa she\nhad outside. The next morning he hadn’t actually met Y/N at all she had gone to\nwork while he was asleep. However, he did get a sandwich and a bottle of orange\njuice along with a note which just told him to stop disturbing her and he was\nbeing pathetic. Harry already knew he was being pathetic, but he didn’t stop,\nhe couldn’t stop.</p><p>Harry knew he was creating problems in her relation with some ‘Jake’ but he\ndidn’t care and if he was honest he was kind of happy about it. He knew, he was\nbeing selfish but he truly didn’t care. He wasn’t usually like this, he wasn’t\nsomeone who’d break someone else’s relation just so he could be with his love\nbut over time Harry realized Y/N wanted to be with him too, she just didn’t\nwant to leave Jake out of courtesy. Harry still remembered what she said when\nhe first showed up at her place.</p><p>“Harry, I can’t,” she had tears in her eyes. “I’m with Jake\nand I can’t just leave him because you decided to show up after a year.”</p><p>The desperation present in her voice and the need in her eyes was enough to\ntell Harry she wanted to be with him too.</p><p>Harry had even accidentally talked to Jake. Jake had picked up Y/N’s phone\nonce and told him to call back after a while because Y/N was in shower. Harry\nhad curiously asked who he was and he told him he was Jake, Y/N’s boyfriend.\nBefore Harry could say anything else Jake somehow realized he was the one who\nwas texting and sending flowers to his girlfriend. The next thing he did was to\ntell Harry to back off, but he never did.</p><p>Harry threw his phone on the couch before going to the kitchen for getting\nsome wine. He had just called Y/N and then sent two texts afterwards, telling\nher he loved her and he was never going to give up.</p><p>Harry took out the wine from the fridge and made his way back to living\nroom. It was raining heavily then, Harry plopped down on his couch. He checked\nhis phone in hope of a reply from Y/N but she hadn’t just like every other\ntime. Harry sighed before turning the TV on.</p><p>Harry was mindlessly watching F.R.I.E.N.D.S, while thinking about Y/N when\nhe heard his door bell rang. Harry slowly got up from the couch and went\ntowards the door having no idea who it’d be.</p><p>“Coming!” Harry yelled when the person behind the door impatiently\nrang his bell non-stop.</p><p>“Coming, coming, coming,” Harry made a small jog towards the door\nand opened it finally making the person stop abusing the bell. However, before\nHarry could even see the person, something was thrown at his face. He looked\ndown at his hand which now carried a bouquet of flowers. Harry realized it was\nthe bouquet he had sent Y/N that morning.</p><p>“You asshole! He broke up with me!” It was Y/N.</p><p>Harry was shocked to see her there, with water dripping from her raven hair,\nsweater soaked and boots filled with water. But as much he was shocked, he was\never so happy.</p><p>“Are you gonna just look at my face or would you say something!”\nY/N yelled.</p><p>“Oh, yeah - I’m sorry?” He wasn’t sorry at all, in fact a small\nsmile tugged itself on his lips.</p><p>“You’re fucking smiling!” Y/N yelled furiously throwing her hands\nin the air. “He told me he couldn’t be with me if my ex keeps sending me\nflowers and call me all the time!”</p><p>“I’m sorry,” Harry forced a frown on his face. “Come in,\nyou’re wet,” he opened the door further and stepped aside for her to get\nin.</p><p>Y/N stomped in throwing her boots off. “You know you’re fucking\nselfish!”</p><p>“I know, I told you that but you never really listened,” Harry\nsaid timidly.</p><p>“God Harry, I wanna punch you in the face! At first you tell me some\nshits and make me leave, then you realize what you said after a whole damn year\nand then you make my boyfriend leave! For fucks sake I don’t know what to\nfucking do!” Y/N exclaimed pulling her hair slightly as tears appeared on\nher face.</p><p>“Y/N,” Harry tried to calm her putting a hand on her shoulder but\nshe quickly pushed him away.</p><p>“Don’t fucking touch me!!” she yelled. “I don’t get it, why\nthings have to happen when you fucking want! When you thought you didn’t need\nme, you tossed me aside like a toy and when you felt like you needed me, you\nwent crazy and just created a situation where my boyfriend had no option but to\nleave!”</p><p>“It’s not true,” Harry was cut off.</p><p>“'It’s not true’, you say! Then what is? You fucking- ugh you fucking\ndidn’t even call me. If I mean so much to you then why didn’t you fucking call\nme?”</p><p>“I called you, Y/N. But your phone was off,” Harry argued but he\ndidn’t raise his voice, he didn’t have the right - he knew that.</p><p>“Two days, three days, alright 7 days, after that? I was with you for\nfive years, we were friends for two years before that, I at least deserved one\nmonth waiting, didn’t I? But you were making out with that French model after\nliterally two weeks,” Y/N chuckled. “I was stupid to think I meant at\nleast something to you.”</p><p>“Y/N you mean everything to me,” Harry said desperately.</p><p>“You didn’t make me feel like it, you just made me feel like a toy, you\nused me then threw me away!” Y/N said again. “I don’t know why I even\ncame here.”</p><p>Y/N was about to walk out again but Harry sprinted after and pulled her by\nher arm, but he made sure he wasn’t hurting.</p><p>He won’t let her walk away yet again.</p><p>“Let me go!” Y/N said trying free herself from his grip, but his\ngrip was firm.</p><p>“Please, hear me out!” Harry said.</p><p>“I heard you at Zonko’s,” she argued, still trying to set herself\nfree from his grip.</p><p>“Please,” Harry said loosening his grip, he didn’t want to make\nher feel uncomfortable in any way possible, “Just, please - can you seat\ndown for a minute?”</p><p>Y/N said nothing but she made her way to his sofa and sat down hugging\nherself, the wet clothes were making her feel cold.</p><p>“You wanna change?” Harry asked.</p><p>“No,” she replied curtly.</p><p>Harry sighed and sat down next to her.</p><p>It was his fault really, and he was paying for what he did. Only if he\ncalled her tried to get her back, back then they wouldn’t have in this\nsituation. Y/N would’ve been with him this whole time. But he didn’t, he just\nforgot her. Harry still didn’t know how he managed to do that and how he\nmanaged to live over a year without her.</p><p>“Y/N I know I was an asshole and I’m truly sorry about what I\ndid.”</p><p>“Sorry doesn’t fucking cut it off.”</p><p>“I know! I’ll do whatever to make you forgive me, please.”</p><p>“I hate you so much you know that,” Y/N looked down as the tears\nran down her already wet cheek.</p><p>“Love you don’t mean that,” Harry knew it but that didn’t stop his\nheart to drop. Harry hated himself. He truly messed up and he can never forgive\nhimself for making her feel like that.</p><p>Harry scooted closure to Y/N and wrapped his arm around Y/N’s shaking form. Harry\nabsolutely hated to see Y/N cry but knowing it was for him, he just want dug a\nhole in the ground and disappear, but he had to make things right with her. He\nloved her and he was not going to let her go like the last time.</p><p>“Y/N-” Harry was taken off guard as Y/N threw her arms over his\nshoulder as a huge sob racked through her body. Harry didn’t waste any time to\nwrap his arms around her. Harry could feel his whole body getting wet for Y/N’s\nclothes but he didn’t care. He put his chin over Y/N’s head as he kept mumbling\nhow sorry he was and how much he loved her.</p><p>“I missed you so much and it felt like you completely forgot me, it\nfelt as if you didn’t even know I ever existed,” Y/N sobbed.</p><p>“I know, I’m so sorry,” Harry said as he felt his own tear falling.</p><p>“Why would you do that?” Y/N pulled the collar of his t-shirt\nlooking at him desperately; tears running down; eyes puffy; nose red and cheek\nflushed.</p><p>“I don’t know, I’m so sorry,” He looked down at her. His heart\nbroke seeing her like that and knowing he caused it, he felt his heart\nshattering</p><p>Y/N let go of his collars as she buried her face in her hand. Harry quickly\npulled her closure to him and rocked her back and forth as she continued to\ncry.</p><p>“Okay,” Y/N said after a while. Her sobs died down as she sat\nstraight. Y/N wiped her face with her sweater sleeve, even thought it was wet\nitself and looked up at Harry.</p><p>“I’ll give you one chance, but we are not in a relation or anything -\nnot even friends. We’re starting from the very beginning. And I swear, if you\nbreak my heart again Harry, you’ll never see my face ever again,” Y/N said\nsternly making a huge grin appear on Harry face.</p><p>“Oh my god, thank you so much!” Harry hugged Y/N again. “I\nwon’t let you down this time, I promise.”</p>",
        "reblog": {
            "comment": "<p><i><i>- the one where Grammy means more to Harry then Y/N (part thr<i><i>e</i></i><i><i>e</i></i>)</i><br></i></p><p><b><a href=\"https://itslikeipayforit.tumblr.com/post/178599134915/so-sorry\">Part 1</a></b></p><p>\n\n<a href=\"https://itslikeipayforit.tumblr.com/post/178765700785/one-chance\"><b>Part</b> <b>2</b></a>  <br></p><p><b><a href=\"https://itslikeipayforit.tumblr.com/post/171056296870/master-list\">Master List</a></b></p><p><i><b>A/N: Quickest update I’ve ever given! But hope you enjoy + it ain’t\nproof-read so yeah.</b></i></p><p>It’s been over three month since Harry met Y/N at Zonko’s and since then Harry\nhadn’t stopped calling her or texting her. Harry knew he was being annoying but\nhe couldn’t stop, he couldn’t let her walk out of his life yet again.</p><p>Harry had even showed up at her place few times but those were nothing but a\nslam of the door on his face. However, the first time he showed up, she had\nactually listened to what he had to say but when he started to show up often\nshe started to shut the door as soon as she saw it was him. He even spent two\nnights at the porch sitting; eventually falling asleep on the small sofa she\nhad outside. The next morning he hadn’t actually met Y/N at all she had gone to\nwork while he was asleep. However, he did get a sandwich and a bottle of orange\njuice along with a note which just told him to stop disturbing her and he was\nbeing pathetic. Harry already knew he was being pathetic, but he didn’t stop,\nhe couldn’t stop.</p><p>Harry knew he was creating problems in her relation with some ‘Jake’ but he\ndidn’t care and if he was honest he was kind of happy about it. He knew, he was\nbeing selfish but he truly didn’t care. He wasn’t usually like this, he wasn’t\nsomeone who’d break someone else’s relation just so he could be with his love\nbut over time Harry realized Y/N wanted to be with him too, she just didn’t\nwant to leave Jake out of courtesy. Harry still remembered what she said when\nhe first showed up at her place.</p><p>“Harry, I can’t,” she had tears in her eyes. “I’m with Jake\nand I can’t just leave him because you decided to show up after a year.”</p><p>The desperation present in her voice and the need in her eyes was enough to\ntell Harry she wanted to be with him too.</p><p>Harry had even accidentally talked to Jake. Jake had picked up Y/N’s phone\nonce and told him to call back after a while because Y/N was in shower. Harry\nhad curiously asked who he was and he told him he was Jake, Y/N’s boyfriend.\nBefore Harry could say anything else Jake somehow realized he was the one who\nwas texting and sending flowers to his girlfriend. The next thing he did was to\ntell Harry to back off, but he never did.</p><p>Harry threw his phone on the couch before going to the kitchen for getting\nsome wine. He had just called Y/N and then sent two texts afterwards, telling\nher he loved her and he was never going to give up.</p><p>Harry took out the wine from the fridge and made his way back to living\nroom. It was raining heavily then, Harry plopped down on his couch. He checked\nhis phone in hope of a reply from Y/N but she hadn’t just like every other\ntime. Harry sighed before turning the TV on.</p><p>Harry was mindlessly watching F.R.I.E.N.D.S, while thinking about Y/N when\nhe heard his door bell rang. Harry slowly got up from the couch and went\ntowards the door having no idea who it’d be.</p><p>“Coming!” Harry yelled when the person behind the door impatiently\nrang his bell non-stop.</p><p>“Coming, coming, coming,” Harry made a small jog towards the door\nand opened it finally making the person stop abusing the bell. However, before\nHarry could even see the person, something was thrown at his face. He looked\ndown at his hand which now carried a bouquet of flowers. Harry realized it was\nthe bouquet he had sent Y/N that morning.</p><p>“You asshole! He broke up with me!” It was Y/N.</p><p>Harry was shocked to see her there, with water dripping from her raven hair,\nsweater soaked and boots filled with water. But as much he was shocked, he was\never so happy.</p><p>“Are you gonna just look at my face or would you say something!”\nY/N yelled.</p><p>“Oh, yeah - I’m sorry?” He wasn’t sorry at all, in fact a small\nsmile tugged itself on his lips.</p><p>“You’re fucking smiling!” Y/N yelled furiously throwing her hands\nin the air. “He told me he couldn’t be with me if my ex keeps sending me\nflowers and call me all the time!”</p><p>“I’m sorry,” Harry forced a frown on his face. “Come in,\nyou’re wet,” he opened the door further and stepped aside for her to get\nin.</p><p>Y/N stomped in throwing her boots off. “You know you’re fucking\nselfish!”</p><p>“I know, I told you that but you never really listened,” Harry\nsaid timidly.</p><p>“God Harry, I wanna punch you in the face! At first you tell me some\nshits and make me leave, then you realize what you said after a whole damn year\nand then you make my boyfriend leave! For fucks sake I don’t know what to\nfucking do!” Y/N exclaimed pulling her hair slightly as tears appeared on\nher face.</p><p>“Y/N,” Harry tried to calm her putting a hand on her shoulder but\nshe quickly pushed him away.</p><p>“Don’t fucking touch me!!” she yelled. “I don’t get it, why\nthings have to happen when you fucking want! When you thought you didn’t need\nme, you tossed me aside like a toy and when you felt like you needed me, you\nwent crazy and just created a situation where my boyfriend had no option but to\nleave!”</p><p>“It’s not true,” Harry was cut off.</p><p>“'It’s not true’, you say! Then what is? You fucking- ugh you fucking\ndidn’t even call me. If I mean so much to you then why didn’t you fucking call\nme?”</p><p>“I called you, Y/N. But your phone was off,” Harry argued but he\ndidn’t raise his voice, he didn’t have the right - he knew that.</p><p>“Two days, three days, alright 7 days, after that? I was with you for\nfive years, we were friends for two years before that, I at least deserved one\nmonth waiting, didn’t I? But you were making out with that French model after\nliterally two weeks,” Y/N chuckled. “I was stupid to think I meant at\nleast something to you.”</p><p>“Y/N you mean everything to me,” Harry said desperately.</p><p>“You didn’t make me feel like it, you just made me feel like a toy, you\nused me then threw me away!” Y/N said again. “I don’t know why I even\ncame here.”</p><p>Y/N was about to walk out again but Harry sprinted after and pulled her by\nher arm, but he made sure he wasn’t hurting.</p><p>He won’t let her walk away yet again.</p><p>“Let me go!” Y/N said trying free herself from his grip, but his\ngrip was firm.</p><p>“Please, hear me out!” Harry said.</p><p>“I heard you at Zonko’s,” she argued, still trying to set herself\nfree from his grip.</p><p>“Please,” Harry said loosening his grip, he didn’t want to make\nher feel uncomfortable in any way possible, “Just, please - can you seat\ndown for a minute?”</p><p>Y/N said nothing but she made her way to his sofa and sat down hugging\nherself, the wet clothes were making her feel cold.</p><p>“You wanna change?” Harry asked.</p><p>“No,” she replied curtly.</p><p>Harry sighed and sat down next to her.</p><p>It was his fault really, and he was paying for what he did. Only if he\ncalled her tried to get her back, back then they wouldn’t have in this\nsituation. Y/N would’ve been with him this whole time. But he didn’t, he just\nforgot her. Harry still didn’t know how he managed to do that and how he\nmanaged to live over a year without her.</p><p>“Y/N I know I was an asshole and I’m truly sorry about what I\ndid.”</p><p>“Sorry doesn’t fucking cut it off.”</p><p>“I know! I’ll do whatever to make you forgive me, please.”</p><p>“I hate you so much you know that,” Y/N looked down as the tears\nran down her already wet cheek.</p><p>“Love you don’t mean that,” Harry knew it but that didn’t stop his\nheart to drop. Harry hated himself. He truly messed up and he can never forgive\nhimself for making her feel like that.</p><p>Harry scooted closure to Y/N and wrapped his arm around Y/N’s shaking form. Harry\nabsolutely hated to see Y/N cry but knowing it was for him, he just want dug a\nhole in the ground and disappear, but he had to make things right with her. He\nloved her and he was not going to let her go like the last time.</p><p>“Y/N-” Harry was taken off guard as Y/N threw her arms over his\nshoulder as a huge sob racked through her body. Harry didn’t waste any time to\nwrap his arms around her. Harry could feel his whole body getting wet for Y/N’s\nclothes but he didn’t care. He put his chin over Y/N’s head as he kept mumbling\nhow sorry he was and how much he loved her.</p><p>“I missed you so much and it felt like you completely forgot me, it\nfelt as if you didn’t even know I ever existed,” Y/N sobbed.</p><p>“I know, I’m so sorry,” Harry said as he felt his own tear falling.</p><p>“Why would you do that?” Y/N pulled the collar of his t-shirt\nlooking at him desperately; tears running down; eyes puffy; nose red and cheek\nflushed.</p><p>“I don’t know, I’m so sorry,” He looked down at her. His heart\nbroke seeing her like that and knowing he caused it, he felt his heart\nshattering</p><p>Y/N let go of his collars as she buried her face in her hand. Harry quickly\npulled her closure to him and rocked her back and forth as she continued to\ncry.</p><p>“Okay,” Y/N said after a while. Her sobs died down as she sat\nstraight. Y/N wiped her face with her sweater sleeve, even thought it was wet\nitself and looked up at Harry.</p><p>“I’ll give you one chance, but we are not in a relation or anything -\nnot even friends. We’re starting from the very beginning. And I swear, if you\nbreak my heart again Harry, you’ll never see my face ever again,” Y/N said\nsternly making a huge grin appear on Harry face.</p><p>“Oh my god, thank you so much!” Harry hugged Y/N again. “I\nwon’t let you down this time, I promise.”</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "itslikeipayforit",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#E8DBDB",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/b8167152e2d6b1997405bb88590042fe/qro6kzq/ot8prm1jg/tumblr_static_1144412284-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/b8167152e2d6b1997405bb88590042fe/qro6kzq/ot8prm1jg/tumblr_static_1144412284-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/b8167152e2d6b1997405bb88590042fe/qro6kzq/ot8prm1jg/tumblr_static_1144412284-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#444444",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178817652350"
                },
                "content_raw": "<p><i><i>- the one where Grammy means more to Harry then Y/N (part thr<i><i>e</i></i><i><i>e</i></i>)</i><br></i></p><p><b><a href=\"https://itslikeipayforit.tumblr.com/post/178599134915/so-sorry\">Part 1</a></b></p><p>\n\n<a href=\"https://itslikeipayforit.tumblr.com/post/178765700785/one-chance\"><b>Part</b> <b>2</b></a>  <br></p><p><b><a href=\"https://itslikeipayforit.tumblr.com/post/171056296870/master-list\">Master List</a></b></p><p><i><b>A/N: Quickest update I’ve ever given! But hope you enjoy + it ain’t\nproof-read so yeah.</b></i></p><p>It’s been over three month since Harry met Y/N at Zonko’s and since then Harry\nhadn’t stopped calling her or texting her. Harry knew he was being annoying but\nhe couldn’t stop, he couldn’t let her walk out of his life yet again.</p><p>Harry had even showed up at her place few times but those were nothing but a\nslam of the door on his face. However, the first time he showed up, she had\nactually listened to what he had to say but when he started to show up often\nshe started to shut the door as soon as she saw it was him. He even spent two\nnights at the porch sitting; eventually falling asleep on the small sofa she\nhad outside. The next morning he hadn’t actually met Y/N at all she had gone to\nwork while he was asleep. However, he did get a sandwich and a bottle of orange\njuice along with a note which just told him to stop disturbing her and he was\nbeing pathetic. Harry already knew he was being pathetic, but he didn’t stop,\nhe couldn’t stop.</p><p>Harry knew he was creating problems in her relation with some ‘Jake’ but he\ndidn’t care and if he was honest he was kind of happy about it. He knew, he was\nbeing selfish but he truly didn’t care. He wasn’t usually like this, he wasn’t\nsomeone who’d break someone else’s relation just so he could be with his love\nbut over time Harry realized Y/N wanted to be with him too, she just didn’t\nwant to leave Jake out of courtesy. Harry still remembered what she said when\nhe first showed up at her place.</p><p>“Harry, I can’t,” she had tears in her eyes. “I’m with Jake\nand I can’t just leave him because you decided to show up after a year.”</p><p>The desperation present in her voice and the need in her eyes was enough to\ntell Harry she wanted to be with him too.</p><p>Harry had even accidentally talked to Jake. Jake had picked up Y/N’s phone\nonce and told him to call back after a while because Y/N was in shower. Harry\nhad curiously asked who he was and he told him he was Jake, Y/N’s boyfriend.\nBefore Harry could say anything else Jake somehow realized he was the one who\nwas texting and sending flowers to his girlfriend. The next thing he did was to\ntell Harry to back off, but he never did.</p><p>Harry threw his phone on the couch before going to the kitchen for getting\nsome wine. He had just called Y/N and then sent two texts afterwards, telling\nher he loved her and he was never going to give up.</p><p>Harry took out the wine from the fridge and made his way back to living\nroom. It was raining heavily then, Harry plopped down on his couch. He checked\nhis phone in hope of a reply from Y/N but she hadn’t just like every other\ntime. Harry sighed before turning the TV on.</p><p>Harry was mindlessly watching F.R.I.E.N.D.S, while thinking about Y/N when\nhe heard his door bell rang. Harry slowly got up from the couch and went\ntowards the door having no idea who it’d be.</p><p>“Coming!” Harry yelled when the person behind the door impatiently\nrang his bell non-stop.</p><p>“Coming, coming, coming,” Harry made a small jog towards the door\nand opened it finally making the person stop abusing the bell. However, before\nHarry could even see the person, something was thrown at his face. He looked\ndown at his hand which now carried a bouquet of flowers. Harry realized it was\nthe bouquet he had sent Y/N that morning.</p><p>“You asshole! He broke up with me!” It was Y/N.</p><p>Harry was shocked to see her there, with water dripping from her raven hair,\nsweater soaked and boots filled with water. But as much he was shocked, he was\never so happy.</p><p>“Are you gonna just look at my face or would you say something!”\nY/N yelled.</p><p>“Oh, yeah - I’m sorry?” He wasn’t sorry at all, in fact a small\nsmile tugged itself on his lips.</p><p>“You’re fucking smiling!” Y/N yelled furiously throwing her hands\nin the air. “He told me he couldn’t be with me if my ex keeps sending me\nflowers and call me all the time!”</p><p>“I’m sorry,” Harry forced a frown on his face. “Come in,\nyou’re wet,” he opened the door further and stepped aside for her to get\nin.</p><p>Y/N stomped in throwing her boots off. “You know you’re fucking\nselfish!”</p><p>“I know, I told you that but you never really listened,” Harry\nsaid timidly.</p><p>“God Harry, I wanna punch you in the face! At first you tell me some\nshits and make me leave, then you realize what you said after a whole damn year\nand then you make my boyfriend leave! For fucks sake I don’t know what to\nfucking do!” Y/N exclaimed pulling her hair slightly as tears appeared on\nher face.</p><p>“Y/N,” Harry tried to calm her putting a hand on her shoulder but\nshe quickly pushed him away.</p><p>“Don’t fucking touch me!!” she yelled. “I don’t get it, why\nthings have to happen when you fucking want! When you thought you didn’t need\nme, you tossed me aside like a toy and when you felt like you needed me, you\nwent crazy and just created a situation where my boyfriend had no option but to\nleave!”</p><p>“It’s not true,” Harry was cut off.</p><p>“'It’s not true’, you say! Then what is? You fucking- ugh you fucking\ndidn’t even call me. If I mean so much to you then why didn’t you fucking call\nme?”</p><p>“I called you, Y/N. But your phone was off,” Harry argued but he\ndidn’t raise his voice, he didn’t have the right - he knew that.</p><p>“Two days, three days, alright 7 days, after that? I was with you for\nfive years, we were friends for two years before that, I at least deserved one\nmonth waiting, didn’t I? But you were making out with that French model after\nliterally two weeks,” Y/N chuckled. “I was stupid to think I meant at\nleast something to you.”</p><p>“Y/N you mean everything to me,” Harry said desperately.</p><p>“You didn’t make me feel like it, you just made me feel like a toy, you\nused me then threw me away!” Y/N said again. “I don’t know why I even\ncame here.”</p><p>Y/N was about to walk out again but Harry sprinted after and pulled her by\nher arm, but he made sure he wasn’t hurting.</p><p>He won’t let her walk away yet again.</p><p>“Let me go!” Y/N said trying free herself from his grip, but his\ngrip was firm.</p><p>“Please, hear me out!” Harry said.</p><p>“I heard you at Zonko’s,” she argued, still trying to set herself\nfree from his grip.</p><p>“Please,” Harry said loosening his grip, he didn’t want to make\nher feel uncomfortable in any way possible, “Just, please - can you seat\ndown for a minute?”</p><p>Y/N said nothing but she made her way to his sofa and sat down hugging\nherself, the wet clothes were making her feel cold.</p><p>“You wanna change?” Harry asked.</p><p>“No,” she replied curtly.</p><p>Harry sighed and sat down next to her.</p><p>It was his fault really, and he was paying for what he did. Only if he\ncalled her tried to get her back, back then they wouldn’t have in this\nsituation. Y/N would’ve been with him this whole time. But he didn’t, he just\nforgot her. Harry still didn’t know how he managed to do that and how he\nmanaged to live over a year without her.</p><p>“Y/N I know I was an asshole and I’m truly sorry about what I\ndid.”</p><p>“Sorry doesn’t fucking cut it off.”</p><p>“I know! I’ll do whatever to make you forgive me, please.”</p><p>“I hate you so much you know that,” Y/N looked down as the tears\nran down her already wet cheek.</p><p>“Love you don’t mean that,” Harry knew it but that didn’t stop his\nheart to drop. Harry hated himself. He truly messed up and he can never forgive\nhimself for making her feel like that.</p><p>Harry scooted closure to Y/N and wrapped his arm around Y/N’s shaking form. Harry\nabsolutely hated to see Y/N cry but knowing it was for him, he just want dug a\nhole in the ground and disappear, but he had to make things right with her. He\nloved her and he was not going to let her go like the last time.</p><p>“Y/N-” Harry was taken off guard as Y/N threw her arms over his\nshoulder as a huge sob racked through her body. Harry didn’t waste any time to\nwrap his arms around her. Harry could feel his whole body getting wet for Y/N’s\nclothes but he didn’t care. He put his chin over Y/N’s head as he kept mumbling\nhow sorry he was and how much he loved her.</p><p>“I missed you so much and it felt like you completely forgot me, it\nfelt as if you didn’t even know I ever existed,” Y/N sobbed.</p><p>“I know, I’m so sorry,” Harry said as he felt his own tear falling.</p><p>“Why would you do that?” Y/N pulled the collar of his t-shirt\nlooking at him desperately; tears running down; eyes puffy; nose red and cheek\nflushed.</p><p>“I don’t know, I’m so sorry,” He looked down at her. His heart\nbroke seeing her like that and knowing he caused it, he felt his heart\nshattering</p><p>Y/N let go of his collars as she buried her face in her hand. Harry quickly\npulled her closure to him and rocked her back and forth as she continued to\ncry.</p><p>“Okay,” Y/N said after a while. Her sobs died down as she sat\nstraight. Y/N wiped her face with her sweater sleeve, even thought it was wet\nitself and looked up at Harry.</p><p>“I’ll give you one chance, but we are not in a relation or anything -\nnot even friends. We’re starting from the very beginning. And I swear, if you\nbreak my heart again Harry, you’ll never see my face ever again,” Y/N said\nsternly making a huge grin appear on Harry face.</p><p>“Oh my god, thank you so much!” Harry hugged Y/N again. “I\nwon’t let you down this time, I promise.”</p>",
                "content": "<p><i><i>- the one where Grammy means more to Harry then Y/N (part thr<i><i>e</i></i><i><i>e</i></i>)</i><br /></i></p><p><b><a href=\"https://itslikeipayforit.tumblr.com/post/178599134915/so-sorry\">Part 1</a></b></p><p>\n\n<a href=\"https://itslikeipayforit.tumblr.com/post/178765700785/one-chance\"><b>Part</b>&nbsp;<b>2</b></a>  <br /></p><p><b><a href=\"https://itslikeipayforit.tumblr.com/post/171056296870/master-list\">Master List</a></b></p><p><i><b>A/N: Quickest&nbsp;update I&rsquo;ve ever given! But hope you enjoy + it ain&rsquo;t\nproof-read so yeah.</b></i></p><p>It&rsquo;s been over three month since Harry met Y/N at Zonko&rsquo;s and since then Harry\nhadn&rsquo;t stopped calling her or texting her. Harry knew he was being annoying but\nhe couldn&rsquo;t stop, he couldn&rsquo;t let her walk out of his life yet again.</p><p>Harry had even showed up at her place few times but those were nothing but a\nslam of the door on his face. However, the first time he showed up, she had\nactually listened to what he had to say but when he started to show up often\nshe started to shut the door as soon as she saw it was him. He even spent two\nnights at the porch sitting; eventually falling asleep on the small sofa she\nhad outside. The next morning he hadn&rsquo;t actually met Y/N at all she had gone to\nwork while he was asleep. However, he did get a sandwich and a bottle of orange\njuice along with a note which just told him to stop disturbing her and he was\nbeing pathetic. Harry already knew he was being pathetic, but he didn&rsquo;t stop,\nhe couldn&rsquo;t stop.</p><p>Harry knew he was creating problems in her relation with some &lsquo;Jake&rsquo; but he\ndidn&rsquo;t care and if he was honest he was kind of happy about it. He knew, he was\nbeing selfish but he truly didn&rsquo;t care. He wasn&rsquo;t usually like this, he wasn&rsquo;t\nsomeone who&rsquo;d break someone else&rsquo;s relation just so he could be with his love\nbut over time Harry realized Y/N wanted to be with him too, she just didn&rsquo;t\nwant to leave Jake out of courtesy. Harry still remembered what she said when\nhe first showed up at her place.</p><p>&ldquo;Harry, I can&rsquo;t,&rdquo; she had tears in her eyes. &ldquo;I&rsquo;m with Jake\nand I can&rsquo;t just leave him because you decided to show up after a year.&rdquo;</p><p>The desperation present in her voice and the need in her eyes was enough to\ntell Harry she wanted to be with him too.</p><p>Harry had even accidentally talked to Jake. Jake had picked up Y/N&rsquo;s phone\nonce and told him to call back after a while because Y/N was in shower. Harry\nhad curiously asked who he was and he told him he was Jake, Y/N&rsquo;s boyfriend.\nBefore Harry could say anything else Jake somehow realized he was the one who\nwas texting and sending flowers to his girlfriend. The next thing he did was to\ntell Harry to back off, but he never did.</p><p>Harry threw his phone on the couch before going to the kitchen for getting\nsome wine. He had just called Y/N and then sent two texts afterwards, telling\nher he loved her and he was never going to give up.</p><p>Harry took out the wine from the fridge and made his way back to living\nroom. It was raining heavily then, Harry plopped down on his couch. He checked\nhis phone in hope of a reply from Y/N but she hadn&rsquo;t just like every other\ntime. Harry sighed before turning the TV on.</p><p>Harry was mindlessly watching F.R.I.E.N.D.S, while thinking about Y/N when\nhe heard his door bell rang. Harry slowly got up from the couch and went\ntowards the door having no idea who it&rsquo;d be.</p><p>&ldquo;Coming!&rdquo; Harry yelled when the person behind the door impatiently\nrang his bell non-stop.</p><p>&ldquo;Coming, coming, coming,&rdquo; Harry made a small jog towards the door\nand opened it finally making the person stop abusing the bell. However, before\nHarry could even see the person, something was thrown at his face. He looked\ndown at his hand which now carried a bouquet of flowers. Harry realized it was\nthe bouquet he had sent Y/N that morning.</p><p>&ldquo;You asshole! He broke up with me!&rdquo; It was Y/N.</p><p>Harry was shocked to see her there, with water dripping from her raven hair,\nsweater soaked and boots filled with water. But as much he was shocked, he was\never so happy.</p><p>&ldquo;Are you gonna just look at my face or would you say something!&rdquo;\nY/N yelled.</p><p>&ldquo;Oh, yeah - I&rsquo;m sorry?&rdquo; He wasn&rsquo;t sorry at all, in fact a small\nsmile tugged itself on his lips.</p><p>&ldquo;You&rsquo;re fucking smiling!&rdquo; Y/N yelled furiously throwing her hands\nin the air. &ldquo;He told me he couldn&rsquo;t be with me if my ex keeps sending me\nflowers and call me all the time!&rdquo;</p><p>&ldquo;I&rsquo;m sorry,&rdquo; Harry forced a frown on his face. &ldquo;Come in,\nyou&rsquo;re wet,&rdquo; he opened the door further and stepped aside for her to get\nin.</p><p>Y/N stomped in throwing her boots off. &ldquo;You know you&rsquo;re fucking\nselfish!&rdquo;</p><p>&ldquo;I know, I told you that but you never really listened,&rdquo; Harry\nsaid timidly.</p><p>&ldquo;God Harry, I wanna punch you in the face! At first you tell me some\nshits and make me leave, then you realize what you said after a whole damn year\nand then you make my boyfriend leave! For fucks sake I don&rsquo;t know what to\nfucking do!&rdquo; Y/N exclaimed pulling her hair slightly as tears appeared on\nher face.</p><p>&ldquo;Y/N,&rdquo; Harry tried to calm her putting a hand on her shoulder but\nshe quickly pushed him away.</p><p>&ldquo;Don&rsquo;t fucking touch me!!&rdquo; she yelled. &ldquo;I don&rsquo;t get it, why\nthings have to happen when you fucking want! When you thought you didn&rsquo;t need\nme, you tossed me aside like a toy and when you felt like you needed me, you\nwent crazy and just created a situation where my boyfriend had no option but to\nleave!&rdquo;</p><p>&ldquo;It&rsquo;s not true,&rdquo; Harry was cut off.</p><p>&ldquo;'It&rsquo;s not true&rsquo;, you say! Then what is? You fucking- ugh you fucking\ndidn&rsquo;t even call me. If I mean so much to you then why didn&rsquo;t you fucking call\nme?&rdquo;</p><p>&ldquo;I called you, Y/N. But your phone was off,&rdquo; Harry argued but he\ndidn&rsquo;t raise his voice, he didn&rsquo;t have the right - he knew that.</p><p>&ldquo;Two days, three days, alright 7 days, after that? I was with you for\nfive years, we were friends for two years before that, I at least deserved one\nmonth waiting, didn&rsquo;t I? But you were making out with that French model after\nliterally two weeks,&rdquo; Y/N chuckled. &ldquo;I was stupid to think I meant at\nleast something to you.&rdquo;</p><p>&ldquo;Y/N you mean everything to me,&rdquo; Harry said desperately.</p><p>&ldquo;You didn&rsquo;t make me feel like it, you just made me feel like a toy, you\nused me then threw me away!&rdquo; Y/N said again. &ldquo;I don&rsquo;t know why I even\ncame here.&rdquo;</p><p>Y/N was about to walk out again but Harry sprinted after and pulled her by\nher arm, but he made sure he wasn&rsquo;t hurting.</p><p>He won&rsquo;t let her walk away yet again.</p><p>&ldquo;Let me go!&rdquo; Y/N said trying free herself from his grip, but his\ngrip was firm.</p><p>&ldquo;Please, hear me out!&rdquo; Harry said.</p><p>&ldquo;I heard you at Zonko&rsquo;s,&rdquo; she argued, still trying to set herself\nfree from his grip.</p><p>&ldquo;Please,&rdquo; Harry said loosening his grip, he didn&rsquo;t want to make\nher feel uncomfortable in any way possible, &ldquo;Just, please - can you seat\ndown for a minute?&rdquo;</p><p>Y/N said nothing but she made her way to his sofa and sat down hugging\nherself, the wet clothes were making her feel cold.</p><p>&ldquo;You wanna change?&rdquo; Harry asked.</p><p>&ldquo;No,&rdquo; she replied curtly.</p><p>Harry sighed and sat down next to her.</p><p>It was his fault really, and he was paying for what he did. Only if he\ncalled her tried to get her back, back then they wouldn&rsquo;t have in this\nsituation. Y/N would&rsquo;ve been with him this whole time. But he didn&rsquo;t, he just\nforgot her. Harry still didn&rsquo;t know how he managed to do that and how he\nmanaged to live over a year without her.</p><p>&ldquo;Y/N I know I was an asshole and I&rsquo;m truly sorry about what I\ndid.&rdquo;</p><p>&ldquo;Sorry doesn&rsquo;t fucking cut it off.&rdquo;</p><p>&ldquo;I know! I&rsquo;ll do whatever to make you forgive me, please.&rdquo;</p><p>&ldquo;I hate you so much you know that,&rdquo; Y/N looked down as the tears\nran down her already wet cheek.</p><p>&ldquo;Love you don&rsquo;t mean that,&rdquo; Harry knew it but that didn&rsquo;t stop his\nheart to drop. Harry hated himself. He truly messed up and he can never forgive\nhimself for making her feel like that.</p><p>Harry scooted closure to Y/N and wrapped his arm around Y/N&rsquo;s shaking form. Harry\nabsolutely hated to see Y/N cry but knowing it was for him, he just want dug a\nhole in the ground and disappear, but he had to make things right with her. He\nloved her and he was not going to let her go like the last time.</p><p>&ldquo;Y/N-&rdquo; Harry was taken off guard as Y/N threw her arms over his\nshoulder as a huge sob racked through her body. Harry didn&rsquo;t waste any time to\nwrap his arms around her. Harry could feel his whole body getting wet for Y/N&rsquo;s\nclothes but he didn&rsquo;t care. He put his chin over Y/N&rsquo;s head as he kept mumbling\nhow sorry he was and how much he loved her.</p><p>&ldquo;I missed you so much and it felt like you completely forgot me, it\nfelt as if you didn&rsquo;t even know I ever existed,&rdquo; Y/N sobbed.</p><p>&ldquo;I know, I&rsquo;m so sorry,&rdquo; Harry said as he felt his own tear falling.</p><p>&ldquo;Why would you do that?&rdquo; Y/N pulled the collar of his t-shirt\nlooking at him desperately; tears running down; eyes puffy; nose red and cheek\nflushed.</p><p>&ldquo;I don&rsquo;t know, I&rsquo;m so sorry,&rdquo; He looked down at her. His heart\nbroke seeing her like that and knowing he caused it, he felt his heart\nshattering</p><p>Y/N let go of his collars as she buried her face in her hand. Harry quickly\npulled her closure to him and rocked her back and forth as she continued to\ncry.</p><p>&ldquo;Okay,&rdquo; Y/N said after a while. Her sobs died down as she sat\nstraight. Y/N wiped her face with her sweater sleeve, even thought it was wet\nitself and looked up at Harry.</p><p>&ldquo;I&rsquo;ll give you one chance, but we are not in a relation or anything -\nnot even friends. We&rsquo;re starting from the very beginning. And I swear, if you\nbreak my heart again Harry, you&rsquo;ll never see my face ever again,&rdquo; Y/N said\nsternly making a huge grin appear on Harry face.</p><p>&ldquo;Oh my god, thank you so much!&rdquo; Harry hugged Y/N again. &ldquo;I\nwon&rsquo;t let you down this time, I promise.&rdquo;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "stylesbandshirts",
        "blog": {
            "name": "stylesbandshirts",
            "title": "...",
            "description": "Irene / 22 / Netherlands \nI just really love Harry and Louis.",
            "url": "https://stylesbandshirts.tumblr.com/",
            "uuid": "t:N79Zoi9xe4XHiLXd4oqYBg",
            "updated": 1558478729
        },
        "id": 178816801736,
        "post_url": "https://stylesbandshirts.tumblr.com/post/178816801736/this-is-titled-harrys-long-ass-neck-as-worm-in",
        "slug": "this-is-titled-harrys-long-ass-neck-as-worm-in",
        "date": "2018-10-07 11:05:36 GMT",
        "timestamp": 1538910336,
        "state": "published",
        "format": "html",
        "reblog_key": "fT462nry",
        "tags": [
            "harry styles",
            "harry apple",
            "idek why",
            "i need to learn stuff and i don't want to",
            "im so sorry",
            "anyway enjoy my bad photoshopping lmao",
            "harry"
        ],
        "short_url": "https://tmblr.co/ZHFf-s2cYJzl8",
        "summary": "this is titled “harry’s long ass neck as worm in an apple” and was inspired by @watchyourattitude‘s tag on this photo of harry:...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 7,
        "caption": "<p>this is titled “harry’s long ass neck as worm in an apple” and was inspired by <a class=\"tumblelog\" href=\"https://tmblr.co/mUsnMVwsSQsIyLOShd1s8jg\">@watchyourattitude</a>‘s tag on <a href=\"http://watchyourattitude.tumblr.com/post/178815851861/ghlden-melbourne-2017\">this</a> photo of harry: #<a href=\"http://watchyourattitude.tumblr.com/tagged/his-neck-looks-so-long-haha\">his neck looks so long haha</a></p><p>anyway enjoy</p>",
        "reblog": {
            "comment": "<p>this is titled “harry’s long ass neck as worm in an apple” and was inspired by <a class=\"tumblelog\" href=\"https://tmblr.co/mUsnMVwsSQsIyLOShd1s8jg\">@watchyourattitude</a>‘s tag on <a href=\"http://watchyourattitude.tumblr.com/post/178815851861/ghlden-melbourne-2017\">this</a> photo of harry: #<a href=\"http://watchyourattitude.tumblr.com/tagged/his-neck-looks-so-long-haha\">his neck looks so long haha</a></p><p>anyway enjoy</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "stylesbandshirts",
                    "active": true,
                    "theme": {
                        "header_full_width": 2472,
                        "header_full_height": 1856,
                        "header_focus_width": 1713,
                        "header_focus_height": 964,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "314,1713,1278,0",
                        "header_image": "https://static.tumblr.com/8f50334485e5e2450764ae9212e131e1/gltpnt5/PFJoxintt/tumblr_static_8e8k2l7zd68s0gok0ccc80ksc.jpg",
                        "header_image_focused": "https://static.tumblr.com/8f50334485e5e2450764ae9212e131e1/gltpnt5/QjEoxinty/tumblr_static_tumblr_static_8e8k2l7zd68s0gok0ccc80ksc_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/8f50334485e5e2450764ae9212e131e1/gltpnt5/PFJoxintt/tumblr_static_8e8k2l7zd68s0gok0ccc80ksc_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#ffc5d7",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Alternate Gothic",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178816801736"
                },
                "content_raw": "<p>this is titled “harry’s long ass neck as worm in an apple” and was inspired by <a class=\"tumblelog\" href=\"https://tmblr.co/mUsnMVwsSQsIyLOShd1s8jg\">@watchyourattitude</a>‘s tag on <a href=\"http://watchyourattitude.tumblr.com/post/178815851861/ghlden-melbourne-2017\">this</a> photo of harry: #<a href=\"http://watchyourattitude.tumblr.com/tagged/his-neck-looks-so-long-haha\">his neck looks so long haha</a></p><p>anyway enjoy</p>",
                "content": "<p>this is titled&nbsp;&ldquo;harry&rsquo;s long ass neck as worm in an apple&rdquo; and was inspired by <a href=\"https://tmblr.co/mUsnMVwsSQsIyLOShd1s8jg\">@watchyourattitude</a>&lsquo;s tag on <a href=\"http://watchyourattitude.tumblr.com/post/178815851861/ghlden-melbourne-2017\">this</a> photo of harry: #<a href=\"http://watchyourattitude.tumblr.com/tagged/his-neck-looks-so-long-haha\">his neck looks so long haha</a></p><p>anyway enjoy</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://stylesbandshirts.tumblr.com/image/178816801736",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/c6adafa38557e9409acda410435cade8/tumblr_pg86tcEJxD1s61wy7o1_1280.png",
                    "width": 1167,
                    "height": 1161
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/c6adafa38557e9409acda410435cade8/tumblr_pg86tcEJxD1s61wy7o1_1280.png",
                        "width": 1167,
                        "height": 1161
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6adafa38557e9409acda410435cade8/tumblr_pg86tcEJxD1s61wy7o1_640.png",
                        "width": 640,
                        "height": 637
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6adafa38557e9409acda410435cade8/tumblr_pg86tcEJxD1s61wy7o1_540.png",
                        "width": 540,
                        "height": 537
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6adafa38557e9409acda410435cade8/tumblr_pg86tcEJxD1s61wy7o1_500.png",
                        "width": 500,
                        "height": 497
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6adafa38557e9409acda410435cade8/tumblr_pg86tcEJxD1s61wy7o1_400.png",
                        "width": 400,
                        "height": 398
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6adafa38557e9409acda410435cade8/tumblr_pg86tcEJxD1s61wy7o1_250.png",
                        "width": 250,
                        "height": 249
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6adafa38557e9409acda410435cade8/tumblr_pg86tcEJxD1s61wy7o1_100.png",
                        "width": 100,
                        "height": 99
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6adafa38557e9409acda410435cade8/tumblr_pg86tcEJxD1s61wy7o1_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "harry-stole-my-heart",
        "blog": {
            "name": "harry-stole-my-heart",
            "title": "I Wanna Stay Up All Night",
            "description": "<p>Just a Aussie that loves One Direction. </p>",
            "url": "https://harry-stole-my-heart.tumblr.com/",
            "uuid": "t:I4fTXjstpoz8TwR1DU9b3Q",
            "updated": 1553942662
        },
        "id": 178816750487,
        "post_url": "https://harry-stole-my-heart.tumblr.com/post/178816750487/dont-let-this-die",
        "slug": "dont-let-this-die",
        "date": "2018-10-07 11:01:53 GMT",
        "timestamp": 1538910113,
        "state": "published",
        "format": "html",
        "reblog_key": "GbGle30v",
        "tags": [
            "harry styles",
            "liam payne",
            "niall horan",
            "louis tomlinson",
            "niall james horan",
            "liam james payne",
            "harry edward styles",
            "louis william tomlinson",
            "one direction",
            "1d"
        ],
        "short_url": "https://tmblr.co/ZjmwkY2cYJnEN",
        "summary": "Don’t let this die",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 34,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"528\" data-orig-width=\"640\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo.mp4\",\"type\":\"video/mp4\",\"width\":640,\"height\":528},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":640,\"height\":528}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo.mp4\" type=\"video/mp4\"></source></video></figure><p>Don’t let this die </p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"528\" data-orig-width=\"640\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo.mp4\",\"type\":\"video/mp4\",\"width\":640,\"height\":528},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":640,\"height\":528}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo.mp4\" type=\"video/mp4\"></source></video></figure><p>Don’t let this die </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "harry-stole-my-heart",
                    "active": true,
                    "theme": {
                        "header_full_width": 600,
                        "header_full_height": 800,
                        "header_focus_width": 600,
                        "header_focus_height": 338,
                        "avatar_shape": "square",
                        "background_color": "#DDD5EC",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "137,600,475,0",
                        "header_image": "https://static.tumblr.com/9d5671cfe23dc6937b27f3df33362817/8rkcie3/xgupehba5/tumblr_static_1yt7r1e9kakkcksww800c40k0.jpg",
                        "header_image_focused": "https://static.tumblr.com/9d5671cfe23dc6937b27f3df33362817/8rkcie3/9Okpehba6/tumblr_static_tumblr_static_1yt7r1e9kakkcksww800c40k0_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/9d5671cfe23dc6937b27f3df33362817/8rkcie3/xgupehba5/tumblr_static_1yt7r1e9kakkcksww800c40k0_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178816750487"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"528\" data-orig-width=\"640\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo.mp4\",\"type\":\"video/mp4\",\"width\":640,\"height\":528},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":640,\"height\":528}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo.mp4\" type=\"video/mp4\"></source></video></figure><p>Don’t let this die </p></p>",
                "content": "<p><figure class=\"tmblr-full\" data-npf=\"{&quot;type&quot;:&quot;video&quot;,&quot;provider&quot;:&quot;tumblr&quot;,&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo.mp4&quot;,&quot;media&quot;:{&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo.mp4&quot;,&quot;type&quot;:&quot;video/mp4&quot;,&quot;width&quot;:640,&quot;height&quot;:528},&quot;poster&quot;:[{&quot;url&quot;:&quot;https://66.media.tumblr.com/tumblr_pg86lxK3RH1xfsruo_frame1.jpg&quot;,&quot;type&quot;:&quot;image/jpeg&quot;,&quot;width&quot;:640,&quot;height&quot;:528}]}\"></figure><p>Don&rsquo;t let this die </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "bowers1989",
        "blog": {
            "name": "bowers1989",
            "title": "",
            "description": "<p>hhhhhhhh henry bowers can like... get it</p>",
            "url": "https://bowers1989.tumblr.com/",
            "uuid": "t:NyJ1-9wC0YjWtY2p0u1MCA",
            "updated": 1558349733
        },
        "id": 178816746466,
        "post_url": "https://bowers1989.tumblr.com/post/178816746466/requested-by-anonymous-a-softchill-playlist",
        "slug": "requested-by-anonymous-a-softchill-playlist",
        "date": "2018-10-07 11:01:43 GMT",
        "timestamp": 1538910103,
        "state": "published",
        "format": "html",
        "reblog_key": "pCu0wNxA",
        "tags": [
            "spotify playlists",
            "allyse’s spotify",
            "harry styles",
            "sweet creature",
            "music",
            "chill",
            "vintage",
            "spotify",
            "playlist"
        ],
        "short_url": "https://tmblr.co/Zr_FTc2cYJmFY",
        "summary": "requested by anonymous: “a soft/chill playlist that features the song sweet creature by harry styles”\nsweet creature\n“sweet...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 5,
        "title": null,
        "body": "<p>requested by anonymous: “a soft/chill playlist that features the song sweet creature by harry styles”</p><p><a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fopen.spotify.com%2Fuser%2Fjamiehadleyx%2Fplaylist%2F3OnOu0rky5DqEzos7cPiqi%3Fsi%3DNak8COKZSwmVJHoqlYFuxA&amp;t=N2FiYjVkY2JmNTRmMmYyY2Y3YTBkNzZhZGI0MGM4Mjg2YTQzZjEwOCwzOTk3Mzc2YTg2M2M5YjdiYWExMDIzMjMwNmNiZWM3YWM3NWQ2NmYy\">sweet creature</a></p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"640\"><img src=\"https://66.media.tumblr.com/7613927fdfcb519d814409ad8c6a7f72/tumblr_inline_pg86jbho2U1vnhwt7_640.jpg\" data-orig-height=\"640\" data-orig-width=\"640\"/></figure><p>“sweet creature, </p><p>had another talk about where it’s going wrong.</p><p>but, we’re still young.</p><p>we dont know where we’re going,</p><p>but we know where we belong.”</p>",
        "reblog": {
            "comment": "<p>requested by anonymous: “a soft/chill playlist that features the song sweet creature by harry styles”</p><p><a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fopen.spotify.com%2Fuser%2Fjamiehadleyx%2Fplaylist%2F3OnOu0rky5DqEzos7cPiqi%3Fsi%3DNak8COKZSwmVJHoqlYFuxA&amp;t=N2FiYjVkY2JmNTRmMmYyY2Y3YTBkNzZhZGI0MGM4Mjg2YTQzZjEwOCwzOTk3Mzc2YTg2M2M5YjdiYWExMDIzMjMwNmNiZWM3YWM3NWQ2NmYy\">sweet creature</a></p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"640\"><img src=\"https://66.media.tumblr.com/7613927fdfcb519d814409ad8c6a7f72/tumblr_inline_pg86jbho2U1vnhwt7_640.jpg\" data-orig-height=\"640\" data-orig-width=\"640\"></figure><p>“sweet creature, </p><p>had another talk about where it’s going wrong.</p><p>but, we’re still young.</p><p>we dont know where we’re going,</p><p>but we know where we belong.”</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "bowers1989",
                    "active": true,
                    "theme": {
                        "header_full_width": 750,
                        "header_full_height": 516,
                        "header_focus_width": 750,
                        "header_focus_height": 422,
                        "avatar_shape": "square",
                        "background_color": "#DADCED",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "34,750,456,0",
                        "header_image": "https://static.tumblr.com/732ca349c2fa620e8effd61921e72d5f/bdfqrht/ROopmkv3i/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/967fa80225ab25af28f3d108f004bca5/bdfqrht/31cpmkv3r/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/732ca349c2fa620e8effd61921e72d5f/bdfqrht/ROopmkv3i/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#4687AE",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#C2C4F0",
                        "title_font": "Brutal Type",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178816746466"
                },
                "content_raw": "<p>requested by anonymous: “a soft/chill playlist that features the song sweet creature by harry styles”</p><p><a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fopen.spotify.com%2Fuser%2Fjamiehadleyx%2Fplaylist%2F3OnOu0rky5DqEzos7cPiqi%3Fsi%3DNak8COKZSwmVJHoqlYFuxA&amp;t=N2FiYjVkY2JmNTRmMmYyY2Y3YTBkNzZhZGI0MGM4Mjg2YTQzZjEwOCwzOTk3Mzc2YTg2M2M5YjdiYWExMDIzMjMwNmNiZWM3YWM3NWQ2NmYy\">sweet creature</a></p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"640\"><img src=\"https://66.media.tumblr.com/7613927fdfcb519d814409ad8c6a7f72/tumblr_inline_pg86jbho2U1vnhwt7_640.jpg\" data-orig-height=\"640\" data-orig-width=\"640\"></figure><p>“sweet creature, </p><p>had another talk about where it’s going wrong.</p><p>but, we’re still young.</p><p>we dont know where we’re going,</p><p>but we know where we belong.”</p>",
                "content": "<p>requested by anonymous:&nbsp;&ldquo;a soft/chill playlist that features the song sweet creature by harry styles&rdquo;</p><p><a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fopen.spotify.com%2Fuser%2Fjamiehadleyx%2Fplaylist%2F3OnOu0rky5DqEzos7cPiqi%3Fsi%3DNak8COKZSwmVJHoqlYFuxA&amp;t=N2FiYjVkY2JmNTRmMmYyY2Y3YTBkNzZhZGI0MGM4Mjg2YTQzZjEwOCwzOTk3Mzc2YTg2M2M5YjdiYWExMDIzMjMwNmNiZWM3YWM3NWQ2NmYy\">sweet creature</a></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/7613927fdfcb519d814409ad8c6a7f72/tumblr_inline_pg86jbho2U1vnhwt7_640.jpg\" class=\"\"/></figure><p>&ldquo;sweet creature,&nbsp;</p><p>had another talk about where it&rsquo;s going wrong.</p><p>but, we&rsquo;re still young.</p><p>we dont know where we&rsquo;re going,</p><p>but we know where we belong.&rdquo;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "video",
        "blog_name": "yourfavoritepornactress",
        "blog": {
            "name": "yourfavoritepornactress",
            "title": "While I'm breathing",
            "description": "pictures of a dreamer, your personal lair",
            "url": "https://yourfavoritepornactress.tumblr.com/",
            "uuid": "t:-TP13Jfkra_14Dr1GE9Kgw",
            "updated": 1556886364
        },
        "id": 178816641118,
        "post_url": "https://yourfavoritepornactress.tumblr.com/post/178816641118/please-find-this-song",
        "slug": "please-find-this-song",
        "date": "2018-10-07 10:54:48 GMT",
        "timestamp": 1538909688,
        "state": "published",
        "format": "html",
        "reblog_key": "CGdMCWu3",
        "tags": [
            "one direction",
            "harry styles",
            "song",
            "vine",
            "video",
            "music",
            "niall horan",
            "liam payne",
            "zayn malik",
            "louis tomlinson"
        ],
        "short_url": "https://tmblr.co/Z0ybIZ2cYJMXU",
        "summary": "please find this song 😭😭😭",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 8,
        "caption": "<p>please find this song 😭😭😭</p>",
        "reblog": {
            "comment": "<p>please find this song 😭😭😭</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "yourfavoritepornactress",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/d9ee36a88e6c941d58b9e69ab485725e/g3zqtj3/mlNpbpiyk/tumblr_static_filename.png",
                        "header_image_focused": "https://static.tumblr.com/d9ee36a88e6c941d58b9e69ab485725e/g3zqtj3/mlNpbpiyk/tumblr_static_filename_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/d9ee36a88e6c941d58b9e69ab485725e/g3zqtj3/mlNpbpiyk/tumblr_static_filename_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#FB9983",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178816641118"
                },
                "content_raw": "<p>please find this song 😭😭😭</p>",
                "content": "<p>please find this song &#128557;&#128557;&#128557;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "video_url": "https://ve.media.tumblr.com/tumblr_pg869oif9R1xzhlvx.mp4",
        "html5_capable": true,
        "thumbnail_url": "https://66.media.tumblr.com/tumblr_pg869oif9R1xzhlvx_frame1.jpg",
        "thumbnail_width": 720,
        "thumbnail_height": 720,
        "duration": 6,
        "player": [
            {
                "width": 250,
                "embed_code": "\n<video  id='embed-5ce54aa6b4566844967342' class='crt-video crt-skin-default' width='250' height='250' poster='https://66.media.tumblr.com/tumblr_pg869oif9R1xzhlvx_smart1.jpg' preload='none' muted data-crt-video data-crt-options='{\"autoheight\":null,\"duration\":6,\"hdUrl\":false,\"filmstrip\":{\"url\":\"https://66.media.tumblr.com/previews/tumblr_pg869oif9R1xzhlvx_filmstrip.jpg\",\"width\":\"200\",\"height\":\"200\"}}' >\n    <source src=\"https://yourfavoritepornactress.tumblr.com/video_file/t:-TP13Jfkra_14Dr1GE9Kgw/178816641118/tumblr_pg869oif9R1xzhlvx/480\" type=\"video/mp4\">\n</video>\n"
            },
            {
                "width": 400,
                "embed_code": "\n<video  id='embed-5ce54aa6b4566844967342' class='crt-video crt-skin-default' width='400' height='400' poster='https://66.media.tumblr.com/tumblr_pg869oif9R1xzhlvx_smart1.jpg' preload='none' muted data-crt-video data-crt-options='{\"autoheight\":null,\"duration\":6,\"hdUrl\":false,\"filmstrip\":{\"url\":\"https://66.media.tumblr.com/previews/tumblr_pg869oif9R1xzhlvx_filmstrip.jpg\",\"width\":\"200\",\"height\":\"200\"}}' >\n    <source src=\"https://yourfavoritepornactress.tumblr.com/video_file/t:-TP13Jfkra_14Dr1GE9Kgw/178816641118/tumblr_pg869oif9R1xzhlvx/480\" type=\"video/mp4\">\n</video>\n"
            },
            {
                "width": 500,
                "embed_code": "\n<video  id='embed-5ce54aa6b4566844967342' class='crt-video crt-skin-default' width='500' height='500' poster='https://66.media.tumblr.com/tumblr_pg869oif9R1xzhlvx_smart1.jpg' preload='none' muted data-crt-video data-crt-options='{\"autoheight\":null,\"duration\":6,\"hdUrl\":false,\"filmstrip\":{\"url\":\"https://66.media.tumblr.com/previews/tumblr_pg869oif9R1xzhlvx_filmstrip.jpg\",\"width\":\"200\",\"height\":\"200\"}}' >\n    <source src=\"https://yourfavoritepornactress.tumblr.com/video_file/t:-TP13Jfkra_14Dr1GE9Kgw/178816641118/tumblr_pg869oif9R1xzhlvx/480\" type=\"video/mp4\">\n</video>\n"
            }
        ],
        "video_type": "tumblr",
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "harry-stole-my-heart",
        "blog": {
            "name": "harry-stole-my-heart",
            "title": "I Wanna Stay Up All Night",
            "description": "<p>Just a Aussie that loves One Direction. </p>",
            "url": "https://harry-stole-my-heart.tumblr.com/",
            "uuid": "t:I4fTXjstpoz8TwR1DU9b3Q",
            "updated": 1553942662
        },
        "id": 178816593636,
        "post_url": "https://harry-stole-my-heart.tumblr.com/post/178816593636/harry-with-a-manbun",
        "slug": "harry-with-a-manbun",
        "date": "2018-10-07 10:51:39 GMT",
        "timestamp": 1538909499,
        "state": "published",
        "format": "html",
        "reblog_key": "xT3jEiRz",
        "tags": [
            "harry styles",
            "harry edward styles",
            "manbun",
            "one direction",
            "1d"
        ],
        "short_url": "https://tmblr.co/ZjmwkY2cYJAxa",
        "summary": "Harry with a manbun",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"739\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/3d618c3900429118bc5e803394666e83/tumblr_pg86618vwb1vjhotq_540.jpg\" data-orig-height=\"739\" data-orig-width=\"750\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"739\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/426904595a3deb16d1f61a9733ba3bfd/tumblr_pg8662Rnqw1vjhotq_540.jpg\" data-orig-height=\"739\" data-orig-width=\"750\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"745\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/6023424379de94519778bb710793c15f/tumblr_pg8662Fzas1vjhotq_540.jpg\" data-orig-height=\"745\" data-orig-width=\"750\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"733\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/521f6577535962f8735a558588b8e82a/tumblr_pg8663QIWy1vjhotq_540.jpg\" data-orig-height=\"733\" data-orig-width=\"750\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"725\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/5886f47751b83539f1f7c672e53bfcb6/tumblr_pg866338Xq1vjhotq_540.jpg\" data-orig-height=\"725\" data-orig-width=\"750\"/></figure></div><p>Harry with a manbun</p>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"739\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/3d618c3900429118bc5e803394666e83/tumblr_pg86618vwb1vjhotq_540.jpg\" data-orig-height=\"739\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"739\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/426904595a3deb16d1f61a9733ba3bfd/tumblr_pg8662Rnqw1vjhotq_540.jpg\" data-orig-height=\"739\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"745\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/6023424379de94519778bb710793c15f/tumblr_pg8662Fzas1vjhotq_540.jpg\" data-orig-height=\"745\" data-orig-width=\"750\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"733\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/521f6577535962f8735a558588b8e82a/tumblr_pg8663QIWy1vjhotq_540.jpg\" data-orig-height=\"733\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"725\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/5886f47751b83539f1f7c672e53bfcb6/tumblr_pg866338Xq1vjhotq_540.jpg\" data-orig-height=\"725\" data-orig-width=\"750\"></figure></div><p>Harry with a manbun</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "harry-stole-my-heart",
                    "active": true,
                    "theme": {
                        "header_full_width": 600,
                        "header_full_height": 800,
                        "header_focus_width": 600,
                        "header_focus_height": 338,
                        "avatar_shape": "square",
                        "background_color": "#DDD5EC",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "137,600,475,0",
                        "header_image": "https://static.tumblr.com/9d5671cfe23dc6937b27f3df33362817/8rkcie3/xgupehba5/tumblr_static_1yt7r1e9kakkcksww800c40k0.jpg",
                        "header_image_focused": "https://static.tumblr.com/9d5671cfe23dc6937b27f3df33362817/8rkcie3/9Okpehba6/tumblr_static_tumblr_static_1yt7r1e9kakkcksww800c40k0_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/9d5671cfe23dc6937b27f3df33362817/8rkcie3/xgupehba5/tumblr_static_1yt7r1e9kakkcksww800c40k0_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178816593636"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"739\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/3d618c3900429118bc5e803394666e83/tumblr_pg86618vwb1vjhotq_540.jpg\" data-orig-height=\"739\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"739\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/426904595a3deb16d1f61a9733ba3bfd/tumblr_pg8662Rnqw1vjhotq_540.jpg\" data-orig-height=\"739\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"745\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/6023424379de94519778bb710793c15f/tumblr_pg8662Fzas1vjhotq_540.jpg\" data-orig-height=\"745\" data-orig-width=\"750\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"733\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/521f6577535962f8735a558588b8e82a/tumblr_pg8663QIWy1vjhotq_540.jpg\" data-orig-height=\"733\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"725\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/5886f47751b83539f1f7c672e53bfcb6/tumblr_pg866338Xq1vjhotq_540.jpg\" data-orig-height=\"725\" data-orig-width=\"750\"></figure></div><p>Harry with a manbun</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/3d618c3900429118bc5e803394666e83/tumblr_pg86618vwb1vjhotq_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/426904595a3deb16d1f61a9733ba3bfd/tumblr_pg8662Rnqw1vjhotq_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/6023424379de94519778bb710793c15f/tumblr_pg8662Fzas1vjhotq_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/521f6577535962f8735a558588b8e82a/tumblr_pg8663QIWy1vjhotq_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/5886f47751b83539f1f7c672e53bfcb6/tumblr_pg866338Xq1vjhotq_540.jpg\" class=\"\"/></figure><p>Harry with a manbun</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "larryslilshit",
        "blog": {
            "name": "larryslilshit",
            "title": "Larry World",
            "description": "<p>The manips aren’t mine, I just post what I find💖 </p>",
            "url": "https://larryslilshit.tumblr.com/",
            "uuid": "t:Fpz7atJpL8jgvWvE1hxe1A",
            "updated": 1557347867
        },
        "id": 178816554736,
        "post_url": "https://larryslilshit.tumblr.com/post/178816554736/does-anyone-know-if-this-is-real-some-people-say",
        "slug": "does-anyone-know-if-this-is-real-some-people-say",
        "date": "2018-10-07 10:48:46 GMT",
        "timestamp": 1538909326,
        "state": "published",
        "format": "html",
        "reblog_key": "hOg3pBiJ",
        "tags": [
            "louis tomlinson",
            "harry styles",
            "houis",
            "larry stylinson",
            "larry",
            "lourry",
            "one direction",
            "1d",
            "harry",
            "houis tomlinstyles",
            "louis",
            "louis styles",
            "harry thompson",
            "larry proof",
            "proof",
            "lou and harry",
            "larries",
            "dark larrie"
        ],
        "short_url": "https://tmblr.co/ZPQCza2cYJ1Rm",
        "summary": "Does anyone know if this is real? Some people say they’ve watched the video but i’ve never heard about this :0 If you guys know...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 169,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1184\" data-orig-width=\"1242\"><img src=\"https://66.media.tumblr.com/26249b4f2aeed5e3956bb1ad3b90f2a4/tumblr_pg861abP6V1vbrzt8_540.jpg\" data-orig-height=\"1184\" data-orig-width=\"1242\"/></figure><p>Does anyone know if this is real? Some people say they’ve watched the video but i’ve never heard about this :0 If you guys know anything tell me please. I’ve been searching the video but i didn’t find anything :(</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1184\" data-orig-width=\"1242\"><img src=\"https://66.media.tumblr.com/26249b4f2aeed5e3956bb1ad3b90f2a4/tumblr_pg861abP6V1vbrzt8_540.jpg\" data-orig-height=\"1184\" data-orig-width=\"1242\"></figure><p>Does anyone know if this is real? Some people say they’ve watched the video but i’ve never heard about this :0 If you guys know anything tell me please. I’ve been searching the video but i didn’t find anything :(</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "larryslilshit",
                    "active": true,
                    "theme": {
                        "header_full_width": 720,
                        "header_full_height": 1280,
                        "header_focus_width": 626,
                        "header_focus_height": 353,
                        "avatar_shape": "circle",
                        "background_color": "#779dc5",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "464,673,817,47",
                        "header_image": "https://static.tumblr.com/6e9555e34a834fdb0a2687831b1956a5/r6ztmig/7gJp48wse/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/6e9555e34a834fdb0a2687831b1956a5/r6ztmig/rFtp48wsf/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/6e9555e34a834fdb0a2687831b1956a5/r6ztmig/7gJp48wse/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#F8DDED",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FEE2FF",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178816554736"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1184\" data-orig-width=\"1242\"><img src=\"https://66.media.tumblr.com/26249b4f2aeed5e3956bb1ad3b90f2a4/tumblr_pg861abP6V1vbrzt8_540.jpg\" data-orig-height=\"1184\" data-orig-width=\"1242\"></figure><p>Does anyone know if this is real? Some people say they’ve watched the video but i’ve never heard about this :0 If you guys know anything tell me please. I’ve been searching the video but i didn’t find anything :(</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/26249b4f2aeed5e3956bb1ad3b90f2a4/tumblr_pg861abP6V1vbrzt8_540.jpg\" class=\"\"/></figure><p>Does anyone know if this is real? Some people say they&rsquo;ve watched the video but i&rsquo;ve never heard about this :0 If you guys know anything tell me please. I&rsquo;ve been searching the video but i didn&rsquo;t find anything :(</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "harrystylesfanfiction-com",
        "blog": {
            "name": "harrystylesfanfiction-com",
            "title": "Harry Styles Fanfiction Tumblr",
            "description": "",
            "url": "https://tumblr.harrystylesfanfiction.com/",
            "uuid": "t:1YJu2SeffFWbNPMzEkSfDg",
            "updated": 1558528927
        },
        "id": 178816378823,
        "post_url": "https://tumblr.harrystylesfanfiction.com/post/178816378823/the-assistant",
        "slug": "the-assistant",
        "date": "2018-10-07 10:36:07 GMT",
        "timestamp": 1538908567,
        "state": "published",
        "format": "html",
        "reblog_key": "Aam6TMjN",
        "tags": [
            "harry styles fanfiction",
            "harry styles fanfic",
            "harry styles"
        ],
        "short_url": "https://tmblr.co/ZlUM5t2cYIMV7",
        "summary": "The  Assistant",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": "The  Assistant",
        "body": "<a href=\"http://www.harrystylesfanfiction.com/Story/88380/The-Assistant/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\"><img class=\"cover\" alt=\"\" src=\"http://www.harrystylesfanfiction.com/data/images/preview/story-cover/41/85836114-crop-680x200.jpg\"/></a>\n\n<h2>E P I L O G U E</h2>\n<p>Chai tea. Hmm. A chai tea latte. Nora really wanted a chai tea latte. The urge was overwhelming as she stepped out of the office building on her lunch break. Starbucks was just down the street and she&hellip;</p>\n<p><a href=\"http://www.harrystylesfanfiction.com/Story/88380/The-Assistant/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\">Read more&hellip;</a></p>",
        "reblog": {
            "comment": "<p><a href=\"http://www.harrystylesfanfiction.com/Story/88380/The-Assistant/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\"><img class=\"cover\" alt=\"\" src=\"http://www.harrystylesfanfiction.com/data/images/preview/story-cover/41/85836114-crop-680x200.jpg\"></a>\n\n<h2>E P I L O G U E</h2>\n<p>Chai tea. Hmm. A chai tea latte. Nora really wanted a chai tea latte. The urge was overwhelming as she stepped out of the office building on her lunch break. Starbucks was just down the street and she…</p>\n<p><a href=\"http://www.harrystylesfanfiction.com/Story/88380/The-Assistant/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\">Read more…</a></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "harrystylesfanfiction-com",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_14.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_14_focused_v3.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_14_focused_v3.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178816378823"
                },
                "content_raw": "<p><a href=\"http://www.harrystylesfanfiction.com/Story/88380/The-Assistant/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\"><img class=\"cover\" alt=\"\" src=\"http://www.harrystylesfanfiction.com/data/images/preview/story-cover/41/85836114-crop-680x200.jpg\"></a>\n\n<h2>E P I L O G U E</h2>\n<p>Chai tea. Hmm. A chai tea latte. Nora really wanted a chai tea latte. The urge was overwhelming as she stepped out of the office building on her lunch break. Starbucks was just down the street and she…</p>\n<p><a href=\"http://www.harrystylesfanfiction.com/Story/88380/The-Assistant/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\">Read more…</a></p></p>",
                "content": "<p><div class=\"external-image-wrapper\" data-loading-text=\"Loading...\" data-src=\"http://www.harrystylesfanfiction.com/data/images/preview/story-cover/41/85836114-crop-680x200.jpg\">External image</div>\n\n</p><h2>E P I L O G U E</h2>\n<p>Chai tea. Hmm. A chai tea latte. Nora really wanted a chai tea latte. The urge was overwhelming as she stepped out of the office building on her lunch break. Starbucks was just down the street and she&hellip;</p>\n<p><a href=\"http://www.harrystylesfanfiction.com/Story/88380/The-Assistant/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\">Read more&hellip;</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "pendantstyles",
        "blog": {
            "name": "pendantstyles",
            "title": "you bring me home",
            "description": "<p>hannah | vision isn’t 20/20, but harry is!!</p><p>+ requests are always open! +</p><p><a href=\"https://pendantstyles.tumblr.com/post/167102962106/it-would-be-redundant-if-i-titled-it\">masterlist</a></p>",
            "url": "https://pendantstyles.tumblr.com/",
            "uuid": "t:iHCNJs3aOJAmAdm24LTLMQ",
            "updated": 1558454476
        },
        "id": 178816172346,
        "post_url": "https://pendantstyles.tumblr.com/post/178816172346/umm-umm-yn-i-dont-know-how-to-say-this-but",
        "slug": "umm-umm-yn-i-dont-know-how-to-say-this-but",
        "date": "2018-10-07 10:21:25 GMT",
        "timestamp": 1538907685,
        "state": "published",
        "format": "html",
        "reblog_key": "cw6fDQUa",
        "tags": [
            "theme nights",
            "harry styles",
            "harry styles imagine"
        ],
        "short_url": "https://tmblr.co/ZoVTnd2cYHa4w",
        "summary": "'umm, umm yn, i dont know how to say this but .. yn, umm, are you .. free tonight.. ?'",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "post_author": "pendantstylestoo",
        "liked": false,
        "note_count": 23,
        "asking_name": "Anonymous",
        "asking_url": null,
        "question": "'umm, umm yn, i dont know how to say this but .. yn, umm, are you .. free tonight.. ?'",
        "answer": "<p>then harry just prepares himself to the answer no but then y/n says yes equally as nervous as him and he’d be all shocked going all:</p><p><br/></p><p><i>“w-wait, y’are?”</i></p>",
        "reblog": {
            "comment": "<p>then harry just prepares himself to the answer no but then y/n says yes equally as nervous as him and he’d be all shocked going all:</p><p><br></p><p><i>“w-wait, y’are?”</i></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "pendantstyles",
                    "active": true,
                    "theme": {
                        "header_full_width": 1080,
                        "header_full_height": 566,
                        "header_focus_width": 1006,
                        "header_focus_height": 566,
                        "avatar_shape": "square",
                        "background_color": "#234357",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1033,566,27",
                        "header_image": "https://static.tumblr.com/17517fa408f231424fedc2557bff5781/l07i8rx/zgdpp6qw2/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/538974e68eec8396343a87d2777b915c/l07i8rx/TiQpp6qw3/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/17517fa408f231424fedc2557bff5781/l07i8rx/zgdpp6qw2/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#E38C7A",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#E8A395",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178816172346"
                },
                "content_raw": "<p>then harry just prepares himself to the answer no but then y/n says yes equally as nervous as him and he’d be all shocked going all:</p><p><br></p><p><i>“w-wait, y’are?”</i></p>",
                "content": "<p>then harry just prepares himself to the answer no but then y/n says yes equally as nervous as him and he&rsquo;d be all shocked going all:</p><p><br /></p><p><i>&ldquo;w-wait, y&rsquo;are?&rdquo;</i></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "pendantstyles",
        "blog": {
            "name": "pendantstyles",
            "title": "you bring me home",
            "description": "<p>hannah | vision isn’t 20/20, but harry is!!</p><p>+ requests are always open! +</p><p><a href=\"https://pendantstyles.tumblr.com/post/167102962106/it-would-be-redundant-if-i-titled-it\">masterlist</a></p>",
            "url": "https://pendantstyles.tumblr.com/",
            "uuid": "t:iHCNJs3aOJAmAdm24LTLMQ",
            "updated": 1558454476
        },
        "id": 178816148266,
        "post_url": "https://pendantstyles.tumblr.com/post/178816148266/but-what-about-mafia-harry-who-has-a-little-bub",
        "slug": "but-what-about-mafia-harry-who-has-a-little-bub",
        "date": "2018-10-07 10:19:39 GMT",
        "timestamp": 1538907579,
        "state": "published",
        "format": "html",
        "reblog_key": "cZO5BTjh",
        "tags": [
            "theme nights",
            "mafia!harry theme nights",
            "mafia!harry",
            "harry styles",
            "harry styles imagine"
        ],
        "short_url": "https://tmblr.co/ZoVTnd2cYHUCg",
        "summary": "but what about mafia harry who has a little bub and is always so gentle around her but one day the missus brings her up to...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "post_author": "pendantstylestoo",
        "liked": false,
        "note_count": 181,
        "asking_name": "Anonymous",
        "asking_url": null,
        "question": "but what about mafia harry who has a little bub and is always so gentle around her but one day the missus brings her up to harry’s bar or something because little bubs misses daddy but she hears h yelling at people and she gets all scared and won’t let go of the missus and won’t even look at him:((",
        "answer": "<p><i>“y’had one fucking job and y’just have to be utter shit at doing it, do you?”</i></p><p><br/></p><p>harry really wishes that his baby bub didn’t have to see that right with her cute adorable eyes that now have been reduced to vulnerable crying ones, her tender three-year old figure not being tainted with the bar’s awful fucking smell at all because all she wanted was to see her daddy from how much she misses him.</p><p>better yet, harry wishes he didn’t even do it in the first place regardless of her being there because now, his own daughter won’t even look at him.</p><p>“best if you leave for a while.”</p><p>his missus says, both in a little anger and a tad more heartbreak as she’s consoling their bub right in her arms, not thrashing anymore but it feels like she still was from how violent her cries were, chest heaving up with sobs and head being buried to her neck.</p><p>“s-she — n-need to get her to look at me.”</p><p>harry begs and more-on says to himself because now that they’ve come home did he realize where he went wrong; fucking up so bad that all his angel could say was no whenever he tried to carry her.</p><p>he’s sobbing now too and he really just wants to apologize and get to his knees so his bub could forgive him, not knowing that his display of anger back there was still replaying on his baby’s mind and how she got so scared by it.</p><p>“i’m sorry.”</p><p>harry shakily lets out while he offers his finger for his bub to take that she just won’t at the moment, the thought behind it making his heart break even more than the (lack of) action itself.</p><p>he can’t take her cries because he knows he’s the one who’s caused it and this isn’t anymore about him accidentally breaking his bub’s favorite bottle or not kissing her on the cheeks as usual —</p><p>this was about him scaring her.</p><p>“m’sorry — f-fuck, i’m sorry, angel.”</p>",
        "reblog": {
            "comment": "<p><i>“y’had one fucking job and y’just have to be utter shit at doing it, do you?”</i></p><p><br></p><p>harry really wishes that his baby bub didn’t have to see that right with her cute adorable eyes that now have been reduced to vulnerable crying ones, her tender three-year old figure not being tainted with the bar’s awful fucking smell at all because all she wanted was to see her daddy from how much she misses him.</p><p>better yet, harry wishes he didn’t even do it in the first place regardless of her being there because now, his own daughter won’t even look at him.</p><p>“best if you leave for a while.”</p><p>his missus says, both in a little anger and a tad more heartbreak as she’s consoling their bub right in her arms, not thrashing anymore but it feels like she still was from how violent her cries were, chest heaving up with sobs and head being buried to her neck.</p><p>“s-she — n-need to get her to look at me.”</p><p>harry begs and more-on says to himself because now that they’ve come home did he realize where he went wrong; fucking up so bad that all his angel could say was no whenever he tried to carry her.</p><p>he’s sobbing now too and he really just wants to apologize and get to his knees so his bub could forgive him, not knowing that his display of anger back there was still replaying on his baby’s mind and how she got so scared by it.</p><p>“i’m sorry.”</p><p>harry shakily lets out while he offers his finger for his bub to take that she just won’t at the moment, the thought behind it making his heart break even more than the (lack of) action itself.</p><p>he can’t take her cries because he knows he’s the one who’s caused it and this isn’t anymore about him accidentally breaking his bub’s favorite bottle or not kissing her on the cheeks as usual —</p><p>this was about him scaring her.</p><p>“m’sorry — f-fuck, i’m sorry, angel.”</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "pendantstyles",
                    "active": true,
                    "theme": {
                        "header_full_width": 1080,
                        "header_full_height": 566,
                        "header_focus_width": 1006,
                        "header_focus_height": 566,
                        "avatar_shape": "square",
                        "background_color": "#234357",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1033,566,27",
                        "header_image": "https://static.tumblr.com/17517fa408f231424fedc2557bff5781/l07i8rx/zgdpp6qw2/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/538974e68eec8396343a87d2777b915c/l07i8rx/TiQpp6qw3/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/17517fa408f231424fedc2557bff5781/l07i8rx/zgdpp6qw2/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#E38C7A",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#E8A395",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178816148266"
                },
                "content_raw": "<p><i>“y’had one fucking job and y’just have to be utter shit at doing it, do you?”</i></p><p><br></p><p>harry really wishes that his baby bub didn’t have to see that right with her cute adorable eyes that now have been reduced to vulnerable crying ones, her tender three-year old figure not being tainted with the bar’s awful fucking smell at all because all she wanted was to see her daddy from how much she misses him.</p><p>better yet, harry wishes he didn’t even do it in the first place regardless of her being there because now, his own daughter won’t even look at him.</p><p>“best if you leave for a while.”</p><p>his missus says, both in a little anger and a tad more heartbreak as she’s consoling their bub right in her arms, not thrashing anymore but it feels like she still was from how violent her cries were, chest heaving up with sobs and head being buried to her neck.</p><p>“s-she — n-need to get her to look at me.”</p><p>harry begs and more-on says to himself because now that they’ve come home did he realize where he went wrong; fucking up so bad that all his angel could say was no whenever he tried to carry her.</p><p>he’s sobbing now too and he really just wants to apologize and get to his knees so his bub could forgive him, not knowing that his display of anger back there was still replaying on his baby’s mind and how she got so scared by it.</p><p>“i’m sorry.”</p><p>harry shakily lets out while he offers his finger for his bub to take that she just won’t at the moment, the thought behind it making his heart break even more than the (lack of) action itself.</p><p>he can’t take her cries because he knows he’s the one who’s caused it and this isn’t anymore about him accidentally breaking his bub’s favorite bottle or not kissing her on the cheeks as usual —</p><p>this was about him scaring her.</p><p>“m’sorry — f-fuck, i’m sorry, angel.”</p>",
                "content": "<p><i>&ldquo;y&rsquo;had one fucking job and y&rsquo;just have to be utter shit at doing it, do you?&rdquo;</i></p><p><br /></p><p>harry really wishes that his baby bub didn&rsquo;t have to see that right with her cute adorable eyes that now have been reduced to vulnerable crying ones, her tender three-year old figure not being tainted with the bar&rsquo;s awful fucking smell at all because all she wanted was to see her daddy from how much she misses him.</p><p>better yet, harry wishes he didn&rsquo;t even do it in the first place regardless of her being there because now, his own daughter won&rsquo;t even look at him.</p><p>&ldquo;best if you leave for a while.&rdquo;</p><p>his missus says, both in a little anger and a tad more heartbreak as she&rsquo;s consoling their bub right in her arms, not thrashing anymore but it feels like she still was from how violent her cries were, chest heaving up with sobs and head being buried to her neck.</p><p>&ldquo;s-she &mdash; n-need to get her to look at me.&rdquo;</p><p>harry begs and more-on says to himself because now that they&rsquo;ve come home did he realize where he went wrong; fucking up so bad that all his angel could say was no whenever he tried to carry her.</p><p>he&rsquo;s sobbing now too and he really just wants to apologize and get to his knees so his bub could forgive him, not knowing that his display of anger back there was still replaying on his baby&rsquo;s mind and how she got so scared by it.</p><p>&ldquo;i&rsquo;m sorry.&rdquo;</p><p>harry shakily lets out while he offers his finger for his bub to take that she just won&rsquo;t at the moment, the thought behind it making his heart break even more than the (lack of) action itself.</p><p>he can&rsquo;t take her cries because he knows he&rsquo;s the one who&rsquo;s caused it and this isn&rsquo;t anymore about him accidentally breaking his bub&rsquo;s favorite bottle or not kissing her on the cheeks as usual &mdash;</p><p>this was about him scaring her.</p><p>&ldquo;m&rsquo;sorry &mdash; f-fuck, i&rsquo;m sorry, angel.&rdquo;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "pendantstyles",
        "blog": {
            "name": "pendantstyles",
            "title": "you bring me home",
            "description": "<p>hannah | vision isn’t 20/20, but harry is!!</p><p>+ requests are always open! +</p><p><a href=\"https://pendantstyles.tumblr.com/post/167102962106/it-would-be-redundant-if-i-titled-it\">masterlist</a></p>",
            "url": "https://pendantstyles.tumblr.com/",
            "uuid": "t:iHCNJs3aOJAmAdm24LTLMQ",
            "updated": 1558454476
        },
        "id": 178815987766,
        "post_url": "https://pendantstyles.tumblr.com/post/178815987766/hannah-you-know-how-shy-harry-is-and-how-he",
        "slug": "hannah-you-know-how-shy-harry-is-and-how-he",
        "date": "2018-10-07 10:07:57 GMT",
        "timestamp": 1538906877,
        "state": "published",
        "format": "html",
        "reblog_key": "T0FRPcz7",
        "tags": [
            "theme nights",
            "harry styles",
            "harry styles imagine"
        ],
        "short_url": "https://tmblr.co/ZoVTnd2cYGt0s",
        "summary": "hannah, you know how shy harry is and how he cannot started a conversation? i'm imagining yn and harry are both shy person and...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "post_author": "pendantstylestoo",
        "liked": false,
        "note_count": 22,
        "asking_name": "Anonymous",
        "asking_url": null,
        "question": "hannah, you know how shy harry is and how he cannot started a conversation? i'm imagining yn and harry are both shy person and when they first time meet, they just like 'umm, hello, i'm .. harry' 'i'm yn.., hi' so cuuute!",
        "answer": "<p>imagine what harry would say when he asks y/n out for a date fUUUUUUUCK</p>",
        "reblog": {
            "comment": "<p>imagine what harry would say when he asks y/n out for a date fUUUUUUUCK</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "pendantstyles",
                    "active": true,
                    "theme": {
                        "header_full_width": 1080,
                        "header_full_height": 566,
                        "header_focus_width": 1006,
                        "header_focus_height": 566,
                        "avatar_shape": "square",
                        "background_color": "#234357",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1033,566,27",
                        "header_image": "https://static.tumblr.com/17517fa408f231424fedc2557bff5781/l07i8rx/zgdpp6qw2/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/538974e68eec8396343a87d2777b915c/l07i8rx/TiQpp6qw3/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/17517fa408f231424fedc2557bff5781/l07i8rx/zgdpp6qw2/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#E38C7A",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#E8A395",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178815987766"
                },
                "content_raw": "<p>imagine what harry would say when he asks y/n out for a date fUUUUUUUCK</p>",
                "content": "<p>imagine what harry would say when he asks y/n out for a date fUUUUUUUCK</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "harrystylesfanfiction-com",
        "blog": {
            "name": "harrystylesfanfiction-com",
            "title": "Harry Styles Fanfiction Tumblr",
            "description": "",
            "url": "https://tumblr.harrystylesfanfiction.com/",
            "uuid": "t:1YJu2SeffFWbNPMzEkSfDg",
            "updated": 1558528927
        },
        "id": 178815779513,
        "post_url": "https://tumblr.harrystylesfanfiction.com/post/178815779513/between-pretend-and-reality",
        "slug": "between-pretend-and-reality",
        "date": "2018-10-07 09:54:07 GMT",
        "timestamp": 1538906047,
        "state": "published",
        "format": "html",
        "reblog_key": "JVuEvr7d",
        "tags": [
            "harry styles fanfiction",
            "harry styles fanfic",
            "harry styles"
        ],
        "short_url": "https://tmblr.co/ZlUM5t2cYG4Av",
        "summary": "Between Pretend And Reality",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": "Between Pretend And Reality",
        "body": "<a href=\"http://www.harrystylesfanfiction.com/Story/88657/Between-Pretend-And-Reality/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\"><img class=\"cover\" alt=\"\" src=\"http://www.harrystylesfanfiction.com/data/images/preview/story-cover/3b/804e6ab3-crop-680x200.jpg\"/></a>\n<p><strong>A collection of &ldquo;Let&rsquo;s Pretend It&rsquo;s Love&rdquo; drabbles</strong></p>\n<h2>SHAMELESS SELF PROMO</h2>\n<p>Welp guys,I hate to even be making this chapter but I honestly need some promo and I really don&rsquo;t know any other effective way to go about this because this site been especially stingy with the&hellip;</p>\n<p><a href=\"http://www.harrystylesfanfiction.com/Story/88657/Between-Pretend-And-Reality/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\">Read more&hellip;</a></p>",
        "reblog": {
            "comment": "<p><a href=\"http://www.harrystylesfanfiction.com/Story/88657/Between-Pretend-And-Reality/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\"><img class=\"cover\" alt=\"\" src=\"http://www.harrystylesfanfiction.com/data/images/preview/story-cover/3b/804e6ab3-crop-680x200.jpg\"></a>\n<p><strong>A collection of “Let’s Pretend It’s Love” drabbles</strong></p>\n<h2>SHAMELESS SELF PROMO</h2>\n<p>Welp guys,I hate to even be making this chapter but I honestly need some promo and I really don’t know any other effective way to go about this because this site been especially stingy with the…</p>\n<p><a href=\"http://www.harrystylesfanfiction.com/Story/88657/Between-Pretend-And-Reality/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\">Read more…</a></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "harrystylesfanfiction-com",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_14.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_14_focused_v3.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_14_focused_v3.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178815779513"
                },
                "content_raw": "<p><a href=\"http://www.harrystylesfanfiction.com/Story/88657/Between-Pretend-And-Reality/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\"><img class=\"cover\" alt=\"\" src=\"http://www.harrystylesfanfiction.com/data/images/preview/story-cover/3b/804e6ab3-crop-680x200.jpg\"></a>\n<p><strong>A collection of “Let’s Pretend It’s Love” drabbles</strong></p>\n<h2>SHAMELESS SELF PROMO</h2>\n<p>Welp guys,I hate to even be making this chapter but I honestly need some promo and I really don’t know any other effective way to go about this because this site been especially stingy with the…</p>\n<p><a href=\"http://www.harrystylesfanfiction.com/Story/88657/Between-Pretend-And-Reality/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\">Read more…</a></p></p>",
                "content": "<p><div class=\"external-image-wrapper\" data-loading-text=\"Loading...\" data-src=\"http://www.harrystylesfanfiction.com/data/images/preview/story-cover/3b/804e6ab3-crop-680x200.jpg\">External image</div>\n</p><p><strong>A collection of &ldquo;Let&rsquo;s Pretend It&rsquo;s Love&rdquo; drabbles</strong></p>\n<h2>SHAMELESS SELF PROMO</h2>\n<p>Welp guys,I hate to even be making this chapter but I honestly need some promo and I really don&rsquo;t know any other effective way to go about this because this site been especially stingy with the&hellip;</p>\n<p><a href=\"http://www.harrystylesfanfiction.com/Story/88657/Between-Pretend-And-Reality/?utm_source=tumblr&amp;utm_medium=blog&amp;utm_campaign=update\">Read more&hellip;</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "nexttxyou",
        "blog": {
            "name": "nexttxyou",
            "title": "‘Is it straight?’ 'No, gay’",
            "description": "<p>mary, 22</p><p>harry and louis are in love</p><p><a href=\"http://nexttxyou.tumblr.com/tagged/my-edit\">edits</a> | <a href=\"https://demauryy.tumblr.com/\">ii</a></p>\n<!-- Statcounter code for anons nexttxyou\nhttp://nexttxyou.tumblr.com on Tumblr -->\n \n \n \n<!-- End of Statcounter Code -->",
            "url": "https://nexttxyou.tumblr.com/",
            "uuid": "t:iN4mfctLDb3coKSQxbbNGg",
            "updated": 1558518158
        },
        "id": 178815511007,
        "post_url": "https://nexttxyou.tumblr.com/post/178815511007/melbourne-2017",
        "slug": "melbourne-2017",
        "date": "2018-10-07 09:35:18 GMT",
        "timestamp": 1538904918,
        "state": "published",
        "format": "html",
        "reblog_key": "2bs0h3fq",
        "tags": [
            "harry styles",
            "hs",
            "hs tour",
            "my edit",
            "I AM SCREAMING",
            "the other op is yikes",
            "and i'm blocked so",
            "LOOK AT HIM SOFT"
        ],
        "short_url": "https://tmblr.co/ZyVqjj2cYF2dV",
        "summary": "Melbourne, 2017",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 969,
        "caption": "<p><small><a href=\"https://twitter.com/rosesforharrie/status/1048801153708748801\" target=\"_blank\">M</a>elbourne, 2017</small></p>",
        "reblog": {
            "comment": "<p><small><a href=\"https://twitter.com/rosesforharrie/status/1048801153708748801\" target=\"_blank\">M</a>elbourne, 2017</small></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "nexttxyou",
                    "active": true,
                    "theme": {
                        "header_full_width": 1000,
                        "header_full_height": 1000,
                        "header_focus_width": 1000,
                        "header_focus_height": 562,
                        "avatar_shape": "square",
                        "background_color": "#033c47",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "212,1000,774,0",
                        "header_image": "https://static.tumblr.com/08f6b7df2286c0243bc890b29965f0dc/riwgktb/sTRpbv7zx/tumblr_static_8dgxp9cmth8goocokgcc4sgos.jpg",
                        "header_image_focused": "https://static.tumblr.com/08f6b7df2286c0243bc890b29965f0dc/riwgktb/i3Apl8k0m/tumblr_static_tumblr_static_8dgxp9cmth8goocokgcc4sgos_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_03_focused_v3.png?_v=a0f20b51ed40eb5a930ab86effe42a40",
                        "header_stretch": true,
                        "link_color": "#c8d1ca",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#575757",
                        "title_font": "Baskerville",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178815511007"
                },
                "content_raw": "<p><small><a href=\"https://twitter.com/rosesforharrie/status/1048801153708748801\" target=\"_blank\">M</a>elbourne, 2017</small></p>",
                "content": "<p><small><a href=\"https://twitter.com/rosesforharrie/status/1048801153708748801\" target=\"_blank\">M</a>elbourne, 2017</small></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://nexttxyou.tumblr.com/image/178815511007",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/2907806c8c48a5a6c27da3cbe920208a/tumblr_pg82muCu721udd1p0o2_r1_1280.jpg",
                    "width": 791,
                    "height": 1183
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/2907806c8c48a5a6c27da3cbe920208a/tumblr_pg82muCu721udd1p0o2_r1_1280.jpg",
                        "width": 791,
                        "height": 1183
                    },
                    {
                        "url": "https://66.media.tumblr.com/2907806c8c48a5a6c27da3cbe920208a/tumblr_pg82muCu721udd1p0o2_r1_640.jpg",
                        "width": 640,
                        "height": 957
                    },
                    {
                        "url": "https://66.media.tumblr.com/2907806c8c48a5a6c27da3cbe920208a/tumblr_pg82muCu721udd1p0o2_r1_540.jpg",
                        "width": 540,
                        "height": 808
                    },
                    {
                        "url": "https://66.media.tumblr.com/2907806c8c48a5a6c27da3cbe920208a/tumblr_pg82muCu721udd1p0o2_r1_500.jpg",
                        "width": 500,
                        "height": 748
                    },
                    {
                        "url": "https://66.media.tumblr.com/2907806c8c48a5a6c27da3cbe920208a/tumblr_pg82muCu721udd1p0o2_r1_400.jpg",
                        "width": 400,
                        "height": 598
                    },
                    {
                        "url": "https://66.media.tumblr.com/2907806c8c48a5a6c27da3cbe920208a/tumblr_pg82muCu721udd1p0o2_r1_250.jpg",
                        "width": 250,
                        "height": 374
                    },
                    {
                        "url": "https://66.media.tumblr.com/2907806c8c48a5a6c27da3cbe920208a/tumblr_pg82muCu721udd1p0o2_r1_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/2907806c8c48a5a6c27da3cbe920208a/tumblr_pg82muCu721udd1p0o2_r1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "stuckinstylinson",
        "blog": {
            "name": "stuckinstylinson",
            "title": "I MESS AROUND WITH HIM AND I'M OKAY WITH IT",
            "description": "— Medicine by Harry Styles",
            "url": "https://stuckinstylinson.tumblr.com/",
            "uuid": "t:kKy8EptOtiXBGUuuIKOM6A",
            "updated": 1557390409
        },
        "id": 178815425464,
        "post_url": "https://stuckinstylinson.tumblr.com/post/178815425464/what-is-this",
        "slug": "what-is-this",
        "date": "2018-10-07 09:29:31 GMT",
        "timestamp": 1538904571,
        "state": "published",
        "format": "html",
        "reblog_key": "Eswkkykl",
        "tags": [
            "one direction",
            "harry styles",
            "louis tomlinson",
            "niall horan",
            "larry stylinson",
            "larry proof",
            "larry theories",
            "larry theory",
            "1d",
            "larry proofs",
            "larry moment",
            "larry moments",
            "fetus larry",
            "fetus louis",
            "fetus louis tomlinson",
            "fetus harry styles",
            "fetus harry",
            "fetus larry stylinson"
        ],
        "short_url": "https://tmblr.co/ZALWnb2cYEjku",
        "summary": "WHAT IS THIS",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 922,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"405\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/90491afcdab5159f5cbe8c008cf75c3e/tumblr_pdkrcc3Fze1vtj8hd_1280.jpg\" data-orig-height=\"405\" data-orig-width=\"720\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"405\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/74977391b55a1119922ac7907f7e9a71/tumblr_pdkrcc1dfY1vtj8hd_1280.jpg\" data-orig-height=\"405\" data-orig-width=\"720\"/></figure></div><p>WHAT IS THIS</p>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"405\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/90491afcdab5159f5cbe8c008cf75c3e/tumblr_pdkrcc3Fze1vtj8hd_1280.jpg\" data-orig-height=\"405\" data-orig-width=\"720\"></figure><figure class=\"tmblr-full\" data-orig-height=\"405\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/74977391b55a1119922ac7907f7e9a71/tumblr_pdkrcc1dfY1vtj8hd_1280.jpg\" data-orig-height=\"405\" data-orig-width=\"720\"></figure></div><p>WHAT IS THIS</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "stuckinstylinson",
                    "active": true,
                    "theme": {
                        "header_full_width": 860,
                        "header_full_height": 617,
                        "header_focus_width": 860,
                        "header_focus_height": 484,
                        "avatar_shape": "circle",
                        "background_color": "#6EADD2",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "133,860,617,0",
                        "header_image": "https://static.tumblr.com/2829c4371e458c6845d197102e0e2a2a/ckpvjc5/0GMpdkqk5/tumblr_static_1231160973-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/2829c4371e458c6845d197102e0e2a2a/ckpvjc5/KP6pdkqk7/tumblr_static_tumblr_static_1231160973-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/2829c4371e458c6845d197102e0e2a2a/ckpvjc5/0GMpdkqk5/tumblr_static_1231160973-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#86BBD9",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178815425464"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"405\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/90491afcdab5159f5cbe8c008cf75c3e/tumblr_pdkrcc3Fze1vtj8hd_1280.jpg\" data-orig-height=\"405\" data-orig-width=\"720\"></figure><figure class=\"tmblr-full\" data-orig-height=\"405\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/74977391b55a1119922ac7907f7e9a71/tumblr_pdkrcc1dfY1vtj8hd_1280.jpg\" data-orig-height=\"405\" data-orig-width=\"720\"></figure></div><p>WHAT IS THIS</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/90491afcdab5159f5cbe8c008cf75c3e/tumblr_pdkrcc3Fze1vtj8hd_1280.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/74977391b55a1119922ac7907f7e9a71/tumblr_pdkrcc1dfY1vtj8hd_1280.jpg\" class=\"\"/></figure><p>WHAT IS THIS</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "lovelyharrystories",
        "blog": {
            "name": "lovelyharrystories",
            "title": "lovelyharrystories",
            "description": "<a href=\"https://lovelyharrystories.tumblr.com/tagged/about-me\">Emma</a>. 20. Something I do for fun! Request are closed. <a href=\"https://lovelyharrystories.tumblr.com/post/181773611165/updating-for-january\">Updating schedule</a>. and I also have a <a href=\"https://lovelyharrystories.tumblr.com/post/176120024095/masterlist\">Masterlist</a>",
            "url": "https://lovelyharrystories.tumblr.com/",
            "uuid": "t:AUbEqinkLCqoDBq-25T5SQ",
            "updated": 1558091631
        },
        "id": 178815374865,
        "post_url": "https://lovelyharrystories.tumblr.com/post/178815374865/hiiii-can-you-do-an-instagram-post-were-harry-and",
        "slug": "hiiii-can-you-do-an-instagram-post-were-harry-and",
        "date": "2018-10-07 09:25:48 GMT",
        "timestamp": 1538904348,
        "state": "published",
        "format": "html",
        "reblog_key": "PliTvvWM",
        "tags": [
            "harry styles",
            "harry styles au meme",
            "harry styles au memes",
            "harry styles blurb",
            "harry styles imagine",
            "harry styles imagines",
            "one direction imagine",
            "one direction imagines",
            "harry styles one shot",
            "one direction one shot",
            "fanfic",
            "fanfiction",
            "harry styles fanfic",
            "harry styles fanfiction",
            "fake socials",
            "harry styles instagram",
            "harry styles fake instagram",
            "fake instagram",
            "instagram prompts"
        ],
        "short_url": "https://tmblr.co/ZiSOFZ2cYEXOH",
        "summary": "Hiiii can you do an instagram post were harry and y/n (she’s an actress) are seen  together at the oscars after party",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "post_author": "harrystyles-is-an-angel",
        "liked": false,
        "note_count": 17,
        "asking_name": "Anonymous",
        "asking_url": null,
        "question": "Hiiii can you do an instagram post were harry and y/n (she’s an actress) are seen  together at the oscars after party",
        "answer": "<p>I combined you request with a blurb so you can find it <a href=\"https://lovelyharrystories.tumblr.com/post/178815338125/hi-can-you-do-one-about-yn-winning-an-oscar\">here</a>. Hope you like it!</p>",
        "reblog": {
            "comment": "<p>I combined you request with a blurb so you can find it <a href=\"https://lovelyharrystories.tumblr.com/post/178815338125/hi-can-you-do-one-about-yn-winning-an-oscar\">here</a>. Hope you like it!</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "lovelyharrystories",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#444444",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/8064905ca42c5a957afc50c448972c49/h1sczkh/mpMpj41nq/tumblr_static_-2094928136-content.gif",
                        "header_image_focused": "https://static.tumblr.com/8064905ca42c5a957afc50c448972c49/h1sczkh/mpMpj41nq/tumblr_static_-2094928136-content_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/8064905ca42c5a957afc50c448972c49/h1sczkh/mpMpj41nq/tumblr_static_-2094928136-content_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#B9513C",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#B9513C",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178815374865"
                },
                "content_raw": "<p>I combined you request with a blurb so you can find it <a href=\"https://lovelyharrystories.tumblr.com/post/178815338125/hi-can-you-do-one-about-yn-winning-an-oscar\">here</a>. Hope you like it!</p>",
                "content": "<p>I combined you request with a blurb so you can find it <a href=\"https://lovelyharrystories.tumblr.com/post/178815338125/hi-can-you-do-one-about-yn-winning-an-oscar\">here</a>. Hope you like it!</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    }
]