[
    {
        "type": "text",
        "blog_name": "drracosmalfoy",
        "blog": {
            "name": "drracosmalfoy",
            "title": "",
            "description": "<p>brooke • 22 • australia</p><p>i follow from <a href=\"http://rogerss.tumblr.com/\">rogerss</a></p>",
            "url": "https://drracosmalfoy.tumblr.com/",
            "uuid": "t:2ynJ9dHVHR2Of1_MOC9xzA",
            "updated": 1557144674
        },
        "id": 182999243417,
        "post_url": "https://drracosmalfoy.tumblr.com/post/182999243417/new-harry-potter-blog-please-follow-or-reblog-to",
        "slug": "new-harry-potter-blog-please-follow-or-reblog-to",
        "date": "2019-02-23 10:32:09 GMT",
        "timestamp": 1550917929,
        "state": "published",
        "format": "html",
        "reblog_key": "W2FMUOlv",
        "tags": [
            "harry potter",
            "hp",
            "draco malfoy",
            "drarry",
            "hermione granger",
            "ron weasley",
            "marauders",
            "wolfstar",
            "remus lupin",
            "sirius black",
            "dramione",
            "daniel radcliffe",
            "emma watson",
            "tom felton",
            "rupert grint",
            "ginny weasley",
            "james potter",
            "albus potter",
            "scorpius malfoy",
            "hpcc",
            "harry potter and the cursed child",
            "luna lovegood",
            "neville longbottom",
            "fantastic beasts",
            "credence barebone",
            "albus dumbledore",
            "newt scamander",
            "fbawtft",
            "jacob kowalski",
            "queenie goldstein"
        ],
        "short_url": "https://tmblr.co/ZyZQEX2gRcjgP",
        "summary": "new harry potter blog! please follow or reblog to boost! ✨⚡️",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 12,
        "title": null,
        "body": "<p>new harry potter blog! please follow or reblog to boost! ✨⚡️</p>",
        "reblog": {
            "comment": "<p>new harry potter blog! please follow or reblog to boost! ✨⚡️</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "drracosmalfoy",
                    "active": true,
                    "theme": {
                        "header_full_width": 320,
                        "header_full_height": 455,
                        "header_focus_width": 274,
                        "header_focus_height": 154,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "136,297,290,23",
                        "header_image": "https://static.tumblr.com/4948352f35523994c9e2f1594f695c3c/kci5yrz/M90pndq2b/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/4948352f35523994c9e2f1594f695c3c/kci5yrz/Ff7pndq2c/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/4948352f35523994c9e2f1594f695c3c/kci5yrz/M90pndq2b/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#B994B0",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": false,
                        "title_color": "#ADADAD",
                        "title_font": "Arquitecta",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182999243417"
                },
                "content_raw": "<p>new harry potter blog! please follow or reblog to boost! ✨⚡️</p>",
                "content": "<p>new harry potter blog! please follow or reblog to boost! &#10024;&#9889;&#65039;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "tessimagines",
        "blog": {
            "name": "tessimagines",
            "title": "Tess",
            "description": "Tess | Writer | Ravenclaw | Fandoms: Harry Potter & Fantastic Beasts, Peaky Blinders, Doctor Who, Game of Thrones, Outlander, Marvel & Sherlock | Requests are open for: imagines/oneshots, headcanons, drabbles & character aesthetics/moodboards | Requests are closed for: preferences, fluffy alphabets & ships | Current number of requests: 30 | No smut, sorry | I do tag lists | <a href=\"https://rosedewson.tumblr.com/\">Profile icon credit</a> | <a href=\"https://tessimagines.tumblr.com/post/178591515226/mobile-masterlist\"> Masterlist</a> | <a href=\"http://tessimagines.tumblr.com/ask\">Request</a> | <a href=\"http://tessimagines.tumblr.com/shiplayout\">Ship Layouts</a> | <a href=\"http://tessimagines.tumblr.com/requestingguidlines\">Requesting Guidelines</a> | <a href=\"https://tessimagines.tumblr.com/post/181963764761/characters-i-write-for\">Characters I write for</a> | <a href=\"https://tessimagines.tumblr.com/post/175600514391/prompt-list\">Current Prompt List</a> | <a href=\"https://tessimagines.tumblr.com/post/181418170736/after-all-this-bill-weasley-x-reader-series\">After All This // Bill Weasley x Reader</a> | <a href=\"https://tessimagines.tumblr.com/post/182743276926/wash-me-clean-thomas-shelby-series-masterlist\">Wash Me Clean // Thomas Shelby x Reader</a> | <a href=\"https://tessimagines.tumblr.com/post/184221972651/hey-guys-so-in-my-obsession-and-anticipation\">GoT8 Celebration</a>",
            "url": "https://tessimagines.tumblr.com/",
            "uuid": "t:TY9y8QtVw3R2ibPUkx91dw",
            "updated": 1558434796
        },
        "id": 182999142641,
        "post_url": "https://tessimagines.tumblr.com/post/182999142641/after-all-this-bill-weasley-part-six",
        "slug": "after-all-this-bill-weasley-part-six",
        "date": "2019-02-23 10:21:30 GMT",
        "timestamp": 1550917290,
        "state": "published",
        "format": "html",
        "reblog_key": "HuH5lIsr",
        "tags": [
            "harry potter",
            "harry potter imagines",
            "harry potter imagine",
            "harry potter oneshot",
            "harry potter oneshots",
            "harry potter x reader",
            "harry potter fanfiction",
            "bill weasley imagine",
            "bill wealsey imagines",
            "bill weasley oneshots",
            "bill weasley oneshot",
            "bill weasley",
            "hphm",
            "hphm imagines",
            "hphm x reader",
            "hogwarts mystery",
            "hogwarts mystery x reader",
            "hogwarts mystery imagines"
        ],
        "short_url": "https://tmblr.co/ZEZLab2gRcL3n",
        "summary": "After All This // Bill Weasley - Part Six",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 107,
        "title": "After All This // Bill Weasley - Part Six",
        "body": "<figure data-orig-width=\"500\" data-orig-height=\"290\" data-tumblr-attribution=\"hogwartsayolculuk:2ZYwudlD9oZz6PuJWFleAQ:Z585Sf2HIhIV0\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f2fdaf737987a07f7d467321b0dc819a/tumblr_ojy03w2Oyw1vkt37oo1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"290\"/></figure><p><b>Pairing: </b>Bill Weasley x Moody!Reader</p><p><b>Summary:</b> Alastor Moody wasn’t a man to back away when someone needed him, so it’s really no surprise that his daughter (Y/N) is like that too. So when both Bill and (Y/N) find a house-elf at their door one day, (Y/N) doesn’t think twice before apparating away with him.<br/></p><p><b>You can find the series masterlist in my bio!</b></p><p><b>Warnings: </b>angst, fighting, grief, torture and just overall a very heavy chapter.</p><p><b>Wordcount: </b>3.65k</p><p><b>A/N: </b>This chapter is pretty intense and plot filled (like pretty much all chapters ahead!)</p><figure data-orig-width=\"1797\" data-orig-height=\"116\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pm5xxw126N1vvelon_540.png\" alt=\"image\" data-orig-width=\"1797\" data-orig-height=\"116\"/></figure><h2><i>March 16th, 1998</i></h2><p><i>“Dad,” you said, giving your father a quizzical look. “What’s that?”</i></p><p><i>Alastor Moody looked down at his daughter from his place at the old mahogany table, his brand new magical glass in his hand. He had just popped it into its brown leather strap and was giving it a quick cautious inspection. You had been watching him the whole time, taking note of every action in the simple process.</i></p><p><i>“It’s my new eye,” Moody said, allowing his daughter to take a proper look at the thing for the first time. You leaned over his knee and peered down at the glass eye in his rough and tattered hand. It looked so small in his wide palm.</i></p><p><i>“So you can get rid of the eye patch?” you asked, your nose scrunching up at the leather patch covering his left eye. You had hated the thing since you had seen it on him for the first time and kept telling him that he looked like one of those muggle pirates. He gave a rare, slight chuckle at your words.</i></p><p><i>“Yes. Happy about that are you?” There was a smile on your face as Moody took the eye patch off, revealing the red, scarred skin around the hole where his eye used to be. He saw you flinch at the sight but keep on looking, disgusted intrigue on your face. Moody felt the need to turn away from your innocent eyes but stayed when you raised a hand to the scars running down the left side of his face.</i></p><!-- more --><p><i>“Did a bad man do that, Dad?” Moody picked up a sense of concern in your young features, bringing a smile to his lips. He lifted you up and placed you on his knee like he would always do when explaining something to you.</i></p><p><i>“Yes,” Moody said. “A very bad man. You know that Dad’s job is to put all the bad wizards and witches in jail. But sometimes I can get hurt, and this can happen.” He lifted a finger to point at his eye. “Or this.” </i><i>He pointed to his wooden prosthetic leg and gave it a pat. He watched your eyes glance down from his facial scars and down to the wooden leg. You followed his action in patting it and smiled at the weird part of your father.</i></p><p><i>“That’s cool,” you said, giving it another pat. Moody chuckled and tucked a (h/c) strand of hair behind your ear, one that so resembled your late moth</i><i>er’s.</i></p><p><i>“That’s not the word I would use for it,” Moody said. “but I suppose it could be considered cool.”</i></p><p><i>“Was it the same man that got Mum?”</i></p><p><i>Moody paused, the question taking him by surprise. His heart sat still in his chest at the mention of your mother, and he was grasping for the right words to say. It had been a different death eater than the one that had taken Adeline, yet to him, they were much of the same muchness. Both were the same evil vermin that they had both been pledged to fight against. </i></p><p><i>“No,” he answered slowly. “No, it wasn’t the same man.”</i></p><p><i>“I miss her,” you said, suddenly looking up at his face from your gaze on his wooden leg. You were playing with one of the buttons on his dark grey shirt, your legs swaying around in the air between his leg and the floor.</i></p><p><i>“I miss her too,” Moody said, letting you wrap your arms around his neck. He held you tight as you nestled your face in his neck and against his light brown hair, his hand going up to cup the back of your head. “I miss her too.”</i></p><p><i>He placed a kiss to the side of your head, keeping your body close against him. Letting a silence come over the both of you, he kept a grip on the electric-blue eye in his hand. He’d give both eyes to have his wife back. But more importantly, he’d give his life to make sure you didn’t have to die along with her. </i></p><p>The sunlight streaming in through the window bounced back off the electric-blue glass ball and into your eye, only becoming aware of the painful glint as you awoke from the old memory. You could almost feel the kiss that you father had placed to the side of your head over twenty years ago, the remanents of its comforting nature still imprinted on your skin.</p><p>The sound of Bill’s footsteps coming down the stairs awoke you from your trance, your head turning to look at him. He flashed you the warm smile he always would whenever he saw you, no matter how long had passed since he had last been in your company. This time it had only been several minutes, yet he still made his way over to you and wrapped his arms snuggly around your waist, digging his nose deep into the strands of hair sitting around your ear.</p><p>He placed a kiss to your temple, feeling you lean back against the front of his body. It was one of the comfiest places in the world and you always found yourself coming back to its comfort. </p><p>“I was thinking we might go visit Tonks and Remus today?” Bill said, feeling you turn around to face him in his arms. “See how big her belly’s gotten and tease her about it.”</p><p>You let a laugh slip from your lips, a large smile on your face now beaming. “Pregnancy is a beautiful thing, Bill. Even if it does make you fat.”</p><p>Bill gave a hearty laugh, placing a kiss to your lips. You reached a hand up to ruffle his long, ginger hair, stepping out from his hold around your waist. “I’ll just go get a jacket for both of us and then we can head off.”</p><p>Before you could take a step up the stairs, a loud crack of someone apparating outside came rippling through the cottage. Your eyes immediately flickered over to Bills, ears pricked to pick up the slightest of noises. Within a second, your wand was outstretched in your hand and you stalked your way over to the window. You tugged the thin lace curtain back, peering outside to find the unexpected visitors.</p><p>Out near the edge of the windy cliffs stood three familiar figures. Dobby the house elf who you had met only a handful of times stood in the middle, both hands outstretched and holding the hands of Luna Lovegood and Garrick Ollivander. Both looked injured and weak, bloody cuts all over their bodies and bones protruding out of their undernourished flesh.</p><p>“It’s Dobby with Luna Lovegood and Ollivander,” You said, turning around to look at Bill. You saw a look of confusion come over his face and the wand in his hand drop to his side.</p><p>“The wandmaker?”</p><p>You simply nodded, making your way outside and over towards them. You heard Bill quickly make his way out behind you. Dobby was hurridly making his way over to you, tugging both of them along behind him.</p><p>“(Y/N) Moody!” called the house elf. “Dobby needs to help Harry Potter! Harry Potter told Dobby to bring Luna Lovegood and Mr Ollivander to Shell Cottage!”</p><p>“Where’s Harry?” You said, placing a hand to Luna’s face to check the scar that sat on her cheek. Luna’s silver eyes were still bright despite the physical wounds that littered her body.</p><p>“They’re at Malfoy Manor,” she said in her light voice. Her normally bubbly expression had turned to one of worry. “They’re in trouble.”</p><p>You had your mind made up within a second. You nodded at Luna before looking down at the Small house elf in front of you. “Can you take me there?”</p><p>“Of course,” he responded, his high-voice enthusiastic to get back to Harry’s aid.</p><p>“(Y/N),” Bill said, grabbing hold of your wrist and turning you to face him. “Don’t go leaping into battle. Think this through first.”</p><p>“There’s no time to think this through, Bill!” You said, your (e/c) eyes meeting his blue ones. “There in real trouble. The Malfoys are dark wizards, and as far as I’m concerned, my job is to hunt down dark wizards.”</p><p>Bill sighed, knowing that fighting with you would be no use. When you were set on something like this, there was no changing your mind. “I’m coming with you, then.”</p><p>“No, you can’t,” you said, “you need to look after Luna and Ollivander. I promise I’ll be careful, okay?”</p><p>You knew he was worried for you; he always was whenever you had to do something like this. Though normally, you would have your father or another auror with you. This time, however, you were heading into it alone. All he could do was place a rash kiss to your lips, a hopeful goodbye, and let you leave, hoping with everything he had that you would return all in one piece.</p><p>“You’re too much like your father,” he muttered against your lips before placing another kiss to your forehead. You leant into him one last time before turning away and grabbing Dobby’s hand.</p><p>“I love you,” Bill said, the breeze ruffling his red hair and sending a shiver down his skin. Bill’s face was already pale with worry but he held onto your gaze with apprehension.</p><p>“I love you too.” And with those final words, you watched as Bill, Luna and Garrick Ollivander vanished into a swirl of colour, the dark colours of the Malfoy’s dungeon quickly setting in. Looking around, your eyes met with Harry and Ron’s, a look of relief coming across their face as they took your presence in.</p><p>“(Y/N)?” You heard Harry say, rushing forward and wrapping his arms around your body. You embraced him in the cold and damp dungeon before wrapping your arms around Ron.</p><p>“Tell me what’s going on.” It was then that a blood-curdling scream erupted from outside, unmistakably a female’s. You winced at the sound, knowing full well who’s throat it had escaped from.</p><p>“Bellatrix has Hermione,” Ron said, rage clear in his voice as he said it. You knew it was taking everything he had not to barge up there and into the middle of a room full of Death Eaters.</p><p>“Why are you even here?” You said, looking between the two of them.</p><p>“Snatchers got us,” Harry responded. “We have the sword of Gryffindor, that’s why Bellatrix is torturing Hermione.” He stumbled on the word torturing, his eyes rising to the roof where another scream erupted.</p><p>“The sword is supposed to be in the Lestrange volt,” you said, your grip tightening on your wand in your hand. “Okay, look, we haven’t got time for stories. I’m going to sneak up there. You leave the duelling to me, okay? I have the most experience. You two get Hermione and the sword and make sure you’re ready to apparate back to Shell Cottage with Dobby.”</p><p>You crouched down until you were face-to-face with the house elf. Your authorative tone reminded you so much of the way your father would address the Aurors below him just before a mission would unfold. “Now you make sure you do whatever you can to get them to safety. If I get injured or die, you disappate out of here and get them to Bill. Do you understand me?”</p><p>“Yes, (Y/N) Moody,” Dobby said. “I’ll make sure Harry Potter and his friends are all safe.”</p><p>You nodded at them all, before making your way past them and up the stairs. Your eyes flickered to Peter Pettigrew’s dead body, no emotion arising in you as you looked at it. You stepped quietly on each step, growing closer and closer to Hermione’s screams as you trod. Years of Auror experience had made your footsteps near silent and your breaths almost invisible to detect. Your heartbeat was beating quickly in your chest but your hand never shook, your wand steady and ready to use in your still hand.</p><p>You rounded a corner, ears pricked to pick up any sound that the Malfoys or Bellatrix might make. You were so close now and could see the dark outline of a tall woman with dark, frizzy hair. On the floor just below her was Hermione, bloody and screaming, tears streaking her pale and distraught face. You swallowed in disgust at the way Bellatrix leaned over her, enjoyment in her eyes at seeing the muggleborn in so much pain.</p><p>You raised your wand silently and aimed it straight at Bellatrix’s chest. You were careful not to let it point in Hermione’s direction before shouting, “<i>Expulso!</i>”</p><p>Bellatrix flew back in the air as blue light hit her chest, a stunned expression on her face at the unexpected curse. You watched as all three of the Malfoy’s heads turned to you, their wands now in their hands.</p><p>Before another second had passed, you had disarmed Lucius Malfoy and were working on stunning Narcissa. Draco stood still, his wand pointed at you yet still unwilling to actually use it. You watched in the corner of your eye as Bellatrix stood back up, her curved, walnut wand in her hand.</p><p>Her frenzied eyes locked with yours and as she raised her wand, a wicked smile playing with her features. As furious as she was at the expulsion curse you had shot her way, she almost looked <i>excited</i> that you were there, hardly able to wait to play with the toy that had been delivered right into her hands.</p><p>“Oh, look,” she said in her high and toying voice. “A Moody has come to save the day.”</p><p>You weren’t one to wait for a death eater to finish toying and shot a stunning curse her way. It seemed to do its job in shutting her up before she deflected it with ease, a look of outrage on her face. Her features were glowing red as she looked at you with pure disgust in her eyes.</p><p>“You think you’re a brave one too, huh?” She gasped. “Well don’t you remember what we did to your father? Don’t you remember him falling off that broom that night?”</p><p>Her words sent a rush of loathing through your blood, your already tight grip on your wand tightening. You saw her raise her wand and you jumped out of the way, barely making it out of the red, torturous light in time. “<i>Crucio!</i>”</p><p>It struck the floor beside you, charring the wooden boards that it hit. You raised your mother’s old wand and yelled, “<i>Incendio!</i>”</p><p>Bright flames shot out of your wand and into her direction, licking her skin and singeing her hair. She staggered pack, a burning pain clear on her face and a look of hatred in her eyes. “Don’t you dare talk about my father like that!”</p><p>Bellatrix laughed despite the pain. “Do you know what happened to his body? Of course you wouldn’t, after all, we got to it first… or more like His Dark Lord’s snake did…”</p><p>Her own words must have stuck Bellatrix as hilarious because she let out a large and long cackle, it’s high-pitched sound echoing around the otherwise silent room. The Malfoys were just watching on now, completely engrossed in the teasing and curses being flown back and forth. You caught the figures of Harry and Ron coming around the corner and into the tense room, their eyes immediately settling on both you and Bellatrix staring back and forth before flickering down to Hermione behind you. Ron instantly made his way over to her and helped her to her feet, Ron taking most of the effort in walking her back over to Harry.</p><p>“You’re another dead Moody, you know that?” She finally said, set on finishing you rather than wasting another minute of her time toying. “There won’t be any more of your filthy half-blood family left to hunt us down.”</p><p>You deflected the stunning shell she shot your way and quickly followed it up with an expulsion charm. She stumbled back, more vicious intent coming into her features as her eyes narrowed on you. “I watched that snake eat him whole,” she screeched, “And I’ll watch it eat you too.”</p><p>“Shut up!” You couldn’t take the taunting about your father anymore, it was opening up to many painful doors you thought you had closed. But she kept going, firing another fiery spell your way as she did do.</p><p>“There was barely enough left of him before the snake got to him! The fall broke his body, oh…” She let a high, intake of breath part her words. “I wish you had been there to watch.”</p><p>You were almost set on dropping your wand and jumping on her, switching to the muggle way of solving fights. But Dobby’s high, anxious voice filled the room. “(Y/N) Moody, we must leave now!”</p><p>“Just a second, Dobby,” you said, taking a large intake of breath to clear your mind. “Just another second.”</p><p>You shot a red curse her way, watching her as she deflected it with a silver shield charm. There were flashes of different coloured lights, blue, red and green as curses were shot back and forth, some deflected and some just missing its target. Bellatrix’s cutting curse struck your arm, sending sharp pains throughout your arm as small but deep cuts sprang up all over your arm. There was blood everywhere, soaking your clothes and dripping to the floor, but you kept your wand pointed at her and fired a successful burning curse her way.</p><p>“Now, (Y/N) Moody!” You heard Dobby scream again, his hand interlocked with both Harry and Ron’s, Hermione struggling to stand up straight against the tall redhead. With a last look at Bellatrix Lestrange, you cast the most havoc-causing curse you could think of.</p><p>“<i>Confringo!</i>”</p><p>Fiery Orange light escaped your wand and hit the ground where Bellatrix stood. The ground erupted, sending her flying back and into the wall behind her. While she was out you hurried back and grabbed Harry’s hand, Dobby instantly moving to diapparate all five of you out of the now rubble filled house.</p><p>It was only as the room turned into a swirl of colour that you noticed the little knife that Bellatrix pulled from her side, and the malice look on her face as she threw into the disapparating form of the five of you. Blood trickled down her smiling lips as she realised it disapparated along with you, hoping with everything that she had that it would find it’s way into one of your flesh and bones.</p><figure data-orig-width=\"1797\" data-orig-height=\"116\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pn562leHt81vvelon_540.png\" alt=\"image\" data-orig-width=\"1797\" data-orig-height=\"116\"/></figure><p>The crack of your apparating forms rippled through Shell Cottage, turning the heads of the three people that sat inside. Bill was immediately on his feet and running full pelt out the front door, frantic for his eyes to lay on you once again. He paused, feeling like his heart was beating in his throat, closing up his airways and leaving him struggling for breath. And then his eyes met yours, standing a few feet from Harry before he watched your knees hit the ground.</p><p>He hadn’t even noticed he had started running towards you before he was on the ground next to you, looking over your body for any indication of injury. Your arm was coated in blood, the scars left by a cutting curse littering the skin of your arm. There was a little cut on your chin, but otherwise, you were physically fine. But for whatever reason, you were shaking uncontrollably in Bill’s arms.</p><p>You couldn’t speak. You had finally let go of all the emotions that Bellatrix’s words had let loose. You knew you wouldn’t be able to fight if you had let them rip and claw at you there, but the holding in had done its own damage. Each breath that came out of your chest was sharp and jagged. You knew you should feel the pain of all the cuts on your arm but you were completely numb to any pain at all. All you could picture was the image of Nagini striking the broken corpse of your father over and over again.</p><p>You hadn’t noticed that you were gripping the inside edge of Bill’s green jacket, the skin on your hands turning white from the pressure it held it with. You barely noticed the screams and whimpers that were coming out of your mouth or the tears that had blurred your vision of the panicked man crouched in front of you.</p><p>“(Y/N)…” he said, but you couldn’t hear him. You scarcely noticed his lips moving. “What happened?”</p><p>All you could do was lean into him, feeling his arms immediately moving to wrap around your neck and chest and bring you deeper into him. The wind whipped both of your hair into each other’s faces, your cries rippling through your body and into his.</p><p>You were only able to mutter one word over and over until it was the only thing your lips seemed to be able to mumble. And that was what kept Bill’s heart thumping a hundred miles per hour in his chest. Your voice was strained and weak with every cry of ‘dad’ that escaped your lips.</p><p>It was like that night all over again. All Bill could do was hold you against him on the damp floor of Shell Cottage while everything else but you and your cries faded out of existence in his mind. You held onto him like he was the only thing keeping you alive at that moment, the sound of Bellatrix’s cackling laugh echoing in your head as she stood over your Father’s broken and battered body. And then the Snake would close in on it, amusement seeping deeper and deeper into Bellatrix’s features.</p><p>And Bill was the only way to hold onto reality. Without him holding you, the snake would engulf you whole along with your father’s damaged and dead body.</p><figure data-orig-width=\"1797\" data-orig-height=\"116\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pn5py27gDa1vvelon_540.png\" alt=\"image\" data-orig-width=\"1797\" data-orig-height=\"116\"/></figure><p><b>I was on edge while writing this part. There were so many times where I was so close to crying because of the intensity of it. What did you guys think? Let me know!</b><br/></p><p><b>If you would like to be added to the <i>After All This</i> taglist, feel free to let me know in my inbox.</b></p><p><b>Alpha tags: <a href=\"https://tmblr.co/m73TQMXCYLh_u_pJQ4Et1dg\" target=\"_blank\">@xinyourdreamsx</a> <a href=\"https://tmblr.co/mi5eOnbwfVzOiE4wbNfzu3Q\" target=\"_blank\">@marvelismylifffe</a> <a href=\"https://tmblr.co/mr3VRIRbro_sJhvbvL9u3RA\" target=\"_blank\">@xxerwin4laypxx</a> <a href=\"https://tmblr.co/mocETYjePDJXUoOmGbkYo3w\" target=\"_blank\">@xxsophie-raabxx</a> <a href=\"https://tmblr.co/mQa6ErL69of6i0TU-LnRQEw\" target=\"_blank\">@yeeterbenjaminparker</a> <a href=\"https://tmblr.co/mKNM8vKfkEVZvNYCte3UfiA\" target=\"_blank\">@bitchinghourss</a> <a href=\"https://tmblr.co/mb1lTa35TLVbsXxf0QMb7VQ\" target=\"_blank\">@sly-vixen-up2nogood</a></b></p><p><b>Beta Tags: <a href=\"https://tmblr.co/mB4j56voIF2I69XIuQoiLPA\" target=\"_blank\">@winchestergirl907</a> <a href=\"https://tmblr.co/mLXVADHSkhhwBGp3Kpu1lPg\" target=\"_blank\">@anormalgirlsthoughts</a> <strike>@moondust-and-stardust</strike> <a href=\"https://tmblr.co/mlSK91hmOns538b7Sor2hfw\" target=\"_blank\">@otherthingsinhead</a> <a href=\"https://tmblr.co/m1BFZcp2MYaPXvBgCXc4L1g\" target=\"_blank\">@kaetastic</a> <a href=\"https://tmblr.co/mbdWxiadSNPZAGOpzfQZddg\" target=\"_blank\">@themeanestlittlewitch</a> <a href=\"https://tmblr.co/mxAxPqSleV7sg8uJgRkRZOw\" target=\"_blank\">@pixierox101</a> <a href=\"https://tmblr.co/mwJIvhPrkBRq9TNC1vgFJHw\" target=\"_blank\">@semicharmedkindofali</a> <strike>@struggleofyesterday</strike> <a href=\"https://tmblr.co/mbsWik7rGQu0GDhkCK_-SyQ\" target=\"_blank\">@lazydiabetic</a> <a href=\"https://tmblr.co/mbmBgTO_AW9isWmJjueFyRg\" target=\"_blank\">@supermassiveblackhope</a> <strike>@thelders</strike> <a href=\"https://tmblr.co/mWtDegeTaHyAQBBY4oDG0eg\" target=\"_blank\">@firekissedwitchbitch</a> <a href=\"https://tmblr.co/mFVvkWtH-JTm66sW1s_Ks9g\" target=\"_blank\">@thatwrestlingfan91</a> <a href=\"https://tmblr.co/mJptKxWsYQX_jjBo7zUJytA\" target=\"_blank\">@wonderwoman292</a> <strike>@ohleahdarling</strike> <a href=\"https://tmblr.co/mYPV6Ohi0Tdx2QFwPQttMow\" target=\"_blank\">@ffantasylandd</a> <a href=\"https://tmblr.co/mOnYi_Nin-rHinxMsiK45wA\" target=\"_blank\">@fallatyourfeet</a> <a href=\"https://tmblr.co/mx2whzivJYMAZB5LLTqRhFA\" target=\"_blank\">@riverdaleserpent-hoe</a> <a href=\"https://tmblr.co/mJDSQLS5O4jEIsJPd4UpGoQ\" target=\"_blank\">@firstworldproblemthings</a> <a href=\"https://tmblr.co/mSnTWCmjnS-bS7Fbhpj3rag\" target=\"_blank\">@wandressfox</a> <strike>@abbssssssssssss</strike> <a href=\"https://tmblr.co/mRP1wmaE1GmYFNTl-F6sE9g\" target=\"_blank\">@izzy28901</a> <a href=\"https://tmblr.co/mI8WBbwn6zxO97cRsCD0njQ\" target=\"_blank\">@lvnalcvegocd</a> <a href=\"https://tmblr.co/mbioeSfNHd-ImcIozJjbTaQ\" target=\"_blank\">@a-mexican-waffle</a> <a href=\"https://tmblr.co/mwMq4GoQRWpPpa7DHNsm6eg\" target=\"_blank\">@dreamleveille</a> <a href=\"https://tmblr.co/mizdCwUqbcDOZBgjHYvFPMQ\" target=\"_blank\">@ashleykaiba</a> <strike>@midnightadventuressss</strike> <a href=\"https://tmblr.co/m8oUPMm2ZoyGGzJiMAC8sdQ\" target=\"_blank\">@bitchytortilla</a> <a href=\"https://tmblr.co/m8btzV1FORE-vMlUfaTAXzw\" target=\"_blank\">@adozendreams</a> <a href=\"https://tmblr.co/mXkBijdBAGWlQFpxqZdU8Mg\" target=\"_blank\">@catseatursoul</a> <a href=\"https://tmblr.co/mSPPbhiQj3_TpEHHZz5ClJg\" target=\"_blank\">@janettarose</a> <a href=\"https://tmblr.co/m4cStpJAKvUlrz5U3BFYd4g\" target=\"_blank\">@alsogolden-ana</a> <a href=\"https://tmblr.co/mjfKM0h8ciX_6RnO3ibekbQ\" target=\"_blank\">@kirra137</a> <a href=\"https://tmblr.co/mFYbo-mKwmOfVhJIaCZBS2A\" target=\"_blank\">@floralhaze91</a> <a href=\"https://tmblr.co/m6M9bhKYQrTp-ZjO1DTHMeA\" target=\"_blank\">@buckybarnesthedoritoslut</a> <a href=\"https://tmblr.co/mwHhmaEi1vu7jVxUzISKvJQ\" target=\"_blank\">@mindy-franco</a> <strike>@heavenanette</strike> <a href=\"https://tmblr.co/mo-MFXpt1YV2wmNXQw0C9gQ\" target=\"_blank\">@axielle-suson</a> <strike>@caleybree0520</strike> <a href=\"https://tmblr.co/mCIkx8CVmfP0eHxbJNsttqA\" target=\"_blank\">@sassyvetstudent</a> <strike>@geek-girl7</strike> <a href=\"https://tmblr.co/mmaxegdW9_BshQZ4YZE6qmQ\" target=\"_blank\">@mxlisxylmz</a> <a href=\"https://tmblr.co/mkZi27b55xdVXfDUducYc2Q\" target=\"_blank\">@ahirunana</a> <strike>@captainsteverogers-68</strike> <a href=\"https://tmblr.co/m-d8EHQ0swFMQUogI3wW8fw\" target=\"_blank\">@ginevraxrogers</a> <a href=\"https://tmblr.co/mDSiT7BVBDDBQ_y9UHyz6eA\" target=\"_blank\">@can-i-say-something-please</a> <strike>@isabellem20</strike> <a href=\"https://tmblr.co/mp9MmzjDLofAPdb4DCY6eXQ\" target=\"_blank\">@autumnrainwitch</a> <a href=\"https://tmblr.co/muTHRHdrIlaLuGzyl-3FFJg\" target=\"_blank\">@caitlinannbarber</a> <a href=\"https://tmblr.co/mHO6usxooz_JIE3rt7u-nDQ\" target=\"_blank\">@icharleecongrevemultifandomsblog</a> <strike>@evelynpotter-lupin</strike> <a href=\"https://tmblr.co/mhEAwAkx2f7jJ8fC93cLxug\" target=\"_blank\">@peterparke-r</a> <a href=\"https://tmblr.co/muwrtXNHtfwIKjR2YjUnPvA\" target=\"_blank\">@daddyslilchild</a> <strike>@vyrei</strike> <a href=\"https://tmblr.co/m7ncXzCiEGFLmB-CJ3UuIAQ\" target=\"_blank\">@wnygirl2012</a> <strike>@furryexpertstrawberry</strike> <a href=\"https://tmblr.co/mWoI0M4_qDRFw5UzgfzTbnQ\" target=\"_blank\">@lynn14lynn</a> <a href=\"https://tmblr.co/mr0kujOtVBeYazL4lfDd1PQ\" target=\"_blank\">@death-of-the-golden-days</a> <strike>@ms-lady-muffin</strike> <a href=\"https://tmblr.co/m_Vzil6mSHv7P2bTWyXbXQg\" target=\"_blank\">@j-brielmalfoy</a> <a href=\"https://tmblr.co/miwQvJR07bCdb_czfC2S3sA\" target=\"_blank\">@songforhema</a> <a href=\"https://tmblr.co/mYgVaFYgxtoHa4ZbMCqeJ9g\" target=\"_blank\">@grandmastergoldblums</a> <a href=\"https://tmblr.co/mInrRtGoTin8xgA8MXfuXbQ\" target=\"_blank\">@galacticnerd-78</a> <a href=\"https://tmblr.co/m9qddr3aSr9wUNFboktbDhA\" target=\"_blank\">@theawkwardbutterfly</a> <a href=\"https://tmblr.co/m6ewkIG8d-X-9DvRUUykW2A\" target=\"_blank\">@steph-fowlie</a> <a href=\"https://tmblr.co/m5FhLDJWszwLRyShpG4g_uw\" target=\"_blank\">@notearslefttocry218</a> <a href=\"https://tmblr.co/miAxdKYh9Zj9HFc1YC4C8zw\" target=\"_blank\">@iluvmesomemarvelndc</a> <a href=\"https://tmblr.co/m5wjMFwLfx77R74lYRS-2CQ\" target=\"_blank\">@expecto-patronadss</a> <strike>@royarlie</strike> <a href=\"https://tmblr.co/mTxjjVcTuXbHG0JlL_wiANw\" target=\"_blank\">@winterboobear001</a> <a href=\"https://tmblr.co/mfoAy05Uu1ZX_brRI2Rry6g\" target=\"_blank\">@good-or-naughty-girl</a> <a href=\"https://tmblr.co/myVdb0oU4313dqokHARDjlw\" target=\"_blank\">@blog-ilove-thedoctor-forever</a> <a href=\"https://tmblr.co/mQBE9t0d1khSgw3O2jaEc8Q\" target=\"_blank\">@nea90sweetie</a> <a href=\"https://tmblr.co/m6hOGiVqRNm_H5eIc8vnovg\" target=\"_blank\">@dreamingofnovember06</a> <a href=\"https://tmblr.co/mHuAgEv25-y1mf0EhplePjQ\" target=\"_blank\">@theravenclawlover</a> <a href=\"https://tmblr.co/m4QYi0Yga7MBSRVawzYSYaw\" target=\"_blank\">@sleepylunarwolf</a> <a href=\"https://tmblr.co/m0W93SJcXYO5mbGRwFrNlYw\" target=\"_blank\">@awesomeowlbook</a> <a href=\"https://tmblr.co/mePU2aTV0XWpSltO_DOXhNw\" target=\"_blank\">@eponine-xx</a> <a href=\"https://tmblr.co/mpI_LV-93y67mqm1s7uuddw\" target=\"_blank\">@sj-thefan</a> <a href=\"https://tmblr.co/mzW5bQSeGHGhEkZD3tHRetQ\" target=\"_blank\">@beatlezrcool</a> <a href=\"https://tmblr.co/mLGuI0gpFiQ5GJG-iQDFNCQ\" target=\"_blank\">@beardburnsupersoldiers</a> <a href=\"https://tmblr.co/mYEHy3WDiRAm6SxGXQlzmfA\" target=\"_blank\">@infinte-exist-ence</a> <strike>@naffeesaa</strike> <a href=\"https://tmblr.co/mro-WHRELP_tIiDT-xlIGAQ\" target=\"_blank\">@fortunebucket</a> <a href=\"https://tmblr.co/mMZASFYamBJrABB_kFAxBfg\" target=\"_blank\">@0-lost-in-stereo-0</a> <a href=\"https://tmblr.co/mvzer79hy_RPs0Zvjj1FA_g\" target=\"_blank\">@sweetlittlespine</a> <a href=\"https://tmblr.co/m-m8gnaK19IIJXPhubkLlTA\" target=\"_blank\">@w-wolfhxrd</a> <strike>@the-unloved-person @kobraki2096</strike> <a href=\"https://tmblr.co/mV4JTOT4gsP26y_o_getnZw\" target=\"_blank\">@musingpredilection</a> <a href=\"https://tmblr.co/mribE3r9PP1VJCE-Xh8exTg\" target=\"_blank\">@sansastarkjusticewarrior</a> <strike>@miracleowlet</strike> <a href=\"https://tmblr.co/mlmbgczU4CX4dax82Yvayow\" target=\"_blank\">@ceruleanrainblues</a> <a href=\"https://tmblr.co/mLUayxXF1golxrBZi5sPU5g\" target=\"_blank\">@hermionebennet</a> <a href=\"https://tmblr.co/mcJEohcrMZjNvCe2iVCCwGw\" target=\"_blank\">@loserrlauraa</a> <a href=\"https://tmblr.co/mJ6IysNXGI4vQEuc-QNr-jg\" target=\"_blank\">@mrsmoore-313</a> <a href=\"https://tmblr.co/m2sGOmRlq8MwFleb1fFMs7Q\" target=\"_blank\">@dottirose</a> <a href=\"https://tmblr.co/mEaMgjkI01LMNRMiMkrZ70A\" target=\"_blank\">@kpopmademedo-it</a> <a href=\"https://tmblr.co/mRfKiRUssG0OYF3cuvcVmnQ\" target=\"_blank\">@nat-arlett</a> <strike>@kenz12234</strike> <a href=\"https://tmblr.co/mwJEEvVgQPoMVd4UqU_6ovw\" target=\"_blank\">@disneyoncerlover815</a> <a href=\"https://tmblr.co/mBXO_RPZEe51jpypcfcvmtg\" target=\"_blank\">@bookfandomsmatter</a> <a href=\"https://tmblr.co/mL8pDTQNoiDD1qSA5DHsaLg\" target=\"_blank\">@cutie-bug</a></b></p>",
        "body_abstract": "\n<figure data-orig-width=\"500\" data-orig-height=\"290\" data-tumblr-attribution=\"hogwartsayolculuk:2ZYwudlD9oZz6PuJWFleAQ:Z585Sf2HIhIV0\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f2fdaf737987a07f7d467321b0dc819a/tumblr_ojy03w2Oyw1vkt37oo1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"290\"></figure><p><b>Pairing: </b>Bill Weasley x Moody!Reader</p>\n<p><b>Summary:</b>&nbsp;Alastor Moody wasn&rsquo;t a man to back away when someone needed him, so it&rsquo;s really no surprise that his daughter (Y/N) is like that too. So when both Bill and (Y/N) find a house-elf at their&nbsp;door one day, (Y/N) doesn&rsquo;t think twice before apparating away with him.<br></p>\n<p><b>You can find the series masterlist in my bio!</b></p>\n<p><b>Warnings: </b>angst, fighting, grief, torture and just overall a very heavy chapter.</p>\n<p><b>Wordcount: </b>3.65k</p>\n<p><b>A/N: </b>This chapter is pretty intense and plot filled (like pretty much all chapters ahead!)</p>\n<figure data-orig-width=\"1797\" data-orig-height=\"116\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pm5xxw126N1vvelon_540.png\" alt=\"image\" data-orig-width=\"1797\" data-orig-height=\"116\"></figure><h2><i>March 16th, 1998</i></h2>\n<p><i>&ldquo;Dad,&rdquo; you said, giving your father a quizzical look. &ldquo;What&rsquo;s that?&rdquo;</i></p>\n<p><i>Alastor Moody looked down at his daughter from his place at the old mahogany table, his brand new magical glass in his hand. He had just popped it into its brown leather strap and was giving it a quick cautious inspection. You had been watching him the whole time, taking note of every action in the simple process.</i></p>\n<p><i>&ldquo;It&rsquo;s my new eye,&rdquo; Moody said, allowing his daughter to take a proper look at the thing for the first time. You leaned over his knee and peered down at the glass eye in his rough and tattered hand. It looked so small in his wide palm.</i></p>\n<p><i>&ldquo;So you can get rid of the eye patch?&rdquo; you asked, your nose scrunching up at the leather patch covering his left eye. You had hated the thing since you had seen it on him for the first time and kept telling him that he looked like one of those muggle pirates. He gave a rare, slight chuckle at your words.</i></p>\n<p><i>&ldquo;Yes. Happy about that are you?&rdquo; There was a smile on your face as Moody took the eye patch off, revealing the red, scarred skin around the hole where his eye used to be. He saw you flinch at the sight but keep on looking, disgusted intrigue on your face. Moody felt the need to turn away from your innocent eyes but stayed when you raised a hand to the scars running down the left side of his face.</i></p>\n",
        "reblog": {
            "comment": "<p><figure data-orig-width=\"500\" data-orig-height=\"290\" data-tumblr-attribution=\"hogwartsayolculuk:2ZYwudlD9oZz6PuJWFleAQ:Z585Sf2HIhIV0\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f2fdaf737987a07f7d467321b0dc819a/tumblr_ojy03w2Oyw1vkt37oo1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"290\"></figure><p><b>Pairing: </b>Bill Weasley x Moody!Reader</p><p><b>Summary:</b> Alastor Moody wasn’t a man to back away when someone needed him, so it’s really no surprise that his daughter (Y/N) is like that too. So when both Bill and (Y/N) find a house-elf at their door one day, (Y/N) doesn’t think twice before apparating away with him.<br></p><p><b>You can find the series masterlist in my bio!</b></p><p><b>Warnings: </b>angst, fighting, grief, torture and just overall a very heavy chapter.</p><p><b>Wordcount: </b>3.65k</p><p><b>A/N: </b>This chapter is pretty intense and plot filled (like pretty much all chapters ahead!)</p><figure data-orig-width=\"1797\" data-orig-height=\"116\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pm5xxw126N1vvelon_540.png\" alt=\"image\" data-orig-width=\"1797\" data-orig-height=\"116\"></figure><h2><i>March 16th, 1998</i></h2><p><i>“Dad,” you said, giving your father a quizzical look. “What’s that?”</i></p><p><i>Alastor Moody looked down at his daughter from his place at the old mahogany table, his brand new magical glass in his hand. He had just popped it into its brown leather strap and was giving it a quick cautious inspection. You had been watching him the whole time, taking note of every action in the simple process.</i></p><p><i>“It’s my new eye,” Moody said, allowing his daughter to take a proper look at the thing for the first time. You leaned over his knee and peered down at the glass eye in his rough and tattered hand. It looked so small in his wide palm.</i></p><p><i>“So you can get rid of the eye patch?” you asked, your nose scrunching up at the leather patch covering his left eye. You had hated the thing since you had seen it on him for the first time and kept telling him that he looked like one of those muggle pirates. He gave a rare, slight chuckle at your words.</i></p><p><i>“Yes. Happy about that are you?” There was a smile on your face as Moody took the eye patch off, revealing the red, scarred skin around the hole where his eye used to be. He saw you flinch at the sight but keep on looking, disgusted intrigue on your face. Moody felt the need to turn away from your innocent eyes but stayed when you raised a hand to the scars running down the left side of his face.</i></p>[[MORE]]<p><i>“Did a bad man do that, Dad?” Moody picked up a sense of concern in your young features, bringing a smile to his lips. He lifted you up and placed you on his knee like he would always do when explaining something to you.</i></p><p><i>“Yes,” Moody said. “A very bad man. You know that Dad’s job is to put all the bad wizards and witches in jail. But sometimes I can get hurt, and this can happen.” He lifted a finger to point at his eye. “Or this.” </i><i>He pointed to his wooden prosthetic leg and gave it a pat. He watched your eyes glance down from his facial scars and down to the wooden leg. You followed his action in patting it and smiled at the weird part of your father.</i></p><p><i>“That’s cool,” you said, giving it another pat. Moody chuckled and tucked a (h/c) strand of hair behind your ear, one that so resembled your late moth</i><i>er’s.</i></p><p><i>“That’s not the word I would use for it,” Moody said. “but I suppose it could be considered cool.”</i></p><p><i>“Was it the same man that got Mum?”</i></p><p><i>Moody paused, the question taking him by surprise. His heart sat still in his chest at the mention of your mother, and he was grasping for the right words to say. It had been a different death eater than the one that had taken Adeline, yet to him, they were much of the same muchness. Both were the same evil vermin that they had both been pledged to fight against. </i></p><p><i>“No,” he answered slowly. “No, it wasn’t the same man.”</i></p><p><i>“I miss her,” you said, suddenly looking up at his face from your gaze on his wooden leg. You were playing with one of the buttons on his dark grey shirt, your legs swaying around in the air between his leg and the floor.</i></p><p><i>“I miss her too,” Moody said, letting you wrap your arms around his neck. He held you tight as you nestled your face in his neck and against his light brown hair, his hand going up to cup the back of your head. “I miss her too.”</i></p><p><i>He placed a kiss to the side of your head, keeping your body close against him. Letting a silence come over the both of you, he kept a grip on the electric-blue eye in his hand. He’d give both eyes to have his wife back. But more importantly, he’d give his life to make sure you didn’t have to die along with her. </i></p><p>The sunlight streaming in through the window bounced back off the electric-blue glass ball and into your eye, only becoming aware of the painful glint as you awoke from the old memory. You could almost feel the kiss that you father had placed to the side of your head over twenty years ago, the remanents of its comforting nature still imprinted on your skin.</p><p>The sound of Bill’s footsteps coming down the stairs awoke you from your trance, your head turning to look at him. He flashed you the warm smile he always would whenever he saw you, no matter how long had passed since he had last been in your company. This time it had only been several minutes, yet he still made his way over to you and wrapped his arms snuggly around your waist, digging his nose deep into the strands of hair sitting around your ear.</p><p>He placed a kiss to your temple, feeling you lean back against the front of his body. It was one of the comfiest places in the world and you always found yourself coming back to its comfort. </p><p>“I was thinking we might go visit Tonks and Remus today?” Bill said, feeling you turn around to face him in his arms. “See how big her belly’s gotten and tease her about it.”</p><p>You let a laugh slip from your lips, a large smile on your face now beaming. “Pregnancy is a beautiful thing, Bill. Even if it does make you fat.”</p><p>Bill gave a hearty laugh, placing a kiss to your lips. You reached a hand up to ruffle his long, ginger hair, stepping out from his hold around your waist. “I’ll just go get a jacket for both of us and then we can head off.”</p><p>Before you could take a step up the stairs, a loud crack of someone apparating outside came rippling through the cottage. Your eyes immediately flickered over to Bills, ears pricked to pick up the slightest of noises. Within a second, your wand was outstretched in your hand and you stalked your way over to the window. You tugged the thin lace curtain back, peering outside to find the unexpected visitors.</p><p>Out near the edge of the windy cliffs stood three familiar figures. Dobby the house elf who you had met only a handful of times stood in the middle, both hands outstretched and holding the hands of Luna Lovegood and Garrick Ollivander. Both looked injured and weak, bloody cuts all over their bodies and bones protruding out of their undernourished flesh.</p><p>“It’s Dobby with Luna Lovegood and Ollivander,” You said, turning around to look at Bill. You saw a look of confusion come over his face and the wand in his hand drop to his side.</p><p>“The wandmaker?”</p><p>You simply nodded, making your way outside and over towards them. You heard Bill quickly make his way out behind you. Dobby was hurridly making his way over to you, tugging both of them along behind him.</p><p>“(Y/N) Moody!” called the house elf. “Dobby needs to help Harry Potter! Harry Potter told Dobby to bring Luna Lovegood and Mr Ollivander to Shell Cottage!”</p><p>“Where’s Harry?” You said, placing a hand to Luna’s face to check the scar that sat on her cheek. Luna’s silver eyes were still bright despite the physical wounds that littered her body.</p><p>“They’re at Malfoy Manor,” she said in her light voice. Her normally bubbly expression had turned to one of worry. “They’re in trouble.”</p><p>You had your mind made up within a second. You nodded at Luna before looking down at the Small house elf in front of you. “Can you take me there?”</p><p>“Of course,” he responded, his high-voice enthusiastic to get back to Harry’s aid.</p><p>“(Y/N),” Bill said, grabbing hold of your wrist and turning you to face him. “Don’t go leaping into battle. Think this through first.”</p><p>“There’s no time to think this through, Bill!” You said, your (e/c) eyes meeting his blue ones. “There in real trouble. The Malfoys are dark wizards, and as far as I’m concerned, my job is to hunt down dark wizards.”</p><p>Bill sighed, knowing that fighting with you would be no use. When you were set on something like this, there was no changing your mind. “I’m coming with you, then.”</p><p>“No, you can’t,” you said, “you need to look after Luna and Ollivander. I promise I’ll be careful, okay?”</p><p>You knew he was worried for you; he always was whenever you had to do something like this. Though normally, you would have your father or another auror with you. This time, however, you were heading into it alone. All he could do was place a rash kiss to your lips, a hopeful goodbye, and let you leave, hoping with everything he had that you would return all in one piece.</p><p>“You’re too much like your father,” he muttered against your lips before placing another kiss to your forehead. You leant into him one last time before turning away and grabbing Dobby’s hand.</p><p>“I love you,” Bill said, the breeze ruffling his red hair and sending a shiver down his skin. Bill’s face was already pale with worry but he held onto your gaze with apprehension.</p><p>“I love you too.” And with those final words, you watched as Bill, Luna and Garrick Ollivander vanished into a swirl of colour, the dark colours of the Malfoy’s dungeon quickly setting in. Looking around, your eyes met with Harry and Ron’s, a look of relief coming across their face as they took your presence in.</p><p>“(Y/N)?” You heard Harry say, rushing forward and wrapping his arms around your body. You embraced him in the cold and damp dungeon before wrapping your arms around Ron.</p><p>“Tell me what’s going on.” It was then that a blood-curdling scream erupted from outside, unmistakably a female’s. You winced at the sound, knowing full well who’s throat it had escaped from.</p><p>“Bellatrix has Hermione,” Ron said, rage clear in his voice as he said it. You knew it was taking everything he had not to barge up there and into the middle of a room full of Death Eaters.</p><p>“Why are you even here?” You said, looking between the two of them.</p><p>“Snatchers got us,” Harry responded. “We have the sword of Gryffindor, that’s why Bellatrix is torturing Hermione.” He stumbled on the word torturing, his eyes rising to the roof where another scream erupted.</p><p>“The sword is supposed to be in the Lestrange volt,” you said, your grip tightening on your wand in your hand. “Okay, look, we haven’t got time for stories. I’m going to sneak up there. You leave the duelling to me, okay? I have the most experience. You two get Hermione and the sword and make sure you’re ready to apparate back to Shell Cottage with Dobby.”</p><p>You crouched down until you were face-to-face with the house elf. Your authorative tone reminded you so much of the way your father would address the Aurors below him just before a mission would unfold. “Now you make sure you do whatever you can to get them to safety. If I get injured or die, you disappate out of here and get them to Bill. Do you understand me?”</p><p>“Yes, (Y/N) Moody,” Dobby said. “I’ll make sure Harry Potter and his friends are all safe.”</p><p>You nodded at them all, before making your way past them and up the stairs. Your eyes flickered to Peter Pettigrew’s dead body, no emotion arising in you as you looked at it. You stepped quietly on each step, growing closer and closer to Hermione’s screams as you trod. Years of Auror experience had made your footsteps near silent and your breaths almost invisible to detect. Your heartbeat was beating quickly in your chest but your hand never shook, your wand steady and ready to use in your still hand.</p><p>You rounded a corner, ears pricked to pick up any sound that the Malfoys or Bellatrix might make. You were so close now and could see the dark outline of a tall woman with dark, frizzy hair. On the floor just below her was Hermione, bloody and screaming, tears streaking her pale and distraught face. You swallowed in disgust at the way Bellatrix leaned over her, enjoyment in her eyes at seeing the muggleborn in so much pain.</p><p>You raised your wand silently and aimed it straight at Bellatrix’s chest. You were careful not to let it point in Hermione’s direction before shouting, “<i>Expulso!</i>”</p><p>Bellatrix flew back in the air as blue light hit her chest, a stunned expression on her face at the unexpected curse. You watched as all three of the Malfoy’s heads turned to you, their wands now in their hands.</p><p>Before another second had passed, you had disarmed Lucius Malfoy and were working on stunning Narcissa. Draco stood still, his wand pointed at you yet still unwilling to actually use it. You watched in the corner of your eye as Bellatrix stood back up, her curved, walnut wand in her hand.</p><p>Her frenzied eyes locked with yours and as she raised her wand, a wicked smile playing with her features. As furious as she was at the expulsion curse you had shot her way, she almost looked <i>excited</i> that you were there, hardly able to wait to play with the toy that had been delivered right into her hands.</p><p>“Oh, look,” she said in her high and toying voice. “A Moody has come to save the day.”</p><p>You weren’t one to wait for a death eater to finish toying and shot a stunning curse her way. It seemed to do its job in shutting her up before she deflected it with ease, a look of outrage on her face. Her features were glowing red as she looked at you with pure disgust in her eyes.</p><p>“You think you’re a brave one too, huh?” She gasped. “Well don’t you remember what we did to your father? Don’t you remember him falling off that broom that night?”</p><p>Her words sent a rush of loathing through your blood, your already tight grip on your wand tightening. You saw her raise her wand and you jumped out of the way, barely making it out of the red, torturous light in time. “<i>Crucio!</i>”</p><p>It struck the floor beside you, charring the wooden boards that it hit. You raised your mother’s old wand and yelled, “<i>Incendio!</i>”</p><p>Bright flames shot out of your wand and into her direction, licking her skin and singeing her hair. She staggered pack, a burning pain clear on her face and a look of hatred in her eyes. “Don’t you dare talk about my father like that!”</p><p>Bellatrix laughed despite the pain. “Do you know what happened to his body? Of course you wouldn’t, after all, we got to it first… or more like His Dark Lord’s snake did…”</p><p>Her own words must have stuck Bellatrix as hilarious because she let out a large and long cackle, it’s high-pitched sound echoing around the otherwise silent room. The Malfoys were just watching on now, completely engrossed in the teasing and curses being flown back and forth. You caught the figures of Harry and Ron coming around the corner and into the tense room, their eyes immediately settling on both you and Bellatrix staring back and forth before flickering down to Hermione behind you. Ron instantly made his way over to her and helped her to her feet, Ron taking most of the effort in walking her back over to Harry.</p><p>“You’re another dead Moody, you know that?” She finally said, set on finishing you rather than wasting another minute of her time toying. “There won’t be any more of your filthy half-blood family left to hunt us down.”</p><p>You deflected the stunning shell she shot your way and quickly followed it up with an expulsion charm. She stumbled back, more vicious intent coming into her features as her eyes narrowed on you. “I watched that snake eat him whole,” she screeched, “And I’ll watch it eat you too.”</p><p>“Shut up!” You couldn’t take the taunting about your father anymore, it was opening up to many painful doors you thought you had closed. But she kept going, firing another fiery spell your way as she did do.</p><p>“There was barely enough left of him before the snake got to him! The fall broke his body, oh…” She let a high, intake of breath part her words. “I wish you had been there to watch.”</p><p>You were almost set on dropping your wand and jumping on her, switching to the muggle way of solving fights. But Dobby’s high, anxious voice filled the room. “(Y/N) Moody, we must leave now!”</p><p>“Just a second, Dobby,” you said, taking a large intake of breath to clear your mind. “Just another second.”</p><p>You shot a red curse her way, watching her as she deflected it with a silver shield charm. There were flashes of different coloured lights, blue, red and green as curses were shot back and forth, some deflected and some just missing its target. Bellatrix’s cutting curse struck your arm, sending sharp pains throughout your arm as small but deep cuts sprang up all over your arm. There was blood everywhere, soaking your clothes and dripping to the floor, but you kept your wand pointed at her and fired a successful burning curse her way.</p><p>“Now, (Y/N) Moody!” You heard Dobby scream again, his hand interlocked with both Harry and Ron’s, Hermione struggling to stand up straight against the tall redhead. With a last look at Bellatrix Lestrange, you cast the most havoc-causing curse you could think of.</p><p>“<i>Confringo!</i>”</p><p>Fiery Orange light escaped your wand and hit the ground where Bellatrix stood. The ground erupted, sending her flying back and into the wall behind her. While she was out you hurried back and grabbed Harry’s hand, Dobby instantly moving to diapparate all five of you out of the now rubble filled house.</p><p>It was only as the room turned into a swirl of colour that you noticed the little knife that Bellatrix pulled from her side, and the malice look on her face as she threw into the disapparating form of the five of you. Blood trickled down her smiling lips as she realised it disapparated along with you, hoping with everything that she had that it would find it’s way into one of your flesh and bones.</p><figure data-orig-width=\"1797\" data-orig-height=\"116\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pn562leHt81vvelon_540.png\" alt=\"image\" data-orig-width=\"1797\" data-orig-height=\"116\"></figure><p>The crack of your apparating forms rippled through Shell Cottage, turning the heads of the three people that sat inside. Bill was immediately on his feet and running full pelt out the front door, frantic for his eyes to lay on you once again. He paused, feeling like his heart was beating in his throat, closing up his airways and leaving him struggling for breath. And then his eyes met yours, standing a few feet from Harry before he watched your knees hit the ground.</p><p>He hadn’t even noticed he had started running towards you before he was on the ground next to you, looking over your body for any indication of injury. Your arm was coated in blood, the scars left by a cutting curse littering the skin of your arm. There was a little cut on your chin, but otherwise, you were physically fine. But for whatever reason, you were shaking uncontrollably in Bill’s arms.</p><p>You couldn’t speak. You had finally let go of all the emotions that Bellatrix’s words had let loose. You knew you wouldn’t be able to fight if you had let them rip and claw at you there, but the holding in had done its own damage. Each breath that came out of your chest was sharp and jagged. You knew you should feel the pain of all the cuts on your arm but you were completely numb to any pain at all. All you could picture was the image of Nagini striking the broken corpse of your father over and over again.</p><p>You hadn’t noticed that you were gripping the inside edge of Bill’s green jacket, the skin on your hands turning white from the pressure it held it with. You barely noticed the screams and whimpers that were coming out of your mouth or the tears that had blurred your vision of the panicked man crouched in front of you.</p><p>“(Y/N)…” he said, but you couldn’t hear him. You scarcely noticed his lips moving. “What happened?”</p><p>All you could do was lean into him, feeling his arms immediately moving to wrap around your neck and chest and bring you deeper into him. The wind whipped both of your hair into each other’s faces, your cries rippling through your body and into his.</p><p>You were only able to mutter one word over and over until it was the only thing your lips seemed to be able to mumble. And that was what kept Bill’s heart thumping a hundred miles per hour in his chest. Your voice was strained and weak with every cry of ‘dad’ that escaped your lips.</p><p>It was like that night all over again. All Bill could do was hold you against him on the damp floor of Shell Cottage while everything else but you and your cries faded out of existence in his mind. You held onto him like he was the only thing keeping you alive at that moment, the sound of Bellatrix’s cackling laugh echoing in your head as she stood over your Father’s broken and battered body. And then the Snake would close in on it, amusement seeping deeper and deeper into Bellatrix’s features.</p><p>And Bill was the only way to hold onto reality. Without him holding you, the snake would engulf you whole along with your father’s damaged and dead body.</p><figure data-orig-width=\"1797\" data-orig-height=\"116\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pn5py27gDa1vvelon_540.png\" alt=\"image\" data-orig-width=\"1797\" data-orig-height=\"116\"></figure><p><b>I was on edge while writing this part. There were so many times where I was so close to crying because of the intensity of it. What did you guys think? Let me know!</b><br></p><p><b>If you would like to be added to the <i>After All This</i> taglist, feel free to let me know in my inbox.</b></p><p><b>Alpha tags: <a href=\"https://tmblr.co/m73TQMXCYLh_u_pJQ4Et1dg\" target=\"_blank\">@xinyourdreamsx</a> <a href=\"https://tmblr.co/mi5eOnbwfVzOiE4wbNfzu3Q\" target=\"_blank\">@marvelismylifffe</a> <a href=\"https://tmblr.co/mr3VRIRbro_sJhvbvL9u3RA\" target=\"_blank\">@xxerwin4laypxx</a> <a href=\"https://tmblr.co/mocETYjePDJXUoOmGbkYo3w\" target=\"_blank\">@xxsophie-raabxx</a> <a href=\"https://tmblr.co/mQa6ErL69of6i0TU-LnRQEw\" target=\"_blank\">@yeeterbenjaminparker</a> <a href=\"https://tmblr.co/mKNM8vKfkEVZvNYCte3UfiA\" target=\"_blank\">@bitchinghourss</a> <a href=\"https://tmblr.co/mb1lTa35TLVbsXxf0QMb7VQ\" target=\"_blank\">@sly-vixen-up2nogood</a></b></p><p><b>Beta Tags: <a href=\"https://tmblr.co/mB4j56voIF2I69XIuQoiLPA\" target=\"_blank\">@winchestergirl907</a> <a href=\"https://tmblr.co/mLXVADHSkhhwBGp3Kpu1lPg\" target=\"_blank\">@anormalgirlsthoughts</a> <strike>@moondust-and-stardust</strike> <a href=\"https://tmblr.co/mlSK91hmOns538b7Sor2hfw\" target=\"_blank\">@otherthingsinhead</a> <a href=\"https://tmblr.co/m1BFZcp2MYaPXvBgCXc4L1g\" target=\"_blank\">@kaetastic</a> <a href=\"https://tmblr.co/mbdWxiadSNPZAGOpzfQZddg\" target=\"_blank\">@themeanestlittlewitch</a> <a href=\"https://tmblr.co/mxAxPqSleV7sg8uJgRkRZOw\" target=\"_blank\">@pixierox101</a> <a href=\"https://tmblr.co/mwJIvhPrkBRq9TNC1vgFJHw\" target=\"_blank\">@semicharmedkindofali</a> <strike>@struggleofyesterday</strike> <a href=\"https://tmblr.co/mbsWik7rGQu0GDhkCK_-SyQ\" target=\"_blank\">@lazydiabetic</a> <a href=\"https://tmblr.co/mbmBgTO_AW9isWmJjueFyRg\" target=\"_blank\">@supermassiveblackhope</a> <strike>@thelders</strike> <a href=\"https://tmblr.co/mWtDegeTaHyAQBBY4oDG0eg\" target=\"_blank\">@firekissedwitchbitch</a> <a href=\"https://tmblr.co/mFVvkWtH-JTm66sW1s_Ks9g\" target=\"_blank\">@thatwrestlingfan91</a> <a href=\"https://tmblr.co/mJptKxWsYQX_jjBo7zUJytA\" target=\"_blank\">@wonderwoman292</a> <strike>@ohleahdarling</strike> <a href=\"https://tmblr.co/mYPV6Ohi0Tdx2QFwPQttMow\" target=\"_blank\">@ffantasylandd</a> <a href=\"https://tmblr.co/mOnYi_Nin-rHinxMsiK45wA\" target=\"_blank\">@fallatyourfeet</a> <a href=\"https://tmblr.co/mx2whzivJYMAZB5LLTqRhFA\" target=\"_blank\">@riverdaleserpent-hoe</a> <a href=\"https://tmblr.co/mJDSQLS5O4jEIsJPd4UpGoQ\" target=\"_blank\">@firstworldproblemthings</a> <a href=\"https://tmblr.co/mSnTWCmjnS-bS7Fbhpj3rag\" target=\"_blank\">@wandressfox</a> <strike>@abbssssssssssss</strike> <a href=\"https://tmblr.co/mRP1wmaE1GmYFNTl-F6sE9g\" target=\"_blank\">@izzy28901</a> <a href=\"https://tmblr.co/mI8WBbwn6zxO97cRsCD0njQ\" target=\"_blank\">@lvnalcvegocd</a> <a href=\"https://tmblr.co/mbioeSfNHd-ImcIozJjbTaQ\" target=\"_blank\">@a-mexican-waffle</a> <a href=\"https://tmblr.co/mwMq4GoQRWpPpa7DHNsm6eg\" target=\"_blank\">@dreamleveille</a> <a href=\"https://tmblr.co/mizdCwUqbcDOZBgjHYvFPMQ\" target=\"_blank\">@ashleykaiba</a> <strike>@midnightadventuressss</strike> <a href=\"https://tmblr.co/m8oUPMm2ZoyGGzJiMAC8sdQ\" target=\"_blank\">@bitchytortilla</a> <a href=\"https://tmblr.co/m8btzV1FORE-vMlUfaTAXzw\" target=\"_blank\">@adozendreams</a> <a href=\"https://tmblr.co/mXkBijdBAGWlQFpxqZdU8Mg\" target=\"_blank\">@catseatursoul</a> <a href=\"https://tmblr.co/mSPPbhiQj3_TpEHHZz5ClJg\" target=\"_blank\">@janettarose</a> <a href=\"https://tmblr.co/m4cStpJAKvUlrz5U3BFYd4g\" target=\"_blank\">@alsogolden-ana</a> <a href=\"https://tmblr.co/mjfKM0h8ciX_6RnO3ibekbQ\" target=\"_blank\">@kirra137</a> <a href=\"https://tmblr.co/mFYbo-mKwmOfVhJIaCZBS2A\" target=\"_blank\">@floralhaze91</a> <a href=\"https://tmblr.co/m6M9bhKYQrTp-ZjO1DTHMeA\" target=\"_blank\">@buckybarnesthedoritoslut</a> <a href=\"https://tmblr.co/mwHhmaEi1vu7jVxUzISKvJQ\" target=\"_blank\">@mindy-franco</a> <strike>@heavenanette</strike> <a href=\"https://tmblr.co/mo-MFXpt1YV2wmNXQw0C9gQ\" target=\"_blank\">@axielle-suson</a> <strike>@caleybree0520</strike> <a href=\"https://tmblr.co/mCIkx8CVmfP0eHxbJNsttqA\" target=\"_blank\">@sassyvetstudent</a> <strike>@geek-girl7</strike> <a href=\"https://tmblr.co/mmaxegdW9_BshQZ4YZE6qmQ\" target=\"_blank\">@mxlisxylmz</a> <a href=\"https://tmblr.co/mkZi27b55xdVXfDUducYc2Q\" target=\"_blank\">@ahirunana</a> <strike>@captainsteverogers-68</strike> <a href=\"https://tmblr.co/m-d8EHQ0swFMQUogI3wW8fw\" target=\"_blank\">@ginevraxrogers</a> <a href=\"https://tmblr.co/mDSiT7BVBDDBQ_y9UHyz6eA\" target=\"_blank\">@can-i-say-something-please</a> <strike>@isabellem20</strike> <a href=\"https://tmblr.co/mp9MmzjDLofAPdb4DCY6eXQ\" target=\"_blank\">@autumnrainwitch</a> <a href=\"https://tmblr.co/muTHRHdrIlaLuGzyl-3FFJg\" target=\"_blank\">@caitlinannbarber</a> <a href=\"https://tmblr.co/mHO6usxooz_JIE3rt7u-nDQ\" target=\"_blank\">@icharleecongrevemultifandomsblog</a> <strike>@evelynpotter-lupin</strike> <a href=\"https://tmblr.co/mhEAwAkx2f7jJ8fC93cLxug\" target=\"_blank\">@peterparke-r</a> <a href=\"https://tmblr.co/muwrtXNHtfwIKjR2YjUnPvA\" target=\"_blank\">@daddyslilchild</a> <strike>@vyrei</strike> <a href=\"https://tmblr.co/m7ncXzCiEGFLmB-CJ3UuIAQ\" target=\"_blank\">@wnygirl2012</a> <strike>@furryexpertstrawberry</strike> <a href=\"https://tmblr.co/mWoI0M4_qDRFw5UzgfzTbnQ\" target=\"_blank\">@lynn14lynn</a> <a href=\"https://tmblr.co/mr0kujOtVBeYazL4lfDd1PQ\" target=\"_blank\">@death-of-the-golden-days</a> <strike>@ms-lady-muffin</strike> <a href=\"https://tmblr.co/m_Vzil6mSHv7P2bTWyXbXQg\" target=\"_blank\">@j-brielmalfoy</a> <a href=\"https://tmblr.co/miwQvJR07bCdb_czfC2S3sA\" target=\"_blank\">@songforhema</a> <a href=\"https://tmblr.co/mYgVaFYgxtoHa4ZbMCqeJ9g\" target=\"_blank\">@grandmastergoldblums</a> <a href=\"https://tmblr.co/mInrRtGoTin8xgA8MXfuXbQ\" target=\"_blank\">@galacticnerd-78</a> <a href=\"https://tmblr.co/m9qddr3aSr9wUNFboktbDhA\" target=\"_blank\">@theawkwardbutterfly</a> <a href=\"https://tmblr.co/m6ewkIG8d-X-9DvRUUykW2A\" target=\"_blank\">@steph-fowlie</a> <a href=\"https://tmblr.co/m5FhLDJWszwLRyShpG4g_uw\" target=\"_blank\">@notearslefttocry218</a> <a href=\"https://tmblr.co/miAxdKYh9Zj9HFc1YC4C8zw\" target=\"_blank\">@iluvmesomemarvelndc</a> <a href=\"https://tmblr.co/m5wjMFwLfx77R74lYRS-2CQ\" target=\"_blank\">@expecto-patronadss</a> <strike>@royarlie</strike> <a href=\"https://tmblr.co/mTxjjVcTuXbHG0JlL_wiANw\" target=\"_blank\">@winterboobear001</a> <a href=\"https://tmblr.co/mfoAy05Uu1ZX_brRI2Rry6g\" target=\"_blank\">@good-or-naughty-girl</a> <a href=\"https://tmblr.co/myVdb0oU4313dqokHARDjlw\" target=\"_blank\">@blog-ilove-thedoctor-forever</a> <a href=\"https://tmblr.co/mQBE9t0d1khSgw3O2jaEc8Q\" target=\"_blank\">@nea90sweetie</a> <a href=\"https://tmblr.co/m6hOGiVqRNm_H5eIc8vnovg\" target=\"_blank\">@dreamingofnovember06</a> <a href=\"https://tmblr.co/mHuAgEv25-y1mf0EhplePjQ\" target=\"_blank\">@theravenclawlover</a> <a href=\"https://tmblr.co/m4QYi0Yga7MBSRVawzYSYaw\" target=\"_blank\">@sleepylunarwolf</a> <a href=\"https://tmblr.co/m0W93SJcXYO5mbGRwFrNlYw\" target=\"_blank\">@awesomeowlbook</a> <a href=\"https://tmblr.co/mePU2aTV0XWpSltO_DOXhNw\" target=\"_blank\">@eponine-xx</a> <a href=\"https://tmblr.co/mpI_LV-93y67mqm1s7uuddw\" target=\"_blank\">@sj-thefan</a> <a href=\"https://tmblr.co/mzW5bQSeGHGhEkZD3tHRetQ\" target=\"_blank\">@beatlezrcool</a> <a href=\"https://tmblr.co/mLGuI0gpFiQ5GJG-iQDFNCQ\" target=\"_blank\">@beardburnsupersoldiers</a> <a href=\"https://tmblr.co/mYEHy3WDiRAm6SxGXQlzmfA\" target=\"_blank\">@infinte-exist-ence</a> <strike>@naffeesaa</strike> <a href=\"https://tmblr.co/mro-WHRELP_tIiDT-xlIGAQ\" target=\"_blank\">@fortunebucket</a> <a href=\"https://tmblr.co/mMZASFYamBJrABB_kFAxBfg\" target=\"_blank\">@0-lost-in-stereo-0</a> <a href=\"https://tmblr.co/mvzer79hy_RPs0Zvjj1FA_g\" target=\"_blank\">@sweetlittlespine</a> <a href=\"https://tmblr.co/m-m8gnaK19IIJXPhubkLlTA\" target=\"_blank\">@w-wolfhxrd</a> <strike>@the-unloved-person @kobraki2096</strike> <a href=\"https://tmblr.co/mV4JTOT4gsP26y_o_getnZw\" target=\"_blank\">@musingpredilection</a> <a href=\"https://tmblr.co/mribE3r9PP1VJCE-Xh8exTg\" target=\"_blank\">@sansastarkjusticewarrior</a> <strike>@miracleowlet</strike> <a href=\"https://tmblr.co/mlmbgczU4CX4dax82Yvayow\" target=\"_blank\">@ceruleanrainblues</a> <a href=\"https://tmblr.co/mLUayxXF1golxrBZi5sPU5g\" target=\"_blank\">@hermionebennet</a> <a href=\"https://tmblr.co/mcJEohcrMZjNvCe2iVCCwGw\" target=\"_blank\">@loserrlauraa</a> <a href=\"https://tmblr.co/mJ6IysNXGI4vQEuc-QNr-jg\" target=\"_blank\">@mrsmoore-313</a> <a href=\"https://tmblr.co/m2sGOmRlq8MwFleb1fFMs7Q\" target=\"_blank\">@dottirose</a> <a href=\"https://tmblr.co/mEaMgjkI01LMNRMiMkrZ70A\" target=\"_blank\">@kpopmademedo-it</a> <a href=\"https://tmblr.co/mRfKiRUssG0OYF3cuvcVmnQ\" target=\"_blank\">@nat-arlett</a> <strike>@kenz12234</strike> <a href=\"https://tmblr.co/mwJEEvVgQPoMVd4UqU_6ovw\" target=\"_blank\">@disneyoncerlover815</a> <a href=\"https://tmblr.co/mBXO_RPZEe51jpypcfcvmtg\" target=\"_blank\">@bookfandomsmatter</a> <a href=\"https://tmblr.co/mL8pDTQNoiDD1qSA5DHsaLg\" target=\"_blank\">@cutie-bug</a></b></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "tessimagines",
                    "active": true,
                    "theme": {
                        "header_full_width": 576,
                        "header_full_height": 426,
                        "header_focus_width": 576,
                        "header_focus_height": 323,
                        "avatar_shape": "circle",
                        "background_color": "#e5d5b6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "51,576,374,0",
                        "header_image": "https://static.tumblr.com/0df90528caf82adcddd498f8c4eea9b6/7wc5llr/p0apfwhli/tumblr_static_aknlbrag5yosgw8c4kg4so8wk.jpg",
                        "header_image_focused": "https://static.tumblr.com/0df90528caf82adcddd498f8c4eea9b6/7wc5llr/2Mwpfwhlj/tumblr_static_tumblr_static_aknlbrag5yosgw8c4kg4so8wk_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/0df90528caf82adcddd498f8c4eea9b6/7wc5llr/p0apfwhli/tumblr_static_aknlbrag5yosgw8c4kg4so8wk_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#f8f5ed",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ffffff",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182999142641"
                },
                "content_raw": "<p><figure data-orig-width=\"500\" data-orig-height=\"290\" data-tumblr-attribution=\"hogwartsayolculuk:2ZYwudlD9oZz6PuJWFleAQ:Z585Sf2HIhIV0\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f2fdaf737987a07f7d467321b0dc819a/tumblr_ojy03w2Oyw1vkt37oo1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"290\"></figure><p><b>Pairing: </b>Bill Weasley x Moody!Reader</p><p><b>Summary:</b> Alastor Moody wasn’t a man to back away when someone needed him, so it’s really no surprise that his daughter (Y/N) is like that too. So when both Bill and (Y/N) find a house-elf at their door one day, (Y/N) doesn’t think twice before apparating away with him.<br></p><p><b>You can find the series masterlist in my bio!</b></p><p><b>Warnings: </b>angst, fighting, grief, torture and just overall a very heavy chapter.</p><p><b>Wordcount: </b>3.65k</p><p><b>A/N: </b>This chapter is pretty intense and plot filled (like pretty much all chapters ahead!)</p><figure data-orig-width=\"1797\" data-orig-height=\"116\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pm5xxw126N1vvelon_540.png\" alt=\"image\" data-orig-width=\"1797\" data-orig-height=\"116\"></figure><h2><i>March 16th, 1998</i></h2><p><i>“Dad,” you said, giving your father a quizzical look. “What’s that?”</i></p><p><i>Alastor Moody looked down at his daughter from his place at the old mahogany table, his brand new magical glass in his hand. He had just popped it into its brown leather strap and was giving it a quick cautious inspection. You had been watching him the whole time, taking note of every action in the simple process.</i></p><p><i>“It’s my new eye,” Moody said, allowing his daughter to take a proper look at the thing for the first time. You leaned over his knee and peered down at the glass eye in his rough and tattered hand. It looked so small in his wide palm.</i></p><p><i>“So you can get rid of the eye patch?” you asked, your nose scrunching up at the leather patch covering his left eye. You had hated the thing since you had seen it on him for the first time and kept telling him that he looked like one of those muggle pirates. He gave a rare, slight chuckle at your words.</i></p><p><i>“Yes. Happy about that are you?” There was a smile on your face as Moody took the eye patch off, revealing the red, scarred skin around the hole where his eye used to be. He saw you flinch at the sight but keep on looking, disgusted intrigue on your face. Moody felt the need to turn away from your innocent eyes but stayed when you raised a hand to the scars running down the left side of his face.</i></p>[[MORE]]<p><i>“Did a bad man do that, Dad?” Moody picked up a sense of concern in your young features, bringing a smile to his lips. He lifted you up and placed you on his knee like he would always do when explaining something to you.</i></p><p><i>“Yes,” Moody said. “A very bad man. You know that Dad’s job is to put all the bad wizards and witches in jail. But sometimes I can get hurt, and this can happen.” He lifted a finger to point at his eye. “Or this.” </i><i>He pointed to his wooden prosthetic leg and gave it a pat. He watched your eyes glance down from his facial scars and down to the wooden leg. You followed his action in patting it and smiled at the weird part of your father.</i></p><p><i>“That’s cool,” you said, giving it another pat. Moody chuckled and tucked a (h/c) strand of hair behind your ear, one that so resembled your late moth</i><i>er’s.</i></p><p><i>“That’s not the word I would use for it,” Moody said. “but I suppose it could be considered cool.”</i></p><p><i>“Was it the same man that got Mum?”</i></p><p><i>Moody paused, the question taking him by surprise. His heart sat still in his chest at the mention of your mother, and he was grasping for the right words to say. It had been a different death eater than the one that had taken Adeline, yet to him, they were much of the same muchness. Both were the same evil vermin that they had both been pledged to fight against. </i></p><p><i>“No,” he answered slowly. “No, it wasn’t the same man.”</i></p><p><i>“I miss her,” you said, suddenly looking up at his face from your gaze on his wooden leg. You were playing with one of the buttons on his dark grey shirt, your legs swaying around in the air between his leg and the floor.</i></p><p><i>“I miss her too,” Moody said, letting you wrap your arms around his neck. He held you tight as you nestled your face in his neck and against his light brown hair, his hand going up to cup the back of your head. “I miss her too.”</i></p><p><i>He placed a kiss to the side of your head, keeping your body close against him. Letting a silence come over the both of you, he kept a grip on the electric-blue eye in his hand. He’d give both eyes to have his wife back. But more importantly, he’d give his life to make sure you didn’t have to die along with her. </i></p><p>The sunlight streaming in through the window bounced back off the electric-blue glass ball and into your eye, only becoming aware of the painful glint as you awoke from the old memory. You could almost feel the kiss that you father had placed to the side of your head over twenty years ago, the remanents of its comforting nature still imprinted on your skin.</p><p>The sound of Bill’s footsteps coming down the stairs awoke you from your trance, your head turning to look at him. He flashed you the warm smile he always would whenever he saw you, no matter how long had passed since he had last been in your company. This time it had only been several minutes, yet he still made his way over to you and wrapped his arms snuggly around your waist, digging his nose deep into the strands of hair sitting around your ear.</p><p>He placed a kiss to your temple, feeling you lean back against the front of his body. It was one of the comfiest places in the world and you always found yourself coming back to its comfort. </p><p>“I was thinking we might go visit Tonks and Remus today?” Bill said, feeling you turn around to face him in his arms. “See how big her belly’s gotten and tease her about it.”</p><p>You let a laugh slip from your lips, a large smile on your face now beaming. “Pregnancy is a beautiful thing, Bill. Even if it does make you fat.”</p><p>Bill gave a hearty laugh, placing a kiss to your lips. You reached a hand up to ruffle his long, ginger hair, stepping out from his hold around your waist. “I’ll just go get a jacket for both of us and then we can head off.”</p><p>Before you could take a step up the stairs, a loud crack of someone apparating outside came rippling through the cottage. Your eyes immediately flickered over to Bills, ears pricked to pick up the slightest of noises. Within a second, your wand was outstretched in your hand and you stalked your way over to the window. You tugged the thin lace curtain back, peering outside to find the unexpected visitors.</p><p>Out near the edge of the windy cliffs stood three familiar figures. Dobby the house elf who you had met only a handful of times stood in the middle, both hands outstretched and holding the hands of Luna Lovegood and Garrick Ollivander. Both looked injured and weak, bloody cuts all over their bodies and bones protruding out of their undernourished flesh.</p><p>“It’s Dobby with Luna Lovegood and Ollivander,” You said, turning around to look at Bill. You saw a look of confusion come over his face and the wand in his hand drop to his side.</p><p>“The wandmaker?”</p><p>You simply nodded, making your way outside and over towards them. You heard Bill quickly make his way out behind you. Dobby was hurridly making his way over to you, tugging both of them along behind him.</p><p>“(Y/N) Moody!” called the house elf. “Dobby needs to help Harry Potter! Harry Potter told Dobby to bring Luna Lovegood and Mr Ollivander to Shell Cottage!”</p><p>“Where’s Harry?” You said, placing a hand to Luna’s face to check the scar that sat on her cheek. Luna’s silver eyes were still bright despite the physical wounds that littered her body.</p><p>“They’re at Malfoy Manor,” she said in her light voice. Her normally bubbly expression had turned to one of worry. “They’re in trouble.”</p><p>You had your mind made up within a second. You nodded at Luna before looking down at the Small house elf in front of you. “Can you take me there?”</p><p>“Of course,” he responded, his high-voice enthusiastic to get back to Harry’s aid.</p><p>“(Y/N),” Bill said, grabbing hold of your wrist and turning you to face him. “Don’t go leaping into battle. Think this through first.”</p><p>“There’s no time to think this through, Bill!” You said, your (e/c) eyes meeting his blue ones. “There in real trouble. The Malfoys are dark wizards, and as far as I’m concerned, my job is to hunt down dark wizards.”</p><p>Bill sighed, knowing that fighting with you would be no use. When you were set on something like this, there was no changing your mind. “I’m coming with you, then.”</p><p>“No, you can’t,” you said, “you need to look after Luna and Ollivander. I promise I’ll be careful, okay?”</p><p>You knew he was worried for you; he always was whenever you had to do something like this. Though normally, you would have your father or another auror with you. This time, however, you were heading into it alone. All he could do was place a rash kiss to your lips, a hopeful goodbye, and let you leave, hoping with everything he had that you would return all in one piece.</p><p>“You’re too much like your father,” he muttered against your lips before placing another kiss to your forehead. You leant into him one last time before turning away and grabbing Dobby’s hand.</p><p>“I love you,” Bill said, the breeze ruffling his red hair and sending a shiver down his skin. Bill’s face was already pale with worry but he held onto your gaze with apprehension.</p><p>“I love you too.” And with those final words, you watched as Bill, Luna and Garrick Ollivander vanished into a swirl of colour, the dark colours of the Malfoy’s dungeon quickly setting in. Looking around, your eyes met with Harry and Ron’s, a look of relief coming across their face as they took your presence in.</p><p>“(Y/N)?” You heard Harry say, rushing forward and wrapping his arms around your body. You embraced him in the cold and damp dungeon before wrapping your arms around Ron.</p><p>“Tell me what’s going on.” It was then that a blood-curdling scream erupted from outside, unmistakably a female’s. You winced at the sound, knowing full well who’s throat it had escaped from.</p><p>“Bellatrix has Hermione,” Ron said, rage clear in his voice as he said it. You knew it was taking everything he had not to barge up there and into the middle of a room full of Death Eaters.</p><p>“Why are you even here?” You said, looking between the two of them.</p><p>“Snatchers got us,” Harry responded. “We have the sword of Gryffindor, that’s why Bellatrix is torturing Hermione.” He stumbled on the word torturing, his eyes rising to the roof where another scream erupted.</p><p>“The sword is supposed to be in the Lestrange volt,” you said, your grip tightening on your wand in your hand. “Okay, look, we haven’t got time for stories. I’m going to sneak up there. You leave the duelling to me, okay? I have the most experience. You two get Hermione and the sword and make sure you’re ready to apparate back to Shell Cottage with Dobby.”</p><p>You crouched down until you were face-to-face with the house elf. Your authorative tone reminded you so much of the way your father would address the Aurors below him just before a mission would unfold. “Now you make sure you do whatever you can to get them to safety. If I get injured or die, you disappate out of here and get them to Bill. Do you understand me?”</p><p>“Yes, (Y/N) Moody,” Dobby said. “I’ll make sure Harry Potter and his friends are all safe.”</p><p>You nodded at them all, before making your way past them and up the stairs. Your eyes flickered to Peter Pettigrew’s dead body, no emotion arising in you as you looked at it. You stepped quietly on each step, growing closer and closer to Hermione’s screams as you trod. Years of Auror experience had made your footsteps near silent and your breaths almost invisible to detect. Your heartbeat was beating quickly in your chest but your hand never shook, your wand steady and ready to use in your still hand.</p><p>You rounded a corner, ears pricked to pick up any sound that the Malfoys or Bellatrix might make. You were so close now and could see the dark outline of a tall woman with dark, frizzy hair. On the floor just below her was Hermione, bloody and screaming, tears streaking her pale and distraught face. You swallowed in disgust at the way Bellatrix leaned over her, enjoyment in her eyes at seeing the muggleborn in so much pain.</p><p>You raised your wand silently and aimed it straight at Bellatrix’s chest. You were careful not to let it point in Hermione’s direction before shouting, “<i>Expulso!</i>”</p><p>Bellatrix flew back in the air as blue light hit her chest, a stunned expression on her face at the unexpected curse. You watched as all three of the Malfoy’s heads turned to you, their wands now in their hands.</p><p>Before another second had passed, you had disarmed Lucius Malfoy and were working on stunning Narcissa. Draco stood still, his wand pointed at you yet still unwilling to actually use it. You watched in the corner of your eye as Bellatrix stood back up, her curved, walnut wand in her hand.</p><p>Her frenzied eyes locked with yours and as she raised her wand, a wicked smile playing with her features. As furious as she was at the expulsion curse you had shot her way, she almost looked <i>excited</i> that you were there, hardly able to wait to play with the toy that had been delivered right into her hands.</p><p>“Oh, look,” she said in her high and toying voice. “A Moody has come to save the day.”</p><p>You weren’t one to wait for a death eater to finish toying and shot a stunning curse her way. It seemed to do its job in shutting her up before she deflected it with ease, a look of outrage on her face. Her features were glowing red as she looked at you with pure disgust in her eyes.</p><p>“You think you’re a brave one too, huh?” She gasped. “Well don’t you remember what we did to your father? Don’t you remember him falling off that broom that night?”</p><p>Her words sent a rush of loathing through your blood, your already tight grip on your wand tightening. You saw her raise her wand and you jumped out of the way, barely making it out of the red, torturous light in time. “<i>Crucio!</i>”</p><p>It struck the floor beside you, charring the wooden boards that it hit. You raised your mother’s old wand and yelled, “<i>Incendio!</i>”</p><p>Bright flames shot out of your wand and into her direction, licking her skin and singeing her hair. She staggered pack, a burning pain clear on her face and a look of hatred in her eyes. “Don’t you dare talk about my father like that!”</p><p>Bellatrix laughed despite the pain. “Do you know what happened to his body? Of course you wouldn’t, after all, we got to it first… or more like His Dark Lord’s snake did…”</p><p>Her own words must have stuck Bellatrix as hilarious because she let out a large and long cackle, it’s high-pitched sound echoing around the otherwise silent room. The Malfoys were just watching on now, completely engrossed in the teasing and curses being flown back and forth. You caught the figures of Harry and Ron coming around the corner and into the tense room, their eyes immediately settling on both you and Bellatrix staring back and forth before flickering down to Hermione behind you. Ron instantly made his way over to her and helped her to her feet, Ron taking most of the effort in walking her back over to Harry.</p><p>“You’re another dead Moody, you know that?” She finally said, set on finishing you rather than wasting another minute of her time toying. “There won’t be any more of your filthy half-blood family left to hunt us down.”</p><p>You deflected the stunning shell she shot your way and quickly followed it up with an expulsion charm. She stumbled back, more vicious intent coming into her features as her eyes narrowed on you. “I watched that snake eat him whole,” she screeched, “And I’ll watch it eat you too.”</p><p>“Shut up!” You couldn’t take the taunting about your father anymore, it was opening up to many painful doors you thought you had closed. But she kept going, firing another fiery spell your way as she did do.</p><p>“There was barely enough left of him before the snake got to him! The fall broke his body, oh…” She let a high, intake of breath part her words. “I wish you had been there to watch.”</p><p>You were almost set on dropping your wand and jumping on her, switching to the muggle way of solving fights. But Dobby’s high, anxious voice filled the room. “(Y/N) Moody, we must leave now!”</p><p>“Just a second, Dobby,” you said, taking a large intake of breath to clear your mind. “Just another second.”</p><p>You shot a red curse her way, watching her as she deflected it with a silver shield charm. There were flashes of different coloured lights, blue, red and green as curses were shot back and forth, some deflected and some just missing its target. Bellatrix’s cutting curse struck your arm, sending sharp pains throughout your arm as small but deep cuts sprang up all over your arm. There was blood everywhere, soaking your clothes and dripping to the floor, but you kept your wand pointed at her and fired a successful burning curse her way.</p><p>“Now, (Y/N) Moody!” You heard Dobby scream again, his hand interlocked with both Harry and Ron’s, Hermione struggling to stand up straight against the tall redhead. With a last look at Bellatrix Lestrange, you cast the most havoc-causing curse you could think of.</p><p>“<i>Confringo!</i>”</p><p>Fiery Orange light escaped your wand and hit the ground where Bellatrix stood. The ground erupted, sending her flying back and into the wall behind her. While she was out you hurried back and grabbed Harry’s hand, Dobby instantly moving to diapparate all five of you out of the now rubble filled house.</p><p>It was only as the room turned into a swirl of colour that you noticed the little knife that Bellatrix pulled from her side, and the malice look on her face as she threw into the disapparating form of the five of you. Blood trickled down her smiling lips as she realised it disapparated along with you, hoping with everything that she had that it would find it’s way into one of your flesh and bones.</p><figure data-orig-width=\"1797\" data-orig-height=\"116\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pn562leHt81vvelon_540.png\" alt=\"image\" data-orig-width=\"1797\" data-orig-height=\"116\"></figure><p>The crack of your apparating forms rippled through Shell Cottage, turning the heads of the three people that sat inside. Bill was immediately on his feet and running full pelt out the front door, frantic for his eyes to lay on you once again. He paused, feeling like his heart was beating in his throat, closing up his airways and leaving him struggling for breath. And then his eyes met yours, standing a few feet from Harry before he watched your knees hit the ground.</p><p>He hadn’t even noticed he had started running towards you before he was on the ground next to you, looking over your body for any indication of injury. Your arm was coated in blood, the scars left by a cutting curse littering the skin of your arm. There was a little cut on your chin, but otherwise, you were physically fine. But for whatever reason, you were shaking uncontrollably in Bill’s arms.</p><p>You couldn’t speak. You had finally let go of all the emotions that Bellatrix’s words had let loose. You knew you wouldn’t be able to fight if you had let them rip and claw at you there, but the holding in had done its own damage. Each breath that came out of your chest was sharp and jagged. You knew you should feel the pain of all the cuts on your arm but you were completely numb to any pain at all. All you could picture was the image of Nagini striking the broken corpse of your father over and over again.</p><p>You hadn’t noticed that you were gripping the inside edge of Bill’s green jacket, the skin on your hands turning white from the pressure it held it with. You barely noticed the screams and whimpers that were coming out of your mouth or the tears that had blurred your vision of the panicked man crouched in front of you.</p><p>“(Y/N)…” he said, but you couldn’t hear him. You scarcely noticed his lips moving. “What happened?”</p><p>All you could do was lean into him, feeling his arms immediately moving to wrap around your neck and chest and bring you deeper into him. The wind whipped both of your hair into each other’s faces, your cries rippling through your body and into his.</p><p>You were only able to mutter one word over and over until it was the only thing your lips seemed to be able to mumble. And that was what kept Bill’s heart thumping a hundred miles per hour in his chest. Your voice was strained and weak with every cry of ‘dad’ that escaped your lips.</p><p>It was like that night all over again. All Bill could do was hold you against him on the damp floor of Shell Cottage while everything else but you and your cries faded out of existence in his mind. You held onto him like he was the only thing keeping you alive at that moment, the sound of Bellatrix’s cackling laugh echoing in your head as she stood over your Father’s broken and battered body. And then the Snake would close in on it, amusement seeping deeper and deeper into Bellatrix’s features.</p><p>And Bill was the only way to hold onto reality. Without him holding you, the snake would engulf you whole along with your father’s damaged and dead body.</p><figure data-orig-width=\"1797\" data-orig-height=\"116\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pn5py27gDa1vvelon_540.png\" alt=\"image\" data-orig-width=\"1797\" data-orig-height=\"116\"></figure><p><b>I was on edge while writing this part. There were so many times where I was so close to crying because of the intensity of it. What did you guys think? Let me know!</b><br></p><p><b>If you would like to be added to the <i>After All This</i> taglist, feel free to let me know in my inbox.</b></p><p><b>Alpha tags: <a href=\"https://tmblr.co/m73TQMXCYLh_u_pJQ4Et1dg\" target=\"_blank\">@xinyourdreamsx</a> <a href=\"https://tmblr.co/mi5eOnbwfVzOiE4wbNfzu3Q\" target=\"_blank\">@marvelismylifffe</a> <a href=\"https://tmblr.co/mr3VRIRbro_sJhvbvL9u3RA\" target=\"_blank\">@xxerwin4laypxx</a> <a href=\"https://tmblr.co/mocETYjePDJXUoOmGbkYo3w\" target=\"_blank\">@xxsophie-raabxx</a> <a href=\"https://tmblr.co/mQa6ErL69of6i0TU-LnRQEw\" target=\"_blank\">@yeeterbenjaminparker</a> <a href=\"https://tmblr.co/mKNM8vKfkEVZvNYCte3UfiA\" target=\"_blank\">@bitchinghourss</a> <a href=\"https://tmblr.co/mb1lTa35TLVbsXxf0QMb7VQ\" target=\"_blank\">@sly-vixen-up2nogood</a></b></p><p><b>Beta Tags: <a href=\"https://tmblr.co/mB4j56voIF2I69XIuQoiLPA\" target=\"_blank\">@winchestergirl907</a> <a href=\"https://tmblr.co/mLXVADHSkhhwBGp3Kpu1lPg\" target=\"_blank\">@anormalgirlsthoughts</a> <strike>@moondust-and-stardust</strike> <a href=\"https://tmblr.co/mlSK91hmOns538b7Sor2hfw\" target=\"_blank\">@otherthingsinhead</a> <a href=\"https://tmblr.co/m1BFZcp2MYaPXvBgCXc4L1g\" target=\"_blank\">@kaetastic</a> <a href=\"https://tmblr.co/mbdWxiadSNPZAGOpzfQZddg\" target=\"_blank\">@themeanestlittlewitch</a> <a href=\"https://tmblr.co/mxAxPqSleV7sg8uJgRkRZOw\" target=\"_blank\">@pixierox101</a> <a href=\"https://tmblr.co/mwJIvhPrkBRq9TNC1vgFJHw\" target=\"_blank\">@semicharmedkindofali</a> <strike>@struggleofyesterday</strike> <a href=\"https://tmblr.co/mbsWik7rGQu0GDhkCK_-SyQ\" target=\"_blank\">@lazydiabetic</a> <a href=\"https://tmblr.co/mbmBgTO_AW9isWmJjueFyRg\" target=\"_blank\">@supermassiveblackhope</a> <strike>@thelders</strike> <a href=\"https://tmblr.co/mWtDegeTaHyAQBBY4oDG0eg\" target=\"_blank\">@firekissedwitchbitch</a> <a href=\"https://tmblr.co/mFVvkWtH-JTm66sW1s_Ks9g\" target=\"_blank\">@thatwrestlingfan91</a> <a href=\"https://tmblr.co/mJptKxWsYQX_jjBo7zUJytA\" target=\"_blank\">@wonderwoman292</a> <strike>@ohleahdarling</strike> <a href=\"https://tmblr.co/mYPV6Ohi0Tdx2QFwPQttMow\" target=\"_blank\">@ffantasylandd</a> <a href=\"https://tmblr.co/mOnYi_Nin-rHinxMsiK45wA\" target=\"_blank\">@fallatyourfeet</a> <a href=\"https://tmblr.co/mx2whzivJYMAZB5LLTqRhFA\" target=\"_blank\">@riverdaleserpent-hoe</a> <a href=\"https://tmblr.co/mJDSQLS5O4jEIsJPd4UpGoQ\" target=\"_blank\">@firstworldproblemthings</a> <a href=\"https://tmblr.co/mSnTWCmjnS-bS7Fbhpj3rag\" target=\"_blank\">@wandressfox</a> <strike>@abbssssssssssss</strike> <a href=\"https://tmblr.co/mRP1wmaE1GmYFNTl-F6sE9g\" target=\"_blank\">@izzy28901</a> <a href=\"https://tmblr.co/mI8WBbwn6zxO97cRsCD0njQ\" target=\"_blank\">@lvnalcvegocd</a> <a href=\"https://tmblr.co/mbioeSfNHd-ImcIozJjbTaQ\" target=\"_blank\">@a-mexican-waffle</a> <a href=\"https://tmblr.co/mwMq4GoQRWpPpa7DHNsm6eg\" target=\"_blank\">@dreamleveille</a> <a href=\"https://tmblr.co/mizdCwUqbcDOZBgjHYvFPMQ\" target=\"_blank\">@ashleykaiba</a> <strike>@midnightadventuressss</strike> <a href=\"https://tmblr.co/m8oUPMm2ZoyGGzJiMAC8sdQ\" target=\"_blank\">@bitchytortilla</a> <a href=\"https://tmblr.co/m8btzV1FORE-vMlUfaTAXzw\" target=\"_blank\">@adozendreams</a> <a href=\"https://tmblr.co/mXkBijdBAGWlQFpxqZdU8Mg\" target=\"_blank\">@catseatursoul</a> <a href=\"https://tmblr.co/mSPPbhiQj3_TpEHHZz5ClJg\" target=\"_blank\">@janettarose</a> <a href=\"https://tmblr.co/m4cStpJAKvUlrz5U3BFYd4g\" target=\"_blank\">@alsogolden-ana</a> <a href=\"https://tmblr.co/mjfKM0h8ciX_6RnO3ibekbQ\" target=\"_blank\">@kirra137</a> <a href=\"https://tmblr.co/mFYbo-mKwmOfVhJIaCZBS2A\" target=\"_blank\">@floralhaze91</a> <a href=\"https://tmblr.co/m6M9bhKYQrTp-ZjO1DTHMeA\" target=\"_blank\">@buckybarnesthedoritoslut</a> <a href=\"https://tmblr.co/mwHhmaEi1vu7jVxUzISKvJQ\" target=\"_blank\">@mindy-franco</a> <strike>@heavenanette</strike> <a href=\"https://tmblr.co/mo-MFXpt1YV2wmNXQw0C9gQ\" target=\"_blank\">@axielle-suson</a> <strike>@caleybree0520</strike> <a href=\"https://tmblr.co/mCIkx8CVmfP0eHxbJNsttqA\" target=\"_blank\">@sassyvetstudent</a> <strike>@geek-girl7</strike> <a href=\"https://tmblr.co/mmaxegdW9_BshQZ4YZE6qmQ\" target=\"_blank\">@mxlisxylmz</a> <a href=\"https://tmblr.co/mkZi27b55xdVXfDUducYc2Q\" target=\"_blank\">@ahirunana</a> <strike>@captainsteverogers-68</strike> <a href=\"https://tmblr.co/m-d8EHQ0swFMQUogI3wW8fw\" target=\"_blank\">@ginevraxrogers</a> <a href=\"https://tmblr.co/mDSiT7BVBDDBQ_y9UHyz6eA\" target=\"_blank\">@can-i-say-something-please</a> <strike>@isabellem20</strike> <a href=\"https://tmblr.co/mp9MmzjDLofAPdb4DCY6eXQ\" target=\"_blank\">@autumnrainwitch</a> <a href=\"https://tmblr.co/muTHRHdrIlaLuGzyl-3FFJg\" target=\"_blank\">@caitlinannbarber</a> <a href=\"https://tmblr.co/mHO6usxooz_JIE3rt7u-nDQ\" target=\"_blank\">@icharleecongrevemultifandomsblog</a> <strike>@evelynpotter-lupin</strike> <a href=\"https://tmblr.co/mhEAwAkx2f7jJ8fC93cLxug\" target=\"_blank\">@peterparke-r</a> <a href=\"https://tmblr.co/muwrtXNHtfwIKjR2YjUnPvA\" target=\"_blank\">@daddyslilchild</a> <strike>@vyrei</strike> <a href=\"https://tmblr.co/m7ncXzCiEGFLmB-CJ3UuIAQ\" target=\"_blank\">@wnygirl2012</a> <strike>@furryexpertstrawberry</strike> <a href=\"https://tmblr.co/mWoI0M4_qDRFw5UzgfzTbnQ\" target=\"_blank\">@lynn14lynn</a> <a href=\"https://tmblr.co/mr0kujOtVBeYazL4lfDd1PQ\" target=\"_blank\">@death-of-the-golden-days</a> <strike>@ms-lady-muffin</strike> <a href=\"https://tmblr.co/m_Vzil6mSHv7P2bTWyXbXQg\" target=\"_blank\">@j-brielmalfoy</a> <a href=\"https://tmblr.co/miwQvJR07bCdb_czfC2S3sA\" target=\"_blank\">@songforhema</a> <a href=\"https://tmblr.co/mYgVaFYgxtoHa4ZbMCqeJ9g\" target=\"_blank\">@grandmastergoldblums</a> <a href=\"https://tmblr.co/mInrRtGoTin8xgA8MXfuXbQ\" target=\"_blank\">@galacticnerd-78</a> <a href=\"https://tmblr.co/m9qddr3aSr9wUNFboktbDhA\" target=\"_blank\">@theawkwardbutterfly</a> <a href=\"https://tmblr.co/m6ewkIG8d-X-9DvRUUykW2A\" target=\"_blank\">@steph-fowlie</a> <a href=\"https://tmblr.co/m5FhLDJWszwLRyShpG4g_uw\" target=\"_blank\">@notearslefttocry218</a> <a href=\"https://tmblr.co/miAxdKYh9Zj9HFc1YC4C8zw\" target=\"_blank\">@iluvmesomemarvelndc</a> <a href=\"https://tmblr.co/m5wjMFwLfx77R74lYRS-2CQ\" target=\"_blank\">@expecto-patronadss</a> <strike>@royarlie</strike> <a href=\"https://tmblr.co/mTxjjVcTuXbHG0JlL_wiANw\" target=\"_blank\">@winterboobear001</a> <a href=\"https://tmblr.co/mfoAy05Uu1ZX_brRI2Rry6g\" target=\"_blank\">@good-or-naughty-girl</a> <a href=\"https://tmblr.co/myVdb0oU4313dqokHARDjlw\" target=\"_blank\">@blog-ilove-thedoctor-forever</a> <a href=\"https://tmblr.co/mQBE9t0d1khSgw3O2jaEc8Q\" target=\"_blank\">@nea90sweetie</a> <a href=\"https://tmblr.co/m6hOGiVqRNm_H5eIc8vnovg\" target=\"_blank\">@dreamingofnovember06</a> <a href=\"https://tmblr.co/mHuAgEv25-y1mf0EhplePjQ\" target=\"_blank\">@theravenclawlover</a> <a href=\"https://tmblr.co/m4QYi0Yga7MBSRVawzYSYaw\" target=\"_blank\">@sleepylunarwolf</a> <a href=\"https://tmblr.co/m0W93SJcXYO5mbGRwFrNlYw\" target=\"_blank\">@awesomeowlbook</a> <a href=\"https://tmblr.co/mePU2aTV0XWpSltO_DOXhNw\" target=\"_blank\">@eponine-xx</a> <a href=\"https://tmblr.co/mpI_LV-93y67mqm1s7uuddw\" target=\"_blank\">@sj-thefan</a> <a href=\"https://tmblr.co/mzW5bQSeGHGhEkZD3tHRetQ\" target=\"_blank\">@beatlezrcool</a> <a href=\"https://tmblr.co/mLGuI0gpFiQ5GJG-iQDFNCQ\" target=\"_blank\">@beardburnsupersoldiers</a> <a href=\"https://tmblr.co/mYEHy3WDiRAm6SxGXQlzmfA\" target=\"_blank\">@infinte-exist-ence</a> <strike>@naffeesaa</strike> <a href=\"https://tmblr.co/mro-WHRELP_tIiDT-xlIGAQ\" target=\"_blank\">@fortunebucket</a> <a href=\"https://tmblr.co/mMZASFYamBJrABB_kFAxBfg\" target=\"_blank\">@0-lost-in-stereo-0</a> <a href=\"https://tmblr.co/mvzer79hy_RPs0Zvjj1FA_g\" target=\"_blank\">@sweetlittlespine</a> <a href=\"https://tmblr.co/m-m8gnaK19IIJXPhubkLlTA\" target=\"_blank\">@w-wolfhxrd</a> <strike>@the-unloved-person @kobraki2096</strike> <a href=\"https://tmblr.co/mV4JTOT4gsP26y_o_getnZw\" target=\"_blank\">@musingpredilection</a> <a href=\"https://tmblr.co/mribE3r9PP1VJCE-Xh8exTg\" target=\"_blank\">@sansastarkjusticewarrior</a> <strike>@miracleowlet</strike> <a href=\"https://tmblr.co/mlmbgczU4CX4dax82Yvayow\" target=\"_blank\">@ceruleanrainblues</a> <a href=\"https://tmblr.co/mLUayxXF1golxrBZi5sPU5g\" target=\"_blank\">@hermionebennet</a> <a href=\"https://tmblr.co/mcJEohcrMZjNvCe2iVCCwGw\" target=\"_blank\">@loserrlauraa</a> <a href=\"https://tmblr.co/mJ6IysNXGI4vQEuc-QNr-jg\" target=\"_blank\">@mrsmoore-313</a> <a href=\"https://tmblr.co/m2sGOmRlq8MwFleb1fFMs7Q\" target=\"_blank\">@dottirose</a> <a href=\"https://tmblr.co/mEaMgjkI01LMNRMiMkrZ70A\" target=\"_blank\">@kpopmademedo-it</a> <a href=\"https://tmblr.co/mRfKiRUssG0OYF3cuvcVmnQ\" target=\"_blank\">@nat-arlett</a> <strike>@kenz12234</strike> <a href=\"https://tmblr.co/mwJEEvVgQPoMVd4UqU_6ovw\" target=\"_blank\">@disneyoncerlover815</a> <a href=\"https://tmblr.co/mBXO_RPZEe51jpypcfcvmtg\" target=\"_blank\">@bookfandomsmatter</a> <a href=\"https://tmblr.co/mL8pDTQNoiDD1qSA5DHsaLg\" target=\"_blank\">@cutie-bug</a></b></p></p>",
                "content": "<p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><p><b>Pairing: </b>Bill Weasley x Moody!Reader</p><p><b>Summary:</b>&nbsp;Alastor Moody wasn&rsquo;t a man to back away when someone needed him, so it&rsquo;s really no surprise that his daughter (Y/N) is like that too. So when both Bill and (Y/N) find a house-elf at their&nbsp;door one day, (Y/N) doesn&rsquo;t think twice before apparating away with him.<br /></p><p><b>You can find the series masterlist in my bio!</b></p><p><b>Warnings: </b>angst, fighting, grief, torture and just overall a very heavy chapter.</p><p><b>Wordcount: </b>3.65k</p><p><b>A/N: </b>This chapter is pretty intense and plot filled (like pretty much all chapters ahead!)</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pm5xxw126N1vvelon_540.png\" class=\"\"/></figure><h2><i>March 16th, 1998</i></h2><p><i>&ldquo;Dad,&rdquo; you said, giving your father a quizzical look. &ldquo;What&rsquo;s that?&rdquo;</i></p><p><i>Alastor Moody looked down at his daughter from his place at the old mahogany table, his brand new magical glass in his hand. He had just popped it into its brown leather strap and was giving it a quick cautious inspection. You had been watching him the whole time, taking note of every action in the simple process.</i></p><p><i>&ldquo;It&rsquo;s my new eye,&rdquo; Moody said, allowing his daughter to take a proper look at the thing for the first time. You leaned over his knee and peered down at the glass eye in his rough and tattered hand. It looked so small in his wide palm.</i></p><p><i>&ldquo;So you can get rid of the eye patch?&rdquo; you asked, your nose scrunching up at the leather patch covering his left eye. You had hated the thing since you had seen it on him for the first time and kept telling him that he looked like one of those muggle pirates. He gave a rare, slight chuckle at your words.</i></p><p><i>&ldquo;Yes. Happy about that are you?&rdquo; There was a smile on your face as Moody took the eye patch off, revealing the red, scarred skin around the hole where his eye used to be. He saw you flinch at the sight but keep on looking, disgusted intrigue on your face. Moody felt the need to turn away from your innocent eyes but stayed when you raised a hand to the scars running down the left side of his face.</i></p><p><i>&ldquo;Did a bad man do that, Dad?&rdquo; Moody picked up a sense of concern in your young features, bringing a smile to his lips. He lifted you up and placed you on his knee like he would always do when explaining something to you.</i></p><p><i>&ldquo;Yes,&rdquo; Moody said. &ldquo;A very bad man. You know that Dad&rsquo;s job is to put all the bad wizards and witches in jail. But sometimes I can get hurt, and this can happen.&rdquo; He lifted a finger to point at his eye. &ldquo;Or this.&rdquo;&nbsp;</i><i>He pointed to his wooden prosthetic leg and gave it a pat. He watched your eyes glance down from his facial scars and down to the wooden leg. You followed his action in patting it and smiled at the weird part of your father.</i></p><p><i>&ldquo;That&rsquo;s cool,&rdquo; you said, giving it another pat. Moody chuckled and tucked a (h/c) strand of hair behind your ear, one that so resembled your late moth</i><i>er&rsquo;s.</i></p><p><i>&ldquo;That&rsquo;s not the word I would use for it,&rdquo; Moody said. &ldquo;but I suppose it could be considered cool.&rdquo;</i></p><p><i>&ldquo;Was it the same man that got Mum?&rdquo;</i></p><p><i>Moody paused, the question taking him by surprise. His heart sat still in his chest at the mention of your mother, and he was grasping for the right words to say. It had been a different death eater than the one that had taken Adeline, yet to him, they were much of the same muchness. Both were the same evil vermin that they had both been pledged to fight against. </i></p><p><i>&ldquo;No,&rdquo; he answered slowly. &ldquo;No, it wasn&rsquo;t the same man.&rdquo;</i></p><p><i>&ldquo;I miss her,&rdquo; you said, suddenly looking up at his face from your gaze on his wooden leg. You were playing with one of the buttons on his dark grey shirt, your legs swaying around in the air between his leg and the floor.</i></p><p><i>&ldquo;I miss her too,&rdquo; Moody said, letting you wrap your arms around his neck. He held you tight as you nestled your face in his neck and against his light brown hair, his hand going up to cup the back of your head. &ldquo;I miss her too.&rdquo;</i></p><p><i>He placed a kiss to the side of your head, keeping your body close against him. Letting a silence come over the both of you, he kept a grip on the electric-blue eye in his hand. He&rsquo;d give both eyes to have his wife back. But more importantly, he&rsquo;d give his life to make sure you didn&rsquo;t have to die along with her. </i></p><p>The sunlight streaming in through the window bounced back off the electric-blue glass ball and into your eye, only becoming aware of the painful glint as you awoke from the old memory. You could almost feel the kiss that you father had placed to the side of your head over twenty years ago, the remanents of its comforting nature still imprinted on your skin.</p><p>The sound of Bill&rsquo;s footsteps coming down the stairs awoke you from your trance, your head turning to look at him. He flashed you the warm smile he always would whenever he saw you, no matter how long had passed since he had last been in your company. This time it had only been several minutes, yet he still made his way over to you and wrapped his arms snuggly around your waist, digging his nose deep into the strands of hair sitting around your ear.</p><p>He placed a kiss to your temple, feeling you lean back against the front of his body. It was one of the comfiest places in the world and you always found yourself coming back to its comfort.&nbsp;</p><p>&ldquo;I was thinking we might go visit Tonks and Remus today?&rdquo; Bill said, feeling you turn around to face him in his arms. &ldquo;See how big her belly&rsquo;s gotten and tease her about it.&rdquo;</p><p>You let a laugh slip from your lips, a large smile on your face now beaming. &ldquo;Pregnancy is a beautiful thing, Bill. Even if it does make you fat.&rdquo;</p><p>Bill gave a hearty laugh, placing a kiss to your lips. You reached a hand up to ruffle his long, ginger hair, stepping out from his hold around your waist. &ldquo;I&rsquo;ll just go get a jacket for both of us and then we can head off.&rdquo;</p><p>Before you could take a step up the stairs, a loud crack of someone apparating outside came rippling through the cottage. Your eyes immediately flickered over to Bills, ears pricked to pick up the slightest of noises. Within a second, your wand was outstretched in your hand and you stalked your way over to the window. You tugged the thin lace curtain back, peering outside to find the unexpected visitors.</p><p>Out near the edge of the windy cliffs stood three familiar figures. Dobby the house elf who you had met only a handful of times stood in the middle, both hands outstretched and holding the hands of Luna Lovegood and Garrick Ollivander. Both looked injured and weak, bloody cuts all over their bodies and bones protruding out of their undernourished flesh.</p><p>&ldquo;It&rsquo;s Dobby with Luna Lovegood and Ollivander,&rdquo; You said, turning around to look at Bill. You saw a look of confusion come over his face and the wand in his hand drop to his side.</p><p>&ldquo;The wandmaker?&rdquo;</p><p>You simply nodded, making your way outside and over towards them. You heard Bill quickly make his way out behind you. Dobby was hurridly making his way over to you, tugging both of them along behind him.</p><p>&ldquo;(Y/N) Moody!&rdquo; called the house elf. &ldquo;Dobby needs to help Harry Potter! Harry Potter told Dobby to bring Luna Lovegood and Mr Ollivander to Shell Cottage!&rdquo;</p><p>&ldquo;Where&rsquo;s Harry?&rdquo; You said, placing a hand to Luna&rsquo;s face to check the scar that sat on her cheek. Luna&rsquo;s silver eyes were still bright despite the physical wounds that littered her body.</p><p>&ldquo;They&rsquo;re at Malfoy Manor,&rdquo; she said in her light voice. Her normally bubbly expression had turned to one of worry. &ldquo;They&rsquo;re in trouble.&rdquo;</p><p>You had your mind made up within a second. You nodded at Luna before looking down at the Small house elf in front of you. &ldquo;Can you take me there?&rdquo;</p><p>&ldquo;Of course,&rdquo; he responded, his high-voice enthusiastic to get back to Harry&rsquo;s aid.</p><p>&ldquo;(Y/N),&rdquo; Bill said, grabbing hold of your wrist and turning you to face him. &ldquo;Don&rsquo;t go leaping into battle. Think this through first.&rdquo;</p><p>&ldquo;There&rsquo;s no time to think this through, Bill!&rdquo; You said, your (e/c) eyes meeting his blue ones. &ldquo;There in real trouble. The Malfoys are dark wizards, and as far as I&rsquo;m concerned, my job is to hunt down dark wizards.&rdquo;</p><p>Bill sighed, knowing that fighting with you would be no use. When you were set on something like this, there was no changing your mind. &ldquo;I&rsquo;m coming with you, then.&rdquo;</p><p>&ldquo;No, you can&rsquo;t,&rdquo; you said, &ldquo;you need to look after Luna and Ollivander. I promise I&rsquo;ll be careful, okay?&rdquo;</p><p>You knew he was worried for you; he always was whenever you had to do something like this. Though normally, you would have your father or another auror with you. This time, however, you were heading into it alone. All he could do was place a rash kiss to your lips, a hopeful goodbye, and let you leave, hoping with everything he had that you would return all in one piece.</p><p>&ldquo;You&rsquo;re too much like your father,&rdquo; he muttered against your lips before placing another kiss to your forehead. You leant into him one last time before turning away and grabbing Dobby&rsquo;s hand.</p><p>&ldquo;I love you,&rdquo; Bill said, the breeze ruffling his red hair and sending a shiver down his skin. Bill&rsquo;s face was already pale with worry but he held onto your gaze with apprehension.</p><p>&ldquo;I love you too.&rdquo; And with those final words, you watched as Bill, Luna and Garrick Ollivander vanished into a swirl of colour, the dark colours of the Malfoy&rsquo;s dungeon quickly setting in. Looking around, your eyes met with Harry and Ron&rsquo;s, a look of relief coming across their face as they took your presence in.</p><p>&ldquo;(Y/N)?&rdquo; You heard Harry say, rushing forward and wrapping his arms around your body. You embraced him in the cold and damp dungeon before wrapping your arms around Ron.</p><p>&ldquo;Tell me what&rsquo;s going on.&rdquo; It was then that a blood-curdling scream erupted from outside, unmistakably a female&rsquo;s. You winced at the sound, knowing full well who&rsquo;s throat it had escaped from.</p><p>&ldquo;Bellatrix has Hermione,&rdquo; Ron said, rage clear in his voice as he said it. You knew it was taking everything he had not to barge up there and into the middle of a room full of Death Eaters.</p><p>&ldquo;Why are you even here?&rdquo; You said, looking between the two of them.</p><p>&ldquo;Snatchers got us,&rdquo; Harry responded. &ldquo;We have the sword of Gryffindor, that&rsquo;s why Bellatrix is torturing Hermione.&rdquo; He stumbled on the word torturing, his eyes rising to the roof where another scream erupted.</p><p>&ldquo;The sword is supposed to be in the Lestrange volt,&rdquo; you said, your grip tightening on your wand in your hand. &ldquo;Okay, look, we haven&rsquo;t got time for stories. I&rsquo;m going to sneak up there. You leave the duelling to me, okay? I have the most experience. You two get Hermione and the sword and make sure you&rsquo;re ready to apparate back to Shell Cottage with Dobby.&rdquo;</p><p>You crouched down until you were face-to-face with the house elf. Your authorative tone reminded you so much of the way your father would address the Aurors below him just before a mission would unfold. &ldquo;Now you make sure you do whatever you can to get them to safety. If I get injured or die, you disappate out of here and get them to Bill. Do you understand me?&rdquo;</p><p>&ldquo;Yes, (Y/N) Moody,&rdquo; Dobby said. &ldquo;I&rsquo;ll make sure Harry Potter and his friends are all safe.&rdquo;</p><p>You nodded at them all, before making your way past them and up the stairs. Your eyes flickered to Peter Pettigrew&rsquo;s dead body, no emotion arising in you as you looked at it. You stepped quietly on each step, growing closer and closer to Hermione&rsquo;s screams as you trod. Years of Auror experience had made your footsteps near silent and your breaths almost invisible to detect. Your heartbeat was beating quickly in your chest but your hand never shook, your wand steady and ready to use in your still hand.</p><p>You rounded a corner, ears pricked to pick up any sound that the Malfoys or Bellatrix might make. You were so close now and could see the dark outline of a tall woman with dark, frizzy hair. On the floor just below her was Hermione, bloody and screaming, tears streaking her pale and distraught face.&nbsp;You swallowed in disgust at the way Bellatrix leaned over her, enjoyment in her eyes at seeing the muggleborn in so much pain.</p><p>You raised your wand silently and aimed it straight at Bellatrix&rsquo;s chest. You were careful not to let it point in Hermione&rsquo;s direction before shouting, &ldquo;<i>Expulso!</i>&rdquo;</p><p>Bellatrix flew back in the air as blue light hit her chest, a stunned expression on her face at the unexpected curse. You watched as all three of the Malfoy&rsquo;s heads turned to you, their wands now in their hands.</p><p>Before another second had passed, you had disarmed Lucius Malfoy and were working on stunning Narcissa. Draco stood still, his wand pointed at you yet still unwilling to actually use it. You watched in the corner of your eye as Bellatrix stood back up, her curved, walnut wand in her hand.</p><p>Her frenzied eyes locked with yours and as she raised her wand, a wicked smile playing with her features. As furious as she was at the expulsion curse you had shot her way, she almost looked <i>excited</i> that you were there, hardly able to wait to play with the toy that had been delivered right into her hands.</p><p>&ldquo;Oh, look,&rdquo; she said in her high and toying voice. &ldquo;A Moody has come to save the day.&rdquo;</p><p>You weren&rsquo;t one to wait for a death eater to finish toying and shot a stunning curse her way. It seemed to do its job in shutting her up before she deflected it with ease, a look of outrage on her face. Her features were glowing red as she looked at you with pure disgust in her eyes.</p><p>&ldquo;You think you&rsquo;re a brave one too, huh?&rdquo; She gasped. &ldquo;Well don&rsquo;t you remember what we did to your father? Don&rsquo;t you remember him falling off that broom that night?&rdquo;</p><p>Her words sent a rush of loathing through your blood, your already tight grip on your wand tightening. You saw her raise her wand and you jumped out of the way, barely making it out of the red, torturous light in time. &ldquo;<i>Crucio!</i>&rdquo;</p><p>It struck the floor beside you, charring the wooden boards that it hit. You raised your mother&rsquo;s old wand and yelled, &ldquo;<i>Incendio!</i>&rdquo;</p><p>Bright flames shot out of your wand and into her direction, licking her skin and singeing her hair. She staggered pack, a burning pain clear on her face and a look of hatred in her eyes. &ldquo;Don&rsquo;t you dare talk about my father like that!&rdquo;</p><p>Bellatrix laughed despite the pain. &ldquo;Do you know what happened to his body? Of course you wouldn&rsquo;t, after all, we got to it first&hellip; or more like His Dark Lord&rsquo;s snake did&hellip;&rdquo;</p><p>Her own words must have stuck Bellatrix as hilarious because she let out a large and long cackle, it&rsquo;s high-pitched sound echoing around the otherwise silent room. The Malfoys were just watching on now, completely engrossed in the teasing and curses being flown back and forth. You caught the figures of Harry and Ron coming around the corner and into the tense room, their eyes immediately settling on both you and Bellatrix staring back and forth before flickering down to Hermione behind you. Ron instantly made his way over to her and helped her to her feet, Ron taking most of the effort in walking her back over to Harry.</p><p>&ldquo;You&rsquo;re another dead Moody, you know that?&rdquo; She finally said, set on finishing you rather than wasting another minute of her time toying. &ldquo;There won&rsquo;t be any more of your filthy half-blood family left to hunt us down.&rdquo;</p><p>You deflected the stunning shell she shot your way and quickly followed it up with an expulsion charm. She stumbled back, more vicious intent coming into her features as her eyes narrowed on you. &ldquo;I watched that snake eat him whole,&rdquo; she screeched, &ldquo;And I&rsquo;ll watch it eat you too.&rdquo;</p><p>&ldquo;Shut up!&rdquo; You couldn&rsquo;t take the taunting about your father anymore, it was opening up to many painful doors you thought you had closed. But she kept going, firing another fiery spell your way as she did do.</p><p>&ldquo;There was barely enough left of him before the snake got to him! The fall broke his body, oh&hellip;&rdquo; She let a high, intake of breath part her words. &ldquo;I wish you had been there to watch.&rdquo;</p><p>You were almost set on dropping your wand and jumping on her, switching to the muggle way of solving fights. But Dobby&rsquo;s high, anxious voice filled the room. &ldquo;(Y/N) Moody, we must leave now!&rdquo;</p><p>&ldquo;Just a second, Dobby,&rdquo; you said, taking a large intake of breath to clear your mind. &ldquo;Just another second.&rdquo;</p><p>You shot a red curse her way, watching her as she deflected it with a silver shield charm. There were flashes of different coloured lights, blue, red and green as curses were shot back and forth, some deflected and some just missing its target. Bellatrix&rsquo;s cutting curse struck your arm, sending sharp pains throughout your arm as small but deep cuts sprang up all over your arm. There was blood everywhere, soaking your clothes and dripping to the floor, but you kept your wand pointed at her and fired a successful burning curse her way.</p><p>&ldquo;Now, (Y/N) Moody!&rdquo; You heard Dobby scream again, his hand interlocked with both Harry and Ron&rsquo;s, Hermione struggling to stand up straight against the tall redhead. With a last look at Bellatrix Lestrange, you cast the most havoc-causing curse you could think of.</p><p>&ldquo;<i>Confringo!</i>&rdquo;</p><p>Fiery Orange light escaped your wand and hit the ground where Bellatrix stood. The ground erupted, sending her flying back and into the wall behind her. While she was out you hurried back and grabbed Harry&rsquo;s hand, Dobby instantly moving to diapparate all five of you out of the now rubble filled house.</p><p>It was only as the room turned into a swirl of colour that you noticed the little knife that Bellatrix pulled from her side, and the malice look on her face as she threw into the disapparating form of the five of you. Blood trickled down her smiling lips as she realised it disapparated along with you, hoping with everything that she had that it would find it&rsquo;s way into one of your flesh and bones.</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pn562leHt81vvelon_540.png\" class=\"\"/></figure><p>The crack of your apparating forms rippled through Shell Cottage, turning the heads of the three people that sat inside. Bill was immediately on his feet and running full pelt out the front door, frantic for his eyes to lay on you once again. He paused, feeling like his heart was beating in his throat, closing up his airways and leaving him struggling for breath. And then his eyes met yours, standing a few feet from Harry before he watched your knees hit the ground.</p><p>He hadn&rsquo;t even noticed he had started running towards you before he was on the ground next to you, looking over your body for any indication of injury. Your arm was coated in blood, the scars left by a cutting curse littering the skin of your arm. There was a little cut on your chin, but otherwise, you were physically fine. But for whatever reason, you were shaking uncontrollably in Bill&rsquo;s arms.</p><p>You couldn&rsquo;t speak. You had finally let go of all the emotions that Bellatrix&rsquo;s words had let loose. You knew you wouldn&rsquo;t be able to fight if you had let them rip and claw at you there, but the holding in had done its own damage. Each breath that came out of your chest was sharp and jagged. You knew you should feel the pain of all the cuts on your arm but you were completely numb to any pain at all. All you could picture was the image of Nagini striking the broken corpse of your father over and over again.</p><p>You hadn&rsquo;t noticed that you were gripping the inside edge of Bill&rsquo;s green jacket, the skin on your hands turning white from the pressure it held it with. You barely noticed the screams and whimpers that were coming out of your&nbsp;mouth or the tears that had blurred your vision of the panicked man crouched in front of you.</p><p>&ldquo;(Y/N)&hellip;&rdquo; he said, but you couldn&rsquo;t hear him. You scarcely noticed his lips moving. &ldquo;What happened?&rdquo;</p><p>All you could do was lean into him, feeling his arms immediately moving to wrap around your neck and chest and bring you deeper into him. The wind whipped both of your hair into each other&rsquo;s faces, your cries rippling through your body and into his.</p><p>You were only able to mutter one word over and over until it was the only thing your lips seemed to be able to mumble. And that was what kept Bill&rsquo;s heart thumping a hundred miles per hour in his chest. Your voice was strained and weak with every cry of &lsquo;dad&rsquo; that escaped your lips.</p><p>It was like that night all over again. All Bill could do was hold you against him on the damp floor of Shell Cottage while everything else but you and your cries faded out of existence in his mind. You held onto him like he was the only thing keeping you alive at that moment, the sound of Bellatrix&rsquo;s cackling laugh echoing in your head as she stood over your Father&rsquo;s broken and battered body. And then the Snake would close in on it, amusement seeping deeper and deeper into Bellatrix&rsquo;s features.</p><p>And Bill was the only way to hold onto reality. Without him holding you, the snake would engulf you whole along with your father&rsquo;s damaged and dead body.</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pn5py27gDa1vvelon_540.png\" class=\"\"/></figure><p><b>I was on edge while writing this part. There were so many times where I was so close to crying because of the intensity of it. What did you guys think? Let me know!</b><br /></p><p><b>If you would like to be added to the <i>After All This</i> taglist, feel free to let me know in my inbox.</b></p><p><b>Alpha tags:&nbsp;<a href=\"https://tmblr.co/m73TQMXCYLh_u_pJQ4Et1dg\" target=\"_blank\">@xinyourdreamsx</a> <a href=\"https://tmblr.co/mi5eOnbwfVzOiE4wbNfzu3Q\" target=\"_blank\">@marvelismylifffe</a> <a href=\"https://tmblr.co/mr3VRIRbro_sJhvbvL9u3RA\" target=\"_blank\">@xxerwin4laypxx</a> <a href=\"https://tmblr.co/mocETYjePDJXUoOmGbkYo3w\" target=\"_blank\">@xxsophie-raabxx</a> <a href=\"https://tmblr.co/mQa6ErL69of6i0TU-LnRQEw\" target=\"_blank\">@yeeterbenjaminparker</a> <a href=\"https://tmblr.co/mKNM8vKfkEVZvNYCte3UfiA\" target=\"_blank\">@bitchinghourss</a> <a href=\"https://tmblr.co/mb1lTa35TLVbsXxf0QMb7VQ\" target=\"_blank\">@sly-vixen-up2nogood</a></b></p><p><b>Beta Tags: <a href=\"https://tmblr.co/mB4j56voIF2I69XIuQoiLPA\" target=\"_blank\">@winchestergirl907</a> <a href=\"https://tmblr.co/mLXVADHSkhhwBGp3Kpu1lPg\" target=\"_blank\">@anormalgirlsthoughts</a> <strike>@moondust-and-stardust</strike> <a href=\"https://tmblr.co/mlSK91hmOns538b7Sor2hfw\" target=\"_blank\">@otherthingsinhead</a> <a href=\"https://tmblr.co/m1BFZcp2MYaPXvBgCXc4L1g\" target=\"_blank\">@kaetastic</a> <a href=\"https://tmblr.co/mbdWxiadSNPZAGOpzfQZddg\" target=\"_blank\">@themeanestlittlewitch</a> <a href=\"https://tmblr.co/mxAxPqSleV7sg8uJgRkRZOw\" target=\"_blank\">@pixierox101</a> <a href=\"https://tmblr.co/mwJIvhPrkBRq9TNC1vgFJHw\" target=\"_blank\">@semicharmedkindofali</a> <strike>@struggleofyesterday</strike> <a href=\"https://tmblr.co/mbsWik7rGQu0GDhkCK_-SyQ\" target=\"_blank\">@lazydiabetic</a> <a href=\"https://tmblr.co/mbmBgTO_AW9isWmJjueFyRg\" target=\"_blank\">@supermassiveblackhope</a> <strike>@thelders</strike> <a href=\"https://tmblr.co/mWtDegeTaHyAQBBY4oDG0eg\" target=\"_blank\">@firekissedwitchbitch</a> <a href=\"https://tmblr.co/mFVvkWtH-JTm66sW1s_Ks9g\" target=\"_blank\">@thatwrestlingfan91</a> <a href=\"https://tmblr.co/mJptKxWsYQX_jjBo7zUJytA\" target=\"_blank\">@wonderwoman292</a> <strike>@ohleahdarling</strike> <a href=\"https://tmblr.co/mYPV6Ohi0Tdx2QFwPQttMow\" target=\"_blank\">@ffantasylandd</a> <a href=\"https://tmblr.co/mOnYi_Nin-rHinxMsiK45wA\" target=\"_blank\">@fallatyourfeet</a> <a href=\"https://tmblr.co/mx2whzivJYMAZB5LLTqRhFA\" target=\"_blank\">@riverdaleserpent-hoe</a> <a href=\"https://tmblr.co/mJDSQLS5O4jEIsJPd4UpGoQ\" target=\"_blank\">@firstworldproblemthings</a> <a href=\"https://tmblr.co/mSnTWCmjnS-bS7Fbhpj3rag\" target=\"_blank\">@wandressfox</a> <strike>@abbssssssssssss</strike> <a href=\"https://tmblr.co/mRP1wmaE1GmYFNTl-F6sE9g\" target=\"_blank\">@izzy28901</a> <a href=\"https://tmblr.co/mI8WBbwn6zxO97cRsCD0njQ\" target=\"_blank\">@lvnalcvegocd</a> <a href=\"https://tmblr.co/mbioeSfNHd-ImcIozJjbTaQ\" target=\"_blank\">@a-mexican-waffle</a> <a href=\"https://tmblr.co/mwMq4GoQRWpPpa7DHNsm6eg\" target=\"_blank\">@dreamleveille</a> <a href=\"https://tmblr.co/mizdCwUqbcDOZBgjHYvFPMQ\" target=\"_blank\">@ashleykaiba</a> <strike>@midnightadventuressss</strike> <a href=\"https://tmblr.co/m8oUPMm2ZoyGGzJiMAC8sdQ\" target=\"_blank\">@bitchytortilla</a> <a href=\"https://tmblr.co/m8btzV1FORE-vMlUfaTAXzw\" target=\"_blank\">@adozendreams</a> <a href=\"https://tmblr.co/mXkBijdBAGWlQFpxqZdU8Mg\" target=\"_blank\">@catseatursoul</a> <a href=\"https://tmblr.co/mSPPbhiQj3_TpEHHZz5ClJg\" target=\"_blank\">@janettarose</a> <a href=\"https://tmblr.co/m4cStpJAKvUlrz5U3BFYd4g\" target=\"_blank\">@alsogolden-ana</a> <a href=\"https://tmblr.co/mjfKM0h8ciX_6RnO3ibekbQ\" target=\"_blank\">@kirra137</a> <a href=\"https://tmblr.co/mFYbo-mKwmOfVhJIaCZBS2A\" target=\"_blank\">@floralhaze91</a> <a href=\"https://tmblr.co/m6M9bhKYQrTp-ZjO1DTHMeA\" target=\"_blank\">@buckybarnesthedoritoslut</a> <a href=\"https://tmblr.co/mwHhmaEi1vu7jVxUzISKvJQ\" target=\"_blank\">@mindy-franco</a> <strike>@heavenanette</strike> <a href=\"https://tmblr.co/mo-MFXpt1YV2wmNXQw0C9gQ\" target=\"_blank\">@axielle-suson</a> <strike>@caleybree0520</strike> <a href=\"https://tmblr.co/mCIkx8CVmfP0eHxbJNsttqA\" target=\"_blank\">@sassyvetstudent</a> <strike>@geek-girl7</strike> <a href=\"https://tmblr.co/mmaxegdW9_BshQZ4YZE6qmQ\" target=\"_blank\">@mxlisxylmz</a> <a href=\"https://tmblr.co/mkZi27b55xdVXfDUducYc2Q\" target=\"_blank\">@ahirunana</a> <strike>@captainsteverogers-68</strike> <a href=\"https://tmblr.co/m-d8EHQ0swFMQUogI3wW8fw\" target=\"_blank\">@ginevraxrogers</a> <a href=\"https://tmblr.co/mDSiT7BVBDDBQ_y9UHyz6eA\" target=\"_blank\">@can-i-say-something-please</a> <strike>@isabellem20</strike> <a href=\"https://tmblr.co/mp9MmzjDLofAPdb4DCY6eXQ\" target=\"_blank\">@autumnrainwitch</a> <a href=\"https://tmblr.co/muTHRHdrIlaLuGzyl-3FFJg\" target=\"_blank\">@caitlinannbarber</a> <a href=\"https://tmblr.co/mHO6usxooz_JIE3rt7u-nDQ\" target=\"_blank\">@icharleecongrevemultifandomsblog</a> <strike>@evelynpotter-lupin</strike> <a href=\"https://tmblr.co/mhEAwAkx2f7jJ8fC93cLxug\" target=\"_blank\">@peterparke-r</a> <a href=\"https://tmblr.co/muwrtXNHtfwIKjR2YjUnPvA\" target=\"_blank\">@daddyslilchild</a> <strike>@vyrei</strike> <a href=\"https://tmblr.co/m7ncXzCiEGFLmB-CJ3UuIAQ\" target=\"_blank\">@wnygirl2012</a> <strike>@furryexpertstrawberry</strike> <a href=\"https://tmblr.co/mWoI0M4_qDRFw5UzgfzTbnQ\" target=\"_blank\">@lynn14lynn</a> <a href=\"https://tmblr.co/mr0kujOtVBeYazL4lfDd1PQ\" target=\"_blank\">@death-of-the-golden-days</a> <strike>@ms-lady-muffin</strike> <a href=\"https://tmblr.co/m_Vzil6mSHv7P2bTWyXbXQg\" target=\"_blank\">@j-brielmalfoy</a> <a href=\"https://tmblr.co/miwQvJR07bCdb_czfC2S3sA\" target=\"_blank\">@songforhema</a> <a href=\"https://tmblr.co/mYgVaFYgxtoHa4ZbMCqeJ9g\" target=\"_blank\">@grandmastergoldblums</a> <a href=\"https://tmblr.co/mInrRtGoTin8xgA8MXfuXbQ\" target=\"_blank\">@galacticnerd-78</a> <a href=\"https://tmblr.co/m9qddr3aSr9wUNFboktbDhA\" target=\"_blank\">@theawkwardbutterfly</a> <a href=\"https://tmblr.co/m6ewkIG8d-X-9DvRUUykW2A\" target=\"_blank\">@steph-fowlie</a> <a href=\"https://tmblr.co/m5FhLDJWszwLRyShpG4g_uw\" target=\"_blank\">@notearslefttocry218</a> <a href=\"https://tmblr.co/miAxdKYh9Zj9HFc1YC4C8zw\" target=\"_blank\">@iluvmesomemarvelndc</a> <a href=\"https://tmblr.co/m5wjMFwLfx77R74lYRS-2CQ\" target=\"_blank\">@expecto-patronadss</a> <strike>@royarlie</strike> <a href=\"https://tmblr.co/mTxjjVcTuXbHG0JlL_wiANw\" target=\"_blank\">@winterboobear001</a> <a href=\"https://tmblr.co/mfoAy05Uu1ZX_brRI2Rry6g\" target=\"_blank\">@good-or-naughty-girl</a> <a href=\"https://tmblr.co/myVdb0oU4313dqokHARDjlw\" target=\"_blank\">@blog-ilove-thedoctor-forever</a> <a href=\"https://tmblr.co/mQBE9t0d1khSgw3O2jaEc8Q\" target=\"_blank\">@nea90sweetie</a> <a href=\"https://tmblr.co/m6hOGiVqRNm_H5eIc8vnovg\" target=\"_blank\">@dreamingofnovember06</a> <a href=\"https://tmblr.co/mHuAgEv25-y1mf0EhplePjQ\" target=\"_blank\">@theravenclawlover</a> <a href=\"https://tmblr.co/m4QYi0Yga7MBSRVawzYSYaw\" target=\"_blank\">@sleepylunarwolf</a> <a href=\"https://tmblr.co/m0W93SJcXYO5mbGRwFrNlYw\" target=\"_blank\">@awesomeowlbook</a> <a href=\"https://tmblr.co/mePU2aTV0XWpSltO_DOXhNw\" target=\"_blank\">@eponine-xx</a> <a href=\"https://tmblr.co/mpI_LV-93y67mqm1s7uuddw\" target=\"_blank\">@sj-thefan</a> <a href=\"https://tmblr.co/mzW5bQSeGHGhEkZD3tHRetQ\" target=\"_blank\">@beatlezrcool</a> <a href=\"https://tmblr.co/mLGuI0gpFiQ5GJG-iQDFNCQ\" target=\"_blank\">@beardburnsupersoldiers</a> <a href=\"https://tmblr.co/mYEHy3WDiRAm6SxGXQlzmfA\" target=\"_blank\">@infinte-exist-ence</a> <strike>@naffeesaa</strike> <a href=\"https://tmblr.co/mro-WHRELP_tIiDT-xlIGAQ\" target=\"_blank\">@fortunebucket</a> <a href=\"https://tmblr.co/mMZASFYamBJrABB_kFAxBfg\" target=\"_blank\">@0-lost-in-stereo-0</a> <a href=\"https://tmblr.co/mvzer79hy_RPs0Zvjj1FA_g\" target=\"_blank\">@sweetlittlespine</a> <a href=\"https://tmblr.co/m-m8gnaK19IIJXPhubkLlTA\" target=\"_blank\">@w-wolfhxrd</a> <strike>@the-unloved-person @kobraki2096</strike> <a href=\"https://tmblr.co/mV4JTOT4gsP26y_o_getnZw\" target=\"_blank\">@musingpredilection</a> <a href=\"https://tmblr.co/mribE3r9PP1VJCE-Xh8exTg\" target=\"_blank\">@sansastarkjusticewarrior</a> <strike>@miracleowlet</strike> <a href=\"https://tmblr.co/mlmbgczU4CX4dax82Yvayow\" target=\"_blank\">@ceruleanrainblues</a> <a href=\"https://tmblr.co/mLUayxXF1golxrBZi5sPU5g\" target=\"_blank\">@hermionebennet</a> <a href=\"https://tmblr.co/mcJEohcrMZjNvCe2iVCCwGw\" target=\"_blank\">@loserrlauraa</a> <a href=\"https://tmblr.co/mJ6IysNXGI4vQEuc-QNr-jg\" target=\"_blank\">@mrsmoore-313</a> <a href=\"https://tmblr.co/m2sGOmRlq8MwFleb1fFMs7Q\" target=\"_blank\">@dottirose</a> <a href=\"https://tmblr.co/mEaMgjkI01LMNRMiMkrZ70A\" target=\"_blank\">@kpopmademedo-it</a> <a href=\"https://tmblr.co/mRfKiRUssG0OYF3cuvcVmnQ\" target=\"_blank\">@nat-arlett</a> <strike>@kenz12234</strike> <a href=\"https://tmblr.co/mwJEEvVgQPoMVd4UqU_6ovw\" target=\"_blank\">@disneyoncerlover815</a> <a href=\"https://tmblr.co/mBXO_RPZEe51jpypcfcvmtg\" target=\"_blank\">@bookfandomsmatter</a> <a href=\"https://tmblr.co/mL8pDTQNoiDD1qSA5DHsaLg\" target=\"_blank\">@cutie-bug</a></b></p></p>",
                "content_abstract": "<p>\n<figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure>\n<p><b>Pairing: </b>Bill Weasley x Moody!Reader</p>\n<p><b>Summary:</b>&nbsp;Alastor Moody wasn&rsquo;t a man to back away when someone needed him, so it&rsquo;s really no surprise that his daughter (Y/N) is like that too. So when both Bill and (Y/N) find a house-elf at their&nbsp;door one day, (Y/N) doesn&rsquo;t think twice before apparating away with him.<br /></p>\n<p><b>You can find the series masterlist in my bio!</b></p>\n<p><b>Warnings: </b>angst, fighting, grief, torture and just overall a very heavy chapter.</p>\n<p><b>Wordcount: </b>3.65k</p>\n<p><b>A/N: </b>This chapter is pretty intense and plot filled (like pretty much all chapters ahead!)</p>\n<figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c6521673a8b1bc61abc6cf93a75658d0/tumblr_inline_pm5xxw126N1vvelon_540.png\" class=\"\"/></figure><h2><i>March 16th, 1998</i></h2>\n<p><i>&ldquo;Dad,&rdquo; you said, giving your father a quizzical look. &ldquo;What&rsquo;s that?&rdquo;</i></p>\n<p><i>Alastor Moody looked down at his daughter from his place at the old mahogany table, his brand new magical glass in his hand. He had just popped it into its brown leather strap and was giving it a quick cautious inspection. You had been watching him the whole time, taking note of every action in the simple process.</i></p>\n<p><i>&ldquo;It&rsquo;s my new eye,&rdquo; Moody said, allowing his daughter to take a proper look at the thing for the first time. You leaned over his knee and peered down at the glass eye in his rough and tattered hand. It looked so small in his wide palm.</i></p>\n<p><i>&ldquo;So you can get rid of the eye patch?&rdquo; you asked, your nose scrunching up at the leather patch covering his left eye. You had hated the thing since you had seen it on him for the first time and kept telling him that he looked like one of those muggle pirates. He gave a rare, slight chuckle at your words.</i></p>\n<p><i>&ldquo;Yes. Happy about that are you?&rdquo; There was a smile on your face as Moody took the eye patch off, revealing the red, scarred skin around the hole where his eye used to be. He saw you flinch at the sight but keep on looking, disgusted intrigue on your face. Moody felt the need to turn away from your innocent eyes but stayed when you raised a hand to the scars running down the left side of his face.</i></p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "pan-tastique",
        "blog": {
            "name": "pan-tastique",
            "title": "This is a new day, a new beginning.",
            "description": "Hi there! The name's Peter, or just Pan if you'd prefer to use my nickname. This is my brand new main art blog! This blog is limited to my art and fanart.\nVisit my new sideblog for reblogs!",
            "url": "https://pan-tastique.tumblr.com/",
            "uuid": "t:pteTTnlj-QyCaam5kmyjwQ",
            "updated": 1557919792
        },
        "id": 182999093161,
        "post_url": "https://pan-tastique.tumblr.com/post/182999093161/another-older-piece-i-still-love-it-tho-the",
        "slug": "another-older-piece-i-still-love-it-tho-the",
        "date": "2019-02-23 10:16:46 GMT",
        "timestamp": 1550917006,
        "state": "published",
        "format": "html",
        "reblog_key": "AHetyTfg",
        "tags": [
            "fantastic beasts",
            "HP",
            "harry potter",
            "fantastic beats and where to find them",
            "newt scamander",
            "niffler",
            "baby nifflers",
            "pantastique"
        ],
        "short_url": "https://tmblr.co/ZvyLFX2gRc8_f",
        "summary": "Another older piece. I still love it tho. The Niffler’s a proud papa. He’s distracting Newt so his babies can steal all the...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 11,
        "caption": "<p>Another older piece. I still love it tho.</p><p>The Niffler’s a proud papa. He’s distracting Newt so his babies can steal all the shiny things XD</p>",
        "reblog": {
            "comment": "<p>Another older piece. I still love it tho.</p><p>The Niffler’s a proud papa. He’s distracting Newt so his babies can steal all the shiny things XD</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "pan-tastique",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#334a8b",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#0b0f29",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182999093161"
                },
                "content_raw": "<p>Another older piece. I still love it tho.</p><p>The Niffler’s a proud papa. He’s distracting Newt so his babies can steal all the shiny things XD</p>",
                "content": "<p>Another older piece. I still love it tho.</p><p>The Niffler&rsquo;s a proud papa. He&rsquo;s distracting Newt so his babies can steal all the shiny things XD</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://pan-tastique.tumblr.com/image/182999093161",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/48464db75b59ed21b482953ff75f2591/tumblr_pndj7yN7oW1y7przoo1_1280.png",
                    "width": 1280,
                    "height": 1172
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/48464db75b59ed21b482953ff75f2591/tumblr_pndj7yN7oW1y7przoo1_1280.png",
                        "width": 1280,
                        "height": 1172
                    },
                    {
                        "url": "https://66.media.tumblr.com/48464db75b59ed21b482953ff75f2591/tumblr_pndj7yN7oW1y7przoo1_640.png",
                        "width": 640,
                        "height": 586
                    },
                    {
                        "url": "https://66.media.tumblr.com/48464db75b59ed21b482953ff75f2591/tumblr_pndj7yN7oW1y7przoo1_540.png",
                        "width": 540,
                        "height": 495
                    },
                    {
                        "url": "https://66.media.tumblr.com/48464db75b59ed21b482953ff75f2591/tumblr_pndj7yN7oW1y7przoo1_500.png",
                        "width": 500,
                        "height": 458
                    },
                    {
                        "url": "https://66.media.tumblr.com/48464db75b59ed21b482953ff75f2591/tumblr_pndj7yN7oW1y7przoo1_400.png",
                        "width": 400,
                        "height": 366
                    },
                    {
                        "url": "https://66.media.tumblr.com/48464db75b59ed21b482953ff75f2591/tumblr_pndj7yN7oW1y7przoo1_250.png",
                        "width": 250,
                        "height": 229
                    },
                    {
                        "url": "https://66.media.tumblr.com/48464db75b59ed21b482953ff75f2591/tumblr_pndj7yN7oW1y7przoo1_100.png",
                        "width": 100,
                        "height": 92
                    },
                    {
                        "url": "https://66.media.tumblr.com/48464db75b59ed21b482953ff75f2591/tumblr_pndj7yN7oW1y7przoo1_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "dracopotterisgay",
        "blog": {
            "name": "dracopotterisgay",
            "title": "Dracopotter",
            "description": "<p>A lot of Harry Potter / Gayness </p>",
            "url": "https://dracopotterisgay.tumblr.com/",
            "uuid": "t:nEwXaMvkgkX-WuDGl7zDVA",
            "updated": 1557867216
        },
        "id": 182999084782,
        "post_url": "https://dracopotterisgay.tumblr.com/post/182999084782/harry-why-do-you-always-have-to-be-so-tall",
        "slug": "harry-why-do-you-always-have-to-be-so-tall",
        "date": "2019-02-23 10:15:27 GMT",
        "timestamp": 1550916927,
        "state": "published",
        "format": "html",
        "reblog_key": "yJd5uObZ",
        "tags": [
            "drarry",
            "harry x draco",
            "draco malfoy",
            "harry potter"
        ],
        "short_url": "https://tmblr.co/ZNM-De2gRc6xk",
        "summary": "Harry: Why do you always have to be so tall? \nDraco: Would you prefer me on my knees, Potter. \nHarry: what?\nDraco: what?",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 57,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Harry:</b> Why do you always have to be so tall? </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b><b>Draco:</b></b> Would you prefer me on my knees, Potter. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Harry:</b> what?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Draco:</b> what?</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Harry:</b> Why do you always have to be so tall? </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b><b>Draco:</b></b> Would you prefer me on my knees, Potter. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Harry:</b> what?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Draco:</b> what?</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "dracopotterisgay",
                    "active": true,
                    "theme": {
                        "header_full_width": 719,
                        "header_full_height": 1280,
                        "header_focus_width": 719,
                        "header_focus_height": 404,
                        "avatar_shape": "square",
                        "background_color": "#D9C8E4",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "355,719,759,0",
                        "header_image": "https://static.tumblr.com/f529cbefdc9f1fe5aa9d36734a9ff3c5/djil5ch/6cipm23z8/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/231a08db365dd3cfb9fa99af2221a45b/djil5ch/ScEpm23zd/tumblr_static_tumblr_static__focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/f529cbefdc9f1fe5aa9d36734a9ff3c5/djil5ch/6cipm23z8/tumblr_static__2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#3A7091",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Alternate Gothic",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182999084782"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Harry:</b> Why do you always have to be so tall? </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b><b>Draco:</b></b> Would you prefer me on my knees, Potter. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Harry:</b> what?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Draco:</b> what?</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Harry:</b> Why do you always have to be so tall? </p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b><b>Draco:</b></b> Would you prefer me on my knees, Potter. </p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Harry:</b> what?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Draco:</b> what?</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "booigi-boi",
        "blog": {
            "name": "booigi-boi",
            "title": "Guess I'm a Rarry blog now",
            "description": "|| Viivi | Hufflepuff | 18 | Finnish || Multifandom (Mostly Harry Potter and StarKid). I draw and reblog memes. That's it. This blog is also super anti Drarry and Dramione so you've been warned. Art tag is #my art",
            "url": "https://booigi-boi.tumblr.com/",
            "uuid": "t:AhfZOoDjWSHdRo_bWvBbww",
            "updated": 1558419245
        },
        "id": 182999058843,
        "post_url": "https://booigi-boi.tumblr.com/post/182999058843/new-drawing-tablet-means-pics-of-ron-long-hair",
        "slug": "new-drawing-tablet-means-pics-of-ron-long-hair",
        "date": "2019-02-23 10:12:45 GMT",
        "timestamp": 1550916765,
        "state": "published",
        "format": "html",
        "reblog_key": "9Z8qpShb",
        "tags": [
            "Harry Potter",
            "harry potter art",
            "Ron Weasley",
            "ron weasley art",
            "harry potter fan art",
            "fan art",
            "art post",
            "my art",
            "art",
            "digital art",
            "digital"
        ],
        "short_url": "https://tmblr.co/ZLcxUh2gRc0cR",
        "summary": "New drawing tablet means pics of Ron long hair suits him, shush",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 131,
        "caption": "<p>New drawing tablet means pics of Ron</p><p><strike>long hair suits him, shush</strike></p>",
        "reblog": {
            "comment": "<p>New drawing tablet means pics of Ron</p><p><strike>long hair suits him, shush</strike></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "booigi-boi",
                    "active": true,
                    "theme": {
                        "header_full_width": 1096,
                        "header_full_height": 1460,
                        "header_focus_width": 1096,
                        "header_focus_height": 617,
                        "avatar_shape": "square",
                        "background_color": "#03020b",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "230,1096,847,0",
                        "header_image": "https://static.tumblr.com/2a61c23a7669cd52d8e685c1c1616e2e/ww1jcqs/x8qpqmsbn/tumblr_static_3bpkibamq8e8gw8w0k4s4sco4.png",
                        "header_image_focused": "https://static.tumblr.com/587e82fa8e71132e1dc97fa9cc57552e/ww1jcqs/SSgproyqw/tumblr_static_tumblr_static_3bpkibamq8e8gw8w0k4s4sco4_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/2a61c23a7669cd52d8e685c1c1616e2e/ww1jcqs/x8qpqmsbn/tumblr_static_3bpkibamq8e8gw8w0k4s4sco4_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#344571",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#344571",
                        "title_font": "Clarendon Text Pro",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182999058843"
                },
                "content_raw": "<p>New drawing tablet means pics of Ron</p><p><strike>long hair suits him, shush</strike></p>",
                "content": "<p>New drawing tablet means pics of Ron</p><p><strike>long hair suits him, shush</strike></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "2",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/3edf69d8d98bd5067525ffa03b31d042/tumblr_pndj19p0m31vq0idso1_1280.png",
                    "width": 1280,
                    "height": 1443
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/3edf69d8d98bd5067525ffa03b31d042/tumblr_pndj19p0m31vq0idso1_1280.png",
                        "width": 1280,
                        "height": 1443
                    },
                    {
                        "url": "https://66.media.tumblr.com/3edf69d8d98bd5067525ffa03b31d042/tumblr_pndj19p0m31vq0idso1_640.png",
                        "width": 640,
                        "height": 721
                    },
                    {
                        "url": "https://66.media.tumblr.com/3edf69d8d98bd5067525ffa03b31d042/tumblr_pndj19p0m31vq0idso1_540.png",
                        "width": 540,
                        "height": 609
                    },
                    {
                        "url": "https://66.media.tumblr.com/3edf69d8d98bd5067525ffa03b31d042/tumblr_pndj19p0m31vq0idso1_500.png",
                        "width": 500,
                        "height": 564
                    },
                    {
                        "url": "https://66.media.tumblr.com/3edf69d8d98bd5067525ffa03b31d042/tumblr_pndj19p0m31vq0idso1_400.png",
                        "width": 400,
                        "height": 451
                    },
                    {
                        "url": "https://66.media.tumblr.com/3edf69d8d98bd5067525ffa03b31d042/tumblr_pndj19p0m31vq0idso1_250.png",
                        "width": 250,
                        "height": 282
                    },
                    {
                        "url": "https://66.media.tumblr.com/3edf69d8d98bd5067525ffa03b31d042/tumblr_pndj19p0m31vq0idso1_100.png",
                        "width": 100,
                        "height": 113
                    },
                    {
                        "url": "https://66.media.tumblr.com/3edf69d8d98bd5067525ffa03b31d042/tumblr_pndj19p0m31vq0idso1_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/31fd89645600cb530ebe9b8ccec25d55/tumblr_pndj19p0m31vq0idso2_1280.png",
                    "width": 1280,
                    "height": 1621
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/31fd89645600cb530ebe9b8ccec25d55/tumblr_pndj19p0m31vq0idso2_1280.png",
                        "width": 1280,
                        "height": 1621
                    },
                    {
                        "url": "https://66.media.tumblr.com/31fd89645600cb530ebe9b8ccec25d55/tumblr_pndj19p0m31vq0idso2_640.png",
                        "width": 640,
                        "height": 811
                    },
                    {
                        "url": "https://66.media.tumblr.com/31fd89645600cb530ebe9b8ccec25d55/tumblr_pndj19p0m31vq0idso2_540.png",
                        "width": 540,
                        "height": 684
                    },
                    {
                        "url": "https://66.media.tumblr.com/31fd89645600cb530ebe9b8ccec25d55/tumblr_pndj19p0m31vq0idso2_500.png",
                        "width": 500,
                        "height": 633
                    },
                    {
                        "url": "https://66.media.tumblr.com/31fd89645600cb530ebe9b8ccec25d55/tumblr_pndj19p0m31vq0idso2_400.png",
                        "width": 400,
                        "height": 507
                    },
                    {
                        "url": "https://66.media.tumblr.com/31fd89645600cb530ebe9b8ccec25d55/tumblr_pndj19p0m31vq0idso2_250.png",
                        "width": 250,
                        "height": 317
                    },
                    {
                        "url": "https://66.media.tumblr.com/31fd89645600cb530ebe9b8ccec25d55/tumblr_pndj19p0m31vq0idso2_100.png",
                        "width": 100,
                        "height": 127
                    },
                    {
                        "url": "https://66.media.tumblr.com/31fd89645600cb530ebe9b8ccec25d55/tumblr_pndj19p0m31vq0idso2_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "gouttenoire",
        "blog": {
            "name": "gouttenoire",
            "title": "Gouttenoire",
            "description": "French Tattoo Artist - Tours (France) also look at : instagram.com/gouttenoire & facebook.com/lagouttenoire",
            "url": "https://gouttenoire.tumblr.com/",
            "uuid": "t:TNc0q59qVUZMngqyMRWYJA",
            "updated": 1553069540
        },
        "id": 182998976619,
        "post_url": "https://gouttenoire.tumblr.com/post/182998976619/new-flash-harry-potter-pour-r%C3%A9server-un-motif",
        "slug": "new-flash-harry-potter-pour-réserver-un-motif",
        "date": "2019-02-23 10:03:55 GMT",
        "timestamp": 1550916235,
        "state": "published",
        "format": "html",
        "reblog_key": "hmLPjAqz",
        "tags": [
            "tattoo",
            "tattoo design",
            "tattoo artist",
            "harry potter",
            "flash tattoo",
            "dotwork",
            "blackwork"
        ],
        "short_url": "https://tmblr.co/Znbkok2gRbiXh",
        "summary": "New flash ; Harry Potter  Pour réserver un motif : gouttenoireink@gmail.com",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "post_author": "noire-chambre",
        "liked": false,
        "note_count": 25,
        "caption": "<p>New flash ; Harry Potter </p><p>Pour réserver un motif : gouttenoireink@gmail.com</p>",
        "reblog": {
            "comment": "<p>New flash ; Harry Potter </p><p>Pour réserver un motif : gouttenoireink@gmail.com</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "gouttenoire",
                    "active": true,
                    "theme": {
                        "header_full_width": 1200,
                        "header_full_height": 448,
                        "header_focus_width": 797,
                        "header_focus_height": 448,
                        "avatar_shape": "circle",
                        "background_color": "#EEEEEE",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,998,448,201",
                        "header_image": "https://static.tumblr.com/f6aa4c97ac94af711ec658ef677d53f6/mlhty6o/q1zp69fvd/tumblr_static_3w3oaszkas4kogkkw0408k8w4.jpg",
                        "header_image_focused": "https://static.tumblr.com/f6aa4c97ac94af711ec658ef677d53f6/mlhty6o/aP8p69fve/tumblr_static_tumblr_static_3w3oaszkas4kogkkw0408k8w4_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f6aa4c97ac94af711ec658ef677d53f6/mlhty6o/q1zp69fvd/tumblr_static_3w3oaszkas4kogkkw0408k8w4_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#888888",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998976619"
                },
                "content_raw": "<p>New flash ; Harry Potter </p><p>Pour réserver un motif : gouttenoireink@gmail.com</p>",
                "content": "<p>New flash ; Harry Potter&nbsp;</p><p>Pour r&eacute;server un motif : gouttenoireink@gmail.com</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "11",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/581b7af3adc43bde511f4b9511dc75b0/tumblr_pndimjs5qr1usli9ao1_500.jpg",
                    "width": 500,
                    "height": 500
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/581b7af3adc43bde511f4b9511dc75b0/tumblr_pndimjs5qr1usli9ao1_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/581b7af3adc43bde511f4b9511dc75b0/tumblr_pndimjs5qr1usli9ao1_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/581b7af3adc43bde511f4b9511dc75b0/tumblr_pndimjs5qr1usli9ao1_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/581b7af3adc43bde511f4b9511dc75b0/tumblr_pndimjs5qr1usli9ao1_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/581b7af3adc43bde511f4b9511dc75b0/tumblr_pndimjs5qr1usli9ao1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/c5e912adf2fba7099ebd5130d5c7b56c/tumblr_pndimjs5qr1usli9ao2_500.jpg",
                    "width": 500,
                    "height": 500
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/c5e912adf2fba7099ebd5130d5c7b56c/tumblr_pndimjs5qr1usli9ao2_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/c5e912adf2fba7099ebd5130d5c7b56c/tumblr_pndimjs5qr1usli9ao2_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/c5e912adf2fba7099ebd5130d5c7b56c/tumblr_pndimjs5qr1usli9ao2_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/c5e912adf2fba7099ebd5130d5c7b56c/tumblr_pndimjs5qr1usli9ao2_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/c5e912adf2fba7099ebd5130d5c7b56c/tumblr_pndimjs5qr1usli9ao2_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "iamaseaangel",
        "blog": {
            "name": "iamaseaangel",
            "title": "McLara",
            "description": "",
            "url": "https://iamaseaangel.tumblr.com/",
            "uuid": "t:SXKMDeCC54nynJFrgM7P8Q",
            "updated": 1553340521
        },
        "id": 182998838393,
        "post_url": "https://iamaseaangel.tumblr.com/post/182998838393/lily-evans-i-did-not-expect-to-finish-this-in-a",
        "slug": "lily-evans-i-did-not-expect-to-finish-this-in-a",
        "date": "2019-02-23 09:50:01 GMT",
        "timestamp": 1550915401,
        "state": "published",
        "format": "html",
        "reblog_key": "f6NR0uwa",
        "tags": [
            "Charcoal",
            "Harry Potter",
            "Art",
            "Lily Evans"
        ],
        "short_url": "https://tmblr.co/ZIk8xf2gRbAnv",
        "summary": "Lily Evans ~ I did not expect to finish this in a day! Powdered charcoal on paper - 2019 :) @asktheboywholived @vagueenthusiast",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 7,
        "caption": "<p>Lily Evans ~ I did <b>not</b> expect to finish this in a day!</p><hr><p><i>Powdered charcoal on paper - 2019 :)</i></p><p><a href=\"https://tmblr.co/m1tVtLlaQp0CbwQXMa0F1GA\">@asktheboywholived</a> <a href=\"https://tmblr.co/m7KUJZElexZa_xAQS9zpfBg\">@vagueenthusiast</a></p>",
        "reblog": {
            "comment": "<p>Lily Evans ~ I did <b>not</b> expect to finish this in a day!</p><hr><p><i>Powdered charcoal on paper - 2019 :)</i></p><p><a href=\"https://tmblr.co/m1tVtLlaQp0CbwQXMa0F1GA\">@asktheboywholived</a> <a href=\"https://tmblr.co/m7KUJZElexZa_xAQS9zpfBg\">@vagueenthusiast</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "iamaseaangel",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 720,
                        "header_focus_width": 1155,
                        "header_focus_height": 649,
                        "avatar_shape": "square",
                        "background_color": "#E2D2B2",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "71,1224,720,69",
                        "header_image": "https://static.tumblr.com/a4cca7011dbeb511d35fe020fbf6f45e/qrzbju1/BMqp7s8dr/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/a4cca7011dbeb511d35fe020fbf6f45e/qrzbju1/X7jp7s8dt/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/a4cca7011dbeb511d35fe020fbf6f45e/qrzbju1/BMqp7s8dr/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#AC6D2A",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998838393"
                },
                "content_raw": "<p>Lily Evans ~ I did <b>not</b> expect to finish this in a day!</p><hr><p><i>Powdered charcoal on paper - 2019 :)</i></p><p><a href=\"https://tmblr.co/m1tVtLlaQp0CbwQXMa0F1GA\">@asktheboywholived</a> <a href=\"https://tmblr.co/m7KUJZElexZa_xAQS9zpfBg\">@vagueenthusiast</a></p>",
                "content": "<p>Lily Evans ~ I did <b>not</b> expect to finish this in a day!</p><hr /><p><i>Powdered charcoal on paper - 2019 :)</i></p><p><a href=\"https://tmblr.co/m1tVtLlaQp0CbwQXMa0F1GA\">@asktheboywholived</a> <a href=\"https://tmblr.co/m7KUJZElexZa_xAQS9zpfBg\">@vagueenthusiast</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "11",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/8d6400c6283c86a8f900459ddbd158d6/tumblr_pndhzdiHYL1vfyyrlo1_1280.jpg",
                    "width": 720,
                    "height": 1280
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/8d6400c6283c86a8f900459ddbd158d6/tumblr_pndhzdiHYL1vfyyrlo1_1280.jpg",
                        "width": 720,
                        "height": 1280
                    },
                    {
                        "url": "https://66.media.tumblr.com/8d6400c6283c86a8f900459ddbd158d6/tumblr_pndhzdiHYL1vfyyrlo1_640.jpg",
                        "width": 540,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/8d6400c6283c86a8f900459ddbd158d6/tumblr_pndhzdiHYL1vfyyrlo1_540.jpg",
                        "width": 456,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/8d6400c6283c86a8f900459ddbd158d6/tumblr_pndhzdiHYL1vfyyrlo1_500.jpg",
                        "width": 422,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/8d6400c6283c86a8f900459ddbd158d6/tumblr_pndhzdiHYL1vfyyrlo1_400.jpg",
                        "width": 338,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/8d6400c6283c86a8f900459ddbd158d6/tumblr_pndhzdiHYL1vfyyrlo1_250.jpg",
                        "width": 225,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/8d6400c6283c86a8f900459ddbd158d6/tumblr_pndhzdiHYL1vfyyrlo1_100.jpg",
                        "width": 100,
                        "height": 178
                    },
                    {
                        "url": "https://66.media.tumblr.com/8d6400c6283c86a8f900459ddbd158d6/tumblr_pndhzdiHYL1vfyyrlo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/723821090f84d7cc0c8a9b3636af76f1/tumblr_pndhzdiHYL1vfyyrlo2_640.jpg",
                    "width": 561,
                    "height": 750
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/723821090f84d7cc0c8a9b3636af76f1/tumblr_pndhzdiHYL1vfyyrlo2_640.jpg",
                        "width": 561,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/723821090f84d7cc0c8a9b3636af76f1/tumblr_pndhzdiHYL1vfyyrlo2_540.jpg",
                        "width": 540,
                        "height": 722
                    },
                    {
                        "url": "https://66.media.tumblr.com/723821090f84d7cc0c8a9b3636af76f1/tumblr_pndhzdiHYL1vfyyrlo2_500.jpg",
                        "width": 500,
                        "height": 668
                    },
                    {
                        "url": "https://66.media.tumblr.com/723821090f84d7cc0c8a9b3636af76f1/tumblr_pndhzdiHYL1vfyyrlo2_400.jpg",
                        "width": 400,
                        "height": 535
                    },
                    {
                        "url": "https://66.media.tumblr.com/723821090f84d7cc0c8a9b3636af76f1/tumblr_pndhzdiHYL1vfyyrlo2_250.jpg",
                        "width": 250,
                        "height": 334
                    },
                    {
                        "url": "https://66.media.tumblr.com/723821090f84d7cc0c8a9b3636af76f1/tumblr_pndhzdiHYL1vfyyrlo2_100.jpg",
                        "width": 100,
                        "height": 134
                    },
                    {
                        "url": "https://66.media.tumblr.com/723821090f84d7cc0c8a9b3636af76f1/tumblr_pndhzdiHYL1vfyyrlo2_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "notrealraju",
        "blog": {
            "name": "notrealraju",
            "title": "RJ__TheGamer",
            "description": "",
            "url": "https://notrealraju.tumblr.com/",
            "uuid": "t:D1F5_j4PGiR-ta_I6xYcaA",
            "updated": 1553273519
        },
        "id": 182998825415,
        "post_url": "https://notrealraju.tumblr.com/post/182998825415",
        "slug": "",
        "date": "2019-02-23 09:48:22 GMT",
        "timestamp": 1550915302,
        "state": "published",
        "format": "html",
        "reblog_key": "QnQNFPSV",
        "tags": [
            "Harry Potter",
            "funny",
            "cat"
        ],
        "short_url": "https://tmblr.co/Znm9zY2gRb7d7",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/5c3af81db06e826c6460f2ef9776f1cb/tumblr_pndhwmUUdy1w6g7zj_1280.png\" data-orig-height=\"1280\" data-orig-width=\"720\"/></figure>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/5c3af81db06e826c6460f2ef9776f1cb/tumblr_pndhwmUUdy1w6g7zj_1280.png\" data-orig-height=\"1280\" data-orig-width=\"720\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "notrealraju",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/e368cf4c89a0183eef09731e8108ccc4/lzddzjm/DBWpde772/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/e368cf4c89a0183eef09731e8108ccc4/lzddzjm/DBWpde772/tumblr_static_filename.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e368cf4c89a0183eef09731e8108ccc4/lzddzjm/DBWpde772/tumblr_static_filename.jpg",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998825415"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/5c3af81db06e826c6460f2ef9776f1cb/tumblr_pndhwmUUdy1w6g7zj_1280.png\" data-orig-height=\"1280\" data-orig-width=\"720\"></figure></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/5c3af81db06e826c6460f2ef9776f1cb/tumblr_pndhwmUUdy1w6g7zj_1280.png\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "theysaidtheseathogwartsprobably",
        "blog": {
            "name": "theysaidtheseathogwartsprobably",
            "title": "Things They Probably Said at Hogwarts",
            "description": "Definitely canon",
            "url": "https://theysaidtheseathogwartsprobably.tumblr.com/",
            "uuid": "t:F44fwJQ8B3bps30bc75I7w",
            "updated": 1557110624
        },
        "id": 182998810318,
        "post_url": "https://theysaidtheseathogwartsprobably.tumblr.com/post/182998810318/albus-dumbledore-standing-in-front-of-the-mirror",
        "slug": "albus-dumbledore-standing-in-front-of-the-mirror",
        "date": "2019-02-23 09:47:15 GMT",
        "timestamp": 1550915235,
        "state": "published",
        "format": "html",
        "reblog_key": "WsvVz5vG",
        "tags": [
            "incorrect harry potter quotes",
            "albus dumbledore",
            "harry potter",
            "source: tangled"
        ],
        "short_url": "https://tmblr.co/ZLYHqc2gRb3xE",
        "summary": "Albus Dumbledore: [standing in front of the Mirror of Erised with Harry] you know what I see?\nAlbus Dumbledore: I see a brave,...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 413,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Albus Dumbledore:</b> [standing in front of the Mirror of Erised with Harry] you know what I see?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Albus Dumbledore:</b> I see a brave, handsome, and intelligent young man.</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Harry Potter:</b> :)</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><br/></p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Albus Dumbledore:</b> Oh look! You’re here too!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Harry Potter:</b> </p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Albus Dumbledore:</b> [standing in front of the Mirror of Erised with Harry] you know what I see?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Albus Dumbledore:</b> I see a brave, handsome, and intelligent young man.</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Harry Potter:</b> :)</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><br></p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Albus Dumbledore:</b> Oh look! You’re here too!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Harry Potter:</b> </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "theysaidtheseathogwartsprobably",
                    "active": true,
                    "theme": {
                        "header_full_width": 625,
                        "header_full_height": 415,
                        "header_focus_width": 535,
                        "header_focus_height": 301,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,564,301,29",
                        "header_image": "https://static.tumblr.com/93768372cff7de466e0dfea9cb94f154/ghxbxml/FEfpq0yhj/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/87ff7ad352ff1ebc71aab75c6f885888/ghxbxml/h6wpq0yhk/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/93768372cff7de466e0dfea9cb94f154/ghxbxml/FEfpq0yhj/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#B4D5E9",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#558BD9",
                        "title_font": "Typewriter FS",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998810318"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Albus Dumbledore:</b> [standing in front of the Mirror of Erised with Harry] you know what I see?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Albus Dumbledore:</b> I see a brave, handsome, and intelligent young man.</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Harry Potter:</b> :)</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><br></p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Albus Dumbledore:</b> Oh look! You’re here too!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Harry Potter:</b> </p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Albus Dumbledore:</b> [standing in front of the Mirror of Erised with Harry] you know what I see?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Albus Dumbledore:</b> I see a brave, handsome, and intelligent young man.</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Harry Potter:</b> :)</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><br /></p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Albus Dumbledore:</b> Oh look! You&rsquo;re here too!</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Harry Potter:</b> </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "lovely-lesbian-luna",
        "blog": {
            "name": "lovely-lesbian-luna",
            "title": "All Your Faves are Gay",
            "description": "Sammy | he/they | nb lesbian | 18 | 🏴󠁧󠁢󠁷󠁬󠁳󠁿 | icon by @ahfuckforgottobestraight",
            "url": "https://lovely-lesbian-luna.tumblr.com/",
            "uuid": "t:amsPI80c5pXHPv3jFDq3hA",
            "updated": 1558432834
        },
        "id": 182998794562,
        "post_url": "https://lovely-lesbian-luna.tumblr.com/post/182998794562/hp-but-ron-realises-hes-jealous-of-hermione-at",
        "slug": "hp-but-ron-realises-hes-jealous-of-hermione-at",
        "date": "2019-02-23 09:45:23 GMT",
        "timestamp": 1550915123,
        "state": "published",
        "format": "html",
        "reblog_key": "dsW1qLEF",
        "tags": [
            "then they bond over their gay crushes and help each other get with the preosn they like",
            "Harry Potter",
            "Ron Weasley",
            "Hermione Granger"
        ],
        "short_url": "https://tmblr.co/ZSFKHh2gRb052",
        "summary": "hp but Ron realises he’s jealous of Hermione at the yule ball because she got to go with Krum, and Hermione realises she’s...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 19,
        "title": null,
        "body": "<p>hp but Ron realises he’s jealous of Hermione at the yule ball because she got to go with Krum, and Hermione realises she’s jealous of Ron dating Lavender, not the other way around</p>",
        "reblog": {
            "comment": "<p>hp but Ron realises he’s jealous of Hermione at the yule ball because she got to go with Krum, and Hermione realises she’s jealous of Ron dating Lavender, not the other way around</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "lovely-lesbian-luna",
                    "active": true,
                    "theme": {
                        "header_full_width": 564,
                        "header_full_height": 564,
                        "header_focus_width": 564,
                        "header_focus_height": 317,
                        "avatar_shape": "square",
                        "background_color": "#dcecf5",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "123,564,440,0",
                        "header_image": "https://static.tumblr.com/eda6910922e8f1475234d0ef12516b8c/4sivnmo/A9doxi28y/tumblr_static_551t3vw0hhc04gw448okowccw.jpg",
                        "header_image_focused": "https://static.tumblr.com/eda6910922e8f1475234d0ef12516b8c/4sivnmo/QWCpm04l0/tumblr_static_tumblr_static_551t3vw0hhc04gw448okowccw_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_01_focused_v3.png?_v=f67ca5ac5d1c4a0526964674cb5a0605",
                        "header_stretch": true,
                        "link_color": "#dccbe7",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#97c5e0",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998794562"
                },
                "content_raw": "<p>hp but Ron realises he’s jealous of Hermione at the yule ball because she got to go with Krum, and Hermione realises she’s jealous of Ron dating Lavender, not the other way around</p>",
                "content": "<p>hp but Ron realises he&rsquo;s jealous of Hermione at the yule ball because she got to go with Krum, and&nbsp;Hermione realises she&rsquo;s jealous of Ron dating Lavender, not the other way around</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "chat",
        "blog_name": "accio-shitpost",
        "blog": {
            "name": "accio-shitpost",
            "title": "shitpost managed",
            "description": "<a href=\"http://accio-shitpost.tumblr.com/about\">FAQ</a><br><br>\nunforgivably cursing you with our existence since 1965<br><br>\n as seen in Bo Burnham's Eighth Grade, apparently<br><br>\n we have a Discord server! join <a href=\"https://discord.gg/TsbbrgF\">here</a>! (15+ only please)<br><br>\nwe track the tag 'accioshitpost' (without a dash) so if you have art or a fic based on of one of our posts, pop it in there and we'll reblog it for you! we always appreciate your creativity!<br><br>\nyou can find our amazon wishlists <a href=\"http://amzn.eu/6qzXznM\">here</a> and <a href=\"http://amzn.eu/dU0UpF4\">here</a> - if you get us anything, we'll post a picture and a thank you note!!<br><br>\n\nif you want to follow our personal blogs, here's <a href=\"https://plaidos.tumblr.com\"/>Roxie</a>'s, here's <a href=\"https://actualypersephone.tumblr.com/\">Persephone</a>'s, and here's <a href=\"https://prnt.sc/n1za84\">Jamie</a>'s<br><br>\n\nnazis, terfs, pedos, and anybody happy to defend or stand by them can leave. we don't want you. avada kedavra, shithead.<br><br>\n\nnow in blue raspberry flavours, hitting stores soon!",
            "url": "https://accio-shitpost.tumblr.com/",
            "uuid": "t:_Qi6Z6oN79BNipNA2ZT0dg",
            "updated": 1558433547
        },
        "id": 182998704289,
        "post_url": "https://accio-shitpost.tumblr.com/post/182998704289/reasonable-fans-film-1-it-doesnt-really-matter",
        "slug": "reasonable-fans-film-1-it-doesnt-really-matter",
        "date": "2019-02-23 09:36:23 GMT",
        "timestamp": 1550914583,
        "state": "published",
        "format": "html",
        "reblog_key": "ajhfni9h",
        "tags": [
            "Harry Potter",
            "Lily Evans",
            "Lily Potter",
            "Harry Potter series"
        ],
        "short_url": "https://tmblr.co/ZoAu2k2gRag2X",
        "summary": "reasonable fans, film 1: it doesn't really matter that daniel radcliffe has blue eyes. i mean, i'd like to see green-eyed harry,...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1525,
        "title": null,
        "body": "reasonable fans, film 1: it doesn't really matter that daniel radcliffe has blue eyes. i mean, i'd like to see green-eyed harry, but i get that they don't want to make a kid wear contacts for that long. besides, what really matters is that he has his mother's eyes, not the colour.\nreasonable fans, film 6: oh COME ON",
        "dialogue": [
            {
                "name": "reasonable fans, film 1",
                "label": "reasonable fans, film 1:",
                "phrase": "it doesn't really matter that daniel radcliffe has blue eyes. i mean, i'd like to see green-eyed harry, but i get that they don't want to make a kid wear contacts for that long. besides, what really matters is that he has his mother's eyes, not the colour."
            },
            {
                "name": "reasonable fans, film 6",
                "label": "reasonable fans, film 6:",
                "phrase": "oh COME ON"
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "sunflower-blogs",
        "blog": {
            "name": "sunflower-blogs",
            "title": "Suns",
            "description": "flower",
            "url": "https://sunflower-blogs.tumblr.com/",
            "uuid": "t:11zrMT1DSQs8WxEYcnleTw",
            "updated": 1558365282
        },
        "id": 182998698038,
        "post_url": "https://sunflower-blogs.tumblr.com/post/182998698038/a-small-drarry-trip-to-ny-draco-crossing-the",
        "slug": "a-small-drarry-trip-to-ny-draco-crossing-the",
        "date": "2019-02-23 09:35:40 GMT",
        "timestamp": 1550914540,
        "state": "published",
        "format": "html",
        "reblog_key": "vYT7zhNq",
        "tags": [
            "draco malfoy",
            "incorrect drarry quotes",
            "harry x draco",
            "drarry",
            "harry potter"
        ],
        "short_url": "https://tmblr.co/ZfRi9Y2gRaeWs",
        "summary": "A small drarry trip to NY\nDraco: *crossing the street with Harry when a taxi almost hits him* \"Watch it! I'm walking...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 118,
        "title": null,
        "body": "<p>A small drarry trip to NY</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>Draco: *crossing the street with Harry when a taxi almost hits him* &ldquo;Watch it! I&rsquo;m walking here!&rdquo;</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>Harry: *having seen too many muggles movies* &ldquo;did u just-&rdquo;</p>",
        "reblog": {
            "comment": "<p>A small drarry trip to NY</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>Draco: *crossing the street with Harry when a taxi almost hits him* “Watch it! I’m walking here!”</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>Harry: *having seen too many muggles movies* “did u just-”</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "sunflower-blogs",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/bdc9995496671daa581acc231a7076b3/coq041t/v6xplwvct/tumblr_static_-517481460-content.png",
                        "header_image_focused": "https://static.tumblr.com/bdc9995496671daa581acc231a7076b3/coq041t/v6xplwvct/tumblr_static_-517481460-content_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/bdc9995496671daa581acc231a7076b3/coq041t/v6xplwvct/tumblr_static_-517481460-content_2048_v2.png",
                        "header_stretch": false,
                        "link_color": "#C09DB4",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998698038"
                },
                "content_raw": "<p>A small drarry trip to NY</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>Draco: *crossing the street with Harry when a taxi almost hits him* “Watch it! I’m walking here!”</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>Harry: *having seen too many muggles movies* “did u just-”</p>",
                "content": "<p>A small drarry trip to NY</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\">Draco: *crossing the street with Harry when a taxi almost hits him* &ldquo;Watch it! I&rsquo;m walking here!&rdquo;</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\">Harry: *having seen too many muggles movies* &ldquo;did u just-&rdquo;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "studywiththisgirl",
        "blog": {
            "name": "studywiththisgirl",
            "title": "Just studying on my own",
            "description": "<p>Sideblog</p>",
            "url": "https://studywiththisgirl.tumblr.com/",
            "uuid": "t:9zn3yVUyxzz2BJpMpSOpIw",
            "updated": 1558427143
        },
        "id": 182998693891,
        "post_url": "https://studywiththisgirl.tumblr.com/post/182998693891/you-fail-to-recognize-that-it-matters-not-what",
        "slug": "you-fail-to-recognize-that-it-matters-not-what",
        "date": "2019-02-23 09:35:35 GMT",
        "timestamp": 1550914535,
        "state": "published",
        "format": "html",
        "reblog_key": "zX3OBTRf",
        "tags": [
            "harry potter",
            "fire of goblet",
            "studyblr",
            "studywiththisgirl"
        ],
        "short_url": "https://tmblr.co/Zc4a2Z2gRadW3",
        "summary": "“You fail to recognize that it matters not what someone is born, but what they grow to be!”",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 5,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"960\"><img src=\"https://66.media.tumblr.com/4afc3a0fc5addaa6dd0d8aea405119f0/tumblr_pndhbaidGg1t7nqgu_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"960\"/></figure><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>“You fail to recognize that it matters not what someone is born, but what they grow to be!” </p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"960\"><img src=\"https://66.media.tumblr.com/4afc3a0fc5addaa6dd0d8aea405119f0/tumblr_pndhbaidGg1t7nqgu_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"960\"></figure><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>“You fail to recognize that it matters not what someone is born, but what they grow to be!” </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "studywiththisgirl",
                    "active": true,
                    "theme": {
                        "header_full_width": 719,
                        "header_full_height": 1280,
                        "header_focus_width": 615,
                        "header_focus_height": 346,
                        "avatar_shape": "circle",
                        "background_color": "#B55354",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "468,667,814,52",
                        "header_image": "https://static.tumblr.com/737e7c404c48ae0257f91fa88857c2f8/nmyklii/u2Qpilhf6/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/737e7c404c48ae0257f91fa88857c2f8/nmyklii/xYZpilhf8/tumblr_static_tumblr_static__focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/737e7c404c48ae0257f91fa88857c2f8/nmyklii/u2Qpilhf6/tumblr_static__2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#EEBAAF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Square Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998693891"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"960\"><img src=\"https://66.media.tumblr.com/4afc3a0fc5addaa6dd0d8aea405119f0/tumblr_pndhbaidGg1t7nqgu_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"960\"></figure><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>“You fail to recognize that it matters not what someone is born, but what they grow to be!” </p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4afc3a0fc5addaa6dd0d8aea405119f0/tumblr_pndhbaidGg1t7nqgu_540.jpg\" class=\"\"/></figure><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\">&ldquo;You fail to recognize that it matters not what someone is born, but what they grow to be!&rdquo; </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "the-ninjago-to-hogwarts",
        "blog": {
            "name": "the-ninjago-to-hogwarts",
            "title": "A Ninjago/Hogwarts Ask Blog",
            "description": "The au in which the ninja are actually hogwarts students. Ask them anything you want!",
            "url": "https://the-ninjago-to-hogwarts.tumblr.com/",
            "uuid": "t:NtoRCYrH9ALA2BlMp0T8ng",
            "updated": 1551431164
        },
        "id": 182998694255,
        "post_url": "https://the-ninjago-to-hogwarts.tumblr.com/post/182998694255/hey-first-off-your-art-is-amazing-secondly",
        "slug": "hey-first-off-your-art-is-amazing-secondly",
        "date": "2019-02-23 09:35:13 GMT",
        "timestamp": 1550914513,
        "state": "published",
        "format": "html",
        "reblog_key": "gexWfRZl",
        "tags": [
            "ninjago",
            "ninjago at hogwarts au",
            "ninjago at hogwarts lore",
            "harry potter",
            "Dilara"
        ],
        "short_url": "https://tmblr.co/Zp3isa2gRadbl",
        "summary": "Hey! First off, your art is amazing! Secondly, who's the nurse/doctor of the school?",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 23,
        "asking_name": "Anonymous",
        "asking_url": null,
        "question": "Hey! First off, your art is amazing! Secondly, who's the nurse/doctor of the school?",
        "answer": "<p>The school nurse is a ghost named Dilara who possess a lifelike mannequin to be able to treat the children without passing through them like uknow ghosts do. </p><p>(Also thank you so much squee I’m always trying to improve to give you guys the best content I can!) </p>",
        "reblog": {
            "comment": "<p>The school nurse is a ghost named Dilara who possess a lifelike mannequin to be able to treat the children without passing through them like uknow ghosts do. </p><p>(Also thank you so much squee I’m always trying to improve to give you guys the best content I can!) </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "the-ninjago-to-hogwarts",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 959,
                        "header_focus_width": 1280,
                        "header_focus_height": 720,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "119,1280,839,0",
                        "header_image": "https://static.tumblr.com/aee8021414bb5d516f7a905b2fe38725/mj3xxoc/g3Ap4orn8/tumblr_static_er8897wsa28swo088csscsssk.png",
                        "header_image_focused": "https://static.tumblr.com/aee8021414bb5d516f7a905b2fe38725/mj3xxoc/CpTp4orna/tumblr_static_tumblr_static_er8897wsa28swo088csscsssk_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/aee8021414bb5d516f7a905b2fe38725/mj3xxoc/g3Ap4orn8/tumblr_static_er8897wsa28swo088csscsssk_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998694255"
                },
                "content_raw": "<p>The school nurse is a ghost named Dilara who possess a lifelike mannequin to be able to treat the children without passing through them like uknow ghosts do. </p><p>(Also thank you so much squee I’m always trying to improve to give you guys the best content I can!) </p>",
                "content": "<p>The school nurse is a ghost named Dilara who possess a lifelike mannequin to be able to treat the children without passing through them like uknow ghosts do. </p><p>(Also thank you so much squee I&rsquo;m always trying to improve to give you guys the best content I can!) </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "you-never-know-you-know",
        "blog": {
            "name": "you-never-know-you-know",
            "title": "Yes to myself",
            "description": "",
            "url": "https://you-never-know-you-know.tumblr.com/",
            "uuid": "t:jhdYRuN0V3B0_ptn92O7aA",
            "updated": 1558418633
        },
        "id": 182998658545,
        "post_url": "https://you-never-know-you-know.tumblr.com/post/182998658545/you-were-sick-i-was-there-the-whole-night-then",
        "slug": "you-were-sick-i-was-there-the-whole-night-then",
        "date": "2019-02-23 09:31:33 GMT",
        "timestamp": 1550914293,
        "state": "published",
        "format": "html",
        "reblog_key": "DriIQ7rl",
        "tags": [
            "harry potter",
            "sick",
            "ill",
            "in bed",
            "love",
            "hihi"
        ],
        "short_url": "https://tmblr.co/Z7lEim2gRaUtn",
        "summary": "You were sick. I was there, the whole night. Then I got sick too. You read me Harry Potter without me asking for it. That was...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1,
        "title": null,
        "body": "<p>You were sick. I was there, the whole night. Then I got sick too. You read me Harry Potter without me asking for it. That was definately one of the most beautiful things you or anyone has ever done for me. hihi :)<br/></p>",
        "reblog": {
            "comment": "<p>You were sick. I was there, the whole night. Then I got sick too. You read me Harry Potter without me asking for it. That was definately one of the most beautiful things you or anyone has ever done for me. hihi :)<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "you-never-know-you-know",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#335162",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/b34ee0d3506eb1dd39ebf6c461c438a2/aqaexxn/VzZnnvn0v/tumblr_static_2lsqf3sy2cw04kkg8o0g4gw4s.jpg",
                        "header_image_focused": "https://static.tumblr.com/b34ee0d3506eb1dd39ebf6c461c438a2/aqaexxn/VzZnnvn0v/tumblr_static_2lsqf3sy2cw04kkg8o0g4gw4s_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/b34ee0d3506eb1dd39ebf6c461c438a2/aqaexxn/VzZnnvn0v/tumblr_static_2lsqf3sy2cw04kkg8o0g4gw4s_2048_v2.jpg",
                        "header_stretch": false,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Bodoni Recut FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998658545"
                },
                "content_raw": "<p>You were sick. I was there, the whole night. Then I got sick too. You read me Harry Potter without me asking for it. That was definately one of the most beautiful things you or anyone has ever done for me. hihi :)<br></p>",
                "content": "<p>You were sick. I was there, the whole night. Then I got sick too. You read me Harry Potter without me asking for it. That was definately one of the most beautiful things you or anyone has ever done for me. hihi :)<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "maybeshesnaped",
        "blog": {
            "name": "maybeshesnaped",
            "title": "𝑽𝒖𝒍𝒏𝒆𝒓𝒂 𝑺𝒂𝒏𝒆𝒏𝒕𝒖𝒓",
            "description": "| Snape is my son and Alan is my father |\nsninsta: @thatbastardrickman",
            "url": "https://maybeshesnaped.tumblr.com/",
            "uuid": "t:pERsxbgIBxElcc1x26bYqw",
            "updated": 1558423950
        },
        "id": 182998498145,
        "post_url": "https://maybeshesnaped.tumblr.com/post/182998498145/snape-before-every-double-potions-with-the",
        "slug": "snape-before-every-double-potions-with-the",
        "date": "2019-02-23 09:15:52 GMT",
        "timestamp": 1550913352,
        "state": "published",
        "format": "html",
        "reblog_key": "czW0Vdv9",
        "tags": [
            "severus snape",
            "snape",
            "pro snape",
            "harry potter",
            "snape meme",
            "snape community",
            "snapedom",
            "gryffindor"
        ],
        "short_url": "https://tmblr.co/Z5rfQX2gRZtjX",
        "summary": "Snape before every double potions with the Gryffindors",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 330,
        "title": null,
        "body": "<p>Snape before every double potions with the Gryffindors</p><figure class=\"tmblr-full\" data-orig-height=\"319\" data-orig-width=\"370\"><img src=\"https://66.media.tumblr.com/031417f996baab538ddaa34773dc692a/tumblr_pndgef4qai1wxg4js_540.jpg\" data-orig-height=\"319\" data-orig-width=\"370\"/></figure>",
        "reblog": {
            "comment": "<p><p>Snape before every double potions with the Gryffindors</p><figure class=\"tmblr-full\" data-orig-height=\"319\" data-orig-width=\"370\"><img src=\"https://66.media.tumblr.com/031417f996baab538ddaa34773dc692a/tumblr_pndgef4qai1wxg4js_540.jpg\" data-orig-height=\"319\" data-orig-width=\"370\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "maybeshesnaped",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/2bc737f73f340aadcf821e552eb17491/vvaiuku/Xhcpqaqdy/tumblr_static_1111971960-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/2bc737f73f340aadcf821e552eb17491/vvaiuku/Xhcpqaqdy/tumblr_static_1111971960-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/2bc737f73f340aadcf821e552eb17491/vvaiuku/Xhcpqaqdy/tumblr_static_1111971960-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#712361",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#712361",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998498145"
                },
                "content_raw": "<p><p>Snape before every double potions with the Gryffindors</p><figure class=\"tmblr-full\" data-orig-height=\"319\" data-orig-width=\"370\"><img src=\"https://66.media.tumblr.com/031417f996baab538ddaa34773dc692a/tumblr_pndgef4qai1wxg4js_540.jpg\" data-orig-height=\"319\" data-orig-width=\"370\"></figure></p>",
                "content": "<p><p>Snape before every double potions with the Gryffindors</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/031417f996baab538ddaa34773dc692a/tumblr_pndgef4qai1wxg4js_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "proudpotterheadsstuff",
        "blog": {
            "name": "proudpotterheadsstuff",
            "title": "I solemnly swear that I'm up-to no good.",
            "description": "Just a Hogwarts girl living in a Muggles world | Indian | Gryffindor | Drarry | Wolfstar",
            "url": "https://proudpotterheadsstuff.tumblr.com/",
            "uuid": "t:3JkIayed7D87pj3BYn3iqg",
            "updated": 1557070263
        },
        "id": 182998415629,
        "post_url": "https://proudpotterheadsstuff.tumblr.com/post/182998415629/sass-level-1000000000",
        "slug": "sass-level-1000000000",
        "date": "2019-02-23 09:07:38 GMT",
        "timestamp": 1550912858,
        "state": "published",
        "format": "html",
        "reblog_key": "5o9Mvw7s",
        "tags": [
            "harry potter",
            "hogwarts",
            "hermione granger",
            "ron weasley"
        ],
        "short_url": "https://tmblr.co/ZhqJwa2gRZZaD",
        "summary": "Sass level 1000000000......",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 3,
        "title": null,
        "body": "<p>Sass level 1000000000&hellip;&hellip;</p><figure class=\"tmblr-full\" data-orig-height=\"531\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/621fc1840fb7fc89fe126f49a208e3a4/tumblr_pndg0qjW9M1vbgw3v_540.png\" data-orig-height=\"531\" data-orig-width=\"719\"/></figure>",
        "reblog": {
            "comment": "<p><p>Sass level 1000000000……</p><figure class=\"tmblr-full\" data-orig-height=\"531\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/621fc1840fb7fc89fe126f49a208e3a4/tumblr_pndg0qjW9M1vbgw3v_540.png\" data-orig-height=\"531\" data-orig-width=\"719\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "proudpotterheadsstuff",
                    "active": true,
                    "theme": {
                        "header_full_width": 934,
                        "header_full_height": 328,
                        "header_focus_width": 583,
                        "header_focus_height": 327,
                        "avatar_shape": "circle",
                        "background_color": "#F5DBD6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,709,327,126",
                        "header_image": "https://static.tumblr.com/2e2db466af8db877c812b0df0429a992/jb9v9qo/8tipnc5ob/tumblr_static_-517516864-content.png",
                        "header_image_focused": "https://static.tumblr.com/036c0b45efe48f4400a138951337cc60/jb9v9qo/ZWPpnc67j/tumblr_static_tumblr_static_-517516864-content_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/2e2db466af8db877c812b0df0429a992/jb9v9qo/8tipnc5ob/tumblr_static_-517516864-content_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#050505",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998415629"
                },
                "content_raw": "<p><p>Sass level 1000000000……</p><figure class=\"tmblr-full\" data-orig-height=\"531\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/621fc1840fb7fc89fe126f49a208e3a4/tumblr_pndg0qjW9M1vbgw3v_540.png\" data-orig-height=\"531\" data-orig-width=\"719\"></figure></p>",
                "content": "<p><p>Sass level 1000000000&hellip;&hellip;</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/621fc1840fb7fc89fe126f49a208e3a4/tumblr_pndg0qjW9M1vbgw3v_540.png\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "proudpotterheadsstuff",
        "blog": {
            "name": "proudpotterheadsstuff",
            "title": "I solemnly swear that I'm up-to no good.",
            "description": "Just a Hogwarts girl living in a Muggles world | Indian | Gryffindor | Drarry | Wolfstar",
            "url": "https://proudpotterheadsstuff.tumblr.com/",
            "uuid": "t:3JkIayed7D87pj3BYn3iqg",
            "updated": 1557070263
        },
        "id": 182998400174,
        "post_url": "https://proudpotterheadsstuff.tumblr.com/post/182998400174/yup-thats-me-100",
        "slug": "yup-thats-me-100",
        "date": "2019-02-23 09:06:04 GMT",
        "timestamp": 1550912764,
        "state": "published",
        "format": "html",
        "reblog_key": "m5q0Pkuq",
        "tags": [
            "harry potter",
            "potterheads",
            "potterhead",
            "chamberofsecrets",
            "hogwarts"
        ],
        "short_url": "https://tmblr.co/ZhqJwa2gRZVok",
        "summary": "Yup. That's me 100%",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1,
        "title": null,
        "body": "<p>Yup. That&rsquo;s me 100% </p><figure class=\"tmblr-full\" data-orig-height=\"334\" data-orig-width=\"498\"><img src=\"https://66.media.tumblr.com/30a13b221f678bad4fae097f79b1a3a4/tumblr_pndfy4b7kz1vbgw3v_540.jpg\" data-orig-height=\"334\" data-orig-width=\"498\"/></figure>",
        "reblog": {
            "comment": "<p><p>Yup. That’s me 100% </p><figure class=\"tmblr-full\" data-orig-height=\"334\" data-orig-width=\"498\"><img src=\"https://66.media.tumblr.com/30a13b221f678bad4fae097f79b1a3a4/tumblr_pndfy4b7kz1vbgw3v_540.jpg\" data-orig-height=\"334\" data-orig-width=\"498\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "proudpotterheadsstuff",
                    "active": true,
                    "theme": {
                        "header_full_width": 934,
                        "header_full_height": 328,
                        "header_focus_width": 583,
                        "header_focus_height": 327,
                        "avatar_shape": "circle",
                        "background_color": "#F5DBD6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,709,327,126",
                        "header_image": "https://static.tumblr.com/2e2db466af8db877c812b0df0429a992/jb9v9qo/8tipnc5ob/tumblr_static_-517516864-content.png",
                        "header_image_focused": "https://static.tumblr.com/036c0b45efe48f4400a138951337cc60/jb9v9qo/ZWPpnc67j/tumblr_static_tumblr_static_-517516864-content_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/2e2db466af8db877c812b0df0429a992/jb9v9qo/8tipnc5ob/tumblr_static_-517516864-content_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#050505",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998400174"
                },
                "content_raw": "<p><p>Yup. That’s me 100% </p><figure class=\"tmblr-full\" data-orig-height=\"334\" data-orig-width=\"498\"><img src=\"https://66.media.tumblr.com/30a13b221f678bad4fae097f79b1a3a4/tumblr_pndfy4b7kz1vbgw3v_540.jpg\" data-orig-height=\"334\" data-orig-width=\"498\"></figure></p>",
                "content": "<p><p>Yup. That&rsquo;s me 100% </p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/30a13b221f678bad4fae097f79b1a3a4/tumblr_pndfy4b7kz1vbgw3v_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "elliwoodd",
        "blog": {
            "name": "elliwoodd",
            "title": "-Alamort-",
            "description": "<p>-‘What would Tom Riddle do? Isn’t good life advice’-</p><p>Poetry•Tomione•NPD</p>",
            "url": "https://elliwoodd.tumblr.com/",
            "uuid": "t:3TdDL-LRyIZfzmVjsCprQw",
            "updated": 1558250265
        },
        "id": 182998400094,
        "post_url": "https://elliwoodd.tumblr.com/post/182998400094/the-fact-that-harry-potter-now-has-over-800k",
        "slug": "the-fact-that-harry-potter-now-has-over-800k",
        "date": "2019-02-23 09:06:04 GMT",
        "timestamp": 1550912764,
        "state": "published",
        "format": "html",
        "reblog_key": "iyT5mNHh",
        "tags": [
            "tomione",
            "harry potter",
            "fanfiction",
            "800K!!!!!",
            "all writers amaze me!"
        ],
        "short_url": "https://tmblr.co/ZkPOrk2gRZVnU",
        "summary": "The fact that Harry Potter now has over 800k fanfics on fanfiction is mindblowing to me!!\nI have so much appreciation for all...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 27,
        "title": null,
        "body": "<p>The fact that Harry Potter now has over 800k fanfics on fanfiction is mindblowing to me!!</p><p>I have so much appreciation for all the writers out there! No matter if you write for Tomione or Dumbledore and his socks!</p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/b1261c011c8dfb428f4ab420ba1f2b23/tumblr_pndfy3RVF01ts4fl7_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"719\"/></figure>",
        "reblog": {
            "comment": "<p><p>The fact that Harry Potter now has over 800k fanfics on fanfiction is mindblowing to me!!</p><p>I have so much appreciation for all the writers out there! No matter if you write for Tomione or Dumbledore and his socks!</p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/b1261c011c8dfb428f4ab420ba1f2b23/tumblr_pndfy3RVF01ts4fl7_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "elliwoodd",
                    "active": true,
                    "theme": {
                        "header_full_width": 540,
                        "header_full_height": 347,
                        "header_focus_width": 540,
                        "header_focus_height": 304,
                        "avatar_shape": "square",
                        "background_color": "#7F7F7F",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,540,304,0",
                        "header_image": "https://static.tumblr.com/4f033d7fa7adedfa71b6d83227f78a8c/ybbxitm/dvHozha9a/tumblr_static_.gif",
                        "header_image_focused": "https://static.tumblr.com/4f033d7fa7adedfa71b6d83227f78a8c/ybbxitm/PuYozha9c/tumblr_static_tumblr_static__focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/4f033d7fa7adedfa71b6d83227f78a8c/ybbxitm/dvHozha9a/tumblr_static__2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#193617",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Avalon",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998400094"
                },
                "content_raw": "<p><p>The fact that Harry Potter now has over 800k fanfics on fanfiction is mindblowing to me!!</p><p>I have so much appreciation for all the writers out there! No matter if you write for Tomione or Dumbledore and his socks!</p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/b1261c011c8dfb428f4ab420ba1f2b23/tumblr_pndfy3RVF01ts4fl7_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure></p>",
                "content": "<p><p>The fact that Harry Potter now has over 800k fanfics on fanfiction is mindblowing to me!!</p><p>I have so much appreciation for all the writers out there! No matter if you write for Tomione or Dumbledore and his socks!</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/b1261c011c8dfb428f4ab420ba1f2b23/tumblr_pndfy3RVF01ts4fl7_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "your-apocalypse-was-fab",
        "blog": {
            "name": "your-apocalypse-was-fab",
            "title": "We're Just Impostors In This Country, You Know",
            "description": "The ramblings and reblogs of Kristen, a 24-year-old who aspires to one day be ambitious.  paypal.me/KP7123",
            "url": "https://your-apocalypse-was-fab.tumblr.com/",
            "uuid": "t:k4RCs5YQ7A_rZabtKS8PSA",
            "updated": 1558431165
        },
        "id": 182998388962,
        "post_url": "https://your-apocalypse-was-fab.tumblr.com/post/182998388962/when-you-think-about-it-jk-rowlings-antics-just",
        "slug": "when-you-think-about-it-jk-rowlings-antics-just",
        "date": "2019-02-23 09:04:54 GMT",
        "timestamp": 1550912694,
        "state": "published",
        "format": "html",
        "reblog_key": "38VBrQ8Z",
        "tags": [
            "harry potter",
            "and tbh i can see her not wanting to admit that is where she was going with that storyline because she has realized what she'd done",
            "and was like",
            "'...wait'"
        ],
        "short_url": "https://tmblr.co/Zh4bHx2gRZT3Y",
        "summary": "When you think about it, JK Rowling's antics just add more credence to the theory that Regulus Black was Dean Thomas's father....",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": null,
        "body": "<p>When you think about it, JK Rowling&rsquo;s antics just add more credence to the theory that Regulus Black was Dean Thomas&rsquo;s father. Because she would have the first in-book established Black character have the ancestral surname of Black. She absolutely would.</p>",
        "reblog": {
            "comment": "<p>When you think about it, JK Rowling’s antics just add more credence to the theory that Regulus Black was Dean Thomas’s father. Because she would have the first in-book established Black character have the ancestral surname of Black. She absolutely would.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "your-apocalypse-was-fab",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 281,
                        "header_focus_width": 499,
                        "header_focus_height": 281,
                        "avatar_shape": "square",
                        "background_color": "#9DCACA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,499,281,0",
                        "header_image": "https://static.tumblr.com/88c37b69f062e457b008f7bfdc7a5586/uifbajn/oCLp9mkpx/tumblr_static_3aav426szqg4s8sgwwwwockkg.png",
                        "header_image_focused": "https://static.tumblr.com/88c37b69f062e457b008f7bfdc7a5586/uifbajn/dsep9mkpy/tumblr_static_tumblr_static_3aav426szqg4s8sgwwwwockkg_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/88c37b69f062e457b008f7bfdc7a5586/uifbajn/oCLp9mkpx/tumblr_static_3aav426szqg4s8sgwwwwockkg_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182998388962"
                },
                "content_raw": "<p>When you think about it, JK Rowling’s antics just add more credence to the theory that Regulus Black was Dean Thomas’s father. Because she would have the first in-book established Black character have the ancestral surname of Black. She absolutely would.</p>",
                "content": "<p>When you think about it, JK Rowling&rsquo;s antics just add more credence to the theory that Regulus Black was Dean Thomas&rsquo;s father. Because she would have the first in-book established Black character have the ancestral surname of Black. She absolutely would.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    }
]