[
    {
        "type": "text",
        "blog_name": "abdallahalhakim",
        "blog": {
            "name": "abdallahalhakim",
            "title": "Marvels of Medicine",
            "description": "Modern Medicine is Fascinating.  Sometimes food heals as well.",
            "url": "https://abdallahalhakim.tumblr.com/",
            "uuid": "t:hiOGS3bidheeMvOmE-Y-CQ",
            "updated": 1551632299
        },
        "id": 181346525147,
        "post_url": "https://abdallahalhakim.tumblr.com/post/181346525147/electronic-health-records-separating-the-signal",
        "slug": "electronic-health-records-separating-the-signal",
        "date": "2018-12-23 13:50:35 GMT",
        "timestamp": 1545573035,
        "state": "published",
        "format": "html",
        "reblog_key": "IC0T3RSu",
        "tags": [
            "Health",
            "Medical"
        ],
        "short_url": "https://tmblr.co/Z16Tbh2ev65-R",
        "summary": "Electronic health records: separating the signal from the noise",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": "Electronic health records: separating the signal from the noise",
        "body": "<p>5,177. That’s the current number of “cc’ed charts” as of this morning in my electronic health record in-basket. While it might sound like a lot, this is not at all an unusual accumulation, partly due to the fact that I receive a notation every time a patient at our practice gets a flu shot, and </p>\n<p><strong><a href=\"https://www.healthecareers.com/kevinmd/search-jobs/\" target=\"_blank\" rel=\"nofollow noopener\">Find jobs at Careers by KevinMD.com</a>. </strong>Search thousands of physician, PA, NP, and CRNA jobs now. <a href=\"https://www.healthecareers.com/kevinmd/search-jobs/\" target=\"_blank\" rel=\"nofollow noopener\">Learn more</a>.</p>\n<p><a href=\"https://www.healthecareers.com/kevinmd/search-jobs/\" target=\"_blank\" rel=\"nofollow noopener\"><img class=\"alignnone wp-image-127855 size-full\" src=\"https://www.kevinmd.com/blog/wp-content/uploads/kevinmd-cc-logo.png\" alt=\"\" width=\"334\" height=\"90\"/></a></p>\n<hr><br/><a href=\"https://www.kevinmd.com/blog/2018/12/electronic-health-records-separating-the-signal-from-the-noise.html\" rel=\"nofollow\" target=\"_blank\">[Read More &hellip;]</a><br/><br/>\n<a href=\"https://www.kevinmd.com/blog/2018/12/electronic-health-records-separating-the-signal-from-the-noise.html\">https://www.kevinmd.com/blog/2018/12/electronic-health-records-separating-the-signal-from-the-noise.html</a>",
        "reblog": {
            "comment": "<p><p>5,177. That’s the current number of “cc’ed charts” as of this morning in my electronic health record in-basket. While it might sound like a lot, this is not at all an unusual accumulation, partly due to the fact that I receive a notation every time a patient at our practice gets a flu shot, and </p>\n<p><strong><a href=\"https://www.healthecareers.com/kevinmd/search-jobs/\" target=\"_blank\" rel=\"nofollow noopener\">Find jobs at Careers by KevinMD.com</a>. </strong>Search thousands of physician, PA, NP, and CRNA jobs now. <a href=\"https://www.healthecareers.com/kevinmd/search-jobs/\" target=\"_blank\" rel=\"nofollow noopener\">Learn more</a>.</p>\n<p><a href=\"https://www.healthecareers.com/kevinmd/search-jobs/\" target=\"_blank\" rel=\"nofollow noopener\"><img class=\"alignnone wp-image-127855 size-full\" src=\"https://www.kevinmd.com/blog/wp-content/uploads/kevinmd-cc-logo.png\" alt=\"\" width=\"334\" height=\"90\"></a></p>\n<hr><br><a href=\"https://www.kevinmd.com/blog/2018/12/electronic-health-records-separating-the-signal-from-the-noise.html\" rel=\"nofollow\" target=\"_blank\">[Read More …]</a><br><br><a href=\"https://www.kevinmd.com/blog/2018/12/electronic-health-records-separating-the-signal-from-the-noise.html\">https://www.kevinmd.com/blog/2018/12/electronic-health-records-separating-the-signal-from-the-noise.html</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "abdallahalhakim",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/39de66b15b1f8651a5d221df139c56d9/pa0ghhb/iOzo4c6nq/tumblr_static_du70vt9l3fsos44cwg48ogc84.png",
                        "header_image_focused": "https://static.tumblr.com/39de66b15b1f8651a5d221df139c56d9/pa0ghhb/iOzo4c6nq/tumblr_static_du70vt9l3fsos44cwg48ogc84_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/39de66b15b1f8651a5d221df139c56d9/pa0ghhb/iOzo4c6nq/tumblr_static_du70vt9l3fsos44cwg48ogc84_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ea0808",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346525147"
                },
                "content_raw": "<p><p>5,177. That’s the current number of “cc’ed charts” as of this morning in my electronic health record in-basket. While it might sound like a lot, this is not at all an unusual accumulation, partly due to the fact that I receive a notation every time a patient at our practice gets a flu shot, and </p>\n<p><strong><a href=\"https://www.healthecareers.com/kevinmd/search-jobs/\" target=\"_blank\" rel=\"nofollow noopener\">Find jobs at Careers by KevinMD.com</a>. </strong>Search thousands of physician, PA, NP, and CRNA jobs now. <a href=\"https://www.healthecareers.com/kevinmd/search-jobs/\" target=\"_blank\" rel=\"nofollow noopener\">Learn more</a>.</p>\n<p><a href=\"https://www.healthecareers.com/kevinmd/search-jobs/\" target=\"_blank\" rel=\"nofollow noopener\"><img class=\"alignnone wp-image-127855 size-full\" src=\"https://www.kevinmd.com/blog/wp-content/uploads/kevinmd-cc-logo.png\" alt=\"\" width=\"334\" height=\"90\"></a></p>\n<hr><br><a href=\"https://www.kevinmd.com/blog/2018/12/electronic-health-records-separating-the-signal-from-the-noise.html\" rel=\"nofollow\" target=\"_blank\">[Read More …]</a><br><br><a href=\"https://www.kevinmd.com/blog/2018/12/electronic-health-records-separating-the-signal-from-the-noise.html\">https://www.kevinmd.com/blog/2018/12/electronic-health-records-separating-the-signal-from-the-noise.html</a></p>",
                "content": "<p><p>5,177. That&rsquo;s the current number of &ldquo;cc&rsquo;ed charts&rdquo; as of this morning in my electronic health record in-basket. While it might sound like a lot, this is not at all an unusual accumulation, partly due to the fact that I receive a notation every time a patient at our practice gets a flu shot, and </p>\n<p><strong><a href=\"https://www.healthecareers.com/kevinmd/search-jobs/\" target=\"_blank\">Find jobs at&nbsp;Careers by KevinMD.com</a>.&nbsp;</strong>Search thousands of physician, PA, NP, and CRNA jobs now.&nbsp;<a href=\"https://www.healthecareers.com/kevinmd/search-jobs/\" target=\"_blank\">Learn more</a>.</p>\n<p><div class=\"external-image-wrapper\" data-loading-text=\"Loading...\" data-src=\"https://www.kevinmd.com/blog/wp-content/uploads/kevinmd-cc-logo.png\">External image</div></p>\n<hr /><br /><a href=\"https://www.kevinmd.com/blog/2018/12/electronic-health-records-separating-the-signal-from-the-noise.html\" target=\"_blank\">[Read More &hellip;]</a><br /><br /><a href=\"https://www.kevinmd.com/blog/2018/12/electronic-health-records-separating-the-signal-from-the-noise.html\">https://www.kevinmd.com/blog/2018/12/electronic-health-records-separating-the-signal-from-the-noise.html</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "fitworlds",
        "blog": {
            "name": "fitworlds",
            "title": "Health & Fitness FANatic",
            "description": "Fitness and Health Tips for Women Who Hate Diets",
            "url": "https://fitworlds.tumblr.com/",
            "uuid": "t:MR5NQ2tHYltAhOZQkqXE2Q",
            "updated": 1558522397
        },
        "id": 181346520340,
        "post_url": "https://fitworlds.tumblr.com/post/181346520340/review-of-recent-fitness-studies-iii-volume",
        "slug": "review-of-recent-fitness-studies-iii-volume",
        "date": "2018-12-23 13:50:21 GMT",
        "timestamp": 1545573021,
        "state": "published",
        "format": "html",
        "reblog_key": "1NmQpfmF",
        "tags": [
            "reddit",
            "fitness",
            "health",
            "diet",
            "gym",
            "workout",
            "life",
            "testimonial",
            "question",
            "advice"
        ],
        "short_url": "https://tmblr.co/Z9DUvn2ev64qK",
        "summary": "Review of Recent Fitness Studies III: Volume, Frequency, Interval Training &amp; More via /r/Fitness",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 2,
        "title": "Review of Recent Fitness Studies III: Volume, Frequency, Interval Training &amp; More via /r/Fitness",
        "body": "<div class=\"md\"><p>Hey guys, I&rsquo;m back with more studies. Same drill as last time really. All for education and I hope we can spark some nice discussion like last time!</p> <p>The first study we will take a look at is a new network meta-analysis conducted by Naci et al. (2018) which put exercise against blood pressure medications to see which one is more effective for reducing blood pressure. A network meta analysis is essentially a study that pools results from several studies together in one big analysis. The difference between a standard meta analysis and a network meta analysis can be elucidated with the following example. We want to see if a new magic pill is better than protein for lean mass gains. A standard meta analysis will only take results from papers where the pill and protein are directly compared with each other within one study. However, a network meta analysis will include studies where the pill is experimented is not compared with protein and is instead compared with something else like a placebo. We compare these kinds of studies together and we can make something called “indirect comparisons”. This type of analysis is very hard to carry out because you have to be very careful with your study selection and the vigilance for bias needs to be even greater than standard meta-analyses so kudos to the authors for putting together such a piece (Li et al. 2011).</p> <p>The reason this study was done in such a manner was because there are actually no studies which directly compare blood pressure medications and exercise. The importance of this investigation is highlighted by the fact that high blood pressure is strongly linked with higher rates of cardiovascular diseases and medications naturally contribute to already expensive healthcare costs (Lewington, Clarke, Qizilbash, Peto and Collins, 2002; OECD, 2017). The increasing use of these medications also leads to problems like polypharmacy (use of many different medications for one individual) leads to issues like higher rates of adverse effects from medications.</p> <p>This analysis decided to look a various types/intensities of exercises along with different types/doses of blood pressure lowering medication. The exercise modalities included endurance, dynamic, isometric and a combination of endurance and dynamic training. There was also analysis done at numerous baselines of blood pressure. An issue with the literature is that there are far more studies done with blood pressure medication than exercise regarding their potency to lower blood pressure. This is supported by the statistic that only 10% of the studies analyzed amongst the hypertensive (high blood pressure) population were from exercise studies. Exercise studies also generally had higher risks of bias and lower sample sizes.</p> <p>When they pooled all the results together without sub-group analysis (i.e. no analysis on smaller, more specific groups of subjects), the medications outperformed exercise by about 4 units of blood pressure on average. Amongst the exercise types, every type performed about the same but the dynamic exercise (standard resistance training) did notably worse by a few units. You could see a positive correlation with drug dosage and blood pressure lowering effects but any correlation with exercise intensity was a lot more ambiguous.</p> <p>However, we see a different story when we narrow the analysis to only hypertensive populations. As we increase the baseline blood pressure, exercise seems to show better results. In fact, as a whole, exercise performed on par with medications. Some exercise types (endurance and combination training especially) were actually found to be more effective than some medications. Intensities and doses did not show any differences.</p> <p>Along with the issues previously described, there was no sorting of exercise studies based on their effectiveness. There are organizations which lay out guidelines for proper medication treatment which helps the authors weed out studies that may not be done properly in regards to medication administration but unfortunately, the same cannot be done for exercise studies. This is because there is no governing body which determines which exact programmes are effective or not. Therefore, it is possible that low-quality exercise studies were included in the analysis.</p> <p>Most studies also start a healthy baseline while we would prefer to see studies done where baseline blood pressures were higher as this is the population we are concerned with. Finally, there needs more reporting of adverse effects in studies where exercise is the intervention. This is done meticulously in most clinical studies. In combination training, there may be a high adverse effect rate because aerobic training can be very fatiguing and negatively affect resistance training performance and safety.</p> <p>As per the usual conclusions, more studies need to be done but these findings are very promising for exercise in a blood pressure control context. Perhaps in the future, it will be a far more common prescription in health care and maybe even find its way into first-line treatment in non-urgent cases.</p> <p><strong>TL;DR:</strong> In healthy people, medications outperform exercise in lower blood pressure. However, as we increase the baseline blood pressure amongst analyzed populations, exercise seems to perform just as good as medications. Endurance and combination training appear to have the greatest effects.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>Now let’s look at a meta analysis looking at the relationship between muscular strength and mortality done by García-Hermoso et al. (2018). The analysis was done amongst healthy adults and 33 studies were included. Overall, it appeared that a greater muscular strength (looking at handgrip strength and leg extension strength) led to a reduced mortality rate. The reported numbers were a 31% reduction mortality with higher handgrip strength and a 14% reduction with higher leg extension strength. There were no differences amongst age groups but the positive effects of strength were more pronounced in women.</p> <p>The authors noted a high heterogeneity in studies analyzed. This means that the studies differed widely in methods used. For example, some measured strength with handgrip strength (the most common measure) while some used other tools. This heterogeneity interferes with the pooling of the studies. Despite this, it does seem that the handgrip measure of strength could be of clinical use to assess mortality risk as it is the most popular tool in this literature.</p> <p><strong>TL;DR:</strong> Being stronger may help you live longer! However, more standardization in this area of research would help accrue better evidence.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>It is now time to journey into the world of frequency in training for a bit. It is a trending topic of research and as such, a few new studies have come out of the woods. I will follow a format of covering some recent interventional studies first and then reporting any new reviews/meta-analyses if available. For this article, we will look over the effects of frequency on strength and hypertrophy as those are common outcomes people will focus on.</p> <p>The theories behind higher frequencies being better for strength include that higher frequencies allow for higher volumes, intensities can be more easily maintained when sessions are spread apart and more sessions give more opportunities to train the neural/motor aspect of strength training.</p> <p>Ochi et al. (2018) put 20 untrained males through 11 weeks of training followed by 6 weeks of detraining. One group did 1 session a week consisting of 6 sets of 12 reps while the the other group did 3 sessions a week of 2 sets of 12 reps (only exercise performed throughout the study was the leg extension). The intensity was roughly maintained at 67% 1RM with volume matched between groups. Outcomes were one repetition maxima, thigh circumference, quadriceps muscle thickness, muscle stiffness (indicator of muscle damage) and maximum voluntary contraction torque (essentially how much force you can produce about a certain joint).</p> <p>The higher frequency did have better 1 repetition maximum gains but the authors reported that there were no statistically significant differences and the standard deviations were quite wide. Regardless, this difference can be noted. Rate of perceived exertion was expectedly greater in the lower frequency group by about 30% on average throughout the study. Stiffness was similar between both groups. Thigh circumference had similar results to the 1 repetition maximum outcome in the sense that the higher frequency group had larger circumferences but no significant results were noted by the authors. While non-significance does support the evidence of there being no difference, statistical significance can be wildly variable and issues with this study’s design as well as no reporting of exact p-values, effect sizes and confidence intervals (for this outcome) do not help make a more solid conclusion. Muscle thickness through the measure of ultrasound was similar between groups.</p> <p>The only statistically significant results reported by the researchers were that at 11 weeks, the maximum voluntary contraction torque was greater in the higher frequency group.</p> <p>A few problems with this study include the low intensity used in this study. In the real life world, most strength-oriented programmes will use a very high intensity as intensity is an important factor in making strength improvements (Schoenfeld, Grgic, Ogborn &amp; Krieger, 2017). There was no dietary control whatsoever. Finally, there was no control group. However, it was good of the authors to collect data at several time points as it is very common to only see data points at the beginning and end of a study.</p> <p><strong>TL;DR:</strong> Potentially more benefits in higher frequency training (thrice vs once a week), however, there are notable issues with the study design that can affect the conclusions we are able to garner from this study.</p> <p>A meta-analysis conducted by Grgic et al. (2018) pooled 22 papers together to carefully examine the relationship between weekly training frequency and strength gains. 22 studies were included. Initially, we see a positive correlation between frequency and strength improvement. However, when we control for volume, as expected, we see no such correlation. While this is a common argument seen amongst those who support lower frequencies, I believe these findings are misapplied. Frequency should be seen as a good way to increase volume. Of course, independently, the current evidence points towards a weak correlation between frequency and strength but training with high volumes is much more manageable if the sessions are spread apart. The same findings can be found in a more recent meta-analysis conducted on the subject by Ralston et al. (2018).</p> <p>Some patterns to note amongst the non-volume matched analyses is that young adults and women responded better to higher frequencies. Upper body, multi-joint exercises were also better with higher frequencies. Women may respond better due to generally having more type I fiber muscle composition which may make them more fatigue-resistant hence being able to handle more sessions per week than men (Haizlip, Harrison &amp; Leinwand, 2015). Improvements in multi-joint exercises may be better because they require more complex motor recruitment patterns which may be poor at baseline but make significant improvements with frequent training. Upper body responds better possibly because the lower body is exposed to constant resistance during activities of daily living moreso than the upper body. Finally, young adults probably have better recovery than older adults which allow them to manage more training sessions per week (Roth et al., 2000).</p> <p>A big gap in the literature is that there is a paucity of data in trained individuals. This meta-analysis could not even conduct a sub-group analysis amongst trained vs un-trained because there were not enough studies on trained people. More research definitely needs to be done in this population.</p> <p><strong>TL;DR:</strong> When equated for volume, higher frequencies will not do much for strength gains. However, they are a good way to boost training volume. Young adults, women, the upper body and multi-joint exercises may respond better to higher frequency training. More data on trained people is needed.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>We will now look at the effects of frequency on muscle hypertrophy. The theories for the relationship largely follow the same ones discussed in the strength literature above. However, muscle protein synthesis (muscle building at a molecular level) is a relevant part of the discussion here. Some theorize that because the muscle protein synthesis response post-exercise is limited to a period of time, it may be a good idea to do frequent sessions throughout the week to keep muscle protein synthesis elevated. This may have an even more pronounced effect in trained individuals because their muscle protein synthesis are generally blunted compared to the untrained population (Damas, Phillips, Vechin &amp; Ugrinowitsch, 2015).</p> <p>A trial ran by Saric et al. (2018) involved 27 trained men to be split into a 2 training groups: a group training 3 times a week and another training 6 times a week. The inclusion criteria for training history was that every subject must have trained at a frequency of at least twice a week for 6 months while training both the upper and lower body. Every set was taken to failure to keep rate of perceived exertion the same and volume was equated through the 6 weeks of exercise intervention. Even though the focus here is hypertrophy, the study outcomes include tests on strength and endurance. For strength, a 1 one repetition maximum bench press and squat test was done. For hypertrophy, ultrasounds were done at the biceps, triceps and 2 quadricep muscles. For endurance, a test where subjects performed the bench press and squat with a load of 60% of 1 repetition maximum for as many repetitions as possible.</p> <p>Volume was generally greater for the higher frequency group. All of the volume differences were statistically insignificant except for the posterior thigh, however, nothing can really be extrapolated from this as the posterior thigh has little to no effect on any of the study outcomes. It’s hard to take any valuable information from this not purely because of the p values but also the deviations from the average were quite wide and comparing total volumes between groups when it is measured in sets<em>repetitions</em>load is difficult. This is because volume differences between specific exercises are much more valuable for analysis when measured in that method. Volume differences may be small between single-joint exercises like the bicep curl and then they can be bigger with higher load exercises like the squat. So if there are any discrepancies in volume, you cannot pinpoint which exercise it is in and therefore cannot extrapolate it to any specific body part.</p> <p>Hypertrophy was very similar between groups but the lower frequency group was the only group to make gains the biceps. Both groups made gains in strength but no difference in improvements. Both groups did not make any real improvements in endurance.</p> <p>We can see that frequency (3/week vs 6/week) does not really have that much of an effect on any outcome including muscle hypertrophy. Regarding the bicep finding, it is possibly because the bicep is included in more multi-joint exercises than the tricep so it perhaps underwent too much volume and suffered from recovery issues in the higher frequency group. A caveat with this study is that it is very short. Muscle hypertrophy is a slow process so studies should take more time to evaluate variables that may have an effect on it. Furthermore, there was no dietary control.</p> <p><strong>TL;DR:</strong> Training 6 times a week has no added benefit over training 3 times a week in not only muscle hypertrophy but muscular strength and endurance in the bench press and squat as well. Study would have been better with a longer duration and dietary control.</p> <p>Just a few days ago, a meta-analysis by Schoenfeld, Grgic &amp; Krieger (2018) exploring the relationship between muscle hypertrophy and training frequency was published. 25 studies were included with the minimum study duration being 6 weeks. There was a lot of different analyses done here. Relationships were checked under volume-equated conditions, under conditions where hypertrophy was measured directly and indirectly, for upper body and lower body and amongst trained individuals. Unfortunately, the meta-analysis could not include analysis on untrained individuals due to not having enough data.</p> <p>Despite all the unique analyses, most of the effects training frequency could possibly muster were trivial. There were tiny effects even in conditions where volume was not equated. The only beacon of light was that under volume-equated conditions, the 3 times/week training frequency had a small (almost-moderate) effect size with the confidence intervals not including values supporting the hypothesis that frequency has no effect on muscle hypertrophy. The lower bound does not even fall into what we would consider trivial effect size. However, it must be noted that the result was statistically insignificant.</p> <p>With the prolonged muscle protein synthesis theory in mind, these results promote caution in those who associate chronic muscular hypertrophy to acute muscle protein synthesis responses. Limitations include that these results only apply to the upper limbs, it is still up in the air whether or not single or multi-joint exercises play a part and that there is no control for other variables like diet, rest or training to failure (however, the meta-analysis reports very low heterogeneity all around and all the studies included should have done their own controlling for these variables).</p> <p><strong>TL;DR:</strong> Even if you do not control volume, it seems frequency has a very minor role to play in hypertrophy yet there are more areas of research to explore, for example, the effects of training frequency on the calf muscles.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>Schoenfeld et al. (2018) decided to see what kind of muscular responses we would get at higher volumes compared to lower volumes. 34, well-trained men (mean training history was 4.5 years) were split into 3 groups where they either did 1 set, 3 sets or 5 sets per exercise every session. Training sessions were held 3 times a week and the programme lasted 8 weeks. All sets were taken to failure to match for rate of perceived exertion. An ultrasound machine was used to assess muscle thickness. Squat and bench press tests were used to determine strength improvements. Endurance was tested with a set of bench press at 50% of 1 repetition maximum done at as many repetitions as possible. For dietary control, a dietary log was completed on 5 different days in week 0 and week 8. A 24 gram protein supplement was also given on training days.</p> <p>The 1 set group had the shortest training sessions at 13 minutes on average whereas the 5 set group obviously had the longest sessions at 68 minutes on average. The average time for the 3 set group was 40 minutes. Strength improvements were similar across groups. Endurance improvements were also similar between groups. Hypertrophy followed a positive correlation in most muscles with evidence towards there being a relationship being highest in the quadriceps. The only muscle that did not support evidence of such a relationship was the triceps. Although, the raw data did show some positive correlation if you follow the effect sizes. Diet composition did not differ by much between groups.</p> <p>The hypertrophy results were likely expected. The similar strength improvements were likely because volume is not the main driving factor in strength gains and it is probably attributed more to something like loads. The same can be said for endurance (a different driver at play). One may argue that the even though the strength improvements are similar, the lower volume groups are at an efficiency advantage due to shorter training sessions. However, these results do not really translate well into the real-life world in this context. This is because strength training sets are generally done at very high intensities where less repetitions are done, rest times are longer and sets are shorter or potentially longer than the times seen in this study. Training history may have not been adequately controlled since training at 5 days a week could have been a novelty for some participants offering a potentially greater improvement in performance. Dietary control could have also been made a more regular requirement throughout the study rather than just having it at the beginning and the end.</p> <p><strong>TL;DR:</strong> Hypertrophy has a positive correlation with number of weekly working sets up to 5 sets per exercise. Strength and endurance are likely driven by other variables like load or frequency.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>To conclude this piece, we will cover a paper completed by Naves et al. (2018). The purpose of this study was to evaluate the effects of high intensity interval training and sprint interval training on body composition and heart health in 49 healthy, women. All interval training was done on a machine bicycle. High intensity interval training (HIIT) involved doing four 4-minute efforts at 90–95% of maximum heart rate with 3 minutes of active rest in between (active rest = 50–60% of maximum heart rate). The sprint interval training (SIT) involved four 30-second all-out efforts with 4 minutes of light cycling in between. Sessions were done 3 times a week for 8 weeks. Study outcomes include waist circumference, skinfolds (to check body fat) and VO2 peak (a measure of endurance or a measure of how healthy the heart is). Diet was controlled with three 24-hour diet recalls at the beginning and end of the study.</p> <p>Adherence in both groups was only 75% in both groups which is quite poor. 3 subjects reported adverse effects (dizziness and vomiting). Only the SIT group had statistically significant reductions in body mass but effect sizes were similar in both groups. The reduction in the sum of all skinfolds was greatest in the SIT group with a 22.2% reduction compared to the HIIT group’s reduction of 15.8%.</p> <p>Reductions in waist circumference were similar between groups. VO2 improvements were also similar. The average timing of the SIT group’s training sessions were 10 minutes shorter on average (23 vs 33 minutes).</p> <p>It appears that SIT leads to greater fat mass reductions while having shorter training sessions compared to HIIT. Another benefit of SIT is that to perform it, you do not need to know your maximum heart rate. Limitations of the study include not having a more thorough dietary control and the use of skinfolds instead of gold standards like magnetic resonance imaging for measuring body fat.</p> <p><strong>TL;DR:</strong> Sprint interval training led to greater fat loss compared to high intensity interval training in women. Sprint interval training sessions were also shorter on average by 10 minutes. Adherence may be an issue and athletes should be aware of possible adverse effects when undergoing interval training.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>Damas, F., Phillips, S., Vechin, F. C. &amp; Ugrinowitsch, C. (2015). A review of resistance training-induced changes in skeletal muscle protein synthesis and their contribution to hypertrophy. Sports Medicine, 45(6), 801–807.</p> <p>García-Hermoso, A., Cavero-Redondo, I., Ramírez-Vélez, R., Ruiz, J. R., Ortega, F. B., Lee, D. &amp; Martínez-Vizcaíno, V. (2018). Muscular Strength as a Predictor of All-Cause Mortality in an Apparently Healthy Population: A Systematic Review and Meta-Analysis of Data From Approximately 2 Million Men and Women. Archives of Physical Medicine and Rehabilitation, 99(10), 2100–2113.</p> <p>Grgic, J., Schoenfeld, B., Davies, T. B., Lazinica, B., Krieger, J. W. &amp; Pedisic, Z. (2018). Effect of Resistance Training Frequency on Gains in Muscular Strength: A Systematic Review and Meta-Analysis. Sports Medicine, 48(5), 1207–1220.</p> <p>Haizlip, K. M., Harrison, B. C. &amp; Leinwand, L. A. (2015). Sex-based differences in skeletal muscle kinetics and fiber-type composition. Physiology, 30(1), 30–39.</p> <p>Lewington, S., Clarke, R., Qizilbash, N., Peto, R. &amp; Collins, R. (2002). Age-specific relevance of usual blood pressure to vascular mortality: a meta-analysis of individual data for one million adults in 61 prospective studies. The Lancet, 360(9349), 1903–1913.</p> <p>Li, T., Puhan, M. A., Vedula, S. S., Singh, S. &amp; Dickersin, K. (2011). Network meta-analysis-highly attractive but more methodological research is needed. BioMed Central, 9(79), .</p> <p>Naci, H., Salcher-Konrad, M., Dias, S., Blum, M. R., Sahoo, S. A., Nunan, D. &amp; Ioannidis, J. P. A. (2018). How does exercise treatment compare with antihypertensive medications? A network meta-analysis of 391 randomised controlled trials assessing exercise and medication effects on systolic blood pressure. British Journal of Sports Medicine, .</p> <p>Naves, J. P. A., Viana, R. B., Rebelo, A. C. S., de Lira, C. A. B., Pimentel, G. D., Lobo, P. C. B., de Oliveira, J. C., … Gentil, P. (2018). Effects of High-Intensity Interval Training vs. Sprint Interval Training on Anthropometric Measures and Cardiorespiratory Fitness in Healthy Young Women. Frontiers in Physiology, 9, .</p> <p>Ochi, E., Maruo, M., Tsuchiya, Y., Ishii, N., Miura, K. &amp; Sasaki, K. (2018). Higher Training Frequency Is Important for Gaining Muscular Strength Under Volume-Matched Training. Frontiers in Physiology, 9(744), .</p> <p>OECD. (2017). Health at a Glance. Retrieved 20 December, 2018, from <a href=\"https://www.oecd-ilibrary.org/social-issues-migration-health/health-at-a-glance_19991312\" target=\"_blank\">https://www.oecd-ilibrary.org/social-issues-migration-health/health-at-a-glance_19991312</a>.</p> <p>Ralston, G. W., Kilgore, L., Wyatt, F. B., Buchan, D. &amp; Baker, J. S. (2018). Weekly Training Frequency Effects on Strength Gain: A Meta-Analysis. Sports Medicine, 4(36), .</p> <p>Roth, S. M., Martel, G. F., Ivey, F. M., Lemmer, J. T., Metter, E. J., Hurley, B. F. &amp; Rogers, M. A. (2000). High-volume, heavy-resistance strength training and muscle damage in young and older women. Journal of Applied Physiology, 88(3), 1112–1118.</p> <p>Saric, J., Lisica, D., Orlic, I., Grgic, J., Krieger, J. W., Vuk, S. &amp; Schoenfeld, B. (2018). Resistance Training Frequencies of 3 and 6 Times Per Week Produce Similar Muscular Adaptations in Resistance-Trained Men. The Journal of Strength &amp; Conditioning Research, Publish Ahead of Print.</p> <p>Schoenfeld, B., Contreras, B., Krieger, J., Grgic, J., Delcastillo, K., Belliard, R. &amp; Alto, A. (2018). Resistance Training Volume Enhances Muscle Hypertrophy but Not Strength in Trained Men. Medicine &amp; Science in Sports &amp; Exercise, 51(1), 94–103.</p> <p>Schoenfeld, B., Grgic, J. &amp; Krieger, J. W. (2018). How many times per week should a muscle be trained to maximize muscle hypertrophy? A systematic review and meta-analysis of studies examining the effects of resistance training frequency. Journal of Sports Sciences, .</p> <p>Schoenfeld, B., Grgic, J., Ogborn, D. &amp; Krieger, J. W. (2017). Strength and Hypertrophy Adaptations Between Low- vs. High-Load Resistance Training: A Systematic Review and Meta-analysis. The Journal of Strength &amp; Conditioning Research, 31(12), 3508–3523.</p> </div><br/><br/>\nSubmitted December 23, 2018 at 04:12AM by MirrorMageZ<br/>\nvia reddit <a href=\"http://bit.ly/2ELqTVl\" target=\"_blank\">http://bit.ly/2ELqTVl</a>",
        "reblog": {
            "comment": "<p><div class=\"md\"><p>Hey guys, I’m back with more studies. Same drill as last time really. All for education and I hope we can spark some nice discussion like last time!</p> <p>The first study we will take a look at is a new network meta-analysis conducted by Naci et al. (2018) which put exercise against blood pressure medications to see which one is more effective for reducing blood pressure. A network meta analysis is essentially a study that pools results from several studies together in one big analysis. The difference between a standard meta analysis and a network meta analysis can be elucidated with the following example. We want to see if a new magic pill is better than protein for lean mass gains. A standard meta analysis will only take results from papers where the pill and protein are directly compared with each other within one study. However, a network meta analysis will include studies where the pill is experimented is not compared with protein and is instead compared with something else like a placebo. We compare these kinds of studies together and we can make something called “indirect comparisons”. This type of analysis is very hard to carry out because you have to be very careful with your study selection and the vigilance for bias needs to be even greater than standard meta-analyses so kudos to the authors for putting together such a piece (Li et al. 2011).</p> <p>The reason this study was done in such a manner was because there are actually no studies which directly compare blood pressure medications and exercise. The importance of this investigation is highlighted by the fact that high blood pressure is strongly linked with higher rates of cardiovascular diseases and medications naturally contribute to already expensive healthcare costs (Lewington, Clarke, Qizilbash, Peto and Collins, 2002; OECD, 2017). The increasing use of these medications also leads to problems like polypharmacy (use of many different medications for one individual) leads to issues like higher rates of adverse effects from medications.</p> <p>This analysis decided to look a various types/intensities of exercises along with different types/doses of blood pressure lowering medication. The exercise modalities included endurance, dynamic, isometric and a combination of endurance and dynamic training. There was also analysis done at numerous baselines of blood pressure. An issue with the literature is that there are far more studies done with blood pressure medication than exercise regarding their potency to lower blood pressure. This is supported by the statistic that only 10% of the studies analyzed amongst the hypertensive (high blood pressure) population were from exercise studies. Exercise studies also generally had higher risks of bias and lower sample sizes.</p> <p>When they pooled all the results together without sub-group analysis (i.e. no analysis on smaller, more specific groups of subjects), the medications outperformed exercise by about 4 units of blood pressure on average. Amongst the exercise types, every type performed about the same but the dynamic exercise (standard resistance training) did notably worse by a few units. You could see a positive correlation with drug dosage and blood pressure lowering effects but any correlation with exercise intensity was a lot more ambiguous.</p> <p>However, we see a different story when we narrow the analysis to only hypertensive populations. As we increase the baseline blood pressure, exercise seems to show better results. In fact, as a whole, exercise performed on par with medications. Some exercise types (endurance and combination training especially) were actually found to be more effective than some medications. Intensities and doses did not show any differences.</p> <p>Along with the issues previously described, there was no sorting of exercise studies based on their effectiveness. There are organizations which lay out guidelines for proper medication treatment which helps the authors weed out studies that may not be done properly in regards to medication administration but unfortunately, the same cannot be done for exercise studies. This is because there is no governing body which determines which exact programmes are effective or not. Therefore, it is possible that low-quality exercise studies were included in the analysis.</p> <p>Most studies also start a healthy baseline while we would prefer to see studies done where baseline blood pressures were higher as this is the population we are concerned with. Finally, there needs more reporting of adverse effects in studies where exercise is the intervention. This is done meticulously in most clinical studies. In combination training, there may be a high adverse effect rate because aerobic training can be very fatiguing and negatively affect resistance training performance and safety.</p> <p>As per the usual conclusions, more studies need to be done but these findings are very promising for exercise in a blood pressure control context. Perhaps in the future, it will be a far more common prescription in health care and maybe even find its way into first-line treatment in non-urgent cases.</p> <p><strong>TL;DR:</strong> In healthy people, medications outperform exercise in lower blood pressure. However, as we increase the baseline blood pressure amongst analyzed populations, exercise seems to perform just as good as medications. Endurance and combination training appear to have the greatest effects.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>Now let’s look at a meta analysis looking at the relationship between muscular strength and mortality done by García-Hermoso et al. (2018). The analysis was done amongst healthy adults and 33 studies were included. Overall, it appeared that a greater muscular strength (looking at handgrip strength and leg extension strength) led to a reduced mortality rate. The reported numbers were a 31% reduction mortality with higher handgrip strength and a 14% reduction with higher leg extension strength. There were no differences amongst age groups but the positive effects of strength were more pronounced in women.</p> <p>The authors noted a high heterogeneity in studies analyzed. This means that the studies differed widely in methods used. For example, some measured strength with handgrip strength (the most common measure) while some used other tools. This heterogeneity interferes with the pooling of the studies. Despite this, it does seem that the handgrip measure of strength could be of clinical use to assess mortality risk as it is the most popular tool in this literature.</p> <p><strong>TL;DR:</strong> Being stronger may help you live longer! However, more standardization in this area of research would help accrue better evidence.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>It is now time to journey into the world of frequency in training for a bit. It is a trending topic of research and as such, a few new studies have come out of the woods. I will follow a format of covering some recent interventional studies first and then reporting any new reviews/meta-analyses if available. For this article, we will look over the effects of frequency on strength and hypertrophy as those are common outcomes people will focus on.</p> <p>The theories behind higher frequencies being better for strength include that higher frequencies allow for higher volumes, intensities can be more easily maintained when sessions are spread apart and more sessions give more opportunities to train the neural/motor aspect of strength training.</p> <p>Ochi et al. (2018) put 20 untrained males through 11 weeks of training followed by 6 weeks of detraining. One group did 1 session a week consisting of 6 sets of 12 reps while the the other group did 3 sessions a week of 2 sets of 12 reps (only exercise performed throughout the study was the leg extension). The intensity was roughly maintained at 67% 1RM with volume matched between groups. Outcomes were one repetition maxima, thigh circumference, quadriceps muscle thickness, muscle stiffness (indicator of muscle damage) and maximum voluntary contraction torque (essentially how much force you can produce about a certain joint).</p> <p>The higher frequency did have better 1 repetition maximum gains but the authors reported that there were no statistically significant differences and the standard deviations were quite wide. Regardless, this difference can be noted. Rate of perceived exertion was expectedly greater in the lower frequency group by about 30% on average throughout the study. Stiffness was similar between both groups. Thigh circumference had similar results to the 1 repetition maximum outcome in the sense that the higher frequency group had larger circumferences but no significant results were noted by the authors. While non-significance does support the evidence of there being no difference, statistical significance can be wildly variable and issues with this study’s design as well as no reporting of exact p-values, effect sizes and confidence intervals (for this outcome) do not help make a more solid conclusion. Muscle thickness through the measure of ultrasound was similar between groups.</p> <p>The only statistically significant results reported by the researchers were that at 11 weeks, the maximum voluntary contraction torque was greater in the higher frequency group.</p> <p>A few problems with this study include the low intensity used in this study. In the real life world, most strength-oriented programmes will use a very high intensity as intensity is an important factor in making strength improvements (Schoenfeld, Grgic, Ogborn &amp; Krieger, 2017). There was no dietary control whatsoever. Finally, there was no control group. However, it was good of the authors to collect data at several time points as it is very common to only see data points at the beginning and end of a study.</p> <p><strong>TL;DR:</strong> Potentially more benefits in higher frequency training (thrice vs once a week), however, there are notable issues with the study design that can affect the conclusions we are able to garner from this study.</p> <p>A meta-analysis conducted by Grgic et al. (2018) pooled 22 papers together to carefully examine the relationship between weekly training frequency and strength gains. 22 studies were included. Initially, we see a positive correlation between frequency and strength improvement. However, when we control for volume, as expected, we see no such correlation. While this is a common argument seen amongst those who support lower frequencies, I believe these findings are misapplied. Frequency should be seen as a good way to increase volume. Of course, independently, the current evidence points towards a weak correlation between frequency and strength but training with high volumes is much more manageable if the sessions are spread apart. The same findings can be found in a more recent meta-analysis conducted on the subject by Ralston et al. (2018).</p> <p>Some patterns to note amongst the non-volume matched analyses is that young adults and women responded better to higher frequencies. Upper body, multi-joint exercises were also better with higher frequencies. Women may respond better due to generally having more type I fiber muscle composition which may make them more fatigue-resistant hence being able to handle more sessions per week than men (Haizlip, Harrison &amp; Leinwand, 2015). Improvements in multi-joint exercises may be better because they require more complex motor recruitment patterns which may be poor at baseline but make significant improvements with frequent training. Upper body responds better possibly because the lower body is exposed to constant resistance during activities of daily living moreso than the upper body. Finally, young adults probably have better recovery than older adults which allow them to manage more training sessions per week (Roth et al., 2000).</p> <p>A big gap in the literature is that there is a paucity of data in trained individuals. This meta-analysis could not even conduct a sub-group analysis amongst trained vs un-trained because there were not enough studies on trained people. More research definitely needs to be done in this population.</p> <p><strong>TL;DR:</strong> When equated for volume, higher frequencies will not do much for strength gains. However, they are a good way to boost training volume. Young adults, women, the upper body and multi-joint exercises may respond better to higher frequency training. More data on trained people is needed.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>We will now look at the effects of frequency on muscle hypertrophy. The theories for the relationship largely follow the same ones discussed in the strength literature above. However, muscle protein synthesis (muscle building at a molecular level) is a relevant part of the discussion here. Some theorize that because the muscle protein synthesis response post-exercise is limited to a period of time, it may be a good idea to do frequent sessions throughout the week to keep muscle protein synthesis elevated. This may have an even more pronounced effect in trained individuals because their muscle protein synthesis are generally blunted compared to the untrained population (Damas, Phillips, Vechin &amp; Ugrinowitsch, 2015).</p> <p>A trial ran by Saric et al. (2018) involved 27 trained men to be split into a 2 training groups: a group training 3 times a week and another training 6 times a week. The inclusion criteria for training history was that every subject must have trained at a frequency of at least twice a week for 6 months while training both the upper and lower body. Every set was taken to failure to keep rate of perceived exertion the same and volume was equated through the 6 weeks of exercise intervention. Even though the focus here is hypertrophy, the study outcomes include tests on strength and endurance. For strength, a 1 one repetition maximum bench press and squat test was done. For hypertrophy, ultrasounds were done at the biceps, triceps and 2 quadricep muscles. For endurance, a test where subjects performed the bench press and squat with a load of 60% of 1 repetition maximum for as many repetitions as possible.</p> <p>Volume was generally greater for the higher frequency group. All of the volume differences were statistically insignificant except for the posterior thigh, however, nothing can really be extrapolated from this as the posterior thigh has little to no effect on any of the study outcomes. It’s hard to take any valuable information from this not purely because of the p values but also the deviations from the average were quite wide and comparing total volumes between groups when it is measured in sets<em>repetitions</em>load is difficult. This is because volume differences between specific exercises are much more valuable for analysis when measured in that method. Volume differences may be small between single-joint exercises like the bicep curl and then they can be bigger with higher load exercises like the squat. So if there are any discrepancies in volume, you cannot pinpoint which exercise it is in and therefore cannot extrapolate it to any specific body part.</p> <p>Hypertrophy was very similar between groups but the lower frequency group was the only group to make gains the biceps. Both groups made gains in strength but no difference in improvements. Both groups did not make any real improvements in endurance.</p> <p>We can see that frequency (3/week vs 6/week) does not really have that much of an effect on any outcome including muscle hypertrophy. Regarding the bicep finding, it is possibly because the bicep is included in more multi-joint exercises than the tricep so it perhaps underwent too much volume and suffered from recovery issues in the higher frequency group. A caveat with this study is that it is very short. Muscle hypertrophy is a slow process so studies should take more time to evaluate variables that may have an effect on it. Furthermore, there was no dietary control.</p> <p><strong>TL;DR:</strong> Training 6 times a week has no added benefit over training 3 times a week in not only muscle hypertrophy but muscular strength and endurance in the bench press and squat as well. Study would have been better with a longer duration and dietary control.</p> <p>Just a few days ago, a meta-analysis by Schoenfeld, Grgic &amp; Krieger (2018) exploring the relationship between muscle hypertrophy and training frequency was published. 25 studies were included with the minimum study duration being 6 weeks. There was a lot of different analyses done here. Relationships were checked under volume-equated conditions, under conditions where hypertrophy was measured directly and indirectly, for upper body and lower body and amongst trained individuals. Unfortunately, the meta-analysis could not include analysis on untrained individuals due to not having enough data.</p> <p>Despite all the unique analyses, most of the effects training frequency could possibly muster were trivial. There were tiny effects even in conditions where volume was not equated. The only beacon of light was that under volume-equated conditions, the 3 times/week training frequency had a small (almost-moderate) effect size with the confidence intervals not including values supporting the hypothesis that frequency has no effect on muscle hypertrophy. The lower bound does not even fall into what we would consider trivial effect size. However, it must be noted that the result was statistically insignificant.</p> <p>With the prolonged muscle protein synthesis theory in mind, these results promote caution in those who associate chronic muscular hypertrophy to acute muscle protein synthesis responses. Limitations include that these results only apply to the upper limbs, it is still up in the air whether or not single or multi-joint exercises play a part and that there is no control for other variables like diet, rest or training to failure (however, the meta-analysis reports very low heterogeneity all around and all the studies included should have done their own controlling for these variables).</p> <p><strong>TL;DR:</strong> Even if you do not control volume, it seems frequency has a very minor role to play in hypertrophy yet there are more areas of research to explore, for example, the effects of training frequency on the calf muscles.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>Schoenfeld et al. (2018) decided to see what kind of muscular responses we would get at higher volumes compared to lower volumes. 34, well-trained men (mean training history was 4.5 years) were split into 3 groups where they either did 1 set, 3 sets or 5 sets per exercise every session. Training sessions were held 3 times a week and the programme lasted 8 weeks. All sets were taken to failure to match for rate of perceived exertion. An ultrasound machine was used to assess muscle thickness. Squat and bench press tests were used to determine strength improvements. Endurance was tested with a set of bench press at 50% of 1 repetition maximum done at as many repetitions as possible. For dietary control, a dietary log was completed on 5 different days in week 0 and week 8. A 24 gram protein supplement was also given on training days.</p> <p>The 1 set group had the shortest training sessions at 13 minutes on average whereas the 5 set group obviously had the longest sessions at 68 minutes on average. The average time for the 3 set group was 40 minutes. Strength improvements were similar across groups. Endurance improvements were also similar between groups. Hypertrophy followed a positive correlation in most muscles with evidence towards there being a relationship being highest in the quadriceps. The only muscle that did not support evidence of such a relationship was the triceps. Although, the raw data did show some positive correlation if you follow the effect sizes. Diet composition did not differ by much between groups.</p> <p>The hypertrophy results were likely expected. The similar strength improvements were likely because volume is not the main driving factor in strength gains and it is probably attributed more to something like loads. The same can be said for endurance (a different driver at play). One may argue that the even though the strength improvements are similar, the lower volume groups are at an efficiency advantage due to shorter training sessions. However, these results do not really translate well into the real-life world in this context. This is because strength training sets are generally done at very high intensities where less repetitions are done, rest times are longer and sets are shorter or potentially longer than the times seen in this study. Training history may have not been adequately controlled since training at 5 days a week could have been a novelty for some participants offering a potentially greater improvement in performance. Dietary control could have also been made a more regular requirement throughout the study rather than just having it at the beginning and the end.</p> <p><strong>TL;DR:</strong> Hypertrophy has a positive correlation with number of weekly working sets up to 5 sets per exercise. Strength and endurance are likely driven by other variables like load or frequency.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>To conclude this piece, we will cover a paper completed by Naves et al. (2018). The purpose of this study was to evaluate the effects of high intensity interval training and sprint interval training on body composition and heart health in 49 healthy, women. All interval training was done on a machine bicycle. High intensity interval training (HIIT) involved doing four 4-minute efforts at 90–95% of maximum heart rate with 3 minutes of active rest in between (active rest = 50–60% of maximum heart rate). The sprint interval training (SIT) involved four 30-second all-out efforts with 4 minutes of light cycling in between. Sessions were done 3 times a week for 8 weeks. Study outcomes include waist circumference, skinfolds (to check body fat) and VO2 peak (a measure of endurance or a measure of how healthy the heart is). Diet was controlled with three 24-hour diet recalls at the beginning and end of the study.</p> <p>Adherence in both groups was only 75% in both groups which is quite poor. 3 subjects reported adverse effects (dizziness and vomiting). Only the SIT group had statistically significant reductions in body mass but effect sizes were similar in both groups. The reduction in the sum of all skinfolds was greatest in the SIT group with a 22.2% reduction compared to the HIIT group’s reduction of 15.8%.</p> <p>Reductions in waist circumference were similar between groups. VO2 improvements were also similar. The average timing of the SIT group’s training sessions were 10 minutes shorter on average (23 vs 33 minutes).</p> <p>It appears that SIT leads to greater fat mass reductions while having shorter training sessions compared to HIIT. Another benefit of SIT is that to perform it, you do not need to know your maximum heart rate. Limitations of the study include not having a more thorough dietary control and the use of skinfolds instead of gold standards like magnetic resonance imaging for measuring body fat.</p> <p><strong>TL;DR:</strong> Sprint interval training led to greater fat loss compared to high intensity interval training in women. Sprint interval training sessions were also shorter on average by 10 minutes. Adherence may be an issue and athletes should be aware of possible adverse effects when undergoing interval training.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>Damas, F., Phillips, S., Vechin, F. C. &amp; Ugrinowitsch, C. (2015). A review of resistance training-induced changes in skeletal muscle protein synthesis and their contribution to hypertrophy. Sports Medicine, 45(6), 801–807.</p> <p>García-Hermoso, A., Cavero-Redondo, I., Ramírez-Vélez, R., Ruiz, J. R., Ortega, F. B., Lee, D. &amp; Martínez-Vizcaíno, V. (2018). Muscular Strength as a Predictor of All-Cause Mortality in an Apparently Healthy Population: A Systematic Review and Meta-Analysis of Data From Approximately 2 Million Men and Women. Archives of Physical Medicine and Rehabilitation, 99(10), 2100–2113.</p> <p>Grgic, J., Schoenfeld, B., Davies, T. B., Lazinica, B., Krieger, J. W. &amp; Pedisic, Z. (2018). Effect of Resistance Training Frequency on Gains in Muscular Strength: A Systematic Review and Meta-Analysis. Sports Medicine, 48(5), 1207–1220.</p> <p>Haizlip, K. M., Harrison, B. C. &amp; Leinwand, L. A. (2015). Sex-based differences in skeletal muscle kinetics and fiber-type composition. Physiology, 30(1), 30–39.</p> <p>Lewington, S., Clarke, R., Qizilbash, N., Peto, R. &amp; Collins, R. (2002). Age-specific relevance of usual blood pressure to vascular mortality: a meta-analysis of individual data for one million adults in 61 prospective studies. The Lancet, 360(9349), 1903–1913.</p> <p>Li, T., Puhan, M. A., Vedula, S. S., Singh, S. &amp; Dickersin, K. (2011). Network meta-analysis-highly attractive but more methodological research is needed. BioMed Central, 9(79), .</p> <p>Naci, H., Salcher-Konrad, M., Dias, S., Blum, M. R., Sahoo, S. A., Nunan, D. &amp; Ioannidis, J. P. A. (2018). How does exercise treatment compare with antihypertensive medications? A network meta-analysis of 391 randomised controlled trials assessing exercise and medication effects on systolic blood pressure. British Journal of Sports Medicine, .</p> <p>Naves, J. P. A., Viana, R. B., Rebelo, A. C. S., de Lira, C. A. B., Pimentel, G. D., Lobo, P. C. B., de Oliveira, J. C., … Gentil, P. (2018). Effects of High-Intensity Interval Training vs. Sprint Interval Training on Anthropometric Measures and Cardiorespiratory Fitness in Healthy Young Women. Frontiers in Physiology, 9, .</p> <p>Ochi, E., Maruo, M., Tsuchiya, Y., Ishii, N., Miura, K. &amp; Sasaki, K. (2018). Higher Training Frequency Is Important for Gaining Muscular Strength Under Volume-Matched Training. Frontiers in Physiology, 9(744), .</p> <p>OECD. (2017). Health at a Glance. Retrieved 20 December, 2018, from <a href=\"https://www.oecd-ilibrary.org/social-issues-migration-health/health-at-a-glance_19991312\" target=\"_blank\">https://www.oecd-ilibrary.org/social-issues-migration-health/health-at-a-glance_19991312</a>.</p> <p>Ralston, G. W., Kilgore, L., Wyatt, F. B., Buchan, D. &amp; Baker, J. S. (2018). Weekly Training Frequency Effects on Strength Gain: A Meta-Analysis. Sports Medicine, 4(36), .</p> <p>Roth, S. M., Martel, G. F., Ivey, F. M., Lemmer, J. T., Metter, E. J., Hurley, B. F. &amp; Rogers, M. A. (2000). High-volume, heavy-resistance strength training and muscle damage in young and older women. Journal of Applied Physiology, 88(3), 1112–1118.</p> <p>Saric, J., Lisica, D., Orlic, I., Grgic, J., Krieger, J. W., Vuk, S. &amp; Schoenfeld, B. (2018). Resistance Training Frequencies of 3 and 6 Times Per Week Produce Similar Muscular Adaptations in Resistance-Trained Men. The Journal of Strength &amp; Conditioning Research, Publish Ahead of Print.</p> <p>Schoenfeld, B., Contreras, B., Krieger, J., Grgic, J., Delcastillo, K., Belliard, R. &amp; Alto, A. (2018). Resistance Training Volume Enhances Muscle Hypertrophy but Not Strength in Trained Men. Medicine &amp; Science in Sports &amp; Exercise, 51(1), 94–103.</p> <p>Schoenfeld, B., Grgic, J. &amp; Krieger, J. W. (2018). How many times per week should a muscle be trained to maximize muscle hypertrophy? A systematic review and meta-analysis of studies examining the effects of resistance training frequency. Journal of Sports Sciences, .</p> <p>Schoenfeld, B., Grgic, J., Ogborn, D. &amp; Krieger, J. W. (2017). Strength and Hypertrophy Adaptations Between Low- vs. High-Load Resistance Training: A Systematic Review and Meta-analysis. The Journal of Strength &amp; Conditioning Research, 31(12), 3508–3523.</p> </div><br><br>\nSubmitted December 23, 2018 at 04:12AM by MirrorMageZ<br>\nvia reddit <a href=\"http://bit.ly/2ELqTVl\" target=\"_blank\">http://bit.ly/2ELqTVl</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fitworlds",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#F6F6F6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_08_focused_v3.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_08_focused_v3.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346520340"
                },
                "content_raw": "<p><div class=\"md\"><p>Hey guys, I’m back with more studies. Same drill as last time really. All for education and I hope we can spark some nice discussion like last time!</p> <p>The first study we will take a look at is a new network meta-analysis conducted by Naci et al. (2018) which put exercise against blood pressure medications to see which one is more effective for reducing blood pressure. A network meta analysis is essentially a study that pools results from several studies together in one big analysis. The difference between a standard meta analysis and a network meta analysis can be elucidated with the following example. We want to see if a new magic pill is better than protein for lean mass gains. A standard meta analysis will only take results from papers where the pill and protein are directly compared with each other within one study. However, a network meta analysis will include studies where the pill is experimented is not compared with protein and is instead compared with something else like a placebo. We compare these kinds of studies together and we can make something called “indirect comparisons”. This type of analysis is very hard to carry out because you have to be very careful with your study selection and the vigilance for bias needs to be even greater than standard meta-analyses so kudos to the authors for putting together such a piece (Li et al. 2011).</p> <p>The reason this study was done in such a manner was because there are actually no studies which directly compare blood pressure medications and exercise. The importance of this investigation is highlighted by the fact that high blood pressure is strongly linked with higher rates of cardiovascular diseases and medications naturally contribute to already expensive healthcare costs (Lewington, Clarke, Qizilbash, Peto and Collins, 2002; OECD, 2017). The increasing use of these medications also leads to problems like polypharmacy (use of many different medications for one individual) leads to issues like higher rates of adverse effects from medications.</p> <p>This analysis decided to look a various types/intensities of exercises along with different types/doses of blood pressure lowering medication. The exercise modalities included endurance, dynamic, isometric and a combination of endurance and dynamic training. There was also analysis done at numerous baselines of blood pressure. An issue with the literature is that there are far more studies done with blood pressure medication than exercise regarding their potency to lower blood pressure. This is supported by the statistic that only 10% of the studies analyzed amongst the hypertensive (high blood pressure) population were from exercise studies. Exercise studies also generally had higher risks of bias and lower sample sizes.</p> <p>When they pooled all the results together without sub-group analysis (i.e. no analysis on smaller, more specific groups of subjects), the medications outperformed exercise by about 4 units of blood pressure on average. Amongst the exercise types, every type performed about the same but the dynamic exercise (standard resistance training) did notably worse by a few units. You could see a positive correlation with drug dosage and blood pressure lowering effects but any correlation with exercise intensity was a lot more ambiguous.</p> <p>However, we see a different story when we narrow the analysis to only hypertensive populations. As we increase the baseline blood pressure, exercise seems to show better results. In fact, as a whole, exercise performed on par with medications. Some exercise types (endurance and combination training especially) were actually found to be more effective than some medications. Intensities and doses did not show any differences.</p> <p>Along with the issues previously described, there was no sorting of exercise studies based on their effectiveness. There are organizations which lay out guidelines for proper medication treatment which helps the authors weed out studies that may not be done properly in regards to medication administration but unfortunately, the same cannot be done for exercise studies. This is because there is no governing body which determines which exact programmes are effective or not. Therefore, it is possible that low-quality exercise studies were included in the analysis.</p> <p>Most studies also start a healthy baseline while we would prefer to see studies done where baseline blood pressures were higher as this is the population we are concerned with. Finally, there needs more reporting of adverse effects in studies where exercise is the intervention. This is done meticulously in most clinical studies. In combination training, there may be a high adverse effect rate because aerobic training can be very fatiguing and negatively affect resistance training performance and safety.</p> <p>As per the usual conclusions, more studies need to be done but these findings are very promising for exercise in a blood pressure control context. Perhaps in the future, it will be a far more common prescription in health care and maybe even find its way into first-line treatment in non-urgent cases.</p> <p><strong>TL;DR:</strong> In healthy people, medications outperform exercise in lower blood pressure. However, as we increase the baseline blood pressure amongst analyzed populations, exercise seems to perform just as good as medications. Endurance and combination training appear to have the greatest effects.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>Now let’s look at a meta analysis looking at the relationship between muscular strength and mortality done by García-Hermoso et al. (2018). The analysis was done amongst healthy adults and 33 studies were included. Overall, it appeared that a greater muscular strength (looking at handgrip strength and leg extension strength) led to a reduced mortality rate. The reported numbers were a 31% reduction mortality with higher handgrip strength and a 14% reduction with higher leg extension strength. There were no differences amongst age groups but the positive effects of strength were more pronounced in women.</p> <p>The authors noted a high heterogeneity in studies analyzed. This means that the studies differed widely in methods used. For example, some measured strength with handgrip strength (the most common measure) while some used other tools. This heterogeneity interferes with the pooling of the studies. Despite this, it does seem that the handgrip measure of strength could be of clinical use to assess mortality risk as it is the most popular tool in this literature.</p> <p><strong>TL;DR:</strong> Being stronger may help you live longer! However, more standardization in this area of research would help accrue better evidence.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>It is now time to journey into the world of frequency in training for a bit. It is a trending topic of research and as such, a few new studies have come out of the woods. I will follow a format of covering some recent interventional studies first and then reporting any new reviews/meta-analyses if available. For this article, we will look over the effects of frequency on strength and hypertrophy as those are common outcomes people will focus on.</p> <p>The theories behind higher frequencies being better for strength include that higher frequencies allow for higher volumes, intensities can be more easily maintained when sessions are spread apart and more sessions give more opportunities to train the neural/motor aspect of strength training.</p> <p>Ochi et al. (2018) put 20 untrained males through 11 weeks of training followed by 6 weeks of detraining. One group did 1 session a week consisting of 6 sets of 12 reps while the the other group did 3 sessions a week of 2 sets of 12 reps (only exercise performed throughout the study was the leg extension). The intensity was roughly maintained at 67% 1RM with volume matched between groups. Outcomes were one repetition maxima, thigh circumference, quadriceps muscle thickness, muscle stiffness (indicator of muscle damage) and maximum voluntary contraction torque (essentially how much force you can produce about a certain joint).</p> <p>The higher frequency did have better 1 repetition maximum gains but the authors reported that there were no statistically significant differences and the standard deviations were quite wide. Regardless, this difference can be noted. Rate of perceived exertion was expectedly greater in the lower frequency group by about 30% on average throughout the study. Stiffness was similar between both groups. Thigh circumference had similar results to the 1 repetition maximum outcome in the sense that the higher frequency group had larger circumferences but no significant results were noted by the authors. While non-significance does support the evidence of there being no difference, statistical significance can be wildly variable and issues with this study’s design as well as no reporting of exact p-values, effect sizes and confidence intervals (for this outcome) do not help make a more solid conclusion. Muscle thickness through the measure of ultrasound was similar between groups.</p> <p>The only statistically significant results reported by the researchers were that at 11 weeks, the maximum voluntary contraction torque was greater in the higher frequency group.</p> <p>A few problems with this study include the low intensity used in this study. In the real life world, most strength-oriented programmes will use a very high intensity as intensity is an important factor in making strength improvements (Schoenfeld, Grgic, Ogborn &amp; Krieger, 2017). There was no dietary control whatsoever. Finally, there was no control group. However, it was good of the authors to collect data at several time points as it is very common to only see data points at the beginning and end of a study.</p> <p><strong>TL;DR:</strong> Potentially more benefits in higher frequency training (thrice vs once a week), however, there are notable issues with the study design that can affect the conclusions we are able to garner from this study.</p> <p>A meta-analysis conducted by Grgic et al. (2018) pooled 22 papers together to carefully examine the relationship between weekly training frequency and strength gains. 22 studies were included. Initially, we see a positive correlation between frequency and strength improvement. However, when we control for volume, as expected, we see no such correlation. While this is a common argument seen amongst those who support lower frequencies, I believe these findings are misapplied. Frequency should be seen as a good way to increase volume. Of course, independently, the current evidence points towards a weak correlation between frequency and strength but training with high volumes is much more manageable if the sessions are spread apart. The same findings can be found in a more recent meta-analysis conducted on the subject by Ralston et al. (2018).</p> <p>Some patterns to note amongst the non-volume matched analyses is that young adults and women responded better to higher frequencies. Upper body, multi-joint exercises were also better with higher frequencies. Women may respond better due to generally having more type I fiber muscle composition which may make them more fatigue-resistant hence being able to handle more sessions per week than men (Haizlip, Harrison &amp; Leinwand, 2015). Improvements in multi-joint exercises may be better because they require more complex motor recruitment patterns which may be poor at baseline but make significant improvements with frequent training. Upper body responds better possibly because the lower body is exposed to constant resistance during activities of daily living moreso than the upper body. Finally, young adults probably have better recovery than older adults which allow them to manage more training sessions per week (Roth et al., 2000).</p> <p>A big gap in the literature is that there is a paucity of data in trained individuals. This meta-analysis could not even conduct a sub-group analysis amongst trained vs un-trained because there were not enough studies on trained people. More research definitely needs to be done in this population.</p> <p><strong>TL;DR:</strong> When equated for volume, higher frequencies will not do much for strength gains. However, they are a good way to boost training volume. Young adults, women, the upper body and multi-joint exercises may respond better to higher frequency training. More data on trained people is needed.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>We will now look at the effects of frequency on muscle hypertrophy. The theories for the relationship largely follow the same ones discussed in the strength literature above. However, muscle protein synthesis (muscle building at a molecular level) is a relevant part of the discussion here. Some theorize that because the muscle protein synthesis response post-exercise is limited to a period of time, it may be a good idea to do frequent sessions throughout the week to keep muscle protein synthesis elevated. This may have an even more pronounced effect in trained individuals because their muscle protein synthesis are generally blunted compared to the untrained population (Damas, Phillips, Vechin &amp; Ugrinowitsch, 2015).</p> <p>A trial ran by Saric et al. (2018) involved 27 trained men to be split into a 2 training groups: a group training 3 times a week and another training 6 times a week. The inclusion criteria for training history was that every subject must have trained at a frequency of at least twice a week for 6 months while training both the upper and lower body. Every set was taken to failure to keep rate of perceived exertion the same and volume was equated through the 6 weeks of exercise intervention. Even though the focus here is hypertrophy, the study outcomes include tests on strength and endurance. For strength, a 1 one repetition maximum bench press and squat test was done. For hypertrophy, ultrasounds were done at the biceps, triceps and 2 quadricep muscles. For endurance, a test where subjects performed the bench press and squat with a load of 60% of 1 repetition maximum for as many repetitions as possible.</p> <p>Volume was generally greater for the higher frequency group. All of the volume differences were statistically insignificant except for the posterior thigh, however, nothing can really be extrapolated from this as the posterior thigh has little to no effect on any of the study outcomes. It’s hard to take any valuable information from this not purely because of the p values but also the deviations from the average were quite wide and comparing total volumes between groups when it is measured in sets<em>repetitions</em>load is difficult. This is because volume differences between specific exercises are much more valuable for analysis when measured in that method. Volume differences may be small between single-joint exercises like the bicep curl and then they can be bigger with higher load exercises like the squat. So if there are any discrepancies in volume, you cannot pinpoint which exercise it is in and therefore cannot extrapolate it to any specific body part.</p> <p>Hypertrophy was very similar between groups but the lower frequency group was the only group to make gains the biceps. Both groups made gains in strength but no difference in improvements. Both groups did not make any real improvements in endurance.</p> <p>We can see that frequency (3/week vs 6/week) does not really have that much of an effect on any outcome including muscle hypertrophy. Regarding the bicep finding, it is possibly because the bicep is included in more multi-joint exercises than the tricep so it perhaps underwent too much volume and suffered from recovery issues in the higher frequency group. A caveat with this study is that it is very short. Muscle hypertrophy is a slow process so studies should take more time to evaluate variables that may have an effect on it. Furthermore, there was no dietary control.</p> <p><strong>TL;DR:</strong> Training 6 times a week has no added benefit over training 3 times a week in not only muscle hypertrophy but muscular strength and endurance in the bench press and squat as well. Study would have been better with a longer duration and dietary control.</p> <p>Just a few days ago, a meta-analysis by Schoenfeld, Grgic &amp; Krieger (2018) exploring the relationship between muscle hypertrophy and training frequency was published. 25 studies were included with the minimum study duration being 6 weeks. There was a lot of different analyses done here. Relationships were checked under volume-equated conditions, under conditions where hypertrophy was measured directly and indirectly, for upper body and lower body and amongst trained individuals. Unfortunately, the meta-analysis could not include analysis on untrained individuals due to not having enough data.</p> <p>Despite all the unique analyses, most of the effects training frequency could possibly muster were trivial. There were tiny effects even in conditions where volume was not equated. The only beacon of light was that under volume-equated conditions, the 3 times/week training frequency had a small (almost-moderate) effect size with the confidence intervals not including values supporting the hypothesis that frequency has no effect on muscle hypertrophy. The lower bound does not even fall into what we would consider trivial effect size. However, it must be noted that the result was statistically insignificant.</p> <p>With the prolonged muscle protein synthesis theory in mind, these results promote caution in those who associate chronic muscular hypertrophy to acute muscle protein synthesis responses. Limitations include that these results only apply to the upper limbs, it is still up in the air whether or not single or multi-joint exercises play a part and that there is no control for other variables like diet, rest or training to failure (however, the meta-analysis reports very low heterogeneity all around and all the studies included should have done their own controlling for these variables).</p> <p><strong>TL;DR:</strong> Even if you do not control volume, it seems frequency has a very minor role to play in hypertrophy yet there are more areas of research to explore, for example, the effects of training frequency on the calf muscles.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>Schoenfeld et al. (2018) decided to see what kind of muscular responses we would get at higher volumes compared to lower volumes. 34, well-trained men (mean training history was 4.5 years) were split into 3 groups where they either did 1 set, 3 sets or 5 sets per exercise every session. Training sessions were held 3 times a week and the programme lasted 8 weeks. All sets were taken to failure to match for rate of perceived exertion. An ultrasound machine was used to assess muscle thickness. Squat and bench press tests were used to determine strength improvements. Endurance was tested with a set of bench press at 50% of 1 repetition maximum done at as many repetitions as possible. For dietary control, a dietary log was completed on 5 different days in week 0 and week 8. A 24 gram protein supplement was also given on training days.</p> <p>The 1 set group had the shortest training sessions at 13 minutes on average whereas the 5 set group obviously had the longest sessions at 68 minutes on average. The average time for the 3 set group was 40 minutes. Strength improvements were similar across groups. Endurance improvements were also similar between groups. Hypertrophy followed a positive correlation in most muscles with evidence towards there being a relationship being highest in the quadriceps. The only muscle that did not support evidence of such a relationship was the triceps. Although, the raw data did show some positive correlation if you follow the effect sizes. Diet composition did not differ by much between groups.</p> <p>The hypertrophy results were likely expected. The similar strength improvements were likely because volume is not the main driving factor in strength gains and it is probably attributed more to something like loads. The same can be said for endurance (a different driver at play). One may argue that the even though the strength improvements are similar, the lower volume groups are at an efficiency advantage due to shorter training sessions. However, these results do not really translate well into the real-life world in this context. This is because strength training sets are generally done at very high intensities where less repetitions are done, rest times are longer and sets are shorter or potentially longer than the times seen in this study. Training history may have not been adequately controlled since training at 5 days a week could have been a novelty for some participants offering a potentially greater improvement in performance. Dietary control could have also been made a more regular requirement throughout the study rather than just having it at the beginning and the end.</p> <p><strong>TL;DR:</strong> Hypertrophy has a positive correlation with number of weekly working sets up to 5 sets per exercise. Strength and endurance are likely driven by other variables like load or frequency.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>To conclude this piece, we will cover a paper completed by Naves et al. (2018). The purpose of this study was to evaluate the effects of high intensity interval training and sprint interval training on body composition and heart health in 49 healthy, women. All interval training was done on a machine bicycle. High intensity interval training (HIIT) involved doing four 4-minute efforts at 90–95% of maximum heart rate with 3 minutes of active rest in between (active rest = 50–60% of maximum heart rate). The sprint interval training (SIT) involved four 30-second all-out efforts with 4 minutes of light cycling in between. Sessions were done 3 times a week for 8 weeks. Study outcomes include waist circumference, skinfolds (to check body fat) and VO2 peak (a measure of endurance or a measure of how healthy the heart is). Diet was controlled with three 24-hour diet recalls at the beginning and end of the study.</p> <p>Adherence in both groups was only 75% in both groups which is quite poor. 3 subjects reported adverse effects (dizziness and vomiting). Only the SIT group had statistically significant reductions in body mass but effect sizes were similar in both groups. The reduction in the sum of all skinfolds was greatest in the SIT group with a 22.2% reduction compared to the HIIT group’s reduction of 15.8%.</p> <p>Reductions in waist circumference were similar between groups. VO2 improvements were also similar. The average timing of the SIT group’s training sessions were 10 minutes shorter on average (23 vs 33 minutes).</p> <p>It appears that SIT leads to greater fat mass reductions while having shorter training sessions compared to HIIT. Another benefit of SIT is that to perform it, you do not need to know your maximum heart rate. Limitations of the study include not having a more thorough dietary control and the use of skinfolds instead of gold standards like magnetic resonance imaging for measuring body fat.</p> <p><strong>TL;DR:</strong> Sprint interval training led to greater fat loss compared to high intensity interval training in women. Sprint interval training sessions were also shorter on average by 10 minutes. Adherence may be an issue and athletes should be aware of possible adverse effects when undergoing interval training.</p> <p>— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p> <p>Damas, F., Phillips, S., Vechin, F. C. &amp; Ugrinowitsch, C. (2015). A review of resistance training-induced changes in skeletal muscle protein synthesis and their contribution to hypertrophy. Sports Medicine, 45(6), 801–807.</p> <p>García-Hermoso, A., Cavero-Redondo, I., Ramírez-Vélez, R., Ruiz, J. R., Ortega, F. B., Lee, D. &amp; Martínez-Vizcaíno, V. (2018). Muscular Strength as a Predictor of All-Cause Mortality in an Apparently Healthy Population: A Systematic Review and Meta-Analysis of Data From Approximately 2 Million Men and Women. Archives of Physical Medicine and Rehabilitation, 99(10), 2100–2113.</p> <p>Grgic, J., Schoenfeld, B., Davies, T. B., Lazinica, B., Krieger, J. W. &amp; Pedisic, Z. (2018). Effect of Resistance Training Frequency on Gains in Muscular Strength: A Systematic Review and Meta-Analysis. Sports Medicine, 48(5), 1207–1220.</p> <p>Haizlip, K. M., Harrison, B. C. &amp; Leinwand, L. A. (2015). Sex-based differences in skeletal muscle kinetics and fiber-type composition. Physiology, 30(1), 30–39.</p> <p>Lewington, S., Clarke, R., Qizilbash, N., Peto, R. &amp; Collins, R. (2002). Age-specific relevance of usual blood pressure to vascular mortality: a meta-analysis of individual data for one million adults in 61 prospective studies. The Lancet, 360(9349), 1903–1913.</p> <p>Li, T., Puhan, M. A., Vedula, S. S., Singh, S. &amp; Dickersin, K. (2011). Network meta-analysis-highly attractive but more methodological research is needed. BioMed Central, 9(79), .</p> <p>Naci, H., Salcher-Konrad, M., Dias, S., Blum, M. R., Sahoo, S. A., Nunan, D. &amp; Ioannidis, J. P. A. (2018). How does exercise treatment compare with antihypertensive medications? A network meta-analysis of 391 randomised controlled trials assessing exercise and medication effects on systolic blood pressure. British Journal of Sports Medicine, .</p> <p>Naves, J. P. A., Viana, R. B., Rebelo, A. C. S., de Lira, C. A. B., Pimentel, G. D., Lobo, P. C. B., de Oliveira, J. C., … Gentil, P. (2018). Effects of High-Intensity Interval Training vs. Sprint Interval Training on Anthropometric Measures and Cardiorespiratory Fitness in Healthy Young Women. Frontiers in Physiology, 9, .</p> <p>Ochi, E., Maruo, M., Tsuchiya, Y., Ishii, N., Miura, K. &amp; Sasaki, K. (2018). Higher Training Frequency Is Important for Gaining Muscular Strength Under Volume-Matched Training. Frontiers in Physiology, 9(744), .</p> <p>OECD. (2017). Health at a Glance. Retrieved 20 December, 2018, from <a href=\"https://www.oecd-ilibrary.org/social-issues-migration-health/health-at-a-glance_19991312\" target=\"_blank\">https://www.oecd-ilibrary.org/social-issues-migration-health/health-at-a-glance_19991312</a>.</p> <p>Ralston, G. W., Kilgore, L., Wyatt, F. B., Buchan, D. &amp; Baker, J. S. (2018). Weekly Training Frequency Effects on Strength Gain: A Meta-Analysis. Sports Medicine, 4(36), .</p> <p>Roth, S. M., Martel, G. F., Ivey, F. M., Lemmer, J. T., Metter, E. J., Hurley, B. F. &amp; Rogers, M. A. (2000). High-volume, heavy-resistance strength training and muscle damage in young and older women. Journal of Applied Physiology, 88(3), 1112–1118.</p> <p>Saric, J., Lisica, D., Orlic, I., Grgic, J., Krieger, J. W., Vuk, S. &amp; Schoenfeld, B. (2018). Resistance Training Frequencies of 3 and 6 Times Per Week Produce Similar Muscular Adaptations in Resistance-Trained Men. The Journal of Strength &amp; Conditioning Research, Publish Ahead of Print.</p> <p>Schoenfeld, B., Contreras, B., Krieger, J., Grgic, J., Delcastillo, K., Belliard, R. &amp; Alto, A. (2018). Resistance Training Volume Enhances Muscle Hypertrophy but Not Strength in Trained Men. Medicine &amp; Science in Sports &amp; Exercise, 51(1), 94–103.</p> <p>Schoenfeld, B., Grgic, J. &amp; Krieger, J. W. (2018). How many times per week should a muscle be trained to maximize muscle hypertrophy? A systematic review and meta-analysis of studies examining the effects of resistance training frequency. Journal of Sports Sciences, .</p> <p>Schoenfeld, B., Grgic, J., Ogborn, D. &amp; Krieger, J. W. (2017). Strength and Hypertrophy Adaptations Between Low- vs. High-Load Resistance Training: A Systematic Review and Meta-analysis. The Journal of Strength &amp; Conditioning Research, 31(12), 3508–3523.</p> </div><br><br>\nSubmitted December 23, 2018 at 04:12AM by MirrorMageZ<br>\nvia reddit <a href=\"http://bit.ly/2ELqTVl\" target=\"_blank\">http://bit.ly/2ELqTVl</a></p>",
                "content": "<p><p>Hey guys, I&rsquo;m back with more studies. Same drill as last time really. All for education and I hope we can spark some nice discussion like last time!</p> <p>The first study we will take a look at is a new network meta-analysis conducted by Naci et al. (2018) which put exercise against blood pressure medications to see which one is more effective for reducing blood pressure. A network meta analysis is essentially a study that pools results from several studies together in one big analysis. The difference between a standard meta analysis and a network meta analysis can be elucidated with the following example. We want to see if a new magic pill is better than protein for lean mass gains. A standard meta analysis will only take results from papers where the pill and protein are directly compared with each other within one study. However, a network meta analysis will include studies where the pill is experimented is not compared with protein and is instead compared with something else like a placebo. We compare these kinds of studies together and we can make something called &ldquo;indirect comparisons&rdquo;. This type of analysis is very hard to carry out because you have to be very careful with your study selection and the vigilance for bias needs to be even greater than standard meta-analyses so kudos to the authors for putting together such a piece (Li et al. 2011).</p> <p>The reason this study was done in such a manner was because there are actually no studies which directly compare blood pressure medications and exercise. The importance of this investigation is highlighted by the fact that high blood pressure is strongly linked with higher rates of cardiovascular diseases and medications naturally contribute to already expensive healthcare costs (Lewington, Clarke, Qizilbash, Peto and Collins, 2002; OECD, 2017). The increasing use of these medications also leads to problems like polypharmacy (use of many different medications for one individual) leads to issues like higher rates of adverse effects from medications.</p> <p>This analysis decided to look a various types/intensities of exercises along with different types/doses of blood pressure lowering medication. The exercise modalities included endurance, dynamic, isometric and a combination of endurance and dynamic training. There was also analysis done at numerous baselines of blood pressure. An issue with the literature is that there are far more studies done with blood pressure medication than exercise regarding their potency to lower blood pressure. This is supported by the statistic that only 10% of the studies analyzed amongst the hypertensive (high blood pressure) population were from exercise studies. Exercise studies also generally had higher risks of bias and lower sample sizes.</p> <p>When they pooled all the results together without sub-group analysis (i.e. no analysis on smaller, more specific groups of subjects), the medications outperformed exercise by about 4 units of blood pressure on average. Amongst the exercise types, every type performed about the same but the dynamic exercise (standard resistance training) did notably worse by a few units. You could see a positive correlation with drug dosage and blood pressure lowering effects but any correlation with exercise intensity was a lot more ambiguous.</p> <p>However, we see a different story when we narrow the analysis to only hypertensive populations. As we increase the baseline blood pressure, exercise seems to show better results. In fact, as a whole, exercise performed on par with medications. Some exercise types (endurance and combination training especially) were actually found to be more effective than some medications. Intensities and doses did not show any differences.</p> <p>Along with the issues previously described, there was no sorting of exercise studies based on their effectiveness. There are organizations which lay out guidelines for proper medication treatment which helps the authors weed out studies that may not be done properly in regards to medication administration but unfortunately, the same cannot be done for exercise studies. This is because there is no governing body which determines which exact programmes are effective or not. Therefore, it is possible that low-quality exercise studies were included in the analysis.</p> <p>Most studies also start a healthy baseline while we would prefer to see studies done where baseline blood pressures were higher as this is the population we are concerned with. Finally, there needs more reporting of adverse effects in studies where exercise is the intervention. This is done meticulously in most clinical studies. In combination training, there may be a high adverse effect rate because aerobic training can be very fatiguing and negatively affect resistance training performance and safety.</p> <p>As per the usual conclusions, more studies need to be done but these findings are very promising for exercise in a blood pressure control context. Perhaps in the future, it will be a far more common prescription in health care and maybe even find its way into first-line treatment in non-urgent cases.</p> <p><strong>TL;DR:</strong> In healthy people, medications outperform exercise in lower blood pressure. However, as we increase the baseline blood pressure amongst analyzed populations, exercise seems to perform just as good as medications. Endurance and combination training appear to have the greatest effects.</p> <p>&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;</p> <p>Now let&rsquo;s look at a meta analysis looking at the relationship between muscular strength and mortality done by Garc&iacute;a-Hermoso et al. (2018). The analysis was done amongst healthy adults and 33 studies were included. Overall, it appeared that a greater muscular strength (looking at handgrip strength and leg extension strength) led to a reduced mortality rate. The reported numbers were a 31% reduction mortality with higher handgrip strength and a 14% reduction with higher leg extension strength. There were no differences amongst age groups but the positive effects of strength were more pronounced in women.</p> <p>The authors noted a high heterogeneity in studies analyzed. This means that the studies differed widely in methods used. For example, some measured strength with handgrip strength (the most common measure) while some used other tools. This heterogeneity interferes with the pooling of the studies. Despite this, it does seem that the handgrip measure of strength could be of clinical use to assess mortality risk as it is the most popular tool in this literature.</p> <p><strong>TL;DR:</strong> Being stronger may help you live longer! However, more standardization in this area of research would help accrue better evidence.</p> <p>&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;</p> <p>It is now time to journey into the world of frequency in training for a bit. It is a trending topic of research and as such, a few new studies have come out of the woods. I will follow a format of covering some recent interventional studies first and then reporting any new reviews/meta-analyses if available. For this article, we will look over the effects of frequency on strength and hypertrophy as those are common outcomes people will focus on.</p> <p>The theories behind higher frequencies being better for strength include that higher frequencies allow for higher volumes, intensities can be more easily maintained when sessions are spread apart and more sessions give more opportunities to train the neural/motor aspect of strength training.</p> <p>Ochi et al. (2018) put 20 untrained males through 11 weeks of training followed by 6 weeks of detraining. One group did 1 session a week consisting of 6 sets of 12 reps while the the other group did 3 sessions a week of 2 sets of 12 reps (only exercise performed throughout the study was the leg extension). The intensity was roughly maintained at 67% 1RM with volume matched between groups. Outcomes were one repetition maxima, thigh circumference, quadriceps muscle thickness, muscle stiffness (indicator of muscle damage) and maximum voluntary contraction torque (essentially how much force you can produce about a certain joint).</p> <p>The higher frequency did have better 1 repetition maximum gains but the authors reported that there were no statistically significant differences and the standard deviations were quite wide. Regardless, this difference can be noted. Rate of perceived exertion was expectedly greater in the lower frequency group by about 30% on average throughout the study. Stiffness was similar between both groups. Thigh circumference had similar results to the 1 repetition maximum outcome in the sense that the higher frequency group had larger circumferences but no significant results were noted by the authors. While non-significance does support the evidence of there being no difference, statistical significance can be wildly variable and issues with this study&rsquo;s design as well as no reporting of exact p-values, effect sizes and confidence intervals (for this outcome) do not help make a more solid conclusion. Muscle thickness through the measure of ultrasound was similar between groups.</p> <p>The only statistically significant results reported by the researchers were that at 11 weeks, the maximum voluntary contraction torque was greater in the higher frequency group.</p> <p>A few problems with this study include the low intensity used in this study. In the real life world, most strength-oriented programmes will use a very high intensity as intensity is an important factor in making strength improvements (Schoenfeld, Grgic, Ogborn &amp; Krieger, 2017). There was no dietary control whatsoever. Finally, there was no control group. However, it was good of the authors to collect data at several time points as it is very common to only see data points at the beginning and end of a study.</p> <p><strong>TL;DR:</strong> Potentially more benefits in higher frequency training (thrice vs once a week), however, there are notable issues with the study design that can affect the conclusions we are able to garner from this study.</p> <p>A meta-analysis conducted by Grgic et al. (2018) pooled 22 papers together to carefully examine the relationship between weekly training frequency and strength gains. 22 studies were included. Initially, we see a positive correlation between frequency and strength improvement. However, when we control for volume, as expected, we see no such correlation. While this is a common argument seen amongst those who support lower frequencies, I believe these findings are misapplied. Frequency should be seen as a good way to increase volume. Of course, independently, the current evidence points towards a weak correlation between frequency and strength but training with high volumes is much more manageable if the sessions are spread apart. The same findings can be found in a more recent meta-analysis conducted on the subject by Ralston et al. (2018).</p> <p>Some patterns to note amongst the non-volume matched analyses is that young adults and women responded better to higher frequencies. Upper body, multi-joint exercises were also better with higher frequencies. Women may respond better due to generally having more type I fiber muscle composition which may make them more fatigue-resistant hence being able to handle more sessions per week than men (Haizlip, Harrison &amp; Leinwand, 2015). Improvements in multi-joint exercises may be better because they require more complex motor recruitment patterns which may be poor at baseline but make significant improvements with frequent training. Upper body responds better possibly because the lower body is exposed to constant resistance during activities of daily living moreso than the upper body. Finally, young adults probably have better recovery than older adults which allow them to manage more training sessions per week (Roth et al., 2000).</p> <p>A big gap in the literature is that there is a paucity of data in trained individuals. This meta-analysis could not even conduct a sub-group analysis amongst trained vs un-trained because there were not enough studies on trained people. More research definitely needs to be done in this population.</p> <p><strong>TL;DR:</strong> When equated for volume, higher frequencies will not do much for strength gains. However, they are a good way to boost training volume. Young adults, women, the upper body and multi-joint exercises may respond better to higher frequency training. More data on trained people is needed.</p> <p>&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;</p> <p>We will now look at the effects of frequency on muscle hypertrophy. The theories for the relationship largely follow the same ones discussed in the strength literature above. However, muscle protein synthesis (muscle building at a molecular level) is a relevant part of the discussion here. Some theorize that because the muscle protein synthesis response post-exercise is limited to a period of time, it may be a good idea to do frequent sessions throughout the week to keep muscle protein synthesis elevated. This may have an even more pronounced effect in trained individuals because their muscle protein synthesis are generally blunted compared to the untrained population (Damas, Phillips, Vechin &amp; Ugrinowitsch, 2015).</p> <p>A trial ran by Saric et al. (2018) involved 27 trained men to be split into a 2 training groups: a group training 3 times a week and another training 6 times a week. The inclusion criteria for training history was that every subject must have trained at a frequency of at least twice a week for 6 months while training both the upper and lower body. Every set was taken to failure to keep rate of perceived exertion the same and volume was equated through the 6 weeks of exercise intervention. Even though the focus here is hypertrophy, the study outcomes include tests on strength and endurance. For strength, a 1 one repetition maximum bench press and squat test was done. For hypertrophy, ultrasounds were done at the biceps, triceps and 2 quadricep muscles. For endurance, a test where subjects performed the bench press and squat with a load of 60% of 1 repetition maximum for as many repetitions as possible.</p> <p>Volume was generally greater for the higher frequency group. All of the volume differences were statistically insignificant except for the posterior thigh, however, nothing can really be extrapolated from this as the posterior thigh has little to no effect on any of the study outcomes. It&rsquo;s hard to take any valuable information from this not purely because of the p values but also the deviations from the average were quite wide and comparing total volumes between groups when it is measured in sets<em>repetitions</em>load is difficult. This is because volume differences between specific exercises are much more valuable for analysis when measured in that method. Volume differences may be small between single-joint exercises like the bicep curl and then they can be bigger with higher load exercises like the squat. So if there are any discrepancies in volume, you cannot pinpoint which exercise it is in and therefore cannot extrapolate it to any specific body part.</p> <p>Hypertrophy was very similar between groups but the lower frequency group was the only group to make gains the biceps. Both groups made gains in strength but no difference in improvements. Both groups did not make any real improvements in endurance.</p> <p>We can see that frequency (3/week vs 6/week) does not really have that much of an effect on any outcome including muscle hypertrophy. Regarding the bicep finding, it is possibly because the bicep is included in more multi-joint exercises than the tricep so it perhaps underwent too much volume and suffered from recovery issues in the higher frequency group. A caveat with this study is that it is very short. Muscle hypertrophy is a slow process so studies should take more time to evaluate variables that may have an effect on it. Furthermore, there was no dietary control.</p> <p><strong>TL;DR:</strong> Training 6 times a week has no added benefit over training 3 times a week in not only muscle hypertrophy but muscular strength and endurance in the bench press and squat as well. Study would have been better with a longer duration and dietary control.</p> <p>Just a few days ago, a meta-analysis by Schoenfeld, Grgic &amp; Krieger (2018) exploring the relationship between muscle hypertrophy and training frequency was published. 25 studies were included with the minimum study duration being 6 weeks. There was a lot of different analyses done here. Relationships were checked under volume-equated conditions, under conditions where hypertrophy was measured directly and indirectly, for upper body and lower body and amongst trained individuals. Unfortunately, the meta-analysis could not include analysis on untrained individuals due to not having enough data.</p> <p>Despite all the unique analyses, most of the effects training frequency could possibly muster were trivial. There were tiny effects even in conditions where volume was not equated. The only beacon of light was that under volume-equated conditions, the 3 times/week training frequency had a small (almost-moderate) effect size with the confidence intervals not including values supporting the hypothesis that frequency has no effect on muscle hypertrophy. The lower bound does not even fall into what we would consider trivial effect size. However, it must be noted that the result was statistically insignificant.</p> <p>With the prolonged muscle protein synthesis theory in mind, these results promote caution in those who associate chronic muscular hypertrophy to acute muscle protein synthesis responses. Limitations include that these results only apply to the upper limbs, it is still up in the air whether or not single or multi-joint exercises play a part and that there is no control for other variables like diet, rest or training to failure (however, the meta-analysis reports very low heterogeneity all around and all the studies included should have done their own controlling for these variables).</p> <p><strong>TL;DR:</strong> Even if you do not control volume, it seems frequency has a very minor role to play in hypertrophy yet there are more areas of research to explore, for example, the effects of training frequency on the calf muscles.</p> <p>&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;</p> <p>Schoenfeld et al. (2018) decided to see what kind of muscular responses we would get at higher volumes compared to lower volumes. 34, well-trained men (mean training history was 4.5 years) were split into 3 groups where they either did 1 set, 3 sets or 5 sets per exercise every session. Training sessions were held 3 times a week and the programme lasted 8 weeks. All sets were taken to failure to match for rate of perceived exertion. An ultrasound machine was used to assess muscle thickness. Squat and bench press tests were used to determine strength improvements. Endurance was tested with a set of bench press at 50% of 1 repetition maximum done at as many repetitions as possible. For dietary control, a dietary log was completed on 5 different days in week 0 and week 8. A 24 gram protein supplement was also given on training days.</p> <p>The 1 set group had the shortest training sessions at 13 minutes on average whereas the 5 set group obviously had the longest sessions at 68 minutes on average. The average time for the 3 set group was 40 minutes. Strength improvements were similar across groups. Endurance improvements were also similar between groups. Hypertrophy followed a positive correlation in most muscles with evidence towards there being a relationship being highest in the quadriceps. The only muscle that did not support evidence of such a relationship was the triceps. Although, the raw data did show some positive correlation if you follow the effect sizes. Diet composition did not differ by much between groups.</p> <p>The hypertrophy results were likely expected. The similar strength improvements were likely because volume is not the main driving factor in strength gains and it is probably attributed more to something like loads. The same can be said for endurance (a different driver at play). One may argue that the even though the strength improvements are similar, the lower volume groups are at an efficiency advantage due to shorter training sessions. However, these results do not really translate well into the real-life world in this context. This is because strength training sets are generally done at very high intensities where less repetitions are done, rest times are longer and sets are shorter or potentially longer than the times seen in this study. Training history may have not been adequately controlled since training at 5 days a week could have been a novelty for some participants offering a potentially greater improvement in performance. Dietary control could have also been made a more regular requirement throughout the study rather than just having it at the beginning and the end.</p> <p><strong>TL;DR:</strong> Hypertrophy has a positive correlation with number of weekly working sets up to 5 sets per exercise. Strength and endurance are likely driven by other variables like load or frequency.</p> <p>&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;</p> <p>To conclude this piece, we will cover a paper completed by Naves et al. (2018). The purpose of this study was to evaluate the effects of high intensity interval training and sprint interval training on body composition and heart health in 49 healthy, women. All interval training was done on a machine bicycle. High intensity interval training (HIIT) involved doing four 4-minute efforts at 90&ndash;95% of maximum heart rate with 3 minutes of active rest in between (active rest = 50&ndash;60% of maximum heart rate). The sprint interval training (SIT) involved four 30-second all-out efforts with 4 minutes of light cycling in between. Sessions were done 3 times a week for 8 weeks. Study outcomes include waist circumference, skinfolds (to check body fat) and VO2 peak (a measure of endurance or a measure of how healthy the heart is). Diet was controlled with three 24-hour diet recalls at the beginning and end of the study.</p> <p>Adherence in both groups was only 75% in both groups which is quite poor. 3 subjects reported adverse effects (dizziness and vomiting). Only the SIT group had statistically significant reductions in body mass but effect sizes were similar in both groups. The reduction in the sum of all skinfolds was greatest in the SIT group with a 22.2% reduction compared to the HIIT group&rsquo;s reduction of 15.8%.</p> <p>Reductions in waist circumference were similar between groups. VO2 improvements were also similar. The average timing of the SIT group&rsquo;s training sessions were 10 minutes shorter on average (23 vs 33 minutes).</p> <p>It appears that SIT leads to greater fat mass reductions while having shorter training sessions compared to HIIT. Another benefit of SIT is that to perform it, you do not need to know your maximum heart rate. Limitations of the study include not having a more thorough dietary control and the use of skinfolds instead of gold standards like magnetic resonance imaging for measuring body fat.</p> <p><strong>TL;DR:</strong> Sprint interval training led to greater fat loss compared to high intensity interval training in women. Sprint interval training sessions were also shorter on average by 10 minutes. Adherence may be an issue and athletes should be aware of possible adverse effects when undergoing interval training.</p> <p>&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;&#8202;&mdash;</p> <p>Damas, F., Phillips, S., Vechin, F. C. &amp; Ugrinowitsch, C. (2015). A review of resistance training-induced changes in skeletal muscle protein synthesis and their contribution to hypertrophy. Sports Medicine, 45(6), 801&ndash;807.</p> <p>Garc&iacute;a-Hermoso, A., Cavero-Redondo, I., Ram&iacute;rez-V&eacute;lez, R., Ruiz, J. R., Ortega, F. B., Lee, D. &amp; Mart&iacute;nez-Vizca&iacute;no, V. (2018). Muscular Strength as a Predictor of All-Cause Mortality in an Apparently Healthy Population: A Systematic Review and Meta-Analysis of Data From Approximately 2 Million Men and Women. Archives of Physical Medicine and Rehabilitation, 99(10), 2100&ndash;2113.</p> <p>Grgic, J., Schoenfeld, B., Davies, T. B., Lazinica, B., Krieger, J. W. &amp; Pedisic, Z. (2018). Effect of Resistance Training Frequency on Gains in Muscular Strength: A Systematic Review and Meta-Analysis. Sports Medicine, 48(5), 1207&ndash;1220.</p> <p>Haizlip, K. M., Harrison, B. C. &amp; Leinwand, L. A. (2015). Sex-based differences in skeletal muscle kinetics and fiber-type composition. Physiology, 30(1), 30&ndash;39.</p> <p>Lewington, S., Clarke, R., Qizilbash, N., Peto, R. &amp; Collins, R. (2002). Age-specific relevance of usual blood pressure to vascular mortality: a meta-analysis of individual data for one million adults in 61 prospective studies. The Lancet, 360(9349), 1903&ndash;1913.</p> <p>Li, T., Puhan, M. A., Vedula, S. S., Singh, S. &amp; Dickersin, K. (2011). Network meta-analysis-highly attractive but more methodological research is needed. BioMed Central, 9(79), .</p> <p>Naci, H., Salcher-Konrad, M., Dias, S., Blum, M. R., Sahoo, S. A., Nunan, D. &amp; Ioannidis, J. P. A. (2018). How does exercise treatment compare with antihypertensive medications? A network meta-analysis of 391 randomised controlled trials assessing exercise and medication effects on systolic blood pressure. British Journal of Sports Medicine, .</p> <p>Naves, J. P. A., Viana, R. B., Rebelo, A. C. S., de Lira, C. A. B., Pimentel, G. D., Lobo, P. C. B., de Oliveira, J. C., &hellip; Gentil, P. (2018). Effects of High-Intensity Interval Training vs. Sprint Interval Training on Anthropometric Measures and Cardiorespiratory Fitness in Healthy Young Women. Frontiers in Physiology, 9, .</p> <p>Ochi, E., Maruo, M., Tsuchiya, Y., Ishii, N., Miura, K. &amp; Sasaki, K. (2018). Higher Training Frequency Is Important for Gaining Muscular Strength Under Volume-Matched Training. Frontiers in Physiology, 9(744), .</p> <p>OECD. (2017). Health at a Glance. Retrieved 20 December, 2018, from <a href=\"https://www.oecd-ilibrary.org/social-issues-migration-health/health-at-a-glance_19991312\" target=\"_blank\">https://www.oecd-ilibrary.org/social-issues-migration-health/health-at-a-glance_19991312</a>.</p> <p>Ralston, G. W., Kilgore, L., Wyatt, F. B., Buchan, D. &amp; Baker, J. S. (2018). Weekly Training Frequency Effects on Strength Gain: A Meta-Analysis. Sports Medicine, 4(36), .</p> <p>Roth, S. M., Martel, G. F., Ivey, F. M., Lemmer, J. T., Metter, E. J., Hurley, B. F. &amp; Rogers, M. A. (2000). High-volume, heavy-resistance strength training and muscle damage in young and older women. Journal of Applied Physiology, 88(3), 1112&ndash;1118.</p> <p>Saric, J., Lisica, D., Orlic, I., Grgic, J., Krieger, J. W., Vuk, S. &amp; Schoenfeld, B. (2018). Resistance Training Frequencies of 3 and 6 Times Per Week Produce Similar Muscular Adaptations in Resistance-Trained Men. The Journal of Strength &amp; Conditioning Research, Publish Ahead of Print.</p> <p>Schoenfeld, B., Contreras, B., Krieger, J., Grgic, J., Delcastillo, K., Belliard, R. &amp; Alto, A. (2018). Resistance Training Volume Enhances Muscle Hypertrophy but Not Strength in Trained Men. Medicine &amp; Science in Sports &amp; Exercise, 51(1), 94&ndash;103.</p> <p>Schoenfeld, B., Grgic, J. &amp; Krieger, J. W. (2018). How many times per week should a muscle be trained to maximize muscle hypertrophy? A systematic review and meta-analysis of studies examining the effects of resistance training frequency. Journal of Sports Sciences, .</p> <p>Schoenfeld, B., Grgic, J., Ogborn, D. &amp; Krieger, J. W. (2017). Strength and Hypertrophy Adaptations Between Low- vs. High-Load Resistance Training: A Systematic Review and Meta-analysis. The Journal of Strength &amp; Conditioning Research, 31(12), 3508&ndash;3523.</p> <br /><br />\nSubmitted December 23, 2018 at 04:12AM by MirrorMageZ<br />\nvia reddit <a href=\"http://bit.ly/2ELqTVl\" target=\"_blank\">http://bit.ly/2ELqTVl</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "thatonecoolnara",
        "blog": {
            "name": "thatonecoolnara",
            "title": "More Info About Vegas",
            "description": "<h2><a href=\"https://medium.com/@b4isayyes\">Affordable Wedding Venue Near The Strip</a> </h2>\n<h3>\n<ul>\n<li><a href=\"https://twitter.com/b4isayyes\">A Review Of Las Vegas Nv 89117</a></li>\n<li><a href=\"https://goo.gl/maps/8TokqXzjgcN2\">Affordable Wedding Venue Near The Strip</a></li>\n<li><a href=\"https://goo.gl/sWTMgD\">Directions Around Vegas Destinations</a></li>\n</ul>\n</h3>\n\n<p>With a collection of restaurants as vivid, varied and also glamorous as the Strip itself, Las Vegas uses the elite tourist an array of international food.\n\nWhether it's eating on the standard French fare of epic chef Joël Robuchon, or delighting in food with a view at the spectacular Mix Dining establishment, Transgression City is assured to satisfy even one of the most demanding elite traveler's cooking hunger.\n\nStyle/Ambiance: A stunning 80-foot-tall sculptural Tree House dining establishment providing food as magnificent as the view.\n\nFound inside the patronize The Crystals, the expansive inside of the Tree Residence includes Mastro's primary dining room.\n\nVisitors enter the restaurant through a sophisticated website of wood-lined reduced ceilings and winding walls. The grandeur of the dining room and terrace supply the best setup for guests to example the menu. The dining establishment's well known three-tiered cold Seafood Tower supplies a distinct culinary experience. </p>\n\n<iframe src=\"https://www.google.com/maps/d/embed?mid=1fKOzsKKRmhPDHf_UgVHx7-inMAjFAwKV\" width=\"640\" height=\"480\"></iframe>",
            "url": "https://thatonecoolnara.tumblr.com/",
            "uuid": "t:d4PmfD_4H79djf1BJBcW4g",
            "updated": 1558466146
        },
        "id": 181346516180,
        "post_url": "https://thatonecoolnara.tumblr.com/post/181346516180",
        "slug": "latest-health-fitness-technology-digital",
        "date": "2018-12-23 13:50:04 GMT",
        "timestamp": 1545573004,
        "state": "published",
        "format": "html",
        "reblog_key": "7ugKPWvD",
        "tags": [
            "Guestpost",
            "Health",
            "Fitness",
            "Technology",
            "Pets",
            "Marketing"
        ],
        "short_url": "https://tmblr.co/ZcAU6b2ev63pK",
        "summary": "Latest Health & Fitness, Technology, Digital marketing and Pets Articles - Accepting Guest Post",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": "Latest Health & Fitness, Technology, Digital marketing and Pets Articles - Accepting Guest Post",
        "body": "<p>Checkout the latest health &amp; fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br/></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
        "reblog": {
            "comment": "<p>Checkout the latest health & fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thatonecoolnara",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/abbe1381505ef63ef61ff725d48c96ce/irbfame/uMmp8kkp3/tumblr_static_bpdji1i8iyo00wo8gko0w8400.jpg",
                        "header_image_focused": "https://static.tumblr.com/abbe1381505ef63ef61ff725d48c96ce/irbfame/uMmp8kkp3/tumblr_static_bpdji1i8iyo00wo8gko0w8400_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/abbe1381505ef63ef61ff725d48c96ce/irbfame/uMmp8kkp3/tumblr_static_bpdji1i8iyo00wo8gko0w8400_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346516180"
                },
                "content_raw": "<p>Checkout the latest health & fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
                "content": "<p>Checkout the latest health &amp; fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br /></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "imthenewblakc",
        "blog": {
            "name": "imthenewblakc",
            "title": "imthenewblakc",
            "description": "<h1>\n<a href=\"https://goo.gl/nQy9t4\">Best Las Vegas Nevada Secrets</a>\n</h1>\n\n<h2>\n<a href=\"https://beforeisayyes.tumblr.com\">Vegas Nevada Best Of</a>\n</h2>\n\n<h3>\n<ul>\n<li><a href=\"https://goo.gl/maps/wJLncaEUZ3S2\">Five Star | Las Vegas Wedding Venue Review</a></li>\n<li><a href=\"https://goo.gl/maps/ankqD8qWxJB2\">Lakeside Weddings and Events 2620 Regatta Dr #102, Las Vegas, NV 89128 (702) 240-5290</a></li>\n<li><a href=\"https://goo.gl/5apGVy\">Top Wedding Venue Las Vegas Nv</a></li>\n</ul>\n</h3>\n<p>\nThese Houses are at this time detailed available for purchase. They can be owned by a lender or a lender who took ownership through foreclosure proceedings. They're often known as bank-owned or real-estate owned (REO).\n\nCheck out dialogue · Vegas @Vegas 9h Replying to @osullime193 Let's make it easier to make the most out of the Distinctive day! Strategy your best working day in Las Vegas: stop by-las-vegas.onlineof.fr/374529472 pic.twitter.com/0gkWVxtVSa\n\nLas Vegas is usually considered an adults-only vacation spot, but there's an abundance of pleasurable below ...\n<br>\nBy clicking “Get Transferring Estimates” I consent to staying contacted in the contact number I’ve offered higher than, which includes by making use of an automated dialing program or a man-made or pre-recorded message: (A) to acquire going rates from as many as four (4) firms as could possibly be chosen by Moving.\n\n\"Las Vegas\" is usually applied to explain spots beyond Formal metropolis limitations—In particular the parts on and close to the Las Vegas Strip, which is definitely Found within the unincorporated communities of Paradise, Winchester, and Company.[13][fourteen]\n<br>\nHomeowners Association (HOA) expenses are every month or annual expenses that deal with the costs of protecting and strengthening shared spaces. HOA expenses are frequent within condos and many single-relatives dwelling neighborhoods.\n<br><br>\nWe ensure it is effortless to search out your aspiration property by filtering house varieties, price tag and sizing. Filtering with key phrase lookup is additionally achievable, like \"waterfront\" or \"on corner ton\" residences in 89117. If you're looking specifically for households in 89117 or apartments in 89117, We have got you covered there likewise.\n<br>\nBecause of the realization of numerous revitalization endeavours, 2012 was dubbed \"The 12 months of Downtown.\" Countless an incredible number of dollars' truly worth of jobs made their debut at the moment.\n<br>\nMy Home Get brief and easy accessibility to your house price, neighborhood activity and financial possibilites.\n<br>\nIn get more info response to the first rumors with the eventual NHL enlargement crew in Las Vegas, ESPN writer Scott Burnside famous many road blocks that will be confronted by the town if it have been to become an expert sports activities industry, including the presence of authorized sporting activities betting, scheduling conflicts with the big quantity of people who do the job nighttime and right away shifts, and the casinos can be unlikely to provide absent tickets to these kinds of functions like a promotion, as they operate Opposite to some objective of encouraging patrons to stay inside their services.[68]\n<br>\nLas Vegas includes a subtropical scorching desert local climate (Köppen local weather classification: BWh), common of your Mojave Desert where it lies. This climate is typified by extensive, very incredibly hot summers; warm transitional seasons; and brief, moderate to chilly winters. There exists plentiful sunshine All year long, with a median of 310 sunny times and brilliant sunshine throughout 86% of all daylight hrs.\n<br>\nBy joining this subscription method you authorize MGM Grand to mail you automatic advertising text message at the cell range delivered. Consent is just not demanded to invest in merchandise or products and services. Cell Variety\n<br>\nWe ensure it is uncomplicated to uncover your dream house by filtering home sorts, selling price and dimensions. Filtering with search term look for can also be achievable, like \"waterfront\" or \"walkin closets\" properties in 89117. If You are looking especially for properties in 89117 or apartments in 89117, We have got you protected there too.\n<br>\nThe lender initiated foreclosure proceedings on these Homes as the owner(s) were in default on their own personal loan obligations. Pre-foreclosures also include things like Homes for which a foreclosure auction is scheduled. These Qualities are not observed on the multiple listing assistance (MLS).\n</p>\n\n<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3219.315816739837!2d-115.27032568472667!3d36.20751798007492!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x80c8eaa68c3f73fd%3A0xe0619895e2779e13!2sLakeside+Weddings+and+Events!5e0!3m2!1sen!2sus!4v1526273621289\" width=\"600\" height=\"450\" frameborder=\"0\" style=\"border:0\" allowfullscreen></iframe>",
            "url": "https://imthenewblakc.tumblr.com/",
            "uuid": "t:ogyedT2xTceF96OqMlXOmg",
            "updated": 1558505741
        },
        "id": 181346516300,
        "post_url": "https://imthenewblakc.tumblr.com/post/181346516300",
        "slug": "latest-health-fitness-technology-digital",
        "date": "2018-12-23 13:50:04 GMT",
        "timestamp": 1545573004,
        "state": "published",
        "format": "html",
        "reblog_key": "hApkXZDN",
        "tags": [
            "Guestpost",
            "Health",
            "Fitness",
            "Technology",
            "Pets",
            "Marketing"
        ],
        "short_url": "https://tmblr.co/ZAzR6b2ev63rC",
        "summary": "Latest Health & Fitness, Technology, Digital marketing and Pets Articles - Accepting Guest Post",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": "Latest Health & Fitness, Technology, Digital marketing and Pets Articles - Accepting Guest Post",
        "body": "<p>Checkout the latest health &amp; fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br/></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
        "reblog": {
            "comment": "<p>Checkout the latest health & fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "imthenewblakc",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/ef3c557f5919904db3c3b47b4ee4e6fc/hndudrl/XXJp8kklk/tumblr_static_bpun1ags94gsoksswk8ossk0g.jpg",
                        "header_image_focused": "https://static.tumblr.com/ef3c557f5919904db3c3b47b4ee4e6fc/hndudrl/XXJp8kklk/tumblr_static_bpun1ags94gsoksswk8ossk0g_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/ef3c557f5919904db3c3b47b4ee4e6fc/hndudrl/XXJp8kklk/tumblr_static_bpun1ags94gsoksswk8ossk0g_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346516300"
                },
                "content_raw": "<p>Checkout the latest health & fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
                "content": "<p>Checkout the latest health &amp; fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br /></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "tiny---raindrop",
        "blog": {
            "name": "tiny---raindrop",
            "title": "Las Vegas is Back ",
            "description": "<h2><center>\n<ul>\n<li><a title=\"las vegas wedding venue\" href=\"https://goo.gl/maps/6mW6xxYvV7m\" target=\"_blank\">Las Vegas Nevada <strong>Best Wedding Venue</strong></a></li>\n<li><a title=\"Lakeside Weddings and Events 5 star Review\" href=\"https://goo.gl/maps/nPiD7ti89Q42\" target=\"_blank\">5-Star Review Las Vegas Wedding Venue</a></li>\n<li><a title=\"Lakeside Weddings and Events \" href=\"https://www.google.com/maps?cid=16168371906753830419\" target=\"_blank\">Lakeside Weddings and Events 2620 Regatta Dr #102, Las Vegas, NV 89128 (702) 240-5290 </a></li>\n<li><a title=\"Las Vegas Nevada 89128\" href=\"https://lakesideweddings.com/fight-night-in-las-vegas/\">Top Wedding Venue Las Vegas Nv</a></li>\n</ul></h2></center>\n\n<center>\n<table style=\"width: 100%; border-collapse: collapse; background-color: #9ce6d3; border-style: solid; border-color: #080707; margin-left: auto; margin-right: auto;\" border=\"1\" cellpadding=\"25\">\n<tbody>\n<tr>\n<td style=\"width: 100%; text-align: center;\">Directions To Las Vegas Wedding Venue From The Vegas Strip</td>\n</tr>\n<tr>\n<td style=\"width: 100%;\"><center><iframe src=\"https://www.google.com/maps/d/embed?mid=1fKOzsKKRmhPDHf_UgVHx7-inMAjFAwKV\" width=\"640\" height=\"480\">las vegas wedding venues</iframe></center></td>\n</tr>\n</tbody>\n</table>\n</center>\n<br>\n<br>\n\n<p style=\"text-align: justify; padding-left: 60px;\"><span style=\"font-family: 'arial black', 'avant garde';\">Savvy locals know all the most beneficial spots to eat in Las Vegas, on and from the Strip. These dining places are beloved by locals...</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">Run by SecureRightsTM By clicking the button, you accept, consent and comply with the next: a) Our Privacy Coverage and consent to get notices and various communications electronically. b) We take your privacy critically. You might be furnishing Specific published consent for Secure Rights to share your info with up to 4 (4) of its Premier Companions and for Safe Rights, functions contacting on behalf of Safe Legal rights, Leading Associates or licensed 3rd get-togethers on their own behalf to Get in touch with you (such as by way of automatic signifies; e.g. </span>autodialing<span style=\"font-family: 'arial black', 'avant garde';\">, text and pre-recorded messaging) by way of telephone, cell machine (together with SMS and MMS) and/or </span>e mail<span style=\"font-family: 'arial black', 'avant garde';\">, regardless of whether your telephone amount is at present outlined on any state, federal, area or company Tend not to Get in touch with checklist. c) Consent just isn't necessary to be able to invest in products and companies from your Lenders that Make contact with you or to employ Safe Legal rights products and services.</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">The main points of interest in Las Vegas are classified as the casinos along with the resorts, Though in recent times other new attractions have started to arise.</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">Think you know each of the prime spots to hit in Vegas? Reconsider. Although there are plenty of billboards showcasing preferred points of interest, and </span>you'll&rsquo;t<span style=\"font-family: 'arial black', 'avant garde';\"> miss the lines outdoors...</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">It appears like Cookies are disabled in your browser. For the top practical experience, you should enable cookies when utilizing our site.</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">The worst time to visit Las Vegas is at the height of summer months, from mid-June to late August, when temperatures routinely top rated a hundred degrees Fahrenheit, and perhaps ubiquitous air conditioning are unable to constantly help save you from sweltering.</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">Las Vegas is noted for its significant buffets, but that's absolutely not the one indulgent eating selection town has got to...</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">Don't seek to hail a cab on the road, because it's essentially illegal for drivers to pick up passengers roadside. As an alternative, head to some taxi stand in a lodge-On line </span>casino,<span style=\"font-family: 'arial black', 'avant garde';\"> or get in touch with a dispatch to pick you up at a specific area.</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">As outlined by a 2004 review, Las Vegas has one among the very best divorce premiums.[50][fifty one] The city's high divorce rate is not really wholly because of Las Vegans themselves getting divorced. Due to the fact divorce is easier in Nevada than most other states, A lot more info of people originate from across the nation to </span>the a<span style=\"font-family: 'arial black', 'avant garde';\"> lot easier system.</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">In response to the initial rumors of your eventual NHL enlargement team in Las Vegas, ESPN author Scott Burnside mentioned many hurdles that may be faced by town if it </span>have<span style=\"font-family: 'arial black', 'avant garde';\"> been to become knowledgeable sports marketplace, including the presence of lawful athletics betting, scheduling conflicts with the large </span>quantity<span style=\"font-family: 'arial black', 'avant garde';\"> of residents who get the job done nighttime and right away shifts, and that the casinos would be unlikely to offer absent tickets to this sort of situations as being </span>a advertising<span style=\"font-family: 'arial black', 'avant garde';\">, since they run Opposite to the aim of encouraging patrons to remain in their amenities.[sixty eight]</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">College details provided by GreatSchools. School company boundaries are meant to be employed as reference only. To confirm enrollment eligibility for your assets, Make contact with The college instantly.</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">In the event the Mirage opened in 1989, it started out a development of main vacation resort advancement to the Las Vegas Strip beyond the town. This resulted </span>within<span style=\"font-family: 'arial black', 'avant garde';\"> a fall in tourism inside the downtown space, but several new initiatives have increased the </span>quantity<span style=\"font-family: 'arial black', 'avant garde';\"> of website visitors to downtown.</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">Get a complete refund if you decide to terminate your reservation no later than </span>seventy two<span style=\"font-family: 'arial black', 'avant garde';\"> hours previous to your arrival, Except if specially excluded by booked give. Other journey web pages may possibly demand you for cancellations.</span><br /><span style=\"font-family: 'arial black', 'avant garde';\">An exertion is produced by metropolis officers to diversify the overall economy by attracting wellness-related, significant-tech along with other commercial pursuits. No state tax for people or firms, in addition to a deficiency of other kinds of company-linked taxes,[55] have aided the accomplishment of such attempts.</span></p>",
            "url": "https://tiny---raindrop.tumblr.com/",
            "uuid": "t:eeJHmVPgkS2VH3tACzibEw",
            "updated": 1558505594
        },
        "id": 181346515920,
        "post_url": "https://tiny---raindrop.tumblr.com/post/181346515920",
        "slug": "latest-health-fitness-technology-digital",
        "date": "2018-12-23 13:50:03 GMT",
        "timestamp": 1545573003,
        "state": "published",
        "format": "html",
        "reblog_key": "1aQ2Ow1L",
        "tags": [
            "Guestpost",
            "Health",
            "Fitness",
            "Technology",
            "Pets",
            "Marketing"
        ],
        "short_url": "https://tmblr.co/ZsVY6b2ev63lG",
        "summary": "Latest Health & Fitness, Technology, Digital marketing and Pets Articles - Accepting Guest Post",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": "Latest Health & Fitness, Technology, Digital marketing and Pets Articles - Accepting Guest Post",
        "body": "<p>Checkout the latest health &amp; fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br/></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
        "reblog": {
            "comment": "<p>Checkout the latest health & fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "tiny---raindrop",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/ddcf80d01503365b0bfa10899dee6c78/oes9rmd/zEJp8kkmq/tumblr_static_22956ctv8ym8wc08000gk4s0g.jpg",
                        "header_image_focused": "https://static.tumblr.com/ddcf80d01503365b0bfa10899dee6c78/oes9rmd/zEJp8kkmq/tumblr_static_22956ctv8ym8wc08000gk4s0g_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/ddcf80d01503365b0bfa10899dee6c78/oes9rmd/zEJp8kkmq/tumblr_static_22956ctv8ym8wc08000gk4s0g_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346515920"
                },
                "content_raw": "<p>Checkout the latest health & fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
                "content": "<p>Checkout the latest health &amp; fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br /></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "ddaewi",
        "blog": {
            "name": "ddaewi",
            "title": "Las Vegas Nevada - Clark County",
            "description": "<h2><a href=https://goo.gl/qsCcW2?rNRAbl\">Top Things About Las Vegas</a></h2>\n\n<h3><ul>\n<li><a href=\"https://beforeisayyes.tumblr.com/\">Las Vegas Wedding Venue</a> </li>\n<li><a href=\"https://goo.gl/qsCcW2?ZLHFEk\">Top Wedding Venue Near The Strip</a></li>\n<li><a href=\"https://goo.gl/qsCcW2?07J0CS\">5- Star Vegas Wedding Venue</a></li>\n</ul>\n</h3>\n\n<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3219.315816739837!2d-115.27032568472667!3d36.20751798007492!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x80c8eaa68c3f73fd%3A0xe0619895e2779e13!2sLakeside+Weddings+and+Events!5e0!3m2!1sen!2sus!4v1526068598421\" width=\"600\" height=\"450\" frameborder=\"0\" style=\"border:0\" allowfullscreen></iframe>",
            "url": "https://ddaewi.tumblr.com/",
            "uuid": "t:5_unCDXJK_i6-b_ECj7aFQ",
            "updated": 1558515966
        },
        "id": 181346520064,
        "post_url": "https://ddaewi.tumblr.com/post/181346520064",
        "slug": "latest-health-fitness-technology-digital",
        "date": "2018-12-23 13:50:03 GMT",
        "timestamp": 1545573003,
        "state": "published",
        "format": "html",
        "reblog_key": "COgHmStT",
        "tags": [
            "Guestpost",
            "Health",
            "Fitness",
            "Technology",
            "Pets",
            "Marketing"
        ],
        "short_url": "https://tmblr.co/ZlNQ6b2ev64m0",
        "summary": "Latest Health & Fitness, Technology, Digital marketing and Pets Articles - Accepting Guest Post",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": "Latest Health & Fitness, Technology, Digital marketing and Pets Articles - Accepting Guest Post",
        "body": "<p>Checkout the latest health &amp; fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br/></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
        "reblog": {
            "comment": "<p>Checkout the latest health & fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ddaewi",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/14d88122bf9feaea8b62e5d89d4d009a/ghw7s27/VZLp8kkq1/tumblr_static_93subbohpyko8cssws4owo48c.jpg",
                        "header_image_focused": "https://static.tumblr.com/14d88122bf9feaea8b62e5d89d4d009a/ghw7s27/VZLp8kkq1/tumblr_static_93subbohpyko8cssws4owo48c_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/14d88122bf9feaea8b62e5d89d4d009a/ghw7s27/VZLp8kkq1/tumblr_static_93subbohpyko8cssws4owo48c_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346520064"
                },
                "content_raw": "<p>Checkout the latest health & fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
                "content": "<p>Checkout the latest health &amp; fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br /></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "toyonlycharacter",
        "blog": {
            "name": "toyonlycharacter",
            "title": "Viva - Discover Las Vegas",
            "description": "<h2>\n<a href=\"https://goo.gl/yjN9kd\">Top Las Vegas Nevada Secrets</a>\n</h2>\n\n<h3>\n<ul>\n<li><a href=\"https://goo.gl/maps/wJLncaEUZ3S2\">5 Star Las Vegas Wedding Venue Review</a></li>\n<li><a href=\"https://goo.gl/maps/DkZrE85QyTN2\">Lakeside Weddings and Events 2620 Regatta Dr #102, Las Vegas, NV 89128 (702) 240-5290</a></li>\n<li><a href=\"https://bestplaces-vegasnv.tumblr.com/\">The Definitive Guide to Las Vegas Nv</a></li>\n</ul>\n</h3>\n\n\n\"Las Vegas\" is often made use of to explain locations further than official metropolis boundaries—In particular the locations on and near the Las Vegas Strip, which is in fact Situated inside the unincorporated communities of Paradise, Winchester, and Business.[13][fourteen]\n\nCo-ops even have month-to-month charges (Prevalent Expenses and Servicing Expenses), which may also contain property taxes in addition to a percentage of the building’s fundamental property finance loan.\n\nComing Soon listings are houses which will quickly be that you can buy. The listing agent for these residences has included a Coming Shortly Take note to notify purchasers ahead of time. Find out more.\n\nFeel you are aware of each of the major places to hit in Vegas? Reassess. Although there are several billboards showcasing common sights, and you can’t skip the traces exterior...\n\nFor enthusiasts of globally cuisine such as Middle Eastern, vegetarian and pizza, ZIP code 89117 is definitely the put that you should be so that you can delight in oneself and deal with your palate to something good. If you want to be able to Prepare dinner at your home Then you really're in luck below as the realm is properly served by many grocery shops.\n\nGet the most robust specifics of our resorts correct on our websites. Get everything from guest room data to point out and dining reservations, furthermore a complete assortment of resort imagery.\n\nThe Fremont Avenue Practical experience was created in order to draw tourists back again to the realm, and continues to be well-liked since its startup in 1995.\n\nDiscover your dream house in 89117 utilizing the instruments above. Use filters to slender your quest by cost, sq. toes, beds, and baths to search out properties that healthy your standards. Our prime-rated real estate property agents in 89117 are regional experts and they are ready to answer your questions about Houses, neighborhoods, educational institutions, and the newest listings available for purchase in 89117.\n\nCommonly cited as among the list of major vacationer points of interest on the planet, the Bellagio fountains are a stunning drinking water fixture showcasing intricate choreographed drinking water shows a number of situations a night, with constantly rotating styles set to A selection of songs. You can find eight Cirque du Soleil exhibits at a variety of lodge-casinos in town, starting from celebrations with the tunes with the Beatles and Michael Jackson to the collaboration with magician Criss Angel into a risqué cabaret-design and style revue, and you may't go Mistaken with any of these.\n\nThese Houses are owned by a bank or a lender who took ownership by way of foreclosure proceedings. They may soon be detailed on the market. These Houses usually are not discovered on the many listing assistance (MLS).\n\nContemporary Las Vegas can be on the get more info list of world's top eating Places, dwelling to The us's most thriving nightclubs, as well as a retail paradise for the two large-stop and discount consumers.\n\nLas Vegas was settled in 1905 and officially integrated in 1911. Within the close with the 20th century, it had been quite possibly the most populated American city founded in just that century (an identical difference earned by Chicago within the 1800s).\n\nReceive a whole refund if you decide to cancel your reservation no afterwards than 72 several hours prior to your arrival, Except if specifically excluded by booked present. Other travel websites may possibly charge you for cancellations.\n\nA pending listing usually means a seller has acknowledged an offer from the buyer. Occasionally, the seller will accept backup offers.</br>\n<center>\n<iframe src=\"https://www.google.com/maps/d/embed?mid=1fKOzsKKRmhPDHf_UgVHx7-inMAjFAwKV\" width=\"640\" height=\"480\">las vegas wedding venues</iframe></center>",
            "url": "https://toyonlycharacter.tumblr.com/",
            "uuid": "t:jW2ORPaVRWmFjfAlB9EMoQ",
            "updated": 1558505653
        },
        "id": 181346517261,
        "post_url": "https://toyonlycharacter.tumblr.com/post/181346517261",
        "slug": "latest-health-fitness-technology-digital",
        "date": "2018-12-23 13:50:03 GMT",
        "timestamp": 1545573003,
        "state": "published",
        "format": "html",
        "reblog_key": "j7ebeeFq",
        "tags": [
            "Guestpost",
            "Health",
            "Fitness",
            "Technology",
            "Pets",
            "Marketing"
        ],
        "short_url": "https://tmblr.co/ZU1P6b2ev644D",
        "summary": "Latest Health & Fitness, Technology, Digital marketing and Pets Articles - Accepting Guest Post",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": "Latest Health & Fitness, Technology, Digital marketing and Pets Articles - Accepting Guest Post",
        "body": "<p>Checkout the latest health &amp; fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br/></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
        "reblog": {
            "comment": "<p>Checkout the latest health & fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "toyonlycharacter",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/7b4cba2a1fd41cee662a0a02fc4f0bd9/cma4nuo/zcnp8kkr6/tumblr_static_5npq6egkj7woo84wg4gosocgs.jpg",
                        "header_image_focused": "https://static.tumblr.com/7b4cba2a1fd41cee662a0a02fc4f0bd9/cma4nuo/zcnp8kkr6/tumblr_static_5npq6egkj7woo84wg4gosocgs_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/7b4cba2a1fd41cee662a0a02fc4f0bd9/cma4nuo/zcnp8kkr6/tumblr_static_5npq6egkj7woo84wg4gosocgs_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346517261"
                },
                "content_raw": "<p>Checkout the latest health & fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
                "content": "<p>Checkout the latest health &amp; fitness, technology, digital marketing and pets articles on <a href=\"https://www.authorsarticle.com/\">https://www.authorsarticle.com/</a><br /></p><p><a href=\"https://www.authorsarticle.com/\">Fitness blog</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "donpapabear",
        "blog": {
            "name": "donpapabear",
            "title": "DonPapaBear",
            "description": "",
            "url": "https://donpapabear.tumblr.com/",
            "uuid": "t:_6UqdAxueJuNDRnePo5WGA",
            "updated": 1558530272
        },
        "id": 181346512568,
        "post_url": "https://donpapabear.tumblr.com/post/181346512568/be-strong-healthy-training-gym",
        "slug": "be-strong-healthy-training-gym",
        "date": "2018-12-23 13:49:43 GMT",
        "timestamp": 1545572983,
        "state": "published",
        "format": "html",
        "reblog_key": "iVqwAVKn",
        "tags": [
            "healthy",
            "training",
            "gym",
            "getfit",
            "health",
            "photooftheday",
            "fitness",
            "excercise",
            "lifestyle",
            "workout",
            "motivation",
            "train",
            "donpapabear",
            "sport",
            "instagood",
            "cardio",
            "active",
            "determination",
            "fit",
            "eatclean",
            "fitnessaddict",
            "dance",
            "cleaneating",
            "bodybuilding",
            "healthychoices",
            "strong",
            "instahealth",
            "diet"
        ],
        "short_url": "https://tmblr.co/Z9QwPn2ev62wu",
        "summary": "Be Strong🐼👊👊👊\n.\n.\n#healthy #training #gym #getfit #health #photooftheday #fitness #excercise #lifestyle #workout #motivation...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1,
        "caption": "<p>Be Strong🐼👊👊👊<br/>\n.<br/>\n.<br/>\n#healthy #training #gym #getfit #health #photooftheday #fitness #excercise #lifestyle #workout #motivation #train #DonPapaBear #sport #instagood #cardio #active #determination #fit #eatclean #fitnessaddict #dance #cleaneating #bodybuilding #healthychoices #strong #instahealth #diet<br/>\n<a href=\"https://www.instagram.com/p/Bru2uaLlhko/?utm_source=ig_tumblr_share&amp;igshid=9379vz3lo04m\">https://www.instagram.com/p/Bru2uaLlhko/?utm_source=ig_tumblr_share&amp;igshid=9379vz3lo04m</a></p>",
        "reblog": {
            "comment": "<p>Be Strong🐼👊👊👊<br>\n.<br>\n.<br>\n#healthy #training #gym #getfit #health #photooftheday #fitness #excercise #lifestyle #workout #motivation #train #DonPapaBear #sport #instagood #cardio #active #determination #fit #eatclean #fitnessaddict #dance #cleaneating #bodybuilding #healthychoices #strong #instahealth #diet<br><a href=\"https://www.instagram.com/p/Bru2uaLlhko/?utm_source=ig_tumblr_share&amp;igshid=9379vz3lo04m\">https://www.instagram.com/p/Bru2uaLlhko/?utm_source=ig_tumblr_share&amp;igshid=9379vz3lo04m</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "donpapabear",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/daed1f533ac46001e8547fc8156cd902/ioenku3/DjYoslmd8/tumblr_static_7477luy6oio0o80gsskww48so.jpg",
                        "header_image_focused": "https://static.tumblr.com/daed1f533ac46001e8547fc8156cd902/ioenku3/DjYoslmd8/tumblr_static_7477luy6oio0o80gsskww48so_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/daed1f533ac46001e8547fc8156cd902/ioenku3/DjYoslmd8/tumblr_static_7477luy6oio0o80gsskww48so_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346512568"
                },
                "content_raw": "<p>Be Strong🐼👊👊👊<br>\n.<br>\n.<br>\n#healthy #training #gym #getfit #health #photooftheday #fitness #excercise #lifestyle #workout #motivation #train #DonPapaBear #sport #instagood #cardio #active #determination #fit #eatclean #fitnessaddict #dance #cleaneating #bodybuilding #healthychoices #strong #instahealth #diet<br><a href=\"https://www.instagram.com/p/Bru2uaLlhko/?utm_source=ig_tumblr_share&amp;igshid=9379vz3lo04m\">https://www.instagram.com/p/Bru2uaLlhko/?utm_source=ig_tumblr_share&amp;igshid=9379vz3lo04m</a></p>",
                "content": "<p>Be Strong&#128060;&#128074;&#128074;&#128074;<br />\n.<br />\n.<br />\n#healthy #training #gym #getfit #health #photooftheday #fitness #excercise #lifestyle #workout #motivation #train #DonPapaBear #sport #instagood #cardio #active #determination #fit #eatclean #fitnessaddict #dance #cleaneating #bodybuilding #healthychoices #strong #instahealth #diet<br /><a href=\"https://www.instagram.com/p/Bru2uaLlhko/?utm_source=ig_tumblr_share&amp;igshid=9379vz3lo04m\">https://www.instagram.com/p/Bru2uaLlhko/?utm_source=ig_tumblr_share&amp;igshid=9379vz3lo04m</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "https://www.instagram.com/p/Bru2uaLlhko/?utm_source=ig_tumblr_share&igshid=9379vz3lo04m",
        "image_permalink": "https://donpapabear.tumblr.com/image/181346512568",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/0e760f456303c5591789acabe6c50e59/tumblr_pk6zqvwToD1tcivx3o1_1280.jpg",
                    "width": 999,
                    "height": 1249
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/0e760f456303c5591789acabe6c50e59/tumblr_pk6zqvwToD1tcivx3o1_1280.jpg",
                        "width": 999,
                        "height": 1249
                    },
                    {
                        "url": "https://66.media.tumblr.com/0e760f456303c5591789acabe6c50e59/tumblr_pk6zqvwToD1tcivx3o1_640.jpg",
                        "width": 640,
                        "height": 800
                    },
                    {
                        "url": "https://66.media.tumblr.com/0e760f456303c5591789acabe6c50e59/tumblr_pk6zqvwToD1tcivx3o1_540.jpg",
                        "width": 540,
                        "height": 675
                    },
                    {
                        "url": "https://66.media.tumblr.com/0e760f456303c5591789acabe6c50e59/tumblr_pk6zqvwToD1tcivx3o1_500.jpg",
                        "width": 500,
                        "height": 625
                    },
                    {
                        "url": "https://66.media.tumblr.com/0e760f456303c5591789acabe6c50e59/tumblr_pk6zqvwToD1tcivx3o1_400.jpg",
                        "width": 400,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/0e760f456303c5591789acabe6c50e59/tumblr_pk6zqvwToD1tcivx3o1_250.jpg",
                        "width": 250,
                        "height": 313
                    },
                    {
                        "url": "https://66.media.tumblr.com/0e760f456303c5591789acabe6c50e59/tumblr_pk6zqvwToD1tcivx3o1_100.jpg",
                        "width": 100,
                        "height": 125
                    },
                    {
                        "url": "https://66.media.tumblr.com/0e760f456303c5591789acabe6c50e59/tumblr_pk6zqvwToD1tcivx3o1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "healthnfitnessnews",
        "blog": {
            "name": "healthnfitnessnews",
            "title": "Health and Fitness News",
            "description": "Daily Health and Fitness News",
            "url": "https://healthnfitnessnews.tumblr.com/",
            "uuid": "t:fVrlOHqY_c23cpYvy8YBWQ",
            "updated": 1558519860
        },
        "id": 181346513329,
        "post_url": "https://healthnfitnessnews.tumblr.com/post/181346513329/negative-effects-of-dieting-when-a-person",
        "slug": "negative-effects-of-dieting-when-a-person",
        "date": "2017-11-20 16:00:04 GMT",
        "timestamp": 1511193604,
        "state": "published",
        "format": "html",
        "reblog_key": "IIkVG9DA",
        "tags": [
            "bodybuilding",
            "diet",
            "Dieting",
            "Effects",
            "health",
            "Negative",
            "nutrition",
            "weight lifting",
            "weight loss",
            "weight training"
        ],
        "short_url": "https://tmblr.co/Z0Vgvb2ev636n",
        "summary": "Negative Effects of Dieting\r\n    When a person wants to engage in a diet, they will be restricting what they eat or drink with...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "source_url": "https://t.umblr.com/redirect?z=http%3A%2F%2Fwww.healthnfitnessnews.com%2Fhealth-nutrition%2Fnegative-effects-of-dieting%2F&t=YWU5NTk0NTU4YWNmMTczMzRhZjFmZjJjMDA5ZmEzMGQwNzg4OGY5OCwxODEzNDY1MTMzMjk%3D&b=t%3AfVrlOHqY_c23cpYvy8YBWQ&p=https%3A%2F%2Fhealthnfitnessnews.tumblr.com%2Fpost%2F181346513329%2Fnegative-effects-of-dieting-when-a-person&m=1",
        "source_title": "healthnfitnessnews.com",
        "caption": "<blockquote><p><strong>Negative Effects of Dieting</strong></p>\n<p><img src=\"http://www.healthnfitnessnews.com/wp-content/uploads/2017/11/polynesian-diet-strategies-7-tips-to-help-you-lose-weight-permanently\"/></p><p>  When a person wants to engage in a diet, they will be restricting what they eat or drink with the goal to either become healthier or lose weight. \n  Healthy dieting can improve the overall health of a dieter, as well as prevent complications such as diabetes and heart disease.  However, when&hellip;</p></blockquote>\n\n<p>Read the full article by clicking <a href=\"http://www.healthnfitnessnews.com/health-nutrition/negative-effects-of-dieting/\" target=\"_blank\">HERE</a></p>",
        "reblog": {
            "comment": "<p><blockquote><p><strong>Negative Effects of Dieting</strong></p>\n<p><img src=\"http://www.healthnfitnessnews.com/wp-content/uploads/2017/11/polynesian-diet-strategies-7-tips-to-help-you-lose-weight-permanently\"></p><p>  When a person wants to engage in a diet, they will be restricting what they eat or drink with the goal to either become healthier or lose weight. \n  Healthy dieting can improve the overall health of a dieter, as well as prevent complications such as diabetes and heart disease.  However, when…</p></blockquote>\n\n<p>Read the full article by clicking <a href=\"http://www.healthnfitnessnews.com/health-nutrition/negative-effects-of-dieting/\" target=\"_blank\">HERE</a></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "healthnfitnessnews",
                    "active": true,
                    "theme": {
                        "header_full_width": 900,
                        "header_full_height": 900,
                        "header_focus_width": 829,
                        "header_focus_height": 467,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "216,864,683,35",
                        "header_image": "https://static.tumblr.com/626e753eb69f47d4dab7ae5e5f1b4a8c/kvr9olf/rh5p097yb/tumblr_static_12pzm9hyypeog44oo44k80g4s.jpg",
                        "header_image_focused": "https://static.tumblr.com/626e753eb69f47d4dab7ae5e5f1b4a8c/kvr9olf/6MEp097ye/tumblr_static_tumblr_static_12pzm9hyypeog44oo44k80g4s_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/626e753eb69f47d4dab7ae5e5f1b4a8c/kvr9olf/rh5p097yb/tumblr_static_12pzm9hyypeog44oo44k80g4s_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346513329"
                },
                "content_raw": "<p><blockquote><p><strong>Negative Effects of Dieting</strong></p>\n<p><img src=\"http://www.healthnfitnessnews.com/wp-content/uploads/2017/11/polynesian-diet-strategies-7-tips-to-help-you-lose-weight-permanently\"></p><p>  When a person wants to engage in a diet, they will be restricting what they eat or drink with the goal to either become healthier or lose weight. \n  Healthy dieting can improve the overall health of a dieter, as well as prevent complications such as diabetes and heart disease.  However, when…</p></blockquote>\n\n<p>Read the full article by clicking <a href=\"http://www.healthnfitnessnews.com/health-nutrition/negative-effects-of-dieting/\" target=\"_blank\">HERE</a></p></p>",
                "content": "<p><blockquote><p><strong>Negative Effects of Dieting</strong></p>\n<p><div class=\"external-image-wrapper\" data-loading-text=\"Loading...\" data-src=\"http://www.healthnfitnessnews.com/wp-content/uploads/2017/11/polynesian-diet-strategies-7-tips-to-help-you-lose-weight-permanently\">External image</div></p><p>  When a person wants to engage in a diet, they will be restricting what they eat or drink with the goal to either become healthier or lose weight. \n  Healthy dieting can improve the overall health of a dieter, as well as prevent complications such as diabetes and heart disease.  However, when&hellip;</p></blockquote>\n\n<p>Read the full article by clicking <a href=\"http://www.healthnfitnessnews.com/health-nutrition/negative-effects-of-dieting/\" target=\"_blank\">HERE</a></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "http://www.healthnfitnessnews.com/health-nutrition/negative-effects-of-dieting/",
        "image_permalink": "https://healthnfitnessnews.tumblr.com/image/181346513329",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/8fe5a94c9e525bc13668fa67d2dccb7e/tumblr_pk6zqpQtwO1wjf8fpo1_250.jpg",
                    "width": 183,
                    "height": 275
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/8fe5a94c9e525bc13668fa67d2dccb7e/tumblr_pk6zqpQtwO1wjf8fpo1_250.jpg",
                        "width": 183,
                        "height": 275
                    },
                    {
                        "url": "https://66.media.tumblr.com/8fe5a94c9e525bc13668fa67d2dccb7e/tumblr_pk6zqpQtwO1wjf8fpo1_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/8fe5a94c9e525bc13668fa67d2dccb7e/tumblr_pk6zqpQtwO1wjf8fpo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "hcsmca",
        "blog": {
            "name": "hcsmca",
            "title": "HCSM News Canada & Resources",
            "description": "#HCSMR #globalhealth  & #CanadaHealth",
            "url": "https://hcsm.ca/",
            "uuid": "t:I03lgpSZCpafbovEVu9nKQ",
            "updated": 1558533551
        },
        "id": 181346459645,
        "post_url": "https://hcsm.ca/post/181346459645/hcsm-news-picture-of-toronto-homelessness",
        "slug": "hcsm-news-picture-of-toronto-homelessness",
        "date": "2018-12-23 13:46:20 GMT",
        "timestamp": 1545572780,
        "state": "published",
        "format": "html",
        "reblog_key": "7TTmgMCQ",
        "tags": [
            "Health",
            "News",
            "Cdnhealth"
        ],
        "short_url": "https://tmblr.co/ZaZUOl2ev5r-z",
        "summary": "HCSM News ~ Picture of Toronto homelessness emerging from research into Out of the Cold program",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": "HCSM News ~ Picture of Toronto homelessness emerging from research into Out of the Cold program",
        "body": "<img src=\"https://i.cbc.ca/1.4957425.1545501351!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_460/dennis-brooks.jpg\" alt=\"Dennis Brooks\" width=\"460\" title=\"\" height=\"259\"/><p>Dennis Brooks says there are no warm places when you&rsquo;re homeless. He should know. Originally from Glace Bay, N.S., Brooks, 54, was homeless in Toronto on and off for more than 20 years.</p>\n        \n      <br/><br/>\nRead more from CBC <a href=\"https://www.cbc.ca/news/canada/toronto/out-of-the-cold-homelessness-research-project-dixon-hall-1.4957419?cmp=rss\">https://www.cbc.ca/news/canada/toronto/out-of-the-cold-homelessness-research-project-dixon-hall-1.4957419?cmp=rss</a>",
        "reblog": {
            "comment": "<p><img src=\"https://i.cbc.ca/1.4957425.1545501351!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_460/dennis-brooks.jpg\" alt=\"Dennis Brooks\" width=\"460\" title=\"\" height=\"259\"><p>Dennis Brooks says there are no warm places when you’re homeless. He should know. Originally from Glace Bay, N.S., Brooks, 54, was homeless in Toronto on and off for more than 20 years.</p>\n        \n      <br><br>\nRead more from CBC <a href=\"https://www.cbc.ca/news/canada/toronto/out-of-the-cold-homelessness-research-project-dixon-hall-1.4957419?cmp=rss\">https://www.cbc.ca/news/canada/toronto/out-of-the-cold-homelessness-research-project-dixon-hall-1.4957419?cmp=rss</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "hcsmca",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/732f8edce2e6ec96e98a0f7f69b1be3d/zcobohz/9gEnj7h59/tumblr_static_c7bzcjc7x0ggg0ksoc000cw80.jpg",
                        "header_image_focused": "https://static.tumblr.com/732f8edce2e6ec96e98a0f7f69b1be3d/zcobohz/9gEnj7h59/tumblr_static_c7bzcjc7x0ggg0ksoc000cw80_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/732f8edce2e6ec96e98a0f7f69b1be3d/zcobohz/9gEnj7h59/tumblr_static_c7bzcjc7x0ggg0ksoc000cw80_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346459645"
                },
                "content_raw": "<p><img src=\"https://i.cbc.ca/1.4957425.1545501351!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_460/dennis-brooks.jpg\" alt=\"Dennis Brooks\" width=\"460\" title=\"\" height=\"259\"><p>Dennis Brooks says there are no warm places when you’re homeless. He should know. Originally from Glace Bay, N.S., Brooks, 54, was homeless in Toronto on and off for more than 20 years.</p>\n        \n      <br><br>\nRead more from CBC <a href=\"https://www.cbc.ca/news/canada/toronto/out-of-the-cold-homelessness-research-project-dixon-hall-1.4957419?cmp=rss\">https://www.cbc.ca/news/canada/toronto/out-of-the-cold-homelessness-research-project-dixon-hall-1.4957419?cmp=rss</a></p>",
                "content": "<p><p><div class=\"external-image-wrapper\" data-loading-text=\"Loading...\" data-src=\"https://i.cbc.ca/1.4957425.1545501351!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_460/dennis-brooks.jpg\">External image</div></p><p>Dennis Brooks says there are no warm places when you&rsquo;re homeless. He should know. Originally from Glace Bay, N.S., Brooks, 54, was homeless in Toronto on and off for more than 20 years.</p>\n        \n      <br /><br />\nRead more from CBC <a href=\"https://www.cbc.ca/news/canada/toronto/out-of-the-cold-homelessness-research-project-dixon-hall-1.4957419?cmp=rss\">https://www.cbc.ca/news/canada/toronto/out-of-the-cold-homelessness-research-project-dixon-hall-1.4957419?cmp=rss</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "healthnfitnessnews",
        "blog": {
            "name": "healthnfitnessnews",
            "title": "Health and Fitness News",
            "description": "Daily Health and Fitness News",
            "url": "https://healthnfitnessnews.tumblr.com/",
            "uuid": "t:fVrlOHqY_c23cpYvy8YBWQ",
            "updated": 1558519860
        },
        "id": 181346380279,
        "post_url": "https://healthnfitnessnews.tumblr.com/post/181346380279/how-drinking-water-makes-you-healthier",
        "slug": "how-drinking-water-makes-you-healthier",
        "date": "2018-02-09 02:30:11 GMT",
        "timestamp": 1518143411,
        "state": "published",
        "format": "html",
        "reblog_key": "u3EeJnGW",
        "tags": [
            "diet",
            "Drinking",
            "health",
            "Healthier",
            "nutrition",
            "supplements",
            "Water",
            "weight lifting",
            "weight loss"
        ],
        "short_url": "https://tmblr.co/Z0Vgvb2ev5Ydt",
        "summary": "How Drinking Water Makes You Healthier\r\n    Scientists have disputed if water has any effect on weight loss, but almost 59% of...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "source_url": "https://t.umblr.com/redirect?z=http%3A%2F%2Fwww.healthnfitnessnews.com%2Fhealth-nutrition%2Fhow-drinking-water-makes-you-healthier%2F&t=ZjU4NmVmYTUxOGIzOTQ5MGExOWI5ZDQ1NjNkZWMwNjk3ZTA4ZjI2OSwxODEzNDYzODAyNzk%3D&b=t%3AfVrlOHqY_c23cpYvy8YBWQ&p=https%3A%2F%2Fhealthnfitnessnews.tumblr.com%2Fpost%2F181346380279%2Fhow-drinking-water-makes-you-healthier&m=1",
        "source_title": "healthnfitnessnews.com",
        "caption": "<blockquote><p><strong>How Drinking Water Makes You Healthier</strong></p>\n<p><img src=\"http://www.healthnfitnessnews.com/wp-content/uploads/2017/11/health-issues-for-men-that-can-make-sex-over-60-difficult.jpg\"/></p><p>  Scientists have disputed if water has any effect on weight loss, but almost 59% of adults in the US believe it does, and these are some of the reasons why.  For those looking for the light at the end of the tunnel, why not try water to help you lose weight?  Here are a few reasons why you need&hellip;</p></blockquote>\n\n<p>Read the full article by clicking <a href=\"http://www.healthnfitnessnews.com/health-nutrition/how-drinking-water-makes-you-healthier/\" target=\"_blank\">HERE</a></p>",
        "reblog": {
            "comment": "<p><blockquote><p><strong>How Drinking Water Makes You Healthier</strong></p>\n<p><img src=\"http://www.healthnfitnessnews.com/wp-content/uploads/2017/11/health-issues-for-men-that-can-make-sex-over-60-difficult.jpg\"></p><p>  Scientists have disputed if water has any effect on weight loss, but almost 59% of adults in the US believe it does, and these are some of the reasons why.  For those looking for the light at the end of the tunnel, why not try water to help you lose weight?  Here are a few reasons why you need…</p></blockquote>\n\n<p>Read the full article by clicking <a href=\"http://www.healthnfitnessnews.com/health-nutrition/how-drinking-water-makes-you-healthier/\" target=\"_blank\">HERE</a></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "healthnfitnessnews",
                    "active": true,
                    "theme": {
                        "header_full_width": 900,
                        "header_full_height": 900,
                        "header_focus_width": 829,
                        "header_focus_height": 467,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "216,864,683,35",
                        "header_image": "https://static.tumblr.com/626e753eb69f47d4dab7ae5e5f1b4a8c/kvr9olf/rh5p097yb/tumblr_static_12pzm9hyypeog44oo44k80g4s.jpg",
                        "header_image_focused": "https://static.tumblr.com/626e753eb69f47d4dab7ae5e5f1b4a8c/kvr9olf/6MEp097ye/tumblr_static_tumblr_static_12pzm9hyypeog44oo44k80g4s_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/626e753eb69f47d4dab7ae5e5f1b4a8c/kvr9olf/rh5p097yb/tumblr_static_12pzm9hyypeog44oo44k80g4s_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346380279"
                },
                "content_raw": "<p><blockquote><p><strong>How Drinking Water Makes You Healthier</strong></p>\n<p><img src=\"http://www.healthnfitnessnews.com/wp-content/uploads/2017/11/health-issues-for-men-that-can-make-sex-over-60-difficult.jpg\"></p><p>  Scientists have disputed if water has any effect on weight loss, but almost 59% of adults in the US believe it does, and these are some of the reasons why.  For those looking for the light at the end of the tunnel, why not try water to help you lose weight?  Here are a few reasons why you need…</p></blockquote>\n\n<p>Read the full article by clicking <a href=\"http://www.healthnfitnessnews.com/health-nutrition/how-drinking-water-makes-you-healthier/\" target=\"_blank\">HERE</a></p></p>",
                "content": "<p><blockquote><p><strong>How Drinking Water Makes You Healthier</strong></p>\n<p><div class=\"external-image-wrapper\" data-loading-text=\"Loading...\" data-src=\"http://www.healthnfitnessnews.com/wp-content/uploads/2017/11/health-issues-for-men-that-can-make-sex-over-60-difficult.jpg\">External image</div></p><p>  Scientists have disputed if water has any effect on weight loss, but almost 59% of adults in the US believe it does, and these are some of the reasons why.  For those looking for the light at the end of the tunnel, why not try water to help you lose weight?  Here are a few reasons why you need&hellip;</p></blockquote>\n\n<p>Read the full article by clicking <a href=\"http://www.healthnfitnessnews.com/health-nutrition/how-drinking-water-makes-you-healthier/\" target=\"_blank\">HERE</a></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "http://www.healthnfitnessnews.com/health-nutrition/how-drinking-water-makes-you-healthier/",
        "image_permalink": "https://healthnfitnessnews.tumblr.com/image/181346380279",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/be7137543c879e6e961b0371cb30c1b0/tumblr_pk6zcaxYQL1wjf8fpo1_1280.jpg",
                    "width": 1132,
                    "height": 1696
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/be7137543c879e6e961b0371cb30c1b0/tumblr_pk6zcaxYQL1wjf8fpo1_1280.jpg",
                        "width": 1132,
                        "height": 1696
                    },
                    {
                        "url": "https://66.media.tumblr.com/be7137543c879e6e961b0371cb30c1b0/tumblr_pk6zcaxYQL1wjf8fpo1_640.jpg",
                        "width": 640,
                        "height": 959
                    },
                    {
                        "url": "https://66.media.tumblr.com/be7137543c879e6e961b0371cb30c1b0/tumblr_pk6zcaxYQL1wjf8fpo1_540.jpg",
                        "width": 540,
                        "height": 809
                    },
                    {
                        "url": "https://66.media.tumblr.com/be7137543c879e6e961b0371cb30c1b0/tumblr_pk6zcaxYQL1wjf8fpo1_500.jpg",
                        "width": 500,
                        "height": 749
                    },
                    {
                        "url": "https://66.media.tumblr.com/be7137543c879e6e961b0371cb30c1b0/tumblr_pk6zcaxYQL1wjf8fpo1_400.jpg",
                        "width": 400,
                        "height": 599
                    },
                    {
                        "url": "https://66.media.tumblr.com/be7137543c879e6e961b0371cb30c1b0/tumblr_pk6zcaxYQL1wjf8fpo1_250.jpg",
                        "width": 250,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/be7137543c879e6e961b0371cb30c1b0/tumblr_pk6zcaxYQL1wjf8fpo1_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/be7137543c879e6e961b0371cb30c1b0/tumblr_pk6zcaxYQL1wjf8fpo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ],
                "exif": {
                    "Camera": "Canon EOS 5D Mark II",
                    "ISO": 100,
                    "Aperture": "f/6.3",
                    "Exposure": "1/160th",
                    "FocalLength": "100mm"
                }
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "iamtrustjones",
        "blog": {
            "name": "iamtrustjones",
            "title": "I Am Maurice Sir' DragonFly Jones",
            "description": "Game spitter",
            "url": "https://iamtrustjones.tumblr.com/",
            "uuid": "t:iY1VFE8Ae0pBcPUmH0Te_A",
            "updated": 1558272866
        },
        "id": 181346367848,
        "post_url": "https://iamtrustjones.tumblr.com/post/181346367848/great-mornin-diet-health-thursday-foodie",
        "slug": "great-mornin-diet-health-thursday-foodie",
        "date": "2018-12-23 13:40:31 GMT",
        "timestamp": 1545572431,
        "state": "published",
        "format": "html",
        "reblog_key": "DDWW5kWK",
        "tags": [
            "diet",
            "health",
            "thursday",
            "foodie",
            "instagood",
            "healthybreakfastclub",
            "vegan",
            "healthylifestyle",
            "linkinbio"
        ],
        "short_url": "https://tmblr.co/Z4_O0i2ev5Vbe",
        "summary": "Great mornin 🍲😍 #diet #health #thursday #foodie #instagood #healthybreakfastclub #vegan #healthylifestyle...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "caption": "<p>Great mornin 🍲😍 #diet #health #thursday #foodie #instagood #healthybreakfastclub #vegan #healthylifestyle #linkinbio<br/>\n<a href=\"https://www.instagram.com/p/Bru1rqmH-Vt/?utm_source=ig_tumblr_share&amp;igshid=e4354th1dnju\">https://www.instagram.com/p/Bru1rqmH-Vt/?utm_source=ig_tumblr_share&amp;igshid=e4354th1dnju</a></p>",
        "reblog": {
            "comment": "<p>Great mornin 🍲😍 #diet #health #thursday #foodie #instagood #healthybreakfastclub #vegan #healthylifestyle #linkinbio<br><a href=\"https://www.instagram.com/p/Bru1rqmH-Vt/?utm_source=ig_tumblr_share&amp;igshid=e4354th1dnju\">https://www.instagram.com/p/Bru1rqmH-Vt/?utm_source=ig_tumblr_share&amp;igshid=e4354th1dnju</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "iamtrustjones",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#C1B74B",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/7a73c7486c0accd88977147965e54df2/yiwop6k/Gbdosu4m6/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/7a73c7486c0accd88977147965e54df2/yiwop6k/Gbdosu4m6/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/7a73c7486c0accd88977147965e54df2/yiwop6k/Gbdosu4m6/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#878778",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#B12D19",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346367848"
                },
                "content_raw": "<p>Great mornin 🍲😍 #diet #health #thursday #foodie #instagood #healthybreakfastclub #vegan #healthylifestyle #linkinbio<br><a href=\"https://www.instagram.com/p/Bru1rqmH-Vt/?utm_source=ig_tumblr_share&amp;igshid=e4354th1dnju\">https://www.instagram.com/p/Bru1rqmH-Vt/?utm_source=ig_tumblr_share&amp;igshid=e4354th1dnju</a></p>",
                "content": "<p>Great mornin &#127858;&#128525; #diet #health #thursday #foodie #instagood #healthybreakfastclub #vegan #healthylifestyle #linkinbio<br /><a href=\"https://www.instagram.com/p/Bru1rqmH-Vt/?utm_source=ig_tumblr_share&amp;igshid=e4354th1dnju\">https://www.instagram.com/p/Bru1rqmH-Vt/?utm_source=ig_tumblr_share&amp;igshid=e4354th1dnju</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "https://www.instagram.com/p/Bru1rqmH-Vt/?utm_source=ig_tumblr_share&igshid=e4354th1dnju",
        "image_permalink": "https://iamtrustjones.tumblr.com/image/181346367848",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/278c991e8eb2aeea6ac53fcc70ffd4bc/tumblr_pk6zbjsdGm1v7fil0o1_1280.jpg",
                    "width": 1080,
                    "height": 1080
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/278c991e8eb2aeea6ac53fcc70ffd4bc/tumblr_pk6zbjsdGm1v7fil0o1_1280.jpg",
                        "width": 1080,
                        "height": 1080
                    },
                    {
                        "url": "https://66.media.tumblr.com/278c991e8eb2aeea6ac53fcc70ffd4bc/tumblr_pk6zbjsdGm1v7fil0o1_640.jpg",
                        "width": 640,
                        "height": 640
                    },
                    {
                        "url": "https://66.media.tumblr.com/278c991e8eb2aeea6ac53fcc70ffd4bc/tumblr_pk6zbjsdGm1v7fil0o1_540.jpg",
                        "width": 540,
                        "height": 540
                    },
                    {
                        "url": "https://66.media.tumblr.com/278c991e8eb2aeea6ac53fcc70ffd4bc/tumblr_pk6zbjsdGm1v7fil0o1_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/278c991e8eb2aeea6ac53fcc70ffd4bc/tumblr_pk6zbjsdGm1v7fil0o1_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/278c991e8eb2aeea6ac53fcc70ffd4bc/tumblr_pk6zbjsdGm1v7fil0o1_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/278c991e8eb2aeea6ac53fcc70ffd4bc/tumblr_pk6zbjsdGm1v7fil0o1_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/278c991e8eb2aeea6ac53fcc70ffd4bc/tumblr_pk6zbjsdGm1v7fil0o1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "divine-fitness",
        "blog": {
            "name": "divine-fitness",
            "title": "\"The only limit is the mind.\"",
            "description": "",
            "url": "https://divine-fitness.tumblr.com/",
            "uuid": "t:LKIsElyjZCUUFzuedFYnow",
            "updated": 1556839078
        },
        "id": 181346353541,
        "post_url": "https://divine-fitness.tumblr.com/post/181346353541",
        "slug": "",
        "date": "2018-12-23 13:39:26 GMT",
        "timestamp": 1545572366,
        "state": "published",
        "format": "html",
        "reblog_key": "BGQOFVnn",
        "tags": [
            "fitness",
            "lifestyle",
            "health",
            "fitness & muscle"
        ],
        "short_url": "https://tmblr.co/ZCev3d2ev5S65",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "image_permalink": "https://divine-fitness.tumblr.com/image/181346353541",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/588677ac95ade01d7e14a8ba98be79b3/tumblr_pk6z9qhdbw1wy74gfo1_500.jpg",
                    "width": 500,
                    "height": 500
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/588677ac95ade01d7e14a8ba98be79b3/tumblr_pk6z9qhdbw1wy74gfo1_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/588677ac95ade01d7e14a8ba98be79b3/tumblr_pk6z9qhdbw1wy74gfo1_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/588677ac95ade01d7e14a8ba98be79b3/tumblr_pk6z9qhdbw1wy74gfo1_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/588677ac95ade01d7e14a8ba98be79b3/tumblr_pk6z9qhdbw1wy74gfo1_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/588677ac95ade01d7e14a8ba98be79b3/tumblr_pk6z9qhdbw1wy74gfo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "divine-fitness",
        "blog": {
            "name": "divine-fitness",
            "title": "\"The only limit is the mind.\"",
            "description": "",
            "url": "https://divine-fitness.tumblr.com/",
            "uuid": "t:LKIsElyjZCUUFzuedFYnow",
            "updated": 1556839078
        },
        "id": 181346353376,
        "post_url": "https://divine-fitness.tumblr.com/post/181346353376",
        "slug": "",
        "date": "2018-12-23 13:39:25 GMT",
        "timestamp": 1545572365,
        "state": "published",
        "format": "html",
        "reblog_key": "p3JRoxdQ",
        "tags": [
            "fitness",
            "lifestyle",
            "health",
            "fitness & muscle"
        ],
        "short_url": "https://tmblr.co/ZCev3d2ev5S3W",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 2,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "image_permalink": "https://divine-fitness.tumblr.com/image/181346353376",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/0e6eb2a5a1659192358be6404f32f3d3/tumblr_pk6z9pBVN81wy74gfo1_500.jpg",
                    "width": 500,
                    "height": 651
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/0e6eb2a5a1659192358be6404f32f3d3/tumblr_pk6z9pBVN81wy74gfo1_500.jpg",
                        "width": 500,
                        "height": 651
                    },
                    {
                        "url": "https://66.media.tumblr.com/0e6eb2a5a1659192358be6404f32f3d3/tumblr_pk6z9pBVN81wy74gfo1_400.jpg",
                        "width": 400,
                        "height": 521
                    },
                    {
                        "url": "https://66.media.tumblr.com/0e6eb2a5a1659192358be6404f32f3d3/tumblr_pk6z9pBVN81wy74gfo1_250.jpg",
                        "width": 250,
                        "height": 326
                    },
                    {
                        "url": "https://66.media.tumblr.com/0e6eb2a5a1659192358be6404f32f3d3/tumblr_pk6z9pBVN81wy74gfo1_100.jpg",
                        "width": 100,
                        "height": 130
                    },
                    {
                        "url": "https://66.media.tumblr.com/0e6eb2a5a1659192358be6404f32f3d3/tumblr_pk6z9pBVN81wy74gfo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "bakugou-rants",
        "blog": {
            "name": "bakugou-rants",
            "title": "choose to survive ",
            "description": "<a href=\"https://bakugou-rants.tumblr.com/s\">love</a> & <a href=\"https://bakugou-rants.tumblr.com/a\">peace</a>",
            "url": "https://bakugou-rants.tumblr.com/",
            "uuid": "t:bTyWp80Ig2_7LqtSZ4R-7g",
            "updated": 1550606811
        },
        "id": 181346290261,
        "post_url": "https://bakugou-rants.tumblr.com/post/181346290261/hey-your-about-page-says-its-okay-to-ask-for",
        "slug": "hey-your-about-page-says-its-okay-to-ask-for",
        "date": "2018-12-23 13:35:08 GMT",
        "timestamp": 1545572108,
        "state": "published",
        "format": "html",
        "reblog_key": "HysfvMsJ",
        "tags": [
            "health tips",
            "mental health",
            "health",
            "answered",
            "couseling",
            "therapy",
            "coping",
            "advice",
            "bakuspeaks"
        ],
        "short_url": "https://tmblr.co/ZwgojX2ev5CfL",
        "summary": "hey, your about page says it's okay to ask for advice on coping, so I wanted your thoughts on this? long story short is that I...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "asking_name": "Anonymous",
        "asking_url": null,
        "question": "hey, your about page says it's okay to ask for advice on coping, so I wanted your thoughts on this? long story short is that I was getting free therapy through my school's clinic. I can't go to another clinic due to transportation and insurance issues. my therapist moved out of the country and last time I went to the clinic, this lady there told me that the clinic isn't really supposed to be for long-term patients anyway, and sort of guilt tripped me about my problems not being 'fixed' yet.",
        "answer": "<blockquote><p>\n\nthey told me to go find help somewhere else, except that I can’t. therapy at my school was convenient because I didn’t have to pay for it, and I can’t drive. do you have advice on how you would cope with all this and if you’ve ever been in a similar situation? like what coping mechanisms help you when you don’t have access to a therapist anymore? and just any advice you can share in general related to dealing with mental health issues? thank you.\n\n<br/></p></blockquote><p>i do appreciate you sending something in, and if you ever want additional advice you are free to give more info as to what you dealing with since each mental issue is different and can be hard to handle with just a broad general speculation as to what you could be dealing with. always feel free to send more info in either on or off anon, it’s up to you. i don’t want to trigger anxiety if you feel unsafe off anon. </p><p>but with what you have told me, being guilt tripped when you are already having mental issues can only add weight. try to lessen that weight if you have it, and you might not even know you have weight. look back to that moment and remind yourself not to take what they said personally. they are being cold, and i’m sure that they would have been a better help if they had been more considerate to your situation and maybe have talked to a different person, but i’m not going to ask you to go back there since the way you have already been treated. </p><p>i have been in similar situations where people just don’t want to deal with another person’s problems, and that’s how this is coming off to me, which is just sad and cruel. </p><p>i’m not able to get a therapist myself at the moment, but what i can handle is researching some self-help sites and other psychiatric care sites that can give info and advice. that has always been my form of outlet. though speaking to a person can do a lot more since it feels more personal and needed since people are social by nature. but here is some sites that i use, personally, when i feel like i need some more in depth help. <a href=\"https://psychcentral.com/\">1</a> / <a href=\"https://www.psychologytoday.com/us\">2</a> / <a href=\"https://www.quora.com/\">3</a></p><p>i understand that the last link is to quora, but there are actual therapists/psychologists on that site that might be of help to you if you have questions there that might do more use than me. </p><p>the best way to cope with this, is to remind yourself of your self-value and not to think back as to what therapist you should find yourself right now because you don’t have the money. but you might be able to find free therapists online that can give you advice. also i’m not saying you shouldn’t find yourself a personal therapist at all, but more that you need to focus on your priorities that can lead you there in the long run, and that means taking care of yourself right now. that way you are stable enough to get money to be able to be a long-term patient for a therapist/counselor and so on. </p><p>coping can have a lot of different meanings to a lot of different people because people cope in different ways. i post a lot of self-care stuff here on this blog, and i will be linking what i think would be beneficial for you at the bottom of this post. </p><p>when i feel at my lowest, when i feel like i have reached a hard spot, i take a breather. it’s good to get a recollection of what’s going on around you and to remind yourself to take a moment and completely separate yourself from the situation. and when you go back to that issue, try finding a different perspective as to how to handle that said situation. don’t put yourself on a time limit and don’t compare yourself to other people. the only time you should compare yourself to people is when you need help self-reflecting and getting to know why you do the things you do, and if you have trauma, don’t blame yourself for not understanding things that other people do because of said trauma. </p><p>coping (the way i’ve always seen it) should be more used as a benefit to helping yourself get better, not more as in a crutch to lean on with all your weight. the more weight you add to that said crutch you might end up breaking it and you won’t have any strength to get back up again. i learned that from experience too. </p><p>coping mechanisms should be more as gentle reminders to yourself to keep going. i don’t know what goes on in your life, so i’m sorry if all this sounds really vague atm. if you need a crutch, something to put your weight on, that depends as to what you are looking for in the long run. if you are the type to put your weight on a crutch that leads to a love-life, you might putting a lot of weight on a loved one. if you are the type to put a lot of weight in finding comfort in life, you might be holding yourself back from doing things that make you uncomfortable. you see where i’m getting at? coping should be a form of finding balance in your life. it can be a lot of work, but it isn’t impossible. </p><p>your crutch should be that of learning balance. balance of what you need and what you don’t need, knowing your wants and separating them from what you need. you might need the balance of finding meaning in your life. (i believe in God, but i’m going more on personal experience there. if you want more info on that you can send another ask in.) so in all reality, the crutch is what keeps you standing while coping is more of those little pieces that become bigger pieces depending on how you use them. sort of like puzzle pieces that either heal you or make you worse. </p><p>here are those links to those posts that might help too (i also added some blog links in case you might need that more than the post itself) :</p><p><a href=\"http://onlinecounsellingcollege.tumblr.com/\">counsel blog</a> | <a href=\"https://bakugou-rants.tumblr.com/post/181106281886/things-you-shouldnt-have-to-apologize-for\">apologize reminder</a> | <a href=\"https://bakugou-rants.tumblr.com/post/181103635631/gentle-reminder\">gentle reminder</a> | <a href=\"https://asking-jude.tumblr.com/\">jude blog</a> (she’s an honest sweetie, i talked to her before.) </p><p>if anyone wants to add more links/blog recs, don’t be afraid to. if there is anything more that is on your mind, anon, let me know. i’m not sure as to what issues you are dealing with, but i hope you feel better knowing that you are cared about. if you need me to clarify anything, or give more info on a specific topic, feel free. other than that, i send you good vibes and best wishes on your mental health. </p>",
        "reblog": {
            "comment": "<p><blockquote><p>\n\nthey told me to go find help somewhere else, except that I can’t. therapy at my school was convenient because I didn’t have to pay for it, and I can’t drive. do you have advice on how you would cope with all this and if you’ve ever been in a similar situation? like what coping mechanisms help you when you don’t have access to a therapist anymore? and just any advice you can share in general related to dealing with mental health issues? thank you.\n\n<br></p></blockquote><p>i do appreciate you sending something in, and if you ever want additional advice you are free to give more info as to what you dealing with since each mental issue is different and can be hard to handle with just a broad general speculation as to what you could be dealing with. always feel free to send more info in either on or off anon, it’s up to you. i don’t want to trigger anxiety if you feel unsafe off anon. </p><p>but with what you have told me, being guilt tripped when you are already having mental issues can only add weight. try to lessen that weight if you have it, and you might not even know you have weight. look back to that moment and remind yourself not to take what they said personally. they are being cold, and i’m sure that they would have been a better help if they had been more considerate to your situation and maybe have talked to a different person, but i’m not going to ask you to go back there since the way you have already been treated. </p><p>i have been in similar situations where people just don’t want to deal with another person’s problems, and that’s how this is coming off to me, which is just sad and cruel. </p><p>i’m not able to get a therapist myself at the moment, but what i can handle is researching some self-help sites and other psychiatric care sites that can give info and advice. that has always been my form of outlet. though speaking to a person can do a lot more since it feels more personal and needed since people are social by nature. but here is some sites that i use, personally, when i feel like i need some more in depth help. <a href=\"https://psychcentral.com/\">1</a> / <a href=\"https://www.psychologytoday.com/us\">2</a> / <a href=\"https://www.quora.com/\">3</a></p><p>i understand that the last link is to quora, but there are actual therapists/psychologists on that site that might be of help to you if you have questions there that might do more use than me. </p><p>the best way to cope with this, is to remind yourself of your self-value and not to think back as to what therapist you should find yourself right now because you don’t have the money. but you might be able to find free therapists online that can give you advice. also i’m not saying you shouldn’t find yourself a personal therapist at all, but more that you need to focus on your priorities that can lead you there in the long run, and that means taking care of yourself right now. that way you are stable enough to get money to be able to be a long-term patient for a therapist/counselor and so on. </p><p>coping can have a lot of different meanings to a lot of different people because people cope in different ways. i post a lot of self-care stuff here on this blog, and i will be linking what i think would be beneficial for you at the bottom of this post. </p><p>when i feel at my lowest, when i feel like i have reached a hard spot, i take a breather. it’s good to get a recollection of what’s going on around you and to remind yourself to take a moment and completely separate yourself from the situation. and when you go back to that issue, try finding a different perspective as to how to handle that said situation. don’t put yourself on a time limit and don’t compare yourself to other people. the only time you should compare yourself to people is when you need help self-reflecting and getting to know why you do the things you do, and if you have trauma, don’t blame yourself for not understanding things that other people do because of said trauma. </p><p>coping (the way i’ve always seen it) should be more used as a benefit to helping yourself get better, not more as in a crutch to lean on with all your weight. the more weight you add to that said crutch you might end up breaking it and you won’t have any strength to get back up again. i learned that from experience too. </p><p>coping mechanisms should be more as gentle reminders to yourself to keep going. i don’t know what goes on in your life, so i’m sorry if all this sounds really vague atm. if you need a crutch, something to put your weight on, that depends as to what you are looking for in the long run. if you are the type to put your weight on a crutch that leads to a love-life, you might putting a lot of weight on a loved one. if you are the type to put a lot of weight in finding comfort in life, you might be holding yourself back from doing things that make you uncomfortable. you see where i’m getting at? coping should be a form of finding balance in your life. it can be a lot of work, but it isn’t impossible. </p><p>your crutch should be that of learning balance. balance of what you need and what you don’t need, knowing your wants and separating them from what you need. you might need the balance of finding meaning in your life. (i believe in God, but i’m going more on personal experience there. if you want more info on that you can send another ask in.) so in all reality, the crutch is what keeps you standing while coping is more of those little pieces that become bigger pieces depending on how you use them. sort of like puzzle pieces that either heal you or make you worse. </p><p>here are those links to those posts that might help too (i also added some blog links in case you might need that more than the post itself) :</p><p><a href=\"http://onlinecounsellingcollege.tumblr.com/\">counsel blog</a> | <a href=\"https://bakugou-rants.tumblr.com/post/181106281886/things-you-shouldnt-have-to-apologize-for\">apologize reminder</a> | <a href=\"https://bakugou-rants.tumblr.com/post/181103635631/gentle-reminder\">gentle reminder</a> | <a href=\"https://asking-jude.tumblr.com/\">jude blog</a> (she’s an honest sweetie, i talked to her before.) </p><p>if anyone wants to add more links/blog recs, don’t be afraid to. if there is anything more that is on your mind, anon, let me know. i’m not sure as to what issues you are dealing with, but i hope you feel better knowing that you are cared about. if you need me to clarify anything, or give more info on a specific topic, feel free. other than that, i send you good vibes and best wishes on your mental health. </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "bakugou-rants",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/335b0787afe068aa1c7772f1feca62c7/62drkja/cYfpkatre/tumblr_static_d4poleo9jig4c8wcccsg40ksk.png",
                        "header_image_focused": "https://static.tumblr.com/335b0787afe068aa1c7772f1feca62c7/62drkja/cYfpkatre/tumblr_static_d4poleo9jig4c8wcccsg40ksk_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/335b0787afe068aa1c7772f1feca62c7/62drkja/cYfpkatre/tumblr_static_d4poleo9jig4c8wcccsg40ksk_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#F2992E",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ae4b33",
                        "title_font": "Baskerville",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346290261"
                },
                "content_raw": "<p><blockquote><p>\n\nthey told me to go find help somewhere else, except that I can’t. therapy at my school was convenient because I didn’t have to pay for it, and I can’t drive. do you have advice on how you would cope with all this and if you’ve ever been in a similar situation? like what coping mechanisms help you when you don’t have access to a therapist anymore? and just any advice you can share in general related to dealing with mental health issues? thank you.\n\n<br></p></blockquote><p>i do appreciate you sending something in, and if you ever want additional advice you are free to give more info as to what you dealing with since each mental issue is different and can be hard to handle with just a broad general speculation as to what you could be dealing with. always feel free to send more info in either on or off anon, it’s up to you. i don’t want to trigger anxiety if you feel unsafe off anon. </p><p>but with what you have told me, being guilt tripped when you are already having mental issues can only add weight. try to lessen that weight if you have it, and you might not even know you have weight. look back to that moment and remind yourself not to take what they said personally. they are being cold, and i’m sure that they would have been a better help if they had been more considerate to your situation and maybe have talked to a different person, but i’m not going to ask you to go back there since the way you have already been treated. </p><p>i have been in similar situations where people just don’t want to deal with another person’s problems, and that’s how this is coming off to me, which is just sad and cruel. </p><p>i’m not able to get a therapist myself at the moment, but what i can handle is researching some self-help sites and other psychiatric care sites that can give info and advice. that has always been my form of outlet. though speaking to a person can do a lot more since it feels more personal and needed since people are social by nature. but here is some sites that i use, personally, when i feel like i need some more in depth help. <a href=\"https://psychcentral.com/\">1</a> / <a href=\"https://www.psychologytoday.com/us\">2</a> / <a href=\"https://www.quora.com/\">3</a></p><p>i understand that the last link is to quora, but there are actual therapists/psychologists on that site that might be of help to you if you have questions there that might do more use than me. </p><p>the best way to cope with this, is to remind yourself of your self-value and not to think back as to what therapist you should find yourself right now because you don’t have the money. but you might be able to find free therapists online that can give you advice. also i’m not saying you shouldn’t find yourself a personal therapist at all, but more that you need to focus on your priorities that can lead you there in the long run, and that means taking care of yourself right now. that way you are stable enough to get money to be able to be a long-term patient for a therapist/counselor and so on. </p><p>coping can have a lot of different meanings to a lot of different people because people cope in different ways. i post a lot of self-care stuff here on this blog, and i will be linking what i think would be beneficial for you at the bottom of this post. </p><p>when i feel at my lowest, when i feel like i have reached a hard spot, i take a breather. it’s good to get a recollection of what’s going on around you and to remind yourself to take a moment and completely separate yourself from the situation. and when you go back to that issue, try finding a different perspective as to how to handle that said situation. don’t put yourself on a time limit and don’t compare yourself to other people. the only time you should compare yourself to people is when you need help self-reflecting and getting to know why you do the things you do, and if you have trauma, don’t blame yourself for not understanding things that other people do because of said trauma. </p><p>coping (the way i’ve always seen it) should be more used as a benefit to helping yourself get better, not more as in a crutch to lean on with all your weight. the more weight you add to that said crutch you might end up breaking it and you won’t have any strength to get back up again. i learned that from experience too. </p><p>coping mechanisms should be more as gentle reminders to yourself to keep going. i don’t know what goes on in your life, so i’m sorry if all this sounds really vague atm. if you need a crutch, something to put your weight on, that depends as to what you are looking for in the long run. if you are the type to put your weight on a crutch that leads to a love-life, you might putting a lot of weight on a loved one. if you are the type to put a lot of weight in finding comfort in life, you might be holding yourself back from doing things that make you uncomfortable. you see where i’m getting at? coping should be a form of finding balance in your life. it can be a lot of work, but it isn’t impossible. </p><p>your crutch should be that of learning balance. balance of what you need and what you don’t need, knowing your wants and separating them from what you need. you might need the balance of finding meaning in your life. (i believe in God, but i’m going more on personal experience there. if you want more info on that you can send another ask in.) so in all reality, the crutch is what keeps you standing while coping is more of those little pieces that become bigger pieces depending on how you use them. sort of like puzzle pieces that either heal you or make you worse. </p><p>here are those links to those posts that might help too (i also added some blog links in case you might need that more than the post itself) :</p><p><a href=\"http://onlinecounsellingcollege.tumblr.com/\">counsel blog</a> | <a href=\"https://bakugou-rants.tumblr.com/post/181106281886/things-you-shouldnt-have-to-apologize-for\">apologize reminder</a> | <a href=\"https://bakugou-rants.tumblr.com/post/181103635631/gentle-reminder\">gentle reminder</a> | <a href=\"https://asking-jude.tumblr.com/\">jude blog</a> (she’s an honest sweetie, i talked to her before.) </p><p>if anyone wants to add more links/blog recs, don’t be afraid to. if there is anything more that is on your mind, anon, let me know. i’m not sure as to what issues you are dealing with, but i hope you feel better knowing that you are cared about. if you need me to clarify anything, or give more info on a specific topic, feel free. other than that, i send you good vibes and best wishes on your mental health. </p></p>",
                "content": "<p><blockquote><p>\n\nthey told me to go find help somewhere else, except that I can&rsquo;t. therapy at my school was convenient because I didn&rsquo;t have to pay for it, and I can&rsquo;t drive. do you have advice on how you would cope with all this and if you&rsquo;ve ever been in a similar situation? like what coping mechanisms help you when you don&rsquo;t have access to a therapist anymore? and just any advice you can share in general related to dealing with mental health issues? thank you.\n\n<br /></p></blockquote><p>i do appreciate you sending something in, and if you ever want additional advice you are free to give more info as to what you dealing with since each mental issue is different and can be hard to handle with just a broad general speculation as to what you could be dealing with. always feel free to send more info in either on or off anon, it&rsquo;s up to you. i don&rsquo;t want to trigger anxiety if you feel unsafe off anon.&nbsp;</p><p>but with what you have told me, being guilt tripped when you are already having mental issues can only add weight. try to lessen that weight if you have it, and you might not even know you have weight. look back to that moment and remind yourself not to take what they said personally. they are being cold, and i&rsquo;m sure that they would have been a better help if they had been more considerate to your situation and maybe have talked to a different person, but i&rsquo;m not going to ask you to go back there since the way you have already been treated.&nbsp;</p><p>i have been in similar situations where people just don&rsquo;t want to deal with another person&rsquo;s problems, and that&rsquo;s how this is coming off to me, which is just sad and cruel.&nbsp;</p><p>i&rsquo;m not able to get a therapist myself at the moment, but what i can handle is researching some self-help sites and other psychiatric care sites that can give info and advice. that has always been my form of outlet. though speaking to a person can do a lot more since it feels more personal and needed since people are social by nature. but here is some sites that i use, personally, when i feel like i need some more in depth help. <a href=\"https://psychcentral.com/\">1</a> / <a href=\"https://www.psychologytoday.com/us\">2</a> / <a href=\"https://www.quora.com/\">3</a></p><p>i understand that the last link is to quora, but there are actual therapists/psychologists on that site that might be of help to you if you have questions there that might do more use than me.&nbsp;</p><p>the best way to cope with this, is to remind yourself of your self-value and not to think back as to what therapist you should find yourself right now because you don&rsquo;t have the money. but you might be able to find free therapists online that can give you advice.&nbsp;also i&rsquo;m not saying you shouldn&rsquo;t find yourself a personal therapist at all, but more that you need to focus on your priorities that can lead you there in the long run, and that means taking care of yourself right now. that way you are stable enough to get money to be able to be a long-term patient for a therapist/counselor and so on.&nbsp;</p><p>coping can have a lot of different meanings to a lot of different people because people cope in different ways.&nbsp;i post a lot of self-care stuff here on this blog, and i will be linking what i think would be beneficial for you at the bottom of this post.&nbsp;</p><p>when i feel at my lowest, when i feel like i have reached a hard spot, i take a breather. it&rsquo;s good to get a recollection of what&rsquo;s going on around you and to remind yourself to take a moment and completely separate yourself from the situation. and when you go back to that issue, try finding a different perspective as to how to handle that said situation. don&rsquo;t put yourself on a time limit and don&rsquo;t compare yourself to other people. the only time you should compare yourself to people is when you need help self-reflecting and getting to know why you do the things you do, and if you have trauma, don&rsquo;t blame yourself for not understanding things that other people do because of said trauma.&nbsp;</p><p>coping (the way i&rsquo;ve always seen it) should be more used as a benefit to helping yourself get better, not more as in a crutch to lean on with all your weight. the more weight you add to that said crutch you might end up breaking it and you won&rsquo;t have any strength to get back up again. i learned that from experience too.&nbsp;</p><p>coping mechanisms should be more as gentle reminders to yourself to keep going. i don&rsquo;t know what goes on in your life, so i&rsquo;m sorry if all this sounds really vague atm. if you need a crutch, something to put your weight on, that depends as to what you are looking for in the long run. if you are the type to put your weight on a crutch that leads to a love-life, you might putting a lot of weight on a loved one. if you are the type to put a lot of weight in finding comfort in life, you might be holding yourself back from doing things that make you uncomfortable. you see where i&rsquo;m getting at? coping should be a form of finding balance in your life. it can be a lot of work, but it isn&rsquo;t impossible.&nbsp;</p><p>your crutch should be that of learning balance. balance of what you need and what you don&rsquo;t need, knowing your wants and separating them from what you need. you might need the balance of finding meaning in your life. (i believe in God, but i&rsquo;m going more on personal experience there. if you want more info on that you can send another ask in.) so in all reality, the crutch is what keeps you standing while coping is more of those little pieces that become bigger pieces depending on how you use them. sort of like puzzle pieces that either heal you or make you worse.&nbsp;</p><p>here are those links to those posts that might help too (i also added some blog links in case you might need that more than the post itself) :</p><p><a href=\"http://onlinecounsellingcollege.tumblr.com/\">counsel blog</a> | <a href=\"https://bakugou-rants.tumblr.com/post/181106281886/things-you-shouldnt-have-to-apologize-for\">apologize reminder</a> | <a href=\"https://bakugou-rants.tumblr.com/post/181103635631/gentle-reminder\">gentle reminder</a> | <a href=\"https://asking-jude.tumblr.com/\">jude blog</a> (she&rsquo;s an honest sweetie, i talked to her before.)&nbsp;</p><p>if anyone wants to add more links/blog recs, don&rsquo;t be afraid to. if there is anything more that is on your mind, anon, let me know. i&rsquo;m not sure as to what issues you are dealing with, but i hope you feel better knowing that you are cared about. if you need me to clarify anything, or give more info on a specific topic, feel free. other than that, i send you good vibes and best wishes on your mental health.&nbsp;</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "healthnfitnessnews",
        "blog": {
            "name": "healthnfitnessnews",
            "title": "Health and Fitness News",
            "description": "Daily Health and Fitness News",
            "url": "https://healthnfitnessnews.tumblr.com/",
            "uuid": "t:fVrlOHqY_c23cpYvy8YBWQ",
            "updated": 1558519860
        },
        "id": 181346211669,
        "post_url": "https://healthnfitnessnews.tumblr.com/post/181346211669/best-bodybuilding-exercises-that-you-never",
        "slug": "best-bodybuilding-exercises-that-you-never",
        "date": "2018-03-28 02:40:07 GMT",
        "timestamp": 1522204807,
        "state": "published",
        "format": "html",
        "reblog_key": "iRbvN8wR",
        "tags": [
            "bodybuilding",
            "diet",
            "exercise",
            "Exercises",
            "health",
            "Part",
            "Perform",
            "weight loss",
            "weight training"
        ],
        "short_url": "https://tmblr.co/Z0Vgvb2ev4vTL",
        "summary": "Best Bodybuilding Exercises That You Never Perform! (Part 1)\r\n    If I could get paid for every time anyone has asked me 'How...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "source_url": "https://t.umblr.com/redirect?z=http%3A%2F%2Fwww.healthnfitnessnews.com%2Fbodybuilding%2Fbest-bodybuilding-exercises-that-you-never-perform-part-1%2F&t=ZjEwZWNmOWQ2MzUwZWJjODE1MzFkYmNjNGE4ZmRjNTY2ZGVlNDkxYiwxODEzNDYyMTE2Njk%3D&b=t%3AfVrlOHqY_c23cpYvy8YBWQ&p=https%3A%2F%2Fhealthnfitnessnews.tumblr.com%2Fpost%2F181346211669%2Fbest-bodybuilding-exercises-that-you-never&m=1",
        "source_title": "healthnfitnessnews.com",
        "caption": "<blockquote><p><strong>Best Bodybuilding Exercises That You Never Perform! (Part 1)</strong></p>\n<p><img src=\"http://www.healthnfitnessnews.com/wp-content/uploads/2017/11/advanced-bodybuilding-workout-routine-for-monster-mass.jpg\"/></p><p>  If I could get paid for every time anyone has asked me &lsquo;How much do you Bench?&rsquo;  I would be a rich man. \n  This article laughs in the face of such questions because if people only knew the benefits, what they would really be asking is: 'How heavy can you go with the Olympic Clean&hellip;</p></blockquote>\n\n<p>Read the full article by clicking <a href=\"http://www.healthnfitnessnews.com/bodybuilding/best-bodybuilding-exercises-that-you-never-perform-part-1/\" target=\"_blank\">HERE</a></p>",
        "reblog": {
            "comment": "<p><blockquote><p><strong>Best Bodybuilding Exercises That You Never Perform! (Part 1)</strong></p>\n<p><img src=\"http://www.healthnfitnessnews.com/wp-content/uploads/2017/11/advanced-bodybuilding-workout-routine-for-monster-mass.jpg\"></p><p>  If I could get paid for every time anyone has asked me ‘How much do you Bench?’  I would be a rich man. \n  This article laughs in the face of such questions because if people only knew the benefits, what they would really be asking is: 'How heavy can you go with the Olympic Clean…</p></blockquote>\n\n<p>Read the full article by clicking <a href=\"http://www.healthnfitnessnews.com/bodybuilding/best-bodybuilding-exercises-that-you-never-perform-part-1/\" target=\"_blank\">HERE</a></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "healthnfitnessnews",
                    "active": true,
                    "theme": {
                        "header_full_width": 900,
                        "header_full_height": 900,
                        "header_focus_width": 829,
                        "header_focus_height": 467,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "216,864,683,35",
                        "header_image": "https://static.tumblr.com/626e753eb69f47d4dab7ae5e5f1b4a8c/kvr9olf/rh5p097yb/tumblr_static_12pzm9hyypeog44oo44k80g4s.jpg",
                        "header_image_focused": "https://static.tumblr.com/626e753eb69f47d4dab7ae5e5f1b4a8c/kvr9olf/6MEp097ye/tumblr_static_tumblr_static_12pzm9hyypeog44oo44k80g4s_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/626e753eb69f47d4dab7ae5e5f1b4a8c/kvr9olf/rh5p097yb/tumblr_static_12pzm9hyypeog44oo44k80g4s_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346211669"
                },
                "content_raw": "<p><blockquote><p><strong>Best Bodybuilding Exercises That You Never Perform! (Part 1)</strong></p>\n<p><img src=\"http://www.healthnfitnessnews.com/wp-content/uploads/2017/11/advanced-bodybuilding-workout-routine-for-monster-mass.jpg\"></p><p>  If I could get paid for every time anyone has asked me ‘How much do you Bench?’  I would be a rich man. \n  This article laughs in the face of such questions because if people only knew the benefits, what they would really be asking is: 'How heavy can you go with the Olympic Clean…</p></blockquote>\n\n<p>Read the full article by clicking <a href=\"http://www.healthnfitnessnews.com/bodybuilding/best-bodybuilding-exercises-that-you-never-perform-part-1/\" target=\"_blank\">HERE</a></p></p>",
                "content": "<p><blockquote><p><strong>Best Bodybuilding Exercises That You Never Perform! (Part 1)</strong></p>\n<p><div class=\"external-image-wrapper\" data-loading-text=\"Loading...\" data-src=\"http://www.healthnfitnessnews.com/wp-content/uploads/2017/11/advanced-bodybuilding-workout-routine-for-monster-mass.jpg\">External image</div></p><p>  If I could get paid for every time anyone has asked me &lsquo;How much do you Bench?&rsquo;  I would be a rich man. \n  This article laughs in the face of such questions because if people only knew the benefits, what they would really be asking is: 'How heavy can you go with the Olympic Clean&hellip;</p></blockquote>\n\n<p>Read the full article by clicking <a href=\"http://www.healthnfitnessnews.com/bodybuilding/best-bodybuilding-exercises-that-you-never-perform-part-1/\" target=\"_blank\">HERE</a></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "link_url": "http://www.healthnfitnessnews.com/bodybuilding/best-bodybuilding-exercises-that-you-never-perform-part-1/",
        "image_permalink": "https://healthnfitnessnews.tumblr.com/image/181346211669",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/12a70d667d89f563148aa4f9cd7a2839/tumblr_pk6ytrYKHl1wjf8fpo1_1280.jpg",
                    "width": 1254,
                    "height": 837
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/12a70d667d89f563148aa4f9cd7a2839/tumblr_pk6ytrYKHl1wjf8fpo1_1280.jpg",
                        "width": 1254,
                        "height": 837
                    },
                    {
                        "url": "https://66.media.tumblr.com/12a70d667d89f563148aa4f9cd7a2839/tumblr_pk6ytrYKHl1wjf8fpo1_640.jpg",
                        "width": 640,
                        "height": 427
                    },
                    {
                        "url": "https://66.media.tumblr.com/12a70d667d89f563148aa4f9cd7a2839/tumblr_pk6ytrYKHl1wjf8fpo1_540.jpg",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/12a70d667d89f563148aa4f9cd7a2839/tumblr_pk6ytrYKHl1wjf8fpo1_500.jpg",
                        "width": 500,
                        "height": 334
                    },
                    {
                        "url": "https://66.media.tumblr.com/12a70d667d89f563148aa4f9cd7a2839/tumblr_pk6ytrYKHl1wjf8fpo1_400.jpg",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/12a70d667d89f563148aa4f9cd7a2839/tumblr_pk6ytrYKHl1wjf8fpo1_250.jpg",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/12a70d667d89f563148aa4f9cd7a2839/tumblr_pk6ytrYKHl1wjf8fpo1_100.jpg",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/12a70d667d89f563148aa4f9cd7a2839/tumblr_pk6ytrYKHl1wjf8fpo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "divine-fitness",
        "blog": {
            "name": "divine-fitness",
            "title": "\"The only limit is the mind.\"",
            "description": "",
            "url": "https://divine-fitness.tumblr.com/",
            "uuid": "t:LKIsElyjZCUUFzuedFYnow",
            "updated": 1556839078
        },
        "id": 181346201211,
        "post_url": "https://divine-fitness.tumblr.com/post/181346201211",
        "slug": "",
        "date": "2018-12-23 13:29:11 GMT",
        "timestamp": 1545571751,
        "state": "published",
        "format": "html",
        "reblog_key": "rydp4LRe",
        "tags": [
            "fitness",
            "lifestyle",
            "health",
            "fitness & muscle"
        ],
        "short_url": "https://tmblr.co/ZCev3d2ev4svx",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "image_permalink": "https://divine-fitness.tumblr.com/image/181346201211",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/48998832f84fe8a097bd84ebe04f1a8b/tumblr_pk6ysnpGVb1wy74gfo1_500.jpg",
                    "width": 444,
                    "height": 750
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/48998832f84fe8a097bd84ebe04f1a8b/tumblr_pk6ysnpGVb1wy74gfo1_500.jpg",
                        "width": 444,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/48998832f84fe8a097bd84ebe04f1a8b/tumblr_pk6ysnpGVb1wy74gfo1_400.jpg",
                        "width": 355,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/48998832f84fe8a097bd84ebe04f1a8b/tumblr_pk6ysnpGVb1wy74gfo1_250.jpg",
                        "width": 237,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/48998832f84fe8a097bd84ebe04f1a8b/tumblr_pk6ysnpGVb1wy74gfo1_100.jpg",
                        "width": 100,
                        "height": 169
                    },
                    {
                        "url": "https://66.media.tumblr.com/48998832f84fe8a097bd84ebe04f1a8b/tumblr_pk6ysnpGVb1wy74gfo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "davederunger",
        "blog": {
            "name": "davederunger",
            "title": "Davede Runger",
            "description": "I am Davede Runger. I am responsible to promote healthy eating habits by developing health plans and educating people about the foods and advise people on what to eat in order to lead a healthy lifestyle or achieve a specific health-related goal.\n\n<br><br>\nCheck out our website\n<br><br>\n<a href=\"http://previous.trainingyoungathletes.com\n\">Previous Training Young Athletes</a>",
            "url": "https://davederunger.tumblr.com/",
            "uuid": "t:NQ03-5qWcCEFlGLIB6Q6Yw",
            "updated": 1555965225
        },
        "id": 181346200626,
        "post_url": "https://davederunger.tumblr.com/post/181346200626/childrens-cheer-a-few-of-our-favorite-holiday",
        "slug": "childrens-cheer-a-few-of-our-favorite-holiday",
        "date": "2018-12-23 13:29:09 GMT",
        "timestamp": 1545571749,
        "state": "published",
        "format": "html",
        "reblog_key": "UZOZm9F1",
        "tags": [
            "Health"
        ],
        "short_url": "https://tmblr.co/ZtcE7c2ev4smo",
        "summary": "Children’s Cheer: A Few of Our Favorite Holiday Happenings in 2018",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": "Children’s Cheer: A Few of Our Favorite Holiday Happenings in 2018",
        "body": "<div id=\"schema-videoobject\" class=\"video-container\"><iframe width=\"600\" height=\"480\" src=\"https://www.youtube.com/embed/Qg_ZbIXB45k?rel=0&amp;controls=0&amp;showinfo=0\" frameborder=\"0\" allowfullscreen></iframe></div>\n<br/><a href=\"http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/\">See the rest of the story at http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/</a><br/><br/>",
        "reblog": {
            "comment": "<p><div id=\"schema-videoobject\" class=\"video-container\"><iframe width=\"600\" height=\"480\" src=\"https://www.youtube.com/embed/Qg_ZbIXB45k?rel=0&controls=0&showinfo=0\" frameborder=\"0\" allowfullscreen></iframe></div>\n<br><a href=\"http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/\">See the rest of the story at http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/</a><br><br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "davederunger",
                    "active": true,
                    "theme": {
                        "header_full_width": 1214,
                        "header_full_height": 1214,
                        "header_focus_width": 1214,
                        "header_focus_height": 683,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "265,1214,948,0",
                        "header_image": "https://static.tumblr.com/f698cd089468140ee0c76426f8a3889e/zadjkh5/GDjoz84a3/tumblr_static_da0360nx31w8ssso40kw0w4so.jpg",
                        "header_image_focused": "https://static.tumblr.com/f698cd089468140ee0c76426f8a3889e/zadjkh5/c0Doz84a6/tumblr_static_tumblr_static_da0360nx31w8ssso40kw0w4so_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f698cd089468140ee0c76426f8a3889e/zadjkh5/GDjoz84a3/tumblr_static_da0360nx31w8ssso40kw0w4so_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346200626"
                },
                "content_raw": "<p><div id=\"schema-videoobject\" class=\"video-container\"><iframe width=\"600\" height=\"480\" src=\"https://www.youtube.com/embed/Qg_ZbIXB45k?rel=0&controls=0&showinfo=0\" frameborder=\"0\" allowfullscreen></iframe></div>\n<br><a href=\"http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/\">See the rest of the story at http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/</a><br><br></p>",
                "content": "<p><p><a href=\"#\"><img src=\"https://assets.tumblr.com/images/inline_placeholder.png\" width=\"18\" height=\"14\"/></a></p>\n<br /><a href=\"http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/\">See the rest of the story at http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/</a><br /><br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "davederunger",
        "blog": {
            "name": "davederunger",
            "title": "Davede Runger",
            "description": "I am Davede Runger. I am responsible to promote healthy eating habits by developing health plans and educating people about the foods and advise people on what to eat in order to lead a healthy lifestyle or achieve a specific health-related goal.\n\n<br><br>\nCheck out our website\n<br><br>\n<a href=\"http://previous.trainingyoungathletes.com\n\">Previous Training Young Athletes</a>",
            "url": "https://davederunger.tumblr.com/",
            "uuid": "t:NQ03-5qWcCEFlGLIB6Q6Yw",
            "updated": 1555965225
        },
        "id": 181346200761,
        "post_url": "https://davederunger.tumblr.com/post/181346200761/best-home-remedy-for-wet-cough-health-tips",
        "slug": "best-home-remedy-for-wet-cough-health-tips",
        "date": "2018-12-23 13:29:09 GMT",
        "timestamp": 1545571749,
        "state": "published",
        "format": "html",
        "reblog_key": "hvo5giaD",
        "tags": [
            "Health"
        ],
        "short_url": "https://tmblr.co/ZtcE7c2ev4sov",
        "summary": "Best Home Remedy for wet cough || # health tips",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 0,
        "title": "Best Home Remedy for wet cough || # health tips",
        "body": "<div id=\"schema-videoobject\" class=\"video-container\"><iframe width=\"600\" height=\"480\" src=\"https://www.youtube.com/embed/aWO8kJ5yneQ?rel=0&amp;controls=0&amp;showinfo=0\" frameborder=\"0\" allowfullscreen></iframe></div>\n<br/><a href=\"http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/\">See the rest of the story at http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/</a><br/><br/>",
        "reblog": {
            "comment": "<p><div id=\"schema-videoobject\" class=\"video-container\"><iframe width=\"600\" height=\"480\" src=\"https://www.youtube.com/embed/aWO8kJ5yneQ?rel=0&controls=0&showinfo=0\" frameborder=\"0\" allowfullscreen></iframe></div>\n<br><a href=\"http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/\">See the rest of the story at http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/</a><br><br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "davederunger",
                    "active": true,
                    "theme": {
                        "header_full_width": 1214,
                        "header_full_height": 1214,
                        "header_focus_width": 1214,
                        "header_focus_height": 683,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "265,1214,948,0",
                        "header_image": "https://static.tumblr.com/f698cd089468140ee0c76426f8a3889e/zadjkh5/GDjoz84a3/tumblr_static_da0360nx31w8ssso40kw0w4so.jpg",
                        "header_image_focused": "https://static.tumblr.com/f698cd089468140ee0c76426f8a3889e/zadjkh5/c0Doz84a6/tumblr_static_tumblr_static_da0360nx31w8ssso40kw0w4so_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f698cd089468140ee0c76426f8a3889e/zadjkh5/GDjoz84a3/tumblr_static_da0360nx31w8ssso40kw0w4so_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346200761"
                },
                "content_raw": "<p><div id=\"schema-videoobject\" class=\"video-container\"><iframe width=\"600\" height=\"480\" src=\"https://www.youtube.com/embed/aWO8kJ5yneQ?rel=0&controls=0&showinfo=0\" frameborder=\"0\" allowfullscreen></iframe></div>\n<br><a href=\"http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/\">See the rest of the story at http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/</a><br><br></p>",
                "content": "<p><p><a href=\"#\"><img src=\"https://assets.tumblr.com/images/inline_placeholder.png\" width=\"18\" height=\"14\"/></a></p>\n<br /><a href=\"http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/\">See the rest of the story at http://previous.trainingyoungathletes.com/best-home-remedy-for-wet-cough-health-tips/</a><br /><br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "lynnecstrum",
        "blog": {
            "name": "lynnecstrum",
            "title": "Lynne Strum",
            "description": "<a href=\"https://lynnecstrum.blogspot.com\">Lynne Strum</a> is a Nutritionist. She provides dietary, supplement and lifestyle advice.\n<br/><br/>\n<a href=\"https://www.youtube.com/channel/UCFr3MVChPooV1LUkmg2WCJw/about\" target=\"_blank\"><img src=\"http://i.imgur.com/R8Nnr52.png\" alt=\"Youtube\" style=\"width:40px;height:40px;\"></a>&nbsp\n\n<a href=\"https://twitter.com/lynnecstrum\" target=\"_blank\"><img src=\"http://i.imgur.com/PQSbCTw.png\" alt=\"Twitter\" style=\"width:40px;height:40px;\"></a>&nbsp\n\n<a href=\"https://plus.google.com/101133215572500102683\" target=\"_blank\"><img src=\"http://i.imgur.com/HVyJqL1.png \" alt=\"Google Plus\" style=\"width:40px;height:40px;\"></a>&nbsp",
            "url": "https://lynnecstrum.tumblr.com/",
            "uuid": "t:1qVmblY9TnMelvbtJkPB0g",
            "updated": 1555991853
        },
        "id": 181346201128,
        "post_url": "https://lynnecstrum.tumblr.com/post/181346201128/say-goodbye-to-cough",
        "slug": "say-goodbye-to-cough",
        "date": "2018-12-23 13:29:06 GMT",
        "timestamp": 1545571746,
        "state": "published",
        "format": "html",
        "reblog_key": "p2TtuIzd",
        "tags": [
            "Health",
            "Nutrition",
            "Diet"
        ],
        "short_url": "https://tmblr.co/ZUxSKc2ev4sue",
        "summary": "say goodbye to cough",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1,
        "title": "say goodbye to cough",
        "body": "<div id=\"schema-videoobject\" class=\"video-container\"><iframe width=\"600\" height=\"480\" src=\"https://www.youtube.com/embed/RXbthdTI4R4?rel=0&amp;controls=0&amp;showinfo=0\" frameborder=\"0\" allowfullscreen></iframe></div>\n<br/><a href=\"http://log.destined2befit.com/2018/12/23/say-goodbye-to-cough/\">See the rest of the story at http://log.destined2befit.com/2018/12/23/say-goodbye-to-cough/</a><br/><br/>",
        "reblog": {
            "comment": "<p><div id=\"schema-videoobject\" class=\"video-container\"><iframe width=\"600\" height=\"480\" src=\"https://www.youtube.com/embed/RXbthdTI4R4?rel=0&controls=0&showinfo=0\" frameborder=\"0\" allowfullscreen></iframe></div>\n<br><a href=\"http://log.destined2befit.com/2018/12/23/say-goodbye-to-cough/\">See the rest of the story at http://log.destined2befit.com/2018/12/23/say-goodbye-to-cough/</a><br><br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "lynnecstrum",
                    "active": true,
                    "theme": {
                        "header_full_width": 995,
                        "header_full_height": 662,
                        "header_focus_width": 995,
                        "header_focus_height": 559,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "51,995,610,0",
                        "header_image": "https://static.tumblr.com/164c932e6b163a05dca463668c63ca4c/3dswfdx/Yleoy9n35/tumblr_static_97nw1ktfy58g44w8ssogco8o4.png",
                        "header_image_focused": "https://static.tumblr.com/164c932e6b163a05dca463668c63ca4c/3dswfdx/qtZoy9n39/tumblr_static_tumblr_static_97nw1ktfy58g44w8ssogco8o4_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/164c932e6b163a05dca463668c63ca4c/3dswfdx/Yleoy9n35/tumblr_static_97nw1ktfy58g44w8ssogco8o4_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181346201128"
                },
                "content_raw": "<p><div id=\"schema-videoobject\" class=\"video-container\"><iframe width=\"600\" height=\"480\" src=\"https://www.youtube.com/embed/RXbthdTI4R4?rel=0&controls=0&showinfo=0\" frameborder=\"0\" allowfullscreen></iframe></div>\n<br><a href=\"http://log.destined2befit.com/2018/12/23/say-goodbye-to-cough/\">See the rest of the story at http://log.destined2befit.com/2018/12/23/say-goodbye-to-cough/</a><br><br></p>",
                "content": "<p><p><a href=\"#\"><img src=\"https://assets.tumblr.com/images/inline_placeholder.png\" width=\"18\" height=\"14\"/></a></p>\n<br /><a href=\"http://log.destined2befit.com/2018/12/23/say-goodbye-to-cough/\">See the rest of the story at http://log.destined2befit.com/2018/12/23/say-goodbye-to-cough/</a><br /><br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    }
]