[
    {
        "type": "text",
        "blog_name": "seonghwass",
        "blog": {
            "name": "seonghwass",
            "title": "",
            "description": "<p>katie [20] pansexual | Dan and Phil (Dannie) | BTS (Yoongi Biased) | ATEEZ (Yunho Biased) | Rae💚</p>",
            "url": "https://seonghwass.tumblr.com/",
            "uuid": "t:L0nIApqDQ3FSlkeZcO9VMQ",
            "updated": 1561760223
        },
        "id": 178676360375,
        "post_url": "https://seonghwass.tumblr.com/post/178676360375/blows-kisses-to-the-stars-for-dan-howell",
        "slug": "blows-kisses-to-the-stars-for-dan-howell",
        "date": "2018-10-02 21:07:03 GMT",
        "timestamp": 1538514423,
        "state": "published",
        "format": "html",
        "reblog_key": "sF4yZk0p",
        "tags": [
            "d&p",
            "dan",
            "dan and phil games",
            "dan and phil",
            "phan",
            "dan howell",
            "daniel howell",
            "she speaks",
            ":( i love him is he ok"
        ],
        "short_url": "https://tmblr.co/ZcuVyg2cPyEIt",
        "summary": "*blows kisses to the stars* for dan howell",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 442,
        "title": null,
        "body": "<p><b>*blows kisses to the stars*</b> for dan howell </p>",
        "reblog": {
            "comment": "<p><b>*blows kisses to the stars*</b> for dan howell </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "seonghwass",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/433c730c9ea7c20e48e516120bd1c8b7/6sbwjty/B8Wpt2avp/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/433c730c9ea7c20e48e516120bd1c8b7/6sbwjty/B8Wpt2avp/tumblr_static__2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/433c730c9ea7c20e48e516120bd1c8b7/6sbwjty/B8Wpt2avp/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#000000",
                        "title_font": "Lorimer No 2",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178676360375"
                },
                "content_raw": "<p><b>*blows kisses to the stars*</b> for dan howell </p>",
                "content": "<p><b>*blows kisses to the stars*</b> for dan howell </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "danfanciesphil",
        "blog": {
            "name": "danfanciesphil",
            "title": "'I'll find you in any world'",
            "description": "Winner of Best Author and Best Overall Fic in the phanfictionawards 2018\n \n<a href=\"/myfics\">Fic Link</a> | <a href=\"/about\">About</a> | <a href=\"/ask\">Ask</a>\n\n<a href=\"/\">🎡</a>\n\n <link href=\"https://fonts.googleapis.com/css?family=Cookie\" rel=\"stylesheet\"><a class=\"bmc-button\" target=\"_blank\" href=\"https://www.buymeacoffee.com/fD1sIr5Ry\"><span style=\"margin-left:2px\">Buy me a coffee</span></a>",
            "url": "https://danfanciesphil.tumblr.com/",
            "uuid": "t:QLX6-A1TlJpHUmJGXd-m-w",
            "updated": 1561758364
        },
        "id": 178676195090,
        "post_url": "https://danfanciesphil.tumblr.com/post/178676195090/some-kind-of-folliful-new-chapter",
        "slug": "some-kind-of-folliful-new-chapter",
        "date": "2018-10-02 21:00:49 GMT",
        "timestamp": 1538514049,
        "state": "published",
        "format": "html",
        "reblog_key": "2gkkHDXE",
        "tags": [
            "phan",
            "phanfic",
            "some kind of folliful",
            "skof"
        ],
        "short_url": "https://tmblr.co/ZNJpki2cPxbyI",
        "summary": "Some Kind Of Folliful (New Chapter)",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 56,
        "title": "Some Kind Of Folliful (New Chapter)",
        "body": "<p><b>Edgelord!Dan x ObliviousBisexual!Phil AU [CHAPTER SIX]<br/></b><b>(based off the 80′s classic Some Kind of Wonderful)</b></p><p><b>Synopsis: </b><i>Dan has one friend, and only because he was forced into it. Phil is loud, excitable, and irritatingly happy all of the time. Phil seems to find Dan’s perpetual attitude funny, and despite Dan’s best efforts to shun him and everyone else, wants to be around him all the time. That is, until Phil starts talking about Amanda Jones.<br/></i><b>Word Count:</b> WIP (Estimated 12-15 chapters) updates every Tuesday<br/><b>Rating:</b> Explicit<br/><b>Warnings:</b> Smoking, swearing, implied prostitution, broken home, class divide/classism, pining, light homophobia, sex <br/><br/></p><p><b>[<a href=\"http://danfanciesphil.tumblr.com/post/177738852529/some-kind-of-folliful-new-fic\">Chapter One</a>]<br/>[<a href=\"http://danfanciesphil.tumblr.com/post/177982263491/some-kind-of-folliful-new-chapter\">Chapter Two</a>]<br/>[<a href=\"http://danfanciesphil.tumblr.com/post/178227297225/some-kind-of-folliful-new-chapter\">Chapter Three</a>]<br/>[<a href=\"http://danfanciesphil.tumblr.com/post/178454752236/some-kind-of-folliful-new-chapter\">Chapter Four</a>]<br/>[<a href=\"http://danfanciesphil.tumblr.com/post/178671704545/some-kind-of-folliful-new-chapter\">Chapter Five</a>]</b></p><p><b>[<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Farchiveofourown.org%2Fworks%2F15894954%2Fchapters%2F37042212&amp;t=YWVmOTliMzc0MTkyZDFjZTFkMzVmMzM4NmFlOGJjZDJmODI1Njk5YixVNUVvdGxGag%3D%3D&amp;b=t%3AA-PgA5Z7k9tbi8i-ePCy7Q&amp;p=https%3A%2F%2Ffeels-forever.tumblr.com%2Fpost%2F177763348310%2Fsome-kind-of-folliful-new-fic&amp;m=1\">Ao3</a>!]</b></p><p>Dan hates the closing shift.</p><p>Or rather, he hates it <i>usually</i>.</p><p>He hates the hour it takes to shut the café down after the last customer leaves. He hates having to clean the entire coffee machine inside and out. He hates the pressure of counting the money in the till, especially as he sucks at maths.</p><p>He hates having to wipe down every table and surface. He hates having to restock the milk in the fridge and the sugar on the counter. He loathes having to switch off every single light one by one, letting the shadows crawl out of their corners and smother the place. He usually does this final task at the last possible moment, so that he can just walk straight to the door and leave as soon as possible. The café, which is quite a sweet, pretty place with a soft, happy feel in the daytime, becomes something evil in the dark.</p><p>Tonight however, it’s not so bad. The late shift is given to Dan at least once a week, because he’s worked here a lot longer than most of the other staff, and so can be trusted. He’s done it so many times that he could do it blindfolded, he’s sure, so Louise allows him to do it on his own.</p><p>Tonight, he’s not on his own.</p><!-- more --><p>Phil walked to work with him today, and has stayed ever since. He has seemed perfectly content all evening, sat at a table for two in the corner by the window, drawing in his sketchpad. He’s ordered at least three coffees, which he’ll probably regret once he gets home and can’t sleep, but Dan isn’t going to lecture him again. The last customer left around twenty minutes ago, and Phil is still there, frowning down at whatever he’s sketching. Dan has just finished counting up, so he walks over to Phil’s table to collect the mug he’s been drinking from.</p><p>“You planning on sleeping here?” He asks, picking up the mug and saucer.</p><p>Phil looks up at him in surprise. “Oh, hey let me take that.”</p><p>Dan snorts at him. “It’s literally my job, Phil.”</p><p>“Yeah, but-”</p><p>“Don’t worry about it.”</p><p>Dan walks away then, shaking his head fondly at Phil’s owlish protestations.</p><p>“Am I slowing you down?” Phil calls as Dan heads into the kitchen. “I can go if you like.”</p><p>“No, it’s fine,” Dan calls back, rinsing the crockery before stacking it into the dishwasher. “Just don’t make a mess.”</p><p>“It’s kind of creepy here after hours,” Phil says as Dan walks back out. “I don’t know how you do it all on your own.”</p><p>“I’m not on my own,” Dan counters.</p><p>There’s a hesitance on Phil’s face when Dan glances at him. “You think I’m nuts, don’t you? For going through with the date.”</p><p>Dan looks away, busying himself with stacking chairs. The scraping of the legs on the tiled floor makes him wince. “It’s certainly brave.”</p><p>Phil snorts. “Brave. Because you think it’s a joke. That she doesn’t actually like me, and that she’s doing it to get back at Hardy.”</p><p>A chair clatters from Dan’s hands, and he curses. Instead of picking it back up, he turns to Phil. “It might have crossed my mind.”</p><p>“I know that’s what everyone thinks,” Phil says, shrugging. “That she’s just using me. I get it. It’s ridiculous to think she’d actually consider me.”</p><p>“It’s got nothing to do with you, Phil,” Dan says quietly. “That’s just how they are in the Elite. They don’t think about the feelings of people like us. The only time they even acknowledge us is if we can benefit their lives in some way. Getting them coffee. Giving them lifts home. Making their boyfriend’s jealous.”</p><p>“It doesn’t matter,” Phil says dismissively, frowning in an uncharacteristic way. “I’m still gonna go through with it.”</p><p>Getting through to Phil is like trying to get through to the floor beneath his feet. </p><p>“Even if you know for sure that she’s stringing you along?” Dan asks, barely disguising his frustration. “Phil, that’s suicidal. If she’s purposefully dangling you in front of Hardy Jenns you’re gonna get your ass kicked.”</p><p>“If that’s her intention going in, that’s her problem. I’m gonna change her mind by the time the date is over,” Phil says confidently. </p><p>“Okay, now I do think you’re nuts,” Dan says.</p><p>He begins stacking the chairs again, loudly and with a recklessness that he wouldn’t normally. He should drop this, change the subject or something. But the irritation is overwhelming. Phil can’t see two feet under his nose. He’s being stubborn, because he feels he has to prove he can go through with this now, even though every star in the sky is screaming at him to turn back. </p><p>“I’ve thought about it a lot, Dan.”</p><p>“Oh, I can see that,” Dan says, rolling his eyes.</p><p>“I have,” Phil insists.  I think I can make her see that it’s better to be in the real world with the rest of us, rather than up in the clouds of the Elite. That she’d be happier without all the drama and the materialism and the seedy guys.”</p><p>Dan snorts. “How’re you gonna show her that, exactly? What’ve you got to offer her apart from a paintbrush and some overpriced jewellery? I mean, have you even properly kissed a girl?”</p><p>He doesn’t mean it to come out so harshly, but he’s angry, and his tongue doesn’t listen to him when he gets into a state. He shuts his eyes, placing the chair in his hands down.</p><p>“Sorry,” he says bitterly, “I didn’t mean-”</p><p>“No, you’re right,” Phil interrupts. He stands slowly from his chair and lifts it onto the table. “I’ve only ever kissed one person. It’s been worrying me a little, actually.”</p><p>Dan stares at him through the legs of several chairs, trying to think of something to say.</p><p>“You think Amanda would notice something like that?” Phil asks, meeting Dan’s eye. His raw, genuine concern is so obvious in his expression that Dan has to tear his gaze away.</p><p>“Maybe.” He can’t stop himself saying it, because it’s the truth. “Amanda Jones isn’t likely to be fooled by an amateur kiss, if you ask me. That babe’s got plenty of battle scars.”</p><p>Phil rolls his eyes at the wording, but catches hold of his lower lip between his teeth, worrying it to and fro. “You think?”</p><p>Dan nods slowly, leaning against an unstacked table for some support. Something about this conversation feels dangerous. Dan can feel his heart racing, his palms growing damp. He swallows thickly, mouth suddenly dry. </p><p>“Well, if you think you can deliver a kiss that kills, you probably can,” Dan says, one shoulder shrugging. “I wouldn’t worry about it.”</p><p>“No,” Phil says hurriedly, taking a step towards him. “I’m no expert.”</p><p>Dan stares at him.</p><p>“Well… it’s all about, like,” Dan flounders, feeling himself grow red. “Confidence.”</p><p>Phil ducks his chin towards his chest, then peers up at Dan, eyes sparkling with mischief. Before Dan can react, Phil’s closing the short distance between them in three long strides, pushing him up against the table behind him. Dan’s lungs seize up, but manages to gather himself enough to prevent himself from squealing at the unexpected attack.</p><p>“Like this?” Phil asks. </p><p>He’s smirking like it’s a stupid joke, but Dan’s breaths are still getting stuck in his throat. Dan rolls his eyes, but there’s no way Phil can’t hear the hammering of his heart. </p><p>“Yeah, just ram her up against the table,” Dan says, ever the sarcastic bitch. “She definitely won’t find that creepy.”</p><p>Phil snickers. “You seem to like it.”</p><p>“Fuck off.”</p><p>Instead of obeying Dan’s command, Phil seizes hold of him by the thighs and lifts him deftly onto the tabletop, slotting himself between Dan’s legs. At this point, Dan is sure he’ll combust, so he focuses all of his attention on the tasks he has left to do before locking up tonight. <i>Mop the floor in the kitchen, put the float into the safe, kick Phil in the balls for being such a fucking tease…</i></p><p>“So, what next?”</p><p>Exasperated, Dan glares at him, struggling to break free of Phil’s hold. “Forget it, I did not sign up to be your snogging tutor.”</p><p>“Dan, I’m literally begging,” Phil says, letting slip a sudden flash of the insecurity lurking beneath his flirtatious demeanour. “I just need to know if I suck. I just need to be <i>passable</i>. You can help me, I know you can.”</p><p>Dan is far, far too soft, he thinks, melting immediately, of course. Any resistance he may once have had was dissolved a few nights ago, in Phil’s bed, when the realisation of his own feelings for the man avalanched down upon him. He’s been trapped underneath the debris of that revelation ever since, struggling to breathe, aching and tortured, awaiting rescue that won’t come.  </p><p>“Ugh, fine,” Dan says, as if it’s some huge inconvenience. </p><p>Phil’s hands release Dan’s thighs, clapping together in glee. “Thank you, Dan. I owe you.”</p><p>“At this point, your debt to me is higher than all of England.”</p><p>“Right, so what do I do now?”</p><p>Dan struggles to focus, but catches sight of Phil’s frantically fidgeting hands. He can start with that, at least. “What are you gonna do with your hands?”</p><p>Phil blinks at him, confused. “Uh, it- it depends-”</p><p>“No,” Dan tells him firmly. “It doesn’t depend. They go on my- on her hips.” He blushes, waiting for this to register, but Phil just stares.  “Do it, you pleb.”</p><p>Phil chuckles nervously, but reaches out to place his hands on Dan’s hips. They’re just resting there, light as anything, but the touch of him, light and warm, still makes Dan want to cry.</p><p>“Okay,” he chokes out. “She’ll um- she’ll probably do this.”</p><p>Dan stretches his own arms out, reaching up until he’s got them locked around Phil’s neck.</p><p>“Is that what you’d do?” Phil asks, his voice sounding strange and thin. “If I were- if it were you being kissed?”</p><p>Dan shrugs, disliking the question. “Prob’ly.”</p><p>Phil nods, drinking down the information like it’s gold. “Okay, what now?”</p><p>“So, close your eyes,” Dan instructs, and Phil does. He’s so passively beautiful. All pale skin and dark lashes. Dan is not in any way ready for what’s about to happen here. How the fuck did he get himself into this situation? “Now, lean in really close to me, but… don’t touch me yet.”</p><p>There’s no denying that at this point, self indulgence has come into play. Dan can’t bring himself to feel too bad about it. He’s never going to get an opportunity like this again, and in all likelihood Phil’s too clueless to cotton on to whether Dan might be a little biased in his instruction. Phil closes some of the distance between them, their lips close now; Dan tightens his lock around Phil’s neck. He smells like the caramel macchiatos Dan’s been making for him all evening.</p><p>He lets Phil wait for it. In Dan’s opinion, the best part about a kiss is the build up. It’s the space between them, humming with an electric yearning. It’s the eyes darting to one another’s mouths, and the slow, careful dance around the minefield of wrong moves as they work up to it.</p><p>“Okay,” Dan whispers, knowing his breath will sizzle against Phil’s lips. He feels Phil shiver, and it makes his stomach flip. “Now, open your eyes.”</p><p>Confused, Phil does as told. He seems a little stunned to see Dan up so close.</p><p>“Like this?”</p><p>Dan nods, their noses brushing. “Tell her something.”</p><p>Phil frowns. “Tell her what?”</p><p>“Whatever you want,” Dan near-whispers. For some reason, his eyes sting. He focuses them on Phil’s tongue as it sweeps over his lower lip. “Tell her she’s got pretty eyes, or she’s a hot babe. Whatever you want.”</p><p>“I’m not telling her she’s a hot babe,” Phil says, rolling his eyes. He seems a little pink-cheeked, though. “And I’m certainly not telling you you’re a hot babe.”</p><p>“So tell me something else, then,” Dan says before he can stop himself. “I mean, pretend I’m her. <i>Amanda</i>. And tell me what you want to tell me.”</p><p>“Pretend you’re her?” Phil asks, eyes roving over Dan’s face as though it’s an impossible feat.</p><p>“I know it’s a stretch Phil, but try it.”</p><p>Phil is silent, his lips pressing together as he surveys Dan, still so close that he’s probably all blurry in Phil’s vision anyway. Eventually, Dan kicks him.</p><p>“Come on,” he prompts, heart stuttering already. </p><p>His palms have gone past clammy into damp; he feels a bit dizzy, from the coffees he’s been drinking, and the cigarette he hasn’t had yet. This is something from his wildest, most surreal dreams, something he honestly never thought would happen, and here it is, right in front of him. He blinks, but it doesn’t go away. Phil is still so irresistibly close, the blue around his eyes thinned to a sliver, his heartbeat loud enough to hear. </p><p>“You’re the most beautiful thing…” Phil starts to say, his voice slow and quiet. “I have ever seen.”</p><p>Dan’s breath catches, and he feels his eyes sting again. He nods. “That’ll work.”</p><p>“Now what?” Phil asks.</p><p>“Now kiss me.”</p><p>Phil’s eyes widen, but he leans forwards readily. Dan’s breath hitches again, and he finds himself drawing back a little.</p><p>“Wait,” he says hurriedly. He fixes Phil with a hard stare, trying to appear as unaffected as possible. “If you stick your tongue in my mouth, I will bite it off, do you understand?”</p><p>Phil laughs, looking a little relieved, and nods. Then, the hands on his hips yank him forwards, and Dan is being kissed. Slowly at first, tentative and unsure, but then harder, hungrier, as though some levee inside of Phil has broken. His hands tighten on Dan’s hips, fingers pushing into Dan’s skin, so hard it could bruise.</p><p>Phil’s lips drag Dan’s apart; he flicks his tongue against Dan’s lip ring, then pushes it into Dan’s mouth, breaking the one, singular rule Dan had given him, but he finds he doesn’t even care. He never meant it anyway. He likes tongue. He would give anything not to know the taste of Phil’s, but only because he’ll never know it again. </p><p>He tastes like coffee, and caramel, and the bitter lead of his pencil when he licks the tip. Dan whimpers as these flavours unfurl across his taste buds; he pulls himself closer to Phil by the vice grip he has around his neck.</p><p>They kiss for what feels like hours, but it still isn’t enough. There’s a sudden vibration against his thigh, from what must be the phone in Phil’s pocket. Like a shock of icy water thrown in his face, he remembers the time. He remembers the day, his own name, his tragedy of a life, and more importantly, who Phil is thinking about right now.</p><p>Somehow, along with the surge of disgust for himself that rises like bile in his throat, Dan manages to summon the strength to unwind his arms from Phil’s neck and shove, hard, against his chest. Phil stumbles backwards, shocked, his lips wet and reddened. There’s an indent in their corner from where Dan’s lip ring has pressed into his flesh, and the sight of it is making Dan want to throw up.</p><p>“Fucking hell, Phil,” Dan pants, staring at him. Phil just stares, stunned, breathing heavily. “You don’t need lessons, okay? You’re fine.”</p><p>Dan swallows, hands braced against the table as he tries to gain some control. How did he just let that happen? He is so, so fucked.</p><p>“Sorry,” Phil says at last. “I… I don’t know what- you’re just so, um, pretty, and it was all nice and familiar- I guess I just… I got carried away.”</p><p>“Carried away,” Dan repeats with a humourless laugh, still breathless. “Just a little.”</p><p>Phil ducks his head, his cheeks a little flushed. “Thanks, though. For helping me.”</p><p>Dan shakes his head, barely able to believe his ears. He feels a rush of hot, stinging anger flooding his veins, and he glares at Phil, unable to suppress it.</p><p>“Sure. What else am I here for, anyway?”</p><p>“What?”</p><p>“About the only thing I’m good for, isn’t it?” Dan spits out. He stands from the table on jelly legs, untying his apron and yanking it off. “As the town whore, you might as well use me for practise.”</p><p>“Dan, what- that is not why I-”</p><p>“Save it,” Dan growls, stalking past Phil towards the kitchen.</p><p>He pushes through the door, trying to ignore that his throat feels like he’s swallowed a lump of burning hot coal.\t</p><p>“Dan, I didn’t mean to offend you, I’m sorry!” Phil calls from the café floor. Dan leans his head back against the kitchen door separating them, shutting his eyes. “I don’t know what happened, I just- fuck. Please don’t be annoyed.”</p><p>Dan bites down hard on his lip, hating that he can still taste Phil there, all sickly sweet syrup and a rich, malty aftertaste.</p><p>“Dan?” Phil calls out again. “Please talk to me.”</p><p>There’s a push from the other side of the door, jolting Dan forwards. He moves out of its path, letting Phil swing it open. He stands in the doorway, looking shame-faced.</p><p>“It’s fine,” Dan sighs, running a hand through his hair. “That… happened. Let’s just move the fuck on.”</p><p>Phil nods, still a little dazed. “Okay.”</p><p>Dan nods, brushing past him as he goes to finish closing up the café. Phil just watches him perform the medial little tasks that need doing with a glazed expression, looking like a lost child.<br/>Dan is about a hundred percent sure he missed something on his to-do list by the time he gets his jacket, but he can’t be bothered to check. Louise can yell at him, he doesn’t care.</p><p>“Come on,” Dan says to Phil, his voice gruff still.</p><p>He walks to the door, jingling the keys, and opens it for Phil to step out into the dark street. Dan switches all the lights off without looking back, and follows him outside to lock the doors.</p><p>“It’s raining,” Phil says, as if Dan hadn’t noticed the moisture pelting him from above.</p><p>“You don’t say,” Dan replies, turning the final lock.</p><p>“Can I come over?”</p><p>Dan freezes, trying not to react. He turns to Phil slowly, a frown creasing his brow. “Don’t think that’s a good idea.”</p><p>Phil cocks his head like a spaniel. “Why?”</p><p>Dan purses his lips, looking up at the rainclouds, invisible in the dark. “Several reasons.”</p><p>He doesn’t mention that one of them is that he needs some time to privately flip the memory of Phil kissing him over and over in his mad, analytical brain until it’s wrung dry. He can already tell that that moment in time will forever be etched into his brain, just like his hips will always feel the ghost of Phil’s grip, and his lips… well. No other kiss will ever again mean anything, Dan is sure.</p><p>“It’s Prom tomorrow,” Phil says, his voice small. Dan rolls his eyes, wondering if Phil really thinks he could have forgotten when it’s literally all they’ve talked about for weeks. “You’re still gonna drive us, right?”</p><p>Dan sighs, desperately wishing he had enough spine to refuse right now. “Said I would, didn’t I?”</p><p>He stuffs the keys into his pocket, flicks up the hood of his jacket and starts walking down the street. Phil follows at his side, hands stuffed into the pocket of his hoodie. Silvery puffs of air escape from his mouth as he breathes; suddenly, Dan remembers his vice, digging into his back pocket. The packet’s a little damp, but he pulls a cigarette out with his teeth, uncaring.</p><p>“I just thought maybe you’d have changed your mind.”</p><p>Dan ducks into a doorway, lighting the end of his cigarette. They’re thin and black, these weird cherry flavoured ones, which is undeniably fitting to his aesthetic and mood. “And pass up three bags of Skittles? No way.”</p><p>He inhales, then continues walking, Phil still trudging along at his side. “So, I can come over, then?”</p><p>Dan rolls his eyes. “You’re literally following me home right now. It’s not like I have much of a choice.”</p><p>Phil says nothing, but when Dan sneaks a glance at his expression, misted from the rain, he’s smiling. </p><p>&mdash;</p><p>“Dan?”</p><p>The whisper filters through the filmy layer of Dan’s mind, hauling him out of the dream he was about to slip into.</p><p>“Dan, are you awake?” Phil’s voice sounds strange.</p><p>“Hm,” Dan says, stirring. “I am now.”</p><p>He opens his eyes crossly, irritated at being woken from what was sure to be a lovely, long sleep. The first thing he notices, even in the pitch black, is that Phil is very close to him. They’re sharing Dan’s single bed, so obviously their proximity is a little more than normal, but he’s shifted towards Dan’s side significantly.</p><p>Dan tries to put some distance back between them, but he’s got the wall behind him. He gives up, mind swirling in an attempt to distract himself from the fact that Phil is wearing his old Muse t-shirt and boxers, and is pressed almost against him, in his bed. Only hours ago, they’d been making out on a table in a closed cafe. Dan no longer feels very sleepy. Phil is staring straight at him, across the pillow. He’s chewing his lip, a worried crease between his brows.</p><p>“Wha’s the matter?” Dan asks sleepily. His heart races. “Did you hear Ricky come home?”</p><p>Phil shakes his head, and Dan’s lets out a quiet sigh of relief.</p><p>“I’m sorry about earlier,” Phil says quietly; Dan really wishes he hadn’t said it at all. “The kiss, I mean.”</p><p>Dan shrugs a shoulder. “S’okay.”</p><p>It isn’t, though. It’s far from okay, it’s made everything a hell of a lot worse, but Phil doesn’t know about Dan’s feelings, so it’s not all his fault. Phil’s hand slides onto his hip. It’s warm, and gripping a little too tightly to be normal. Dan stares at him, entirely lost on what’s happening.</p><p>“You smell like cherries again,” Phil tells him, so quiet it’s barely audible. “You taste like cherries, too.” </p><p>Dan has no idea what to say, but it turns out he needn’t bother. Phil shifts closer still, that hand on his hip gripping tighter, and then their lips are pressed together. Phil is purposeful, searching, kissing Dan with the same unexpected intensity that he had back in the café. For a fleeting second, Dan is able to hold onto his resistance. He remains rigid, certain that this is a mistake, that Phil is not in his right mind, and that he should not give in to it. But Phil is stubborn, he is patient, and desperate. The hand on his hip feels like a plea, and Dan could never resist Phil’s begging. So he gives in, falls into the welcome warmth of Phil’s wave of wanting. He kisses Phil like he’s starving, not concerned with breaking away this time because he initiated it, there are no ‘kissing lessons’ to disguise it. This is unprecedented, unprovoked, and entirely Phil’s decision.</p><p>The hand on Dan’s hip slips round to grab at his bum, mostly to pull their bodies closer together. Dan gasps, allowing his limp, exhausted body to mould itself around Phil’s chest and legs. He imagines the clothes gone, the warm, smooth skin of him beneath, and groans. He winds his hands into Phil’s t-shirt, feeling the heady arousal sweep from his lips, down his chest, and between his legs, leaving a flush in its wake. </p><p>Phil’s hand works its way between them, finding the telltale bump of Dan’s erection and pressing against it. Dan gasps, pulling back from the kiss to look into Phil’s eyes. He should say something, make sure Phil is really sure he wants to do this, but the words die with a firm push of Phil’s fingers. He rubs against Dan in soft, gentle movements, still above his boxers. It’s too teasing to be enough, but Dan shuts his eyes anyway, choking back a moan of bliss. </p><p>“Do you want me to stop?” Phil asks, his voice quiet and husky.</p><p>Dan’s eyes fly open, and he shakes his head. Phil doesn’t seem to need any further confirmation. He dips his hand into the waistband of Dan’s boxers, curling his fingers around the length of him. Dan chokes on something – the air, maybe – thrown by the confidence with which Phil moves considering this is, as far as Dan knows, his first time doing anything like this.</p><p>Dan’s never been particularly vocal in bed unless asked, so he just buries his face in Phil’s shoulder, whimpering as Phil’s hand pumps a steady rhythm around him, gradually becoming slicker, messier as the build of his orgasm drags over Dan’s body. Phil’s movements are unpracticed, his hand is at an awkward angle, and he hasn’t even pulled Dan’s boxers down, but somehow it’s beyond incredible.</p><p>Dan comes hard, unable to stop himself crying out as Phil sinks his teeth into the exposed skin of his neck, sucking a mark there. He shudders as the pleasure ebbs away, going limp in Phil’s arms. Phil pulls his hand out from Dan’s boxers, wiping it on the Muse logo. A few seconds of stunned silence pass in the wake of what just occurred, and then Dan moves, jumping to attention like a soldier going about his routine. He pushes his lips back into Phil’s, just as hungry as before, and slides a hand down his torso, from collarbone to groin.</p><p>Phil catches hold of his wrist.</p><p>“Hey, it’s fine,” Phil says hurriedly. Through the Muse t-shirt, Dan can feel his heart pounding.</p><p>He stares at Phil, confused. “Let me… help you out.”</p><p>Phil smiles at him, though it seems a bit strained. “I’m fine, really. Let’s just go to sleep, yeah?”</p><p>Dan scans his face, trying to suss out why on earth somebody would refuse a return offer in this situation, but he comes up short. Hey, maybe Phil is just a little strange. Maybe his first time nerves kicked in a little later than expected.</p><p>“Are you sure?” Dan asks. His tongue flicks out to play with his lip ring, flirtatious. “I don’t mind, you know.”</p><p>Phil’s gaze hones in on the lip ring, and he swallows thickly. “Y-yeah, really. I’m just tired. Sleep.”</p><p>Reluctantly, Dan shuffles down, getting comfy again. It’s difficult, because he’d ideally like a shower right now, preferably one with Phil, but it’s obviously not going to happen, so Dan’s gonna just have to suck it up. But not literally, apparently.</p><p>“Okay,” Dan says after some thought. He shuffles closer to Phil, a warm and hopeful glow pulsating in his gut for the first time in years. “Goodnight.”</p><p>There’s a long time before Phil replies.</p><p>“Night.”</p><p><b>(<a href=\"http://danfanciesphil.tumblr.com/post/178893484577/edgelorddan-x-obliviousbisexualphil-au-chapter\">Chapter Seven!</a>)</b></p>",
        "body_abstract": "\n<p><b>Edgelord!Dan x ObliviousBisexual!Phil AU [CHAPTER SIX]<br></b><b>(based off the 80&prime;s classic Some Kind of Wonderful)</b></p>\n<p><b>Synopsis: </b><i>Dan has one friend, and only because he was forced into it. Phil is loud, excitable, and irritatingly happy all of the time. Phil seems to find Dan&rsquo;s perpetual attitude funny, and despite Dan&rsquo;s best efforts to shun him and everyone else, wants to be around him all the time. That is, until Phil starts talking about Amanda Jones.<br></i><b>Word Count:</b> WIP (Estimated 12-15 chapters) updates every Tuesday<br><b>Rating:</b> Explicit<br><b>Warnings:</b> Smoking, swearing, implied prostitution, broken home, class divide/classism, pining, light homophobia, sex <br><br></p>\n<p><b>[<a href=\"http://danfanciesphil.tumblr.com/post/177738852529/some-kind-of-folliful-new-fic\">Chapter One</a>]<br>[<a href=\"http://danfanciesphil.tumblr.com/post/177982263491/some-kind-of-folliful-new-chapter\">Chapter Two</a>]<br>[<a href=\"http://danfanciesphil.tumblr.com/post/178227297225/some-kind-of-folliful-new-chapter\">Chapter Three</a>]<br>[<a href=\"http://danfanciesphil.tumblr.com/post/178454752236/some-kind-of-folliful-new-chapter\">Chapter Four</a>]<br>[<a href=\"http://danfanciesphil.tumblr.com/post/178671704545/some-kind-of-folliful-new-chapter\">Chapter Five</a>]</b></p>\n<p><b>[<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Farchiveofourown.org%2Fworks%2F15894954%2Fchapters%2F37042212&amp;t=YWVmOTliMzc0MTkyZDFjZTFkMzVmMzM4NmFlOGJjZDJmODI1Njk5YixVNUVvdGxGag%3D%3D&amp;b=t%3AA-PgA5Z7k9tbi8i-ePCy7Q&amp;p=https%3A%2F%2Ffeels-forever.tumblr.com%2Fpost%2F177763348310%2Fsome-kind-of-folliful-new-fic&amp;m=1\">Ao3</a>!]</b></p>\n<p>Dan hates the closing shift.</p>\n<p>Or rather, he hates it <i>usually</i>.</p>\n<p>He hates the hour it takes to shut the caf&eacute; down after the last customer leaves. He hates having to clean the entire coffee machine inside and out. He hates the pressure of counting the money in the till, especially as he sucks at maths.</p>\n<p>He hates having to wipe down every table and surface. He hates having to restock the milk in the fridge and the sugar on the counter. He loathes having to switch off every single light one by one, letting the shadows crawl out of their corners and smother the place. He usually does this final task at the last possible moment, so that he can just walk straight to the door and leave as soon as possible. The caf&eacute;, which is quite a sweet, pretty place with a soft, happy feel in the daytime, becomes something evil in the dark.</p>\n<p>Tonight however, it&rsquo;s not so bad. The late shift is given to Dan at least once a week, because he&rsquo;s worked here a lot longer than most of the other staff, and so can be trusted. He&rsquo;s done it so many times that he could do it blindfolded, he&rsquo;s sure, so Louise allows him to do it on his own.</p>\n<p>Tonight, he&rsquo;s not on his own.</p>\n",
        "reblog": {
            "comment": "<p><b>Edgelord!Dan x ObliviousBisexual!Phil AU [CHAPTER SIX]<br></b><b>(based off the 80′s classic Some Kind of Wonderful)</b></p><p><b>Synopsis: </b><i>Dan has one friend, and only because he was forced into it. Phil is loud, excitable, and irritatingly happy all of the time. Phil seems to find Dan’s perpetual attitude funny, and despite Dan’s best efforts to shun him and everyone else, wants to be around him all the time. That is, until Phil starts talking about Amanda Jones.<br></i><b>Word Count:</b> WIP (Estimated 12-15 chapters) updates every Tuesday<br><b>Rating:</b> Explicit<br><b>Warnings:</b> Smoking, swearing, implied prostitution, broken home, class divide/classism, pining, light homophobia, sex <br><br></p><p><b>[<a href=\"http://danfanciesphil.tumblr.com/post/177738852529/some-kind-of-folliful-new-fic\">Chapter One</a>]<br>[<a href=\"http://danfanciesphil.tumblr.com/post/177982263491/some-kind-of-folliful-new-chapter\">Chapter Two</a>]<br>[<a href=\"http://danfanciesphil.tumblr.com/post/178227297225/some-kind-of-folliful-new-chapter\">Chapter Three</a>]<br>[<a href=\"http://danfanciesphil.tumblr.com/post/178454752236/some-kind-of-folliful-new-chapter\">Chapter Four</a>]<br>[<a href=\"http://danfanciesphil.tumblr.com/post/178671704545/some-kind-of-folliful-new-chapter\">Chapter Five</a>]</b></p><p><b>[<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Farchiveofourown.org%2Fworks%2F15894954%2Fchapters%2F37042212&amp;t=YWVmOTliMzc0MTkyZDFjZTFkMzVmMzM4NmFlOGJjZDJmODI1Njk5YixVNUVvdGxGag%3D%3D&amp;b=t%3AA-PgA5Z7k9tbi8i-ePCy7Q&amp;p=https%3A%2F%2Ffeels-forever.tumblr.com%2Fpost%2F177763348310%2Fsome-kind-of-folliful-new-fic&amp;m=1\">Ao3</a>!]</b></p><p>Dan hates the closing shift.</p><p>Or rather, he hates it <i>usually</i>.</p><p>He hates the hour it takes to shut the café down after the last customer leaves. He hates having to clean the entire coffee machine inside and out. He hates the pressure of counting the money in the till, especially as he sucks at maths.</p><p>He hates having to wipe down every table and surface. He hates having to restock the milk in the fridge and the sugar on the counter. He loathes having to switch off every single light one by one, letting the shadows crawl out of their corners and smother the place. He usually does this final task at the last possible moment, so that he can just walk straight to the door and leave as soon as possible. The café, which is quite a sweet, pretty place with a soft, happy feel in the daytime, becomes something evil in the dark.</p><p>Tonight however, it’s not so bad. The late shift is given to Dan at least once a week, because he’s worked here a lot longer than most of the other staff, and so can be trusted. He’s done it so many times that he could do it blindfolded, he’s sure, so Louise allows him to do it on his own.</p><p>Tonight, he’s not on his own.</p>[[MORE]]<p>Phil walked to work with him today, and has stayed ever since. He has seemed perfectly content all evening, sat at a table for two in the corner by the window, drawing in his sketchpad. He’s ordered at least three coffees, which he’ll probably regret once he gets home and can’t sleep, but Dan isn’t going to lecture him again. The last customer left around twenty minutes ago, and Phil is still there, frowning down at whatever he’s sketching. Dan has just finished counting up, so he walks over to Phil’s table to collect the mug he’s been drinking from.</p><p>“You planning on sleeping here?” He asks, picking up the mug and saucer.</p><p>Phil looks up at him in surprise. “Oh, hey let me take that.”</p><p>Dan snorts at him. “It’s literally my job, Phil.”</p><p>“Yeah, but-”</p><p>“Don’t worry about it.”</p><p>Dan walks away then, shaking his head fondly at Phil’s owlish protestations.</p><p>“Am I slowing you down?” Phil calls as Dan heads into the kitchen. “I can go if you like.”</p><p>“No, it’s fine,” Dan calls back, rinsing the crockery before stacking it into the dishwasher. “Just don’t make a mess.”</p><p>“It’s kind of creepy here after hours,” Phil says as Dan walks back out. “I don’t know how you do it all on your own.”</p><p>“I’m not on my own,” Dan counters.</p><p>There’s a hesitance on Phil’s face when Dan glances at him. “You think I’m nuts, don’t you? For going through with the date.”</p><p>Dan looks away, busying himself with stacking chairs. The scraping of the legs on the tiled floor makes him wince. “It’s certainly brave.”</p><p>Phil snorts. “Brave. Because you think it’s a joke. That she doesn’t actually like me, and that she’s doing it to get back at Hardy.”</p><p>A chair clatters from Dan’s hands, and he curses. Instead of picking it back up, he turns to Phil. “It might have crossed my mind.”</p><p>“I know that’s what everyone thinks,” Phil says, shrugging. “That she’s just using me. I get it. It’s ridiculous to think she’d actually consider me.”</p><p>“It’s got nothing to do with you, Phil,” Dan says quietly. “That’s just how they are in the Elite. They don’t think about the feelings of people like us. The only time they even acknowledge us is if we can benefit their lives in some way. Getting them coffee. Giving them lifts home. Making their boyfriend’s jealous.”</p><p>“It doesn’t matter,” Phil says dismissively, frowning in an uncharacteristic way. “I’m still gonna go through with it.”</p><p>Getting through to Phil is like trying to get through to the floor beneath his feet. </p><p>“Even if you know for sure that she’s stringing you along?” Dan asks, barely disguising his frustration. “Phil, that’s suicidal. If she’s purposefully dangling you in front of Hardy Jenns you’re gonna get your ass kicked.”</p><p>“If that’s her intention going in, that’s her problem. I’m gonna change her mind by the time the date is over,” Phil says confidently. </p><p>“Okay, now I do think you’re nuts,” Dan says.</p><p>He begins stacking the chairs again, loudly and with a recklessness that he wouldn’t normally. He should drop this, change the subject or something. But the irritation is overwhelming. Phil can’t see two feet under his nose. He’s being stubborn, because he feels he has to prove he can go through with this now, even though every star in the sky is screaming at him to turn back. </p><p>“I’ve thought about it a lot, Dan.”</p><p>“Oh, I can see that,” Dan says, rolling his eyes.</p><p>“I have,” Phil insists.  I think I can make her see that it’s better to be in the real world with the rest of us, rather than up in the clouds of the Elite. That she’d be happier without all the drama and the materialism and the seedy guys.”</p><p>Dan snorts. “How’re you gonna show her that, exactly? What’ve you got to offer her apart from a paintbrush and some overpriced jewellery? I mean, have you even properly kissed a girl?”</p><p>He doesn’t mean it to come out so harshly, but he’s angry, and his tongue doesn’t listen to him when he gets into a state. He shuts his eyes, placing the chair in his hands down.</p><p>“Sorry,” he says bitterly, “I didn’t mean-”</p><p>“No, you’re right,” Phil interrupts. He stands slowly from his chair and lifts it onto the table. “I’ve only ever kissed one person. It’s been worrying me a little, actually.”</p><p>Dan stares at him through the legs of several chairs, trying to think of something to say.</p><p>“You think Amanda would notice something like that?” Phil asks, meeting Dan’s eye. His raw, genuine concern is so obvious in his expression that Dan has to tear his gaze away.</p><p>“Maybe.” He can’t stop himself saying it, because it’s the truth. “Amanda Jones isn’t likely to be fooled by an amateur kiss, if you ask me. That babe’s got plenty of battle scars.”</p><p>Phil rolls his eyes at the wording, but catches hold of his lower lip between his teeth, worrying it to and fro. “You think?”</p><p>Dan nods slowly, leaning against an unstacked table for some support. Something about this conversation feels dangerous. Dan can feel his heart racing, his palms growing damp. He swallows thickly, mouth suddenly dry. </p><p>“Well, if you think you can deliver a kiss that kills, you probably can,” Dan says, one shoulder shrugging. “I wouldn’t worry about it.”</p><p>“No,” Phil says hurriedly, taking a step towards him. “I’m no expert.”</p><p>Dan stares at him.</p><p>“Well… it’s all about, like,” Dan flounders, feeling himself grow red. “Confidence.”</p><p>Phil ducks his chin towards his chest, then peers up at Dan, eyes sparkling with mischief. Before Dan can react, Phil’s closing the short distance between them in three long strides, pushing him up against the table behind him. Dan’s lungs seize up, but manages to gather himself enough to prevent himself from squealing at the unexpected attack.</p><p>“Like this?” Phil asks. </p><p>He’s smirking like it’s a stupid joke, but Dan’s breaths are still getting stuck in his throat. Dan rolls his eyes, but there’s no way Phil can’t hear the hammering of his heart. </p><p>“Yeah, just ram her up against the table,” Dan says, ever the sarcastic bitch. “She definitely won’t find that creepy.”</p><p>Phil snickers. “You seem to like it.”</p><p>“Fuck off.”</p><p>Instead of obeying Dan’s command, Phil seizes hold of him by the thighs and lifts him deftly onto the tabletop, slotting himself between Dan’s legs. At this point, Dan is sure he’ll combust, so he focuses all of his attention on the tasks he has left to do before locking up tonight. <i>Mop the floor in the kitchen, put the float into the safe, kick Phil in the balls for being such a fucking tease…</i></p><p>“So, what next?”</p><p>Exasperated, Dan glares at him, struggling to break free of Phil’s hold. “Forget it, I did not sign up to be your snogging tutor.”</p><p>“Dan, I’m literally begging,” Phil says, letting slip a sudden flash of the insecurity lurking beneath his flirtatious demeanour. “I just need to know if I suck. I just need to be <i>passable</i>. You can help me, I know you can.”</p><p>Dan is far, far too soft, he thinks, melting immediately, of course. Any resistance he may once have had was dissolved a few nights ago, in Phil’s bed, when the realisation of his own feelings for the man avalanched down upon him. He’s been trapped underneath the debris of that revelation ever since, struggling to breathe, aching and tortured, awaiting rescue that won’t come.  </p><p>“Ugh, fine,” Dan says, as if it’s some huge inconvenience. </p><p>Phil’s hands release Dan’s thighs, clapping together in glee. “Thank you, Dan. I owe you.”</p><p>“At this point, your debt to me is higher than all of England.”</p><p>“Right, so what do I do now?”</p><p>Dan struggles to focus, but catches sight of Phil’s frantically fidgeting hands. He can start with that, at least. “What are you gonna do with your hands?”</p><p>Phil blinks at him, confused. “Uh, it- it depends-”</p><p>“No,” Dan tells him firmly. “It doesn’t depend. They go on my- on her hips.” He blushes, waiting for this to register, but Phil just stares.  “Do it, you pleb.”</p><p>Phil chuckles nervously, but reaches out to place his hands on Dan’s hips. They’re just resting there, light as anything, but the touch of him, light and warm, still makes Dan want to cry.</p><p>“Okay,” he chokes out. “She’ll um- she’ll probably do this.”</p><p>Dan stretches his own arms out, reaching up until he’s got them locked around Phil’s neck.</p><p>“Is that what you’d do?” Phil asks, his voice sounding strange and thin. “If I were- if it were you being kissed?”</p><p>Dan shrugs, disliking the question. “Prob’ly.”</p><p>Phil nods, drinking down the information like it’s gold. “Okay, what now?”</p><p>“So, close your eyes,” Dan instructs, and Phil does. He’s so passively beautiful. All pale skin and dark lashes. Dan is not in any way ready for what’s about to happen here. How the fuck did he get himself into this situation? “Now, lean in really close to me, but… don’t touch me yet.”</p><p>There’s no denying that at this point, self indulgence has come into play. Dan can’t bring himself to feel too bad about it. He’s never going to get an opportunity like this again, and in all likelihood Phil’s too clueless to cotton on to whether Dan might be a little biased in his instruction. Phil closes some of the distance between them, their lips close now; Dan tightens his lock around Phil’s neck. He smells like the caramel macchiatos Dan’s been making for him all evening.</p><p>He lets Phil wait for it. In Dan’s opinion, the best part about a kiss is the build up. It’s the space between them, humming with an electric yearning. It’s the eyes darting to one another’s mouths, and the slow, careful dance around the minefield of wrong moves as they work up to it.</p><p>“Okay,” Dan whispers, knowing his breath will sizzle against Phil’s lips. He feels Phil shiver, and it makes his stomach flip. “Now, open your eyes.”</p><p>Confused, Phil does as told. He seems a little stunned to see Dan up so close.</p><p>“Like this?”</p><p>Dan nods, their noses brushing. “Tell her something.”</p><p>Phil frowns. “Tell her what?”</p><p>“Whatever you want,” Dan near-whispers. For some reason, his eyes sting. He focuses them on Phil’s tongue as it sweeps over his lower lip. “Tell her she’s got pretty eyes, or she’s a hot babe. Whatever you want.”</p><p>“I’m not telling her she’s a hot babe,” Phil says, rolling his eyes. He seems a little pink-cheeked, though. “And I’m certainly not telling you you’re a hot babe.”</p><p>“So tell me something else, then,” Dan says before he can stop himself. “I mean, pretend I’m her. <i>Amanda</i>. And tell me what you want to tell me.”</p><p>“Pretend you’re her?” Phil asks, eyes roving over Dan’s face as though it’s an impossible feat.</p><p>“I know it’s a stretch Phil, but try it.”</p><p>Phil is silent, his lips pressing together as he surveys Dan, still so close that he’s probably all blurry in Phil’s vision anyway. Eventually, Dan kicks him.</p><p>“Come on,” he prompts, heart stuttering already. </p><p>His palms have gone past clammy into damp; he feels a bit dizzy, from the coffees he’s been drinking, and the cigarette he hasn’t had yet. This is something from his wildest, most surreal dreams, something he honestly never thought would happen, and here it is, right in front of him. He blinks, but it doesn’t go away. Phil is still so irresistibly close, the blue around his eyes thinned to a sliver, his heartbeat loud enough to hear. </p><p>“You’re the most beautiful thing…” Phil starts to say, his voice slow and quiet. “I have ever seen.”</p><p>Dan’s breath catches, and he feels his eyes sting again. He nods. “That’ll work.”</p><p>“Now what?” Phil asks.</p><p>“Now kiss me.”</p><p>Phil’s eyes widen, but he leans forwards readily. Dan’s breath hitches again, and he finds himself drawing back a little.</p><p>“Wait,” he says hurriedly. He fixes Phil with a hard stare, trying to appear as unaffected as possible. “If you stick your tongue in my mouth, I will bite it off, do you understand?”</p><p>Phil laughs, looking a little relieved, and nods. Then, the hands on his hips yank him forwards, and Dan is being kissed. Slowly at first, tentative and unsure, but then harder, hungrier, as though some levee inside of Phil has broken. His hands tighten on Dan’s hips, fingers pushing into Dan’s skin, so hard it could bruise.</p><p>Phil’s lips drag Dan’s apart; he flicks his tongue against Dan’s lip ring, then pushes it into Dan’s mouth, breaking the one, singular rule Dan had given him, but he finds he doesn’t even care. He never meant it anyway. He likes tongue. He would give anything not to know the taste of Phil’s, but only because he’ll never know it again. </p><p>He tastes like coffee, and caramel, and the bitter lead of his pencil when he licks the tip. Dan whimpers as these flavours unfurl across his taste buds; he pulls himself closer to Phil by the vice grip he has around his neck.</p><p>They kiss for what feels like hours, but it still isn’t enough. There’s a sudden vibration against his thigh, from what must be the phone in Phil’s pocket. Like a shock of icy water thrown in his face, he remembers the time. He remembers the day, his own name, his tragedy of a life, and more importantly, who Phil is thinking about right now.</p><p>Somehow, along with the surge of disgust for himself that rises like bile in his throat, Dan manages to summon the strength to unwind his arms from Phil’s neck and shove, hard, against his chest. Phil stumbles backwards, shocked, his lips wet and reddened. There’s an indent in their corner from where Dan’s lip ring has pressed into his flesh, and the sight of it is making Dan want to throw up.</p><p>“Fucking hell, Phil,” Dan pants, staring at him. Phil just stares, stunned, breathing heavily. “You don’t need lessons, okay? You’re fine.”</p><p>Dan swallows, hands braced against the table as he tries to gain some control. How did he just let that happen? He is so, so fucked.</p><p>“Sorry,” Phil says at last. “I… I don’t know what- you’re just so, um, pretty, and it was all nice and familiar- I guess I just… I got carried away.”</p><p>“Carried away,” Dan repeats with a humourless laugh, still breathless. “Just a little.”</p><p>Phil ducks his head, his cheeks a little flushed. “Thanks, though. For helping me.”</p><p>Dan shakes his head, barely able to believe his ears. He feels a rush of hot, stinging anger flooding his veins, and he glares at Phil, unable to suppress it.</p><p>“Sure. What else am I here for, anyway?”</p><p>“What?”</p><p>“About the only thing I’m good for, isn’t it?” Dan spits out. He stands from the table on jelly legs, untying his apron and yanking it off. “As the town whore, you might as well use me for practise.”</p><p>“Dan, what- that is not why I-”</p><p>“Save it,” Dan growls, stalking past Phil towards the kitchen.</p><p>He pushes through the door, trying to ignore that his throat feels like he’s swallowed a lump of burning hot coal.\t</p><p>“Dan, I didn’t mean to offend you, I’m sorry!” Phil calls from the café floor. Dan leans his head back against the kitchen door separating them, shutting his eyes. “I don’t know what happened, I just- fuck. Please don’t be annoyed.”</p><p>Dan bites down hard on his lip, hating that he can still taste Phil there, all sickly sweet syrup and a rich, malty aftertaste.</p><p>“Dan?” Phil calls out again. “Please talk to me.”</p><p>There’s a push from the other side of the door, jolting Dan forwards. He moves out of its path, letting Phil swing it open. He stands in the doorway, looking shame-faced.</p><p>“It’s fine,” Dan sighs, running a hand through his hair. “That… happened. Let’s just move the fuck on.”</p><p>Phil nods, still a little dazed. “Okay.”</p><p>Dan nods, brushing past him as he goes to finish closing up the café. Phil just watches him perform the medial little tasks that need doing with a glazed expression, looking like a lost child.<br>Dan is about a hundred percent sure he missed something on his to-do list by the time he gets his jacket, but he can’t be bothered to check. Louise can yell at him, he doesn’t care.</p><p>“Come on,” Dan says to Phil, his voice gruff still.</p><p>He walks to the door, jingling the keys, and opens it for Phil to step out into the dark street. Dan switches all the lights off without looking back, and follows him outside to lock the doors.</p><p>“It’s raining,” Phil says, as if Dan hadn’t noticed the moisture pelting him from above.</p><p>“You don’t say,” Dan replies, turning the final lock.</p><p>“Can I come over?”</p><p>Dan freezes, trying not to react. He turns to Phil slowly, a frown creasing his brow. “Don’t think that’s a good idea.”</p><p>Phil cocks his head like a spaniel. “Why?”</p><p>Dan purses his lips, looking up at the rainclouds, invisible in the dark. “Several reasons.”</p><p>He doesn’t mention that one of them is that he needs some time to privately flip the memory of Phil kissing him over and over in his mad, analytical brain until it’s wrung dry. He can already tell that that moment in time will forever be etched into his brain, just like his hips will always feel the ghost of Phil’s grip, and his lips… well. No other kiss will ever again mean anything, Dan is sure.</p><p>“It’s Prom tomorrow,” Phil says, his voice small. Dan rolls his eyes, wondering if Phil really thinks he could have forgotten when it’s literally all they’ve talked about for weeks. “You’re still gonna drive us, right?”</p><p>Dan sighs, desperately wishing he had enough spine to refuse right now. “Said I would, didn’t I?”</p><p>He stuffs the keys into his pocket, flicks up the hood of his jacket and starts walking down the street. Phil follows at his side, hands stuffed into the pocket of his hoodie. Silvery puffs of air escape from his mouth as he breathes; suddenly, Dan remembers his vice, digging into his back pocket. The packet’s a little damp, but he pulls a cigarette out with his teeth, uncaring.</p><p>“I just thought maybe you’d have changed your mind.”</p><p>Dan ducks into a doorway, lighting the end of his cigarette. They’re thin and black, these weird cherry flavoured ones, which is undeniably fitting to his aesthetic and mood. “And pass up three bags of Skittles? No way.”</p><p>He inhales, then continues walking, Phil still trudging along at his side. “So, I can come over, then?”</p><p>Dan rolls his eyes. “You’re literally following me home right now. It’s not like I have much of a choice.”</p><p>Phil says nothing, but when Dan sneaks a glance at his expression, misted from the rain, he’s smiling. </p><p>—</p><p>“Dan?”</p><p>The whisper filters through the filmy layer of Dan’s mind, hauling him out of the dream he was about to slip into.</p><p>“Dan, are you awake?” Phil’s voice sounds strange.</p><p>“Hm,” Dan says, stirring. “I am now.”</p><p>He opens his eyes crossly, irritated at being woken from what was sure to be a lovely, long sleep. The first thing he notices, even in the pitch black, is that Phil is very close to him. They’re sharing Dan’s single bed, so obviously their proximity is a little more than normal, but he’s shifted towards Dan’s side significantly.</p><p>Dan tries to put some distance back between them, but he’s got the wall behind him. He gives up, mind swirling in an attempt to distract himself from the fact that Phil is wearing his old Muse t-shirt and boxers, and is pressed almost against him, in his bed. Only hours ago, they’d been making out on a table in a closed cafe. Dan no longer feels very sleepy. Phil is staring straight at him, across the pillow. He’s chewing his lip, a worried crease between his brows.</p><p>“Wha’s the matter?” Dan asks sleepily. His heart races. “Did you hear Ricky come home?”</p><p>Phil shakes his head, and Dan’s lets out a quiet sigh of relief.</p><p>“I’m sorry about earlier,” Phil says quietly; Dan really wishes he hadn’t said it at all. “The kiss, I mean.”</p><p>Dan shrugs a shoulder. “S’okay.”</p><p>It isn’t, though. It’s far from okay, it’s made everything a hell of a lot worse, but Phil doesn’t know about Dan’s feelings, so it’s not all his fault. Phil’s hand slides onto his hip. It’s warm, and gripping a little too tightly to be normal. Dan stares at him, entirely lost on what’s happening.</p><p>“You smell like cherries again,” Phil tells him, so quiet it’s barely audible. “You taste like cherries, too.” </p><p>Dan has no idea what to say, but it turns out he needn’t bother. Phil shifts closer still, that hand on his hip gripping tighter, and then their lips are pressed together. Phil is purposeful, searching, kissing Dan with the same unexpected intensity that he had back in the café. For a fleeting second, Dan is able to hold onto his resistance. He remains rigid, certain that this is a mistake, that Phil is not in his right mind, and that he should not give in to it. But Phil is stubborn, he is patient, and desperate. The hand on his hip feels like a plea, and Dan could never resist Phil’s begging. So he gives in, falls into the welcome warmth of Phil’s wave of wanting. He kisses Phil like he’s starving, not concerned with breaking away this time because he initiated it, there are no ‘kissing lessons’ to disguise it. This is unprecedented, unprovoked, and entirely Phil’s decision.</p><p>The hand on Dan’s hip slips round to grab at his bum, mostly to pull their bodies closer together. Dan gasps, allowing his limp, exhausted body to mould itself around Phil’s chest and legs. He imagines the clothes gone, the warm, smooth skin of him beneath, and groans. He winds his hands into Phil’s t-shirt, feeling the heady arousal sweep from his lips, down his chest, and between his legs, leaving a flush in its wake. </p><p>Phil’s hand works its way between them, finding the telltale bump of Dan’s erection and pressing against it. Dan gasps, pulling back from the kiss to look into Phil’s eyes. He should say something, make sure Phil is really sure he wants to do this, but the words die with a firm push of Phil’s fingers. He rubs against Dan in soft, gentle movements, still above his boxers. It’s too teasing to be enough, but Dan shuts his eyes anyway, choking back a moan of bliss. </p><p>“Do you want me to stop?” Phil asks, his voice quiet and husky.</p><p>Dan’s eyes fly open, and he shakes his head. Phil doesn’t seem to need any further confirmation. He dips his hand into the waistband of Dan’s boxers, curling his fingers around the length of him. Dan chokes on something – the air, maybe – thrown by the confidence with which Phil moves considering this is, as far as Dan knows, his first time doing anything like this.</p><p>Dan’s never been particularly vocal in bed unless asked, so he just buries his face in Phil’s shoulder, whimpering as Phil’s hand pumps a steady rhythm around him, gradually becoming slicker, messier as the build of his orgasm drags over Dan’s body. Phil’s movements are unpracticed, his hand is at an awkward angle, and he hasn’t even pulled Dan’s boxers down, but somehow it’s beyond incredible.</p><p>Dan comes hard, unable to stop himself crying out as Phil sinks his teeth into the exposed skin of his neck, sucking a mark there. He shudders as the pleasure ebbs away, going limp in Phil’s arms. Phil pulls his hand out from Dan’s boxers, wiping it on the Muse logo. A few seconds of stunned silence pass in the wake of what just occurred, and then Dan moves, jumping to attention like a soldier going about his routine. He pushes his lips back into Phil’s, just as hungry as before, and slides a hand down his torso, from collarbone to groin.</p><p>Phil catches hold of his wrist.</p><p>“Hey, it’s fine,” Phil says hurriedly. Through the Muse t-shirt, Dan can feel his heart pounding.</p><p>He stares at Phil, confused. “Let me… help you out.”</p><p>Phil smiles at him, though it seems a bit strained. “I’m fine, really. Let’s just go to sleep, yeah?”</p><p>Dan scans his face, trying to suss out why on earth somebody would refuse a return offer in this situation, but he comes up short. Hey, maybe Phil is just a little strange. Maybe his first time nerves kicked in a little later than expected.</p><p>“Are you sure?” Dan asks. His tongue flicks out to play with his lip ring, flirtatious. “I don’t mind, you know.”</p><p>Phil’s gaze hones in on the lip ring, and he swallows thickly. “Y-yeah, really. I’m just tired. Sleep.”</p><p>Reluctantly, Dan shuffles down, getting comfy again. It’s difficult, because he’d ideally like a shower right now, preferably one with Phil, but it’s obviously not going to happen, so Dan’s gonna just have to suck it up. But not literally, apparently.</p><p>“Okay,” Dan says after some thought. He shuffles closer to Phil, a warm and hopeful glow pulsating in his gut for the first time in years. “Goodnight.”</p><p>There’s a long time before Phil replies.</p><p>“Night.”</p><p><b>(<a href=\"http://danfanciesphil.tumblr.com/post/178893484577/edgelorddan-x-obliviousbisexualphil-au-chapter\">Chapter Seven!</a>)</b></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "danfanciesphil",
                    "active": true,
                    "theme": {
                        "header_full_width": 537,
                        "header_full_height": 300,
                        "header_focus_width": 534,
                        "header_focus_height": 300,
                        "avatar_shape": "square",
                        "background_color": "#F6F6F6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,535,300,1",
                        "header_image": "https://static.tumblr.com/36735ac3f3c8d402ee832c068d44346d/smxjzpm/wKmpnau7r/tumblr_static_9ibdg7h6io84ck0gg4g4swcgw.jpg",
                        "header_image_focused": "https://static.tumblr.com/63113ab564d52bbfffd5d29347aa7643/smxjzpm/CWdps4bhf/tumblr_static_tumblr_static_9ibdg7h6io84ck0gg4g4swcgw_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_04_focused_v3.png?_v=7c4e5e82cf797042596e2e64af1c383f",
                        "header_stretch": true,
                        "link_color": "#CCCCCC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Capita",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178676195090"
                },
                "content_raw": "<p><b>Edgelord!Dan x ObliviousBisexual!Phil AU [CHAPTER SIX]<br></b><b>(based off the 80′s classic Some Kind of Wonderful)</b></p><p><b>Synopsis: </b><i>Dan has one friend, and only because he was forced into it. Phil is loud, excitable, and irritatingly happy all of the time. Phil seems to find Dan’s perpetual attitude funny, and despite Dan’s best efforts to shun him and everyone else, wants to be around him all the time. That is, until Phil starts talking about Amanda Jones.<br></i><b>Word Count:</b> WIP (Estimated 12-15 chapters) updates every Tuesday<br><b>Rating:</b> Explicit<br><b>Warnings:</b> Smoking, swearing, implied prostitution, broken home, class divide/classism, pining, light homophobia, sex <br><br></p><p><b>[<a href=\"http://danfanciesphil.tumblr.com/post/177738852529/some-kind-of-folliful-new-fic\">Chapter One</a>]<br>[<a href=\"http://danfanciesphil.tumblr.com/post/177982263491/some-kind-of-folliful-new-chapter\">Chapter Two</a>]<br>[<a href=\"http://danfanciesphil.tumblr.com/post/178227297225/some-kind-of-folliful-new-chapter\">Chapter Three</a>]<br>[<a href=\"http://danfanciesphil.tumblr.com/post/178454752236/some-kind-of-folliful-new-chapter\">Chapter Four</a>]<br>[<a href=\"http://danfanciesphil.tumblr.com/post/178671704545/some-kind-of-folliful-new-chapter\">Chapter Five</a>]</b></p><p><b>[<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Farchiveofourown.org%2Fworks%2F15894954%2Fchapters%2F37042212&amp;t=YWVmOTliMzc0MTkyZDFjZTFkMzVmMzM4NmFlOGJjZDJmODI1Njk5YixVNUVvdGxGag%3D%3D&amp;b=t%3AA-PgA5Z7k9tbi8i-ePCy7Q&amp;p=https%3A%2F%2Ffeels-forever.tumblr.com%2Fpost%2F177763348310%2Fsome-kind-of-folliful-new-fic&amp;m=1\">Ao3</a>!]</b></p><p>Dan hates the closing shift.</p><p>Or rather, he hates it <i>usually</i>.</p><p>He hates the hour it takes to shut the café down after the last customer leaves. He hates having to clean the entire coffee machine inside and out. He hates the pressure of counting the money in the till, especially as he sucks at maths.</p><p>He hates having to wipe down every table and surface. He hates having to restock the milk in the fridge and the sugar on the counter. He loathes having to switch off every single light one by one, letting the shadows crawl out of their corners and smother the place. He usually does this final task at the last possible moment, so that he can just walk straight to the door and leave as soon as possible. The café, which is quite a sweet, pretty place with a soft, happy feel in the daytime, becomes something evil in the dark.</p><p>Tonight however, it’s not so bad. The late shift is given to Dan at least once a week, because he’s worked here a lot longer than most of the other staff, and so can be trusted. He’s done it so many times that he could do it blindfolded, he’s sure, so Louise allows him to do it on his own.</p><p>Tonight, he’s not on his own.</p>[[MORE]]<p>Phil walked to work with him today, and has stayed ever since. He has seemed perfectly content all evening, sat at a table for two in the corner by the window, drawing in his sketchpad. He’s ordered at least three coffees, which he’ll probably regret once he gets home and can’t sleep, but Dan isn’t going to lecture him again. The last customer left around twenty minutes ago, and Phil is still there, frowning down at whatever he’s sketching. Dan has just finished counting up, so he walks over to Phil’s table to collect the mug he’s been drinking from.</p><p>“You planning on sleeping here?” He asks, picking up the mug and saucer.</p><p>Phil looks up at him in surprise. “Oh, hey let me take that.”</p><p>Dan snorts at him. “It’s literally my job, Phil.”</p><p>“Yeah, but-”</p><p>“Don’t worry about it.”</p><p>Dan walks away then, shaking his head fondly at Phil’s owlish protestations.</p><p>“Am I slowing you down?” Phil calls as Dan heads into the kitchen. “I can go if you like.”</p><p>“No, it’s fine,” Dan calls back, rinsing the crockery before stacking it into the dishwasher. “Just don’t make a mess.”</p><p>“It’s kind of creepy here after hours,” Phil says as Dan walks back out. “I don’t know how you do it all on your own.”</p><p>“I’m not on my own,” Dan counters.</p><p>There’s a hesitance on Phil’s face when Dan glances at him. “You think I’m nuts, don’t you? For going through with the date.”</p><p>Dan looks away, busying himself with stacking chairs. The scraping of the legs on the tiled floor makes him wince. “It’s certainly brave.”</p><p>Phil snorts. “Brave. Because you think it’s a joke. That she doesn’t actually like me, and that she’s doing it to get back at Hardy.”</p><p>A chair clatters from Dan’s hands, and he curses. Instead of picking it back up, he turns to Phil. “It might have crossed my mind.”</p><p>“I know that’s what everyone thinks,” Phil says, shrugging. “That she’s just using me. I get it. It’s ridiculous to think she’d actually consider me.”</p><p>“It’s got nothing to do with you, Phil,” Dan says quietly. “That’s just how they are in the Elite. They don’t think about the feelings of people like us. The only time they even acknowledge us is if we can benefit their lives in some way. Getting them coffee. Giving them lifts home. Making their boyfriend’s jealous.”</p><p>“It doesn’t matter,” Phil says dismissively, frowning in an uncharacteristic way. “I’m still gonna go through with it.”</p><p>Getting through to Phil is like trying to get through to the floor beneath his feet. </p><p>“Even if you know for sure that she’s stringing you along?” Dan asks, barely disguising his frustration. “Phil, that’s suicidal. If she’s purposefully dangling you in front of Hardy Jenns you’re gonna get your ass kicked.”</p><p>“If that’s her intention going in, that’s her problem. I’m gonna change her mind by the time the date is over,” Phil says confidently. </p><p>“Okay, now I do think you’re nuts,” Dan says.</p><p>He begins stacking the chairs again, loudly and with a recklessness that he wouldn’t normally. He should drop this, change the subject or something. But the irritation is overwhelming. Phil can’t see two feet under his nose. He’s being stubborn, because he feels he has to prove he can go through with this now, even though every star in the sky is screaming at him to turn back. </p><p>“I’ve thought about it a lot, Dan.”</p><p>“Oh, I can see that,” Dan says, rolling his eyes.</p><p>“I have,” Phil insists.  I think I can make her see that it’s better to be in the real world with the rest of us, rather than up in the clouds of the Elite. That she’d be happier without all the drama and the materialism and the seedy guys.”</p><p>Dan snorts. “How’re you gonna show her that, exactly? What’ve you got to offer her apart from a paintbrush and some overpriced jewellery? I mean, have you even properly kissed a girl?”</p><p>He doesn’t mean it to come out so harshly, but he’s angry, and his tongue doesn’t listen to him when he gets into a state. He shuts his eyes, placing the chair in his hands down.</p><p>“Sorry,” he says bitterly, “I didn’t mean-”</p><p>“No, you’re right,” Phil interrupts. He stands slowly from his chair and lifts it onto the table. “I’ve only ever kissed one person. It’s been worrying me a little, actually.”</p><p>Dan stares at him through the legs of several chairs, trying to think of something to say.</p><p>“You think Amanda would notice something like that?” Phil asks, meeting Dan’s eye. His raw, genuine concern is so obvious in his expression that Dan has to tear his gaze away.</p><p>“Maybe.” He can’t stop himself saying it, because it’s the truth. “Amanda Jones isn’t likely to be fooled by an amateur kiss, if you ask me. That babe’s got plenty of battle scars.”</p><p>Phil rolls his eyes at the wording, but catches hold of his lower lip between his teeth, worrying it to and fro. “You think?”</p><p>Dan nods slowly, leaning against an unstacked table for some support. Something about this conversation feels dangerous. Dan can feel his heart racing, his palms growing damp. He swallows thickly, mouth suddenly dry. </p><p>“Well, if you think you can deliver a kiss that kills, you probably can,” Dan says, one shoulder shrugging. “I wouldn’t worry about it.”</p><p>“No,” Phil says hurriedly, taking a step towards him. “I’m no expert.”</p><p>Dan stares at him.</p><p>“Well… it’s all about, like,” Dan flounders, feeling himself grow red. “Confidence.”</p><p>Phil ducks his chin towards his chest, then peers up at Dan, eyes sparkling with mischief. Before Dan can react, Phil’s closing the short distance between them in three long strides, pushing him up against the table behind him. Dan’s lungs seize up, but manages to gather himself enough to prevent himself from squealing at the unexpected attack.</p><p>“Like this?” Phil asks. </p><p>He’s smirking like it’s a stupid joke, but Dan’s breaths are still getting stuck in his throat. Dan rolls his eyes, but there’s no way Phil can’t hear the hammering of his heart. </p><p>“Yeah, just ram her up against the table,” Dan says, ever the sarcastic bitch. “She definitely won’t find that creepy.”</p><p>Phil snickers. “You seem to like it.”</p><p>“Fuck off.”</p><p>Instead of obeying Dan’s command, Phil seizes hold of him by the thighs and lifts him deftly onto the tabletop, slotting himself between Dan’s legs. At this point, Dan is sure he’ll combust, so he focuses all of his attention on the tasks he has left to do before locking up tonight. <i>Mop the floor in the kitchen, put the float into the safe, kick Phil in the balls for being such a fucking tease…</i></p><p>“So, what next?”</p><p>Exasperated, Dan glares at him, struggling to break free of Phil’s hold. “Forget it, I did not sign up to be your snogging tutor.”</p><p>“Dan, I’m literally begging,” Phil says, letting slip a sudden flash of the insecurity lurking beneath his flirtatious demeanour. “I just need to know if I suck. I just need to be <i>passable</i>. You can help me, I know you can.”</p><p>Dan is far, far too soft, he thinks, melting immediately, of course. Any resistance he may once have had was dissolved a few nights ago, in Phil’s bed, when the realisation of his own feelings for the man avalanched down upon him. He’s been trapped underneath the debris of that revelation ever since, struggling to breathe, aching and tortured, awaiting rescue that won’t come.  </p><p>“Ugh, fine,” Dan says, as if it’s some huge inconvenience. </p><p>Phil’s hands release Dan’s thighs, clapping together in glee. “Thank you, Dan. I owe you.”</p><p>“At this point, your debt to me is higher than all of England.”</p><p>“Right, so what do I do now?”</p><p>Dan struggles to focus, but catches sight of Phil’s frantically fidgeting hands. He can start with that, at least. “What are you gonna do with your hands?”</p><p>Phil blinks at him, confused. “Uh, it- it depends-”</p><p>“No,” Dan tells him firmly. “It doesn’t depend. They go on my- on her hips.” He blushes, waiting for this to register, but Phil just stares.  “Do it, you pleb.”</p><p>Phil chuckles nervously, but reaches out to place his hands on Dan’s hips. They’re just resting there, light as anything, but the touch of him, light and warm, still makes Dan want to cry.</p><p>“Okay,” he chokes out. “She’ll um- she’ll probably do this.”</p><p>Dan stretches his own arms out, reaching up until he’s got them locked around Phil’s neck.</p><p>“Is that what you’d do?” Phil asks, his voice sounding strange and thin. “If I were- if it were you being kissed?”</p><p>Dan shrugs, disliking the question. “Prob’ly.”</p><p>Phil nods, drinking down the information like it’s gold. “Okay, what now?”</p><p>“So, close your eyes,” Dan instructs, and Phil does. He’s so passively beautiful. All pale skin and dark lashes. Dan is not in any way ready for what’s about to happen here. How the fuck did he get himself into this situation? “Now, lean in really close to me, but… don’t touch me yet.”</p><p>There’s no denying that at this point, self indulgence has come into play. Dan can’t bring himself to feel too bad about it. He’s never going to get an opportunity like this again, and in all likelihood Phil’s too clueless to cotton on to whether Dan might be a little biased in his instruction. Phil closes some of the distance between them, their lips close now; Dan tightens his lock around Phil’s neck. He smells like the caramel macchiatos Dan’s been making for him all evening.</p><p>He lets Phil wait for it. In Dan’s opinion, the best part about a kiss is the build up. It’s the space between them, humming with an electric yearning. It’s the eyes darting to one another’s mouths, and the slow, careful dance around the minefield of wrong moves as they work up to it.</p><p>“Okay,” Dan whispers, knowing his breath will sizzle against Phil’s lips. He feels Phil shiver, and it makes his stomach flip. “Now, open your eyes.”</p><p>Confused, Phil does as told. He seems a little stunned to see Dan up so close.</p><p>“Like this?”</p><p>Dan nods, their noses brushing. “Tell her something.”</p><p>Phil frowns. “Tell her what?”</p><p>“Whatever you want,” Dan near-whispers. For some reason, his eyes sting. He focuses them on Phil’s tongue as it sweeps over his lower lip. “Tell her she’s got pretty eyes, or she’s a hot babe. Whatever you want.”</p><p>“I’m not telling her she’s a hot babe,” Phil says, rolling his eyes. He seems a little pink-cheeked, though. “And I’m certainly not telling you you’re a hot babe.”</p><p>“So tell me something else, then,” Dan says before he can stop himself. “I mean, pretend I’m her. <i>Amanda</i>. And tell me what you want to tell me.”</p><p>“Pretend you’re her?” Phil asks, eyes roving over Dan’s face as though it’s an impossible feat.</p><p>“I know it’s a stretch Phil, but try it.”</p><p>Phil is silent, his lips pressing together as he surveys Dan, still so close that he’s probably all blurry in Phil’s vision anyway. Eventually, Dan kicks him.</p><p>“Come on,” he prompts, heart stuttering already. </p><p>His palms have gone past clammy into damp; he feels a bit dizzy, from the coffees he’s been drinking, and the cigarette he hasn’t had yet. This is something from his wildest, most surreal dreams, something he honestly never thought would happen, and here it is, right in front of him. He blinks, but it doesn’t go away. Phil is still so irresistibly close, the blue around his eyes thinned to a sliver, his heartbeat loud enough to hear. </p><p>“You’re the most beautiful thing…” Phil starts to say, his voice slow and quiet. “I have ever seen.”</p><p>Dan’s breath catches, and he feels his eyes sting again. He nods. “That’ll work.”</p><p>“Now what?” Phil asks.</p><p>“Now kiss me.”</p><p>Phil’s eyes widen, but he leans forwards readily. Dan’s breath hitches again, and he finds himself drawing back a little.</p><p>“Wait,” he says hurriedly. He fixes Phil with a hard stare, trying to appear as unaffected as possible. “If you stick your tongue in my mouth, I will bite it off, do you understand?”</p><p>Phil laughs, looking a little relieved, and nods. Then, the hands on his hips yank him forwards, and Dan is being kissed. Slowly at first, tentative and unsure, but then harder, hungrier, as though some levee inside of Phil has broken. His hands tighten on Dan’s hips, fingers pushing into Dan’s skin, so hard it could bruise.</p><p>Phil’s lips drag Dan’s apart; he flicks his tongue against Dan’s lip ring, then pushes it into Dan’s mouth, breaking the one, singular rule Dan had given him, but he finds he doesn’t even care. He never meant it anyway. He likes tongue. He would give anything not to know the taste of Phil’s, but only because he’ll never know it again. </p><p>He tastes like coffee, and caramel, and the bitter lead of his pencil when he licks the tip. Dan whimpers as these flavours unfurl across his taste buds; he pulls himself closer to Phil by the vice grip he has around his neck.</p><p>They kiss for what feels like hours, but it still isn’t enough. There’s a sudden vibration against his thigh, from what must be the phone in Phil’s pocket. Like a shock of icy water thrown in his face, he remembers the time. He remembers the day, his own name, his tragedy of a life, and more importantly, who Phil is thinking about right now.</p><p>Somehow, along with the surge of disgust for himself that rises like bile in his throat, Dan manages to summon the strength to unwind his arms from Phil’s neck and shove, hard, against his chest. Phil stumbles backwards, shocked, his lips wet and reddened. There’s an indent in their corner from where Dan’s lip ring has pressed into his flesh, and the sight of it is making Dan want to throw up.</p><p>“Fucking hell, Phil,” Dan pants, staring at him. Phil just stares, stunned, breathing heavily. “You don’t need lessons, okay? You’re fine.”</p><p>Dan swallows, hands braced against the table as he tries to gain some control. How did he just let that happen? He is so, so fucked.</p><p>“Sorry,” Phil says at last. “I… I don’t know what- you’re just so, um, pretty, and it was all nice and familiar- I guess I just… I got carried away.”</p><p>“Carried away,” Dan repeats with a humourless laugh, still breathless. “Just a little.”</p><p>Phil ducks his head, his cheeks a little flushed. “Thanks, though. For helping me.”</p><p>Dan shakes his head, barely able to believe his ears. He feels a rush of hot, stinging anger flooding his veins, and he glares at Phil, unable to suppress it.</p><p>“Sure. What else am I here for, anyway?”</p><p>“What?”</p><p>“About the only thing I’m good for, isn’t it?” Dan spits out. He stands from the table on jelly legs, untying his apron and yanking it off. “As the town whore, you might as well use me for practise.”</p><p>“Dan, what- that is not why I-”</p><p>“Save it,” Dan growls, stalking past Phil towards the kitchen.</p><p>He pushes through the door, trying to ignore that his throat feels like he’s swallowed a lump of burning hot coal.\t</p><p>“Dan, I didn’t mean to offend you, I’m sorry!” Phil calls from the café floor. Dan leans his head back against the kitchen door separating them, shutting his eyes. “I don’t know what happened, I just- fuck. Please don’t be annoyed.”</p><p>Dan bites down hard on his lip, hating that he can still taste Phil there, all sickly sweet syrup and a rich, malty aftertaste.</p><p>“Dan?” Phil calls out again. “Please talk to me.”</p><p>There’s a push from the other side of the door, jolting Dan forwards. He moves out of its path, letting Phil swing it open. He stands in the doorway, looking shame-faced.</p><p>“It’s fine,” Dan sighs, running a hand through his hair. “That… happened. Let’s just move the fuck on.”</p><p>Phil nods, still a little dazed. “Okay.”</p><p>Dan nods, brushing past him as he goes to finish closing up the café. Phil just watches him perform the medial little tasks that need doing with a glazed expression, looking like a lost child.<br>Dan is about a hundred percent sure he missed something on his to-do list by the time he gets his jacket, but he can’t be bothered to check. Louise can yell at him, he doesn’t care.</p><p>“Come on,” Dan says to Phil, his voice gruff still.</p><p>He walks to the door, jingling the keys, and opens it for Phil to step out into the dark street. Dan switches all the lights off without looking back, and follows him outside to lock the doors.</p><p>“It’s raining,” Phil says, as if Dan hadn’t noticed the moisture pelting him from above.</p><p>“You don’t say,” Dan replies, turning the final lock.</p><p>“Can I come over?”</p><p>Dan freezes, trying not to react. He turns to Phil slowly, a frown creasing his brow. “Don’t think that’s a good idea.”</p><p>Phil cocks his head like a spaniel. “Why?”</p><p>Dan purses his lips, looking up at the rainclouds, invisible in the dark. “Several reasons.”</p><p>He doesn’t mention that one of them is that he needs some time to privately flip the memory of Phil kissing him over and over in his mad, analytical brain until it’s wrung dry. He can already tell that that moment in time will forever be etched into his brain, just like his hips will always feel the ghost of Phil’s grip, and his lips… well. No other kiss will ever again mean anything, Dan is sure.</p><p>“It’s Prom tomorrow,” Phil says, his voice small. Dan rolls his eyes, wondering if Phil really thinks he could have forgotten when it’s literally all they’ve talked about for weeks. “You’re still gonna drive us, right?”</p><p>Dan sighs, desperately wishing he had enough spine to refuse right now. “Said I would, didn’t I?”</p><p>He stuffs the keys into his pocket, flicks up the hood of his jacket and starts walking down the street. Phil follows at his side, hands stuffed into the pocket of his hoodie. Silvery puffs of air escape from his mouth as he breathes; suddenly, Dan remembers his vice, digging into his back pocket. The packet’s a little damp, but he pulls a cigarette out with his teeth, uncaring.</p><p>“I just thought maybe you’d have changed your mind.”</p><p>Dan ducks into a doorway, lighting the end of his cigarette. They’re thin and black, these weird cherry flavoured ones, which is undeniably fitting to his aesthetic and mood. “And pass up three bags of Skittles? No way.”</p><p>He inhales, then continues walking, Phil still trudging along at his side. “So, I can come over, then?”</p><p>Dan rolls his eyes. “You’re literally following me home right now. It’s not like I have much of a choice.”</p><p>Phil says nothing, but when Dan sneaks a glance at his expression, misted from the rain, he’s smiling. </p><p>—</p><p>“Dan?”</p><p>The whisper filters through the filmy layer of Dan’s mind, hauling him out of the dream he was about to slip into.</p><p>“Dan, are you awake?” Phil’s voice sounds strange.</p><p>“Hm,” Dan says, stirring. “I am now.”</p><p>He opens his eyes crossly, irritated at being woken from what was sure to be a lovely, long sleep. The first thing he notices, even in the pitch black, is that Phil is very close to him. They’re sharing Dan’s single bed, so obviously their proximity is a little more than normal, but he’s shifted towards Dan’s side significantly.</p><p>Dan tries to put some distance back between them, but he’s got the wall behind him. He gives up, mind swirling in an attempt to distract himself from the fact that Phil is wearing his old Muse t-shirt and boxers, and is pressed almost against him, in his bed. Only hours ago, they’d been making out on a table in a closed cafe. Dan no longer feels very sleepy. Phil is staring straight at him, across the pillow. He’s chewing his lip, a worried crease between his brows.</p><p>“Wha’s the matter?” Dan asks sleepily. His heart races. “Did you hear Ricky come home?”</p><p>Phil shakes his head, and Dan’s lets out a quiet sigh of relief.</p><p>“I’m sorry about earlier,” Phil says quietly; Dan really wishes he hadn’t said it at all. “The kiss, I mean.”</p><p>Dan shrugs a shoulder. “S’okay.”</p><p>It isn’t, though. It’s far from okay, it’s made everything a hell of a lot worse, but Phil doesn’t know about Dan’s feelings, so it’s not all his fault. Phil’s hand slides onto his hip. It’s warm, and gripping a little too tightly to be normal. Dan stares at him, entirely lost on what’s happening.</p><p>“You smell like cherries again,” Phil tells him, so quiet it’s barely audible. “You taste like cherries, too.” </p><p>Dan has no idea what to say, but it turns out he needn’t bother. Phil shifts closer still, that hand on his hip gripping tighter, and then their lips are pressed together. Phil is purposeful, searching, kissing Dan with the same unexpected intensity that he had back in the café. For a fleeting second, Dan is able to hold onto his resistance. He remains rigid, certain that this is a mistake, that Phil is not in his right mind, and that he should not give in to it. But Phil is stubborn, he is patient, and desperate. The hand on his hip feels like a plea, and Dan could never resist Phil’s begging. So he gives in, falls into the welcome warmth of Phil’s wave of wanting. He kisses Phil like he’s starving, not concerned with breaking away this time because he initiated it, there are no ‘kissing lessons’ to disguise it. This is unprecedented, unprovoked, and entirely Phil’s decision.</p><p>The hand on Dan’s hip slips round to grab at his bum, mostly to pull their bodies closer together. Dan gasps, allowing his limp, exhausted body to mould itself around Phil’s chest and legs. He imagines the clothes gone, the warm, smooth skin of him beneath, and groans. He winds his hands into Phil’s t-shirt, feeling the heady arousal sweep from his lips, down his chest, and between his legs, leaving a flush in its wake. </p><p>Phil’s hand works its way between them, finding the telltale bump of Dan’s erection and pressing against it. Dan gasps, pulling back from the kiss to look into Phil’s eyes. He should say something, make sure Phil is really sure he wants to do this, but the words die with a firm push of Phil’s fingers. He rubs against Dan in soft, gentle movements, still above his boxers. It’s too teasing to be enough, but Dan shuts his eyes anyway, choking back a moan of bliss. </p><p>“Do you want me to stop?” Phil asks, his voice quiet and husky.</p><p>Dan’s eyes fly open, and he shakes his head. Phil doesn’t seem to need any further confirmation. He dips his hand into the waistband of Dan’s boxers, curling his fingers around the length of him. Dan chokes on something – the air, maybe – thrown by the confidence with which Phil moves considering this is, as far as Dan knows, his first time doing anything like this.</p><p>Dan’s never been particularly vocal in bed unless asked, so he just buries his face in Phil’s shoulder, whimpering as Phil’s hand pumps a steady rhythm around him, gradually becoming slicker, messier as the build of his orgasm drags over Dan’s body. Phil’s movements are unpracticed, his hand is at an awkward angle, and he hasn’t even pulled Dan’s boxers down, but somehow it’s beyond incredible.</p><p>Dan comes hard, unable to stop himself crying out as Phil sinks his teeth into the exposed skin of his neck, sucking a mark there. He shudders as the pleasure ebbs away, going limp in Phil’s arms. Phil pulls his hand out from Dan’s boxers, wiping it on the Muse logo. A few seconds of stunned silence pass in the wake of what just occurred, and then Dan moves, jumping to attention like a soldier going about his routine. He pushes his lips back into Phil’s, just as hungry as before, and slides a hand down his torso, from collarbone to groin.</p><p>Phil catches hold of his wrist.</p><p>“Hey, it’s fine,” Phil says hurriedly. Through the Muse t-shirt, Dan can feel his heart pounding.</p><p>He stares at Phil, confused. “Let me… help you out.”</p><p>Phil smiles at him, though it seems a bit strained. “I’m fine, really. Let’s just go to sleep, yeah?”</p><p>Dan scans his face, trying to suss out why on earth somebody would refuse a return offer in this situation, but he comes up short. Hey, maybe Phil is just a little strange. Maybe his first time nerves kicked in a little later than expected.</p><p>“Are you sure?” Dan asks. His tongue flicks out to play with his lip ring, flirtatious. “I don’t mind, you know.”</p><p>Phil’s gaze hones in on the lip ring, and he swallows thickly. “Y-yeah, really. I’m just tired. Sleep.”</p><p>Reluctantly, Dan shuffles down, getting comfy again. It’s difficult, because he’d ideally like a shower right now, preferably one with Phil, but it’s obviously not going to happen, so Dan’s gonna just have to suck it up. But not literally, apparently.</p><p>“Okay,” Dan says after some thought. He shuffles closer to Phil, a warm and hopeful glow pulsating in his gut for the first time in years. “Goodnight.”</p><p>There’s a long time before Phil replies.</p><p>“Night.”</p><p><b>(<a href=\"http://danfanciesphil.tumblr.com/post/178893484577/edgelorddan-x-obliviousbisexualphil-au-chapter\">Chapter Seven!</a>)</b></p>",
                "content": "<p><b>Edgelord!Dan x ObliviousBisexual!Phil AU [CHAPTER SIX]<br /></b><b>(based off the 80&prime;s classic Some Kind of Wonderful)</b></p><p><b>Synopsis: </b><i>Dan has one friend, and only because he was forced into it. Phil is loud, excitable, and irritatingly happy all of the time. Phil seems to find Dan&rsquo;s perpetual attitude funny, and despite Dan&rsquo;s best efforts to shun him and everyone else, wants to be around him all the time. That is, until Phil starts talking about Amanda Jones.<br /></i><b>Word Count:</b> WIP (Estimated 12-15 chapters) updates every Tuesday<br /><b>Rating:</b> Explicit<br /><b>Warnings:</b> Smoking, swearing, implied prostitution, broken home, class divide/classism, pining, light homophobia, sex <br /><br /></p><p><b>[<a href=\"http://danfanciesphil.tumblr.com/post/177738852529/some-kind-of-folliful-new-fic\">Chapter One</a>]<br />[<a href=\"http://danfanciesphil.tumblr.com/post/177982263491/some-kind-of-folliful-new-chapter\">Chapter Two</a>]<br />[<a href=\"http://danfanciesphil.tumblr.com/post/178227297225/some-kind-of-folliful-new-chapter\">Chapter Three</a>]<br />[<a href=\"http://danfanciesphil.tumblr.com/post/178454752236/some-kind-of-folliful-new-chapter\">Chapter Four</a>]<br />[<a href=\"http://danfanciesphil.tumblr.com/post/178671704545/some-kind-of-folliful-new-chapter\">Chapter Five</a>]</b></p><p><b>[<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Farchiveofourown.org%2Fworks%2F15894954%2Fchapters%2F37042212&amp;t=YWVmOTliMzc0MTkyZDFjZTFkMzVmMzM4NmFlOGJjZDJmODI1Njk5YixVNUVvdGxGag%3D%3D&amp;b=t%3AA-PgA5Z7k9tbi8i-ePCy7Q&amp;p=https%3A%2F%2Ffeels-forever.tumblr.com%2Fpost%2F177763348310%2Fsome-kind-of-folliful-new-fic&amp;m=1\">Ao3</a>!]</b></p><p>Dan hates the closing shift.</p><p>Or rather, he hates it <i>usually</i>.</p><p>He hates the hour it takes to shut the caf&eacute; down after the last customer leaves. He hates having to clean the entire coffee machine inside and out. He hates the pressure of counting the money in the till, especially as he sucks at maths.</p><p>He hates having to wipe down every table and surface. He hates having to restock the milk in the fridge and the sugar on the counter. He loathes having to switch off every single light one by one, letting the shadows crawl out of their corners and smother the place. He usually does this final task at the last possible moment, so that he can just walk straight to the door and leave as soon as possible. The caf&eacute;, which is quite a sweet, pretty place with a soft, happy feel in the daytime, becomes something evil in the dark.</p><p>Tonight however, it&rsquo;s not so bad. The late shift is given to Dan at least once a week, because he&rsquo;s worked here a lot longer than most of the other staff, and so can be trusted. He&rsquo;s done it so many times that he could do it blindfolded, he&rsquo;s sure, so Louise allows him to do it on his own.</p><p>Tonight, he&rsquo;s not on his own.</p><p>Phil walked to work with him today, and has stayed ever since. He has seemed perfectly content all evening, sat at a table for two in the corner by the window, drawing in his sketchpad. He&rsquo;s ordered at least three coffees, which he&rsquo;ll probably regret once he gets home and can&rsquo;t sleep, but Dan isn&rsquo;t going to lecture him again. The last customer left around twenty minutes ago, and Phil is still there, frowning down at whatever he&rsquo;s sketching. Dan has just finished counting up, so he walks over to Phil&rsquo;s table to collect the mug he&rsquo;s been drinking from.</p><p>&ldquo;You planning on sleeping here?&rdquo; He asks, picking up the mug and saucer.</p><p>Phil looks up at him in surprise. &ldquo;Oh, hey let me take that.&rdquo;</p><p>Dan snorts at him. &ldquo;It&rsquo;s literally my job, Phil.&rdquo;</p><p>&ldquo;Yeah, but-&rdquo;</p><p>&ldquo;Don&rsquo;t worry about it.&rdquo;</p><p>Dan walks away then, shaking his head fondly at Phil&rsquo;s owlish protestations.</p><p>&ldquo;Am I slowing you down?&rdquo; Phil calls as Dan heads into the kitchen. &ldquo;I can go if you like.&rdquo;</p><p>&ldquo;No, it&rsquo;s fine,&rdquo; Dan calls back, rinsing the crockery before stacking it into the dishwasher. &ldquo;Just don&rsquo;t make a mess.&rdquo;</p><p>&ldquo;It&rsquo;s kind of creepy here after hours,&rdquo; Phil says as Dan walks back out. &ldquo;I don&rsquo;t know how you do it all on your own.&rdquo;</p><p>&ldquo;I&rsquo;m not on my own,&rdquo; Dan counters.</p><p>There&rsquo;s a hesitance on Phil&rsquo;s face when Dan glances at him. &ldquo;You think I&rsquo;m nuts, don&rsquo;t you? For going through with the date.&rdquo;</p><p>Dan looks away, busying himself with stacking chairs. The scraping of the legs on the tiled floor makes him wince. &ldquo;It&rsquo;s certainly brave.&rdquo;</p><p>Phil snorts. &ldquo;Brave. Because you think it&rsquo;s a joke. That she doesn&rsquo;t actually like me, and that she&rsquo;s doing it to get back at Hardy.&rdquo;</p><p>A chair clatters from Dan&rsquo;s hands, and he curses. Instead of picking it back up, he turns to Phil. &ldquo;It might have crossed my mind.&rdquo;</p><p>&ldquo;I know that&rsquo;s what everyone thinks,&rdquo; Phil says, shrugging. &ldquo;That she&rsquo;s just using me. I get it. It&rsquo;s ridiculous to think she&rsquo;d actually consider me.&rdquo;</p><p>&ldquo;It&rsquo;s got nothing to do with you, Phil,&rdquo; Dan says quietly. &ldquo;That&rsquo;s just how they are in the Elite. They don&rsquo;t think about the feelings of people like us. The only time they even acknowledge us is if we can benefit their lives in some way. Getting them coffee. Giving them lifts home. Making their boyfriend&rsquo;s jealous.&rdquo;</p><p>&ldquo;It doesn&rsquo;t matter,&rdquo; Phil says dismissively, frowning in an uncharacteristic way. &ldquo;I&rsquo;m still gonna go through with it.&rdquo;</p><p>Getting through to Phil is like trying to get through to the floor beneath his feet. </p><p>&ldquo;Even if you know for sure that she&rsquo;s stringing you along?&rdquo; Dan asks, barely disguising his frustration. &ldquo;Phil, that&rsquo;s suicidal. If she&rsquo;s purposefully dangling you in front of Hardy Jenns you&rsquo;re gonna get your ass kicked.&rdquo;</p><p>&ldquo;If that&rsquo;s her intention going in, that&rsquo;s her problem. I&rsquo;m gonna change her mind by the time the date is over,&rdquo; Phil says confidently. </p><p>&ldquo;Okay, now I do think you&rsquo;re nuts,&rdquo; Dan says.</p><p>He begins stacking the chairs again, loudly and with a recklessness that he wouldn&rsquo;t normally. He should drop this, change the subject or something. But the irritation is overwhelming. Phil can&rsquo;t see two feet under his nose. He&rsquo;s being stubborn, because he feels he has to prove he can go through with this now, even though every star in the sky is screaming at him to turn back. </p><p>&ldquo;I&rsquo;ve thought about it a lot, Dan.&rdquo;</p><p>&ldquo;Oh, I can see that,&rdquo; Dan says, rolling his eyes.</p><p>&ldquo;I have,&rdquo; Phil insists. &nbsp;I think I can make her see that it&rsquo;s better to be in the real world with the rest of us, rather than up in the clouds of the Elite. That she&rsquo;d be happier without all the drama and the materialism and the seedy guys.&rdquo;</p><p>Dan snorts. &ldquo;How&rsquo;re you gonna show her that, exactly? What&rsquo;ve you got to offer her apart from a paintbrush and some overpriced jewellery? I mean, have you even properly kissed a girl?&rdquo;</p><p>He doesn&rsquo;t mean it to come out so harshly, but he&rsquo;s angry, and his tongue doesn&rsquo;t listen to him when he gets into a state. He shuts his eyes, placing the chair in his hands down.</p><p>&ldquo;Sorry,&rdquo; he says bitterly, &ldquo;I didn&rsquo;t mean-&rdquo;</p><p>&ldquo;No, you&rsquo;re right,&rdquo; Phil interrupts. He stands slowly from his chair and lifts it onto the table. &ldquo;I&rsquo;ve only ever kissed one person. It&rsquo;s been worrying me a little, actually.&rdquo;</p><p>Dan stares at him through the legs of several chairs, trying to think of something to say.</p><p>&ldquo;You think Amanda would notice something like that?&rdquo; Phil asks, meeting Dan&rsquo;s eye. His raw, genuine concern is so obvious in his expression that Dan has to tear his gaze away.</p><p>&ldquo;Maybe.&rdquo; He can&rsquo;t stop himself saying it, because it&rsquo;s the truth. &ldquo;Amanda Jones isn&rsquo;t likely to be fooled by an amateur kiss, if you ask me. That babe&rsquo;s got plenty of battle scars.&rdquo;</p><p>Phil rolls his eyes at the wording, but catches hold of his lower lip between his teeth, worrying it to and fro. &ldquo;You think?&rdquo;</p><p>Dan nods slowly, leaning against an unstacked table for some support. Something about this conversation feels dangerous. Dan can feel his heart racing, his palms growing damp. He swallows thickly, mouth suddenly dry. </p><p>&ldquo;Well, if you think you can deliver a kiss that kills, you probably can,&rdquo; Dan says, one shoulder shrugging. &ldquo;I wouldn&rsquo;t worry about it.&rdquo;</p><p>&ldquo;No,&rdquo; Phil says hurriedly, taking a step towards him. &ldquo;I&rsquo;m no expert.&rdquo;</p><p>Dan stares at him.</p><p>&ldquo;Well&hellip; it&rsquo;s all about, like,&rdquo; Dan flounders, feeling himself grow red. &ldquo;Confidence.&rdquo;</p><p>Phil ducks his chin towards his chest, then peers up at Dan, eyes sparkling with mischief. Before Dan can react, Phil&rsquo;s closing the short distance between them in three long strides, pushing him up against the table behind him. Dan&rsquo;s lungs seize up, but manages to gather himself enough to prevent himself from squealing at the unexpected attack.</p><p>&ldquo;Like this?&rdquo; Phil asks. </p><p>He&rsquo;s smirking like it&rsquo;s a stupid joke, but Dan&rsquo;s breaths are still getting stuck in his throat. Dan rolls his eyes, but there&rsquo;s no way Phil can&rsquo;t hear the hammering of his heart. </p><p>&ldquo;Yeah, just ram her up against the table,&rdquo; Dan says, ever the sarcastic bitch. &ldquo;She definitely won&rsquo;t find that creepy.&rdquo;</p><p>Phil snickers. &ldquo;You seem to like it.&rdquo;</p><p>&ldquo;Fuck off.&rdquo;</p><p>Instead of obeying Dan&rsquo;s command, Phil seizes hold of him by the thighs and lifts him deftly onto the tabletop, slotting himself between Dan&rsquo;s legs. At this point, Dan is sure he&rsquo;ll combust, so he focuses all of his attention on the tasks he has left to do before locking up tonight. <i>Mop the floor in the kitchen, put the float into the safe, kick Phil in the balls for being such a fucking tease&hellip;</i></p><p>&ldquo;So, what next?&rdquo;</p><p>Exasperated, Dan glares at him, struggling to break free of Phil&rsquo;s hold. &ldquo;Forget it, I did not sign up to be your snogging tutor.&rdquo;</p><p>&ldquo;Dan, I&rsquo;m literally begging,&rdquo; Phil says, letting slip a sudden flash of the insecurity lurking beneath his flirtatious demeanour. &ldquo;I just need to know if I suck. I just need to be <i>passable</i>. You can help me, I know you can.&rdquo;</p><p>Dan is far, far too soft, he thinks, melting immediately, of course. Any resistance he may once have had was dissolved a few nights ago, in Phil&rsquo;s bed, when the realisation of his own feelings for the man avalanched down upon him. He&rsquo;s been trapped underneath the debris of that revelation ever since, struggling to breathe, aching and tortured, awaiting rescue that won&rsquo;t come. &nbsp;</p><p>&ldquo;Ugh, fine,&rdquo; Dan says, as if it&rsquo;s some huge inconvenience. </p><p>Phil&rsquo;s hands release Dan&rsquo;s thighs, clapping together in glee. &ldquo;Thank you, Dan. I owe you.&rdquo;</p><p>&ldquo;At this point, your debt to me is higher than all of England.&rdquo;</p><p>&ldquo;Right, so what do I do now?&rdquo;</p><p>Dan struggles to focus, but catches sight of Phil&rsquo;s frantically fidgeting hands. He can start with that, at least. &ldquo;What are you gonna do with your hands?&rdquo;</p><p>Phil blinks at him, confused. &ldquo;Uh, it- it depends-&rdquo;</p><p>&ldquo;No,&rdquo; Dan tells him firmly. &ldquo;It doesn&rsquo;t depend. They go on my- on her hips.&rdquo; He blushes, waiting for this to register, but Phil just stares. &nbsp;&ldquo;Do it, you pleb.&rdquo;</p><p>Phil chuckles nervously, but reaches out to place his hands on Dan&rsquo;s hips. They&rsquo;re just resting there, light as anything, but the touch of him, light and warm, still makes Dan want to cry.</p><p>&ldquo;Okay,&rdquo; he chokes out. &ldquo;She&rsquo;ll um- she&rsquo;ll probably do this.&rdquo;</p><p>Dan stretches his own arms out, reaching up until he&rsquo;s got them locked around Phil&rsquo;s neck.</p><p>&ldquo;Is that what you&rsquo;d do?&rdquo; Phil asks, his voice sounding strange and thin. &ldquo;If I were- if it were you being kissed?&rdquo;</p><p>Dan shrugs, disliking the question. &ldquo;Prob&rsquo;ly.&rdquo;</p><p>Phil nods, drinking down the information like it&rsquo;s gold. &ldquo;Okay, what now?&rdquo;</p><p>&ldquo;So, close your eyes,&rdquo; Dan instructs, and Phil does. He&rsquo;s so passively beautiful. All pale skin and dark lashes. Dan is not in any way ready for what&rsquo;s about to happen here. How the fuck did he get himself into this situation? &ldquo;Now, lean in really close to me, but&hellip; don&rsquo;t touch me yet.&rdquo;</p><p>There&rsquo;s no denying that at this point, self indulgence has come into play. Dan can&rsquo;t bring himself to feel too bad about it. He&rsquo;s never going to get an opportunity like this again, and in all likelihood Phil&rsquo;s too clueless to cotton on to whether Dan might be a little biased in his instruction. Phil closes some of the distance between them, their lips close now; Dan tightens his lock around Phil&rsquo;s neck. He smells like the caramel macchiatos Dan&rsquo;s been making for him all evening.</p><p>He lets Phil wait for it. In Dan&rsquo;s opinion, the best part about a kiss is the build up. It&rsquo;s the space between them, humming with an electric yearning. It&rsquo;s the eyes darting to one another&rsquo;s mouths, and the slow, careful dance around the minefield of wrong moves as they work up to it.</p><p>&ldquo;Okay,&rdquo; Dan whispers, knowing his breath will sizzle against Phil&rsquo;s lips. He feels Phil shiver, and it makes his stomach flip. &ldquo;Now, open your eyes.&rdquo;</p><p>Confused, Phil does as told. He seems a little stunned to see Dan up so close.</p><p>&ldquo;Like this?&rdquo;</p><p>Dan nods, their noses brushing. &ldquo;Tell her something.&rdquo;</p><p>Phil frowns. &ldquo;Tell her what?&rdquo;</p><p>&ldquo;Whatever you want,&rdquo; Dan near-whispers. For some reason, his eyes sting. He focuses them on Phil&rsquo;s tongue as it sweeps over his lower lip. &ldquo;Tell her she&rsquo;s got pretty eyes, or she&rsquo;s a hot babe. Whatever you want.&rdquo;</p><p>&ldquo;I&rsquo;m not telling her she&rsquo;s a hot babe,&rdquo; Phil says, rolling his eyes. He seems a little pink-cheeked, though. &ldquo;And I&rsquo;m certainly not telling you you&rsquo;re a hot babe.&rdquo;</p><p>&ldquo;So tell me something else, then,&rdquo; Dan says before he can stop himself. &ldquo;I mean, pretend I&rsquo;m her. <i>Amanda</i>. And tell me what you want to tell me.&rdquo;</p><p>&ldquo;Pretend you&rsquo;re her?&rdquo; Phil asks, eyes roving over Dan&rsquo;s face as though it&rsquo;s an impossible feat.</p><p>&ldquo;I know it&rsquo;s a stretch Phil, but try it.&rdquo;</p><p>Phil is silent, his lips pressing together as he surveys Dan, still so close that he&rsquo;s probably all blurry in Phil&rsquo;s vision anyway. Eventually, Dan kicks him.</p><p>&ldquo;Come on,&rdquo; he prompts, heart stuttering already. </p><p>His palms have gone past clammy into damp; he feels a bit dizzy, from the coffees he&rsquo;s been drinking, and the cigarette he hasn&rsquo;t had yet. This is something from his wildest, most surreal dreams, something he honestly never thought would happen, and here it is, right in front of him. He blinks, but it doesn&rsquo;t go away. Phil is still so irresistibly close, the blue around his eyes thinned to a sliver, his heartbeat loud enough to hear. </p><p>&ldquo;You&rsquo;re the most beautiful thing&hellip;&rdquo; Phil starts to say, his voice slow and quiet. &ldquo;I have ever seen.&rdquo;</p><p>Dan&rsquo;s breath catches, and he feels his eyes sting again. He nods. &ldquo;That&rsquo;ll work.&rdquo;</p><p>&ldquo;Now what?&rdquo; Phil asks.</p><p>&ldquo;Now kiss me.&rdquo;</p><p>Phil&rsquo;s eyes widen, but he leans forwards readily. Dan&rsquo;s breath hitches again, and he finds himself drawing back a little.</p><p>&ldquo;Wait,&rdquo; he says hurriedly. He fixes Phil with a hard stare, trying to appear as unaffected as possible. &ldquo;If you stick your tongue in my mouth, I will bite it off, do you understand?&rdquo;</p><p>Phil laughs, looking a little relieved, and nods. Then, the hands on his hips yank him forwards, and Dan is being kissed. Slowly at first, tentative and unsure, but then harder, hungrier, as though some levee inside of Phil has broken. His hands tighten on Dan&rsquo;s hips, fingers pushing into Dan&rsquo;s skin, so hard it could bruise.</p><p>Phil&rsquo;s lips drag Dan&rsquo;s apart; he flicks his tongue against Dan&rsquo;s lip ring, then pushes it into Dan&rsquo;s mouth, breaking the one, singular rule Dan had given him, but he finds he doesn&rsquo;t even care. He never meant it anyway. He likes tongue. He would give anything not to know the taste of Phil&rsquo;s, but only because he&rsquo;ll never know it again. </p><p>He tastes like coffee, and caramel, and the bitter lead of his pencil when he licks the tip. Dan whimpers as these flavours unfurl across his taste buds; he pulls himself closer to Phil by the vice grip he has around his neck.</p><p>They kiss for what feels like hours, but it still isn&rsquo;t enough. There&rsquo;s a sudden vibration against his thigh, from what must be the phone in Phil&rsquo;s pocket. Like a shock of icy water thrown in his face, he remembers the time. He remembers the day, his own name, his tragedy of a life, and more importantly, who Phil is thinking about right now.</p><p>Somehow, along with the surge of disgust for himself that rises like bile in his throat, Dan manages to summon the strength to unwind his arms from Phil&rsquo;s neck and shove, hard, against his chest. Phil stumbles backwards, shocked, his lips wet and reddened. There&rsquo;s an indent in their corner from where Dan&rsquo;s lip ring has pressed into his flesh, and the sight of it is making Dan want to throw up.</p><p>&ldquo;Fucking hell, Phil,&rdquo; Dan pants, staring at him. Phil just stares, stunned, breathing heavily. &ldquo;You don&rsquo;t need lessons, okay? You&rsquo;re fine.&rdquo;</p><p>Dan swallows, hands braced against the table as he tries to gain some control. How did he just let that happen? He is so, so fucked.</p><p>&ldquo;Sorry,&rdquo; Phil says at last. &ldquo;I&hellip; I don&rsquo;t know what- you&rsquo;re just so, um, pretty, and it was all nice and familiar- I guess I just&hellip; I got carried away.&rdquo;</p><p>&ldquo;Carried away,&rdquo; Dan repeats with a humourless laugh, still breathless. &ldquo;Just a little.&rdquo;</p><p>Phil ducks his head, his cheeks a little flushed. &ldquo;Thanks, though. For helping me.&rdquo;</p><p>Dan shakes his head, barely able to believe his ears. He feels a rush of hot, stinging anger flooding his veins, and he glares at Phil, unable to suppress it.</p><p>&ldquo;Sure. What else am I here for, anyway?&rdquo;</p><p>&ldquo;What?&rdquo;</p><p>&ldquo;About the only thing I&rsquo;m good for, isn&rsquo;t it?&rdquo; Dan spits out. He stands from the table on jelly legs, untying his apron and yanking it off. &ldquo;As the town whore, you might as well use me for practise.&rdquo;</p><p>&ldquo;Dan, what- that is not why I-&rdquo;</p><p>&ldquo;Save it,&rdquo; Dan growls, stalking past Phil towards the kitchen.</p><p>He pushes through the door, trying to ignore that his throat feels like he&rsquo;s swallowed a lump of burning hot coal.\t</p><p>&ldquo;Dan, I didn&rsquo;t mean to offend you, I&rsquo;m sorry!&rdquo; Phil calls from the caf&eacute; floor. Dan leans his head back against the kitchen door separating them, shutting his eyes. &ldquo;I don&rsquo;t know what happened, I just- fuck. Please don&rsquo;t be annoyed.&rdquo;</p><p>Dan bites down hard on his lip, hating that he can still taste Phil there, all sickly sweet syrup and a rich, malty aftertaste.</p><p>&ldquo;Dan?&rdquo; Phil calls out again. &ldquo;Please talk to me.&rdquo;</p><p>There&rsquo;s a push from the other side of the door, jolting Dan forwards. He moves out of its path, letting Phil swing it open. He stands in the doorway, looking shame-faced.</p><p>&ldquo;It&rsquo;s fine,&rdquo; Dan sighs, running a hand through his hair. &ldquo;That&hellip; happened. Let&rsquo;s just move the fuck on.&rdquo;</p><p>Phil nods, still a little dazed. &ldquo;Okay.&rdquo;</p><p>Dan nods, brushing past him as he goes to finish closing up the caf&eacute;. Phil just watches him perform the medial little tasks that need doing with a glazed expression, looking like a lost child.<br />Dan is about a hundred percent sure he missed something on his to-do list by the time he gets his jacket, but he can&rsquo;t be bothered to check. Louise can yell at him, he doesn&rsquo;t care.</p><p>&ldquo;Come on,&rdquo; Dan says to Phil, his voice gruff still.</p><p>He walks to the door, jingling the keys, and opens it for Phil to step out into the dark street. Dan switches all the lights off without looking back, and follows him outside to lock the doors.</p><p>&ldquo;It&rsquo;s raining,&rdquo; Phil says, as if Dan hadn&rsquo;t noticed the moisture pelting him from above.</p><p>&ldquo;You don&rsquo;t say,&rdquo; Dan replies, turning the final lock.</p><p>&ldquo;Can I come over?&rdquo;</p><p>Dan freezes, trying not to react. He turns to Phil slowly, a frown creasing his brow. &ldquo;Don&rsquo;t think that&rsquo;s a good idea.&rdquo;</p><p>Phil cocks his head like a spaniel. &ldquo;Why?&rdquo;</p><p>Dan purses his lips, looking up at the rainclouds, invisible in the dark. &ldquo;Several reasons.&rdquo;</p><p>He doesn&rsquo;t mention that one of them is that he needs some time to privately flip the memory of Phil kissing him over and over in his mad, analytical brain until it&rsquo;s wrung dry. He can already tell that that moment in time will forever be etched into his brain, just like his hips will always feel the ghost of Phil&rsquo;s grip, and his lips&hellip; well. No other kiss will ever again mean anything, Dan is sure.</p><p>&ldquo;It&rsquo;s Prom tomorrow,&rdquo; Phil says, his voice small. Dan rolls his eyes, wondering if Phil really thinks he could have forgotten when it&rsquo;s literally all they&rsquo;ve talked about for weeks. &ldquo;You&rsquo;re still gonna drive us, right?&rdquo;</p><p>Dan sighs, desperately wishing he had enough spine to refuse right now. &ldquo;Said I would, didn&rsquo;t I?&rdquo;</p><p>He stuffs the keys into his pocket, flicks up the hood of his jacket and starts walking down the street. Phil follows at his side, hands stuffed into the pocket of his hoodie. Silvery puffs of air escape from his mouth as he breathes; suddenly, Dan remembers his vice, digging into his back pocket. The packet&rsquo;s a little damp, but he pulls a cigarette out with his teeth, uncaring.</p><p>&ldquo;I just thought maybe you&rsquo;d have changed your mind.&rdquo;</p><p>Dan ducks into a doorway, lighting the end of his cigarette. They&rsquo;re thin and black, these weird cherry flavoured ones, which is undeniably fitting to his aesthetic and mood. &ldquo;And pass up three bags of Skittles? No way.&rdquo;</p><p>He inhales, then continues walking, Phil still trudging along at his side. &ldquo;So, I can come over, then?&rdquo;</p><p>Dan rolls his eyes. &ldquo;You&rsquo;re literally following me home right now. It&rsquo;s not like I have much of a choice.&rdquo;</p><p>Phil says nothing, but when Dan sneaks a glance at his expression, misted from the rain, he&rsquo;s smiling. </p><p>&mdash;</p><p>&ldquo;Dan?&rdquo;</p><p>The whisper filters through the filmy layer of Dan&rsquo;s mind, hauling him out of the dream he was about to slip into.</p><p>&ldquo;Dan, are you awake?&rdquo; Phil&rsquo;s voice sounds strange.</p><p>&ldquo;Hm,&rdquo; Dan says, stirring. &ldquo;I am now.&rdquo;</p><p>He opens his eyes crossly, irritated at being woken from what was sure to be a lovely, long sleep. The first thing he notices, even in the pitch black, is that Phil is very close to him. They&rsquo;re sharing Dan&rsquo;s single bed, so obviously their proximity is a little more than normal, but he&rsquo;s shifted towards Dan&rsquo;s side significantly.</p><p>Dan tries to put some distance back between them, but he&rsquo;s got the wall behind him. He gives up, mind swirling in an attempt to distract himself from the fact that Phil is wearing his old Muse t-shirt and boxers, and is pressed almost against him, in his bed. Only hours ago, they&rsquo;d been making out on a table in a closed cafe. Dan no longer feels very sleepy. Phil is staring straight at him, across the pillow. He&rsquo;s chewing his lip, a worried crease between his brows.</p><p>&ldquo;Wha&rsquo;s the matter?&rdquo; Dan asks sleepily. His heart races. &ldquo;Did you hear Ricky come home?&rdquo;</p><p>Phil shakes his head, and Dan&rsquo;s lets out a quiet sigh of relief.</p><p>&ldquo;I&rsquo;m sorry about earlier,&rdquo; Phil says quietly; Dan really wishes he hadn&rsquo;t said it at all. &ldquo;The kiss, I mean.&rdquo;</p><p>Dan shrugs a shoulder. &ldquo;S&rsquo;okay.&rdquo;</p><p>It isn&rsquo;t, though. It&rsquo;s far from okay, it&rsquo;s made everything a hell of a lot worse, but Phil doesn&rsquo;t know about Dan&rsquo;s feelings, so it&rsquo;s not all his fault. Phil&rsquo;s hand slides onto his hip. It&rsquo;s warm, and gripping a little too tightly to be normal. Dan stares at him, entirely lost on what&rsquo;s happening.</p><p>&ldquo;You smell like cherries again,&rdquo; Phil tells him, so quiet it&rsquo;s barely audible. &ldquo;You taste like cherries, too.&rdquo; </p><p>Dan has no idea what to say, but it turns out he needn&rsquo;t bother. Phil shifts closer still, that hand on his hip gripping tighter, and then their lips are pressed together. Phil is purposeful, searching, kissing Dan with the same unexpected intensity that he had back in the caf&eacute;. For a fleeting second, Dan is able to hold onto his resistance. He remains rigid, certain that this is a mistake, that Phil is not in his right mind, and that he should not give in to it. But Phil is stubborn, he is patient, and desperate. The hand on his hip feels like a plea, and Dan could never resist Phil&rsquo;s begging. So he gives in, falls into the welcome warmth of Phil&rsquo;s wave of wanting. He kisses Phil like he&rsquo;s starving, not concerned with breaking away this time because he initiated it, there are no &lsquo;kissing lessons&rsquo; to disguise it. This is unprecedented, unprovoked, and entirely Phil&rsquo;s decision.</p><p>The hand on Dan&rsquo;s hip slips round to grab at his bum, mostly to pull their bodies closer together. Dan gasps, allowing his limp, exhausted body to mould itself around Phil&rsquo;s chest and legs. He imagines the clothes gone, the warm, smooth skin of him beneath, and groans. He winds his hands into Phil&rsquo;s t-shirt, feeling the heady arousal sweep from his lips, down his chest, and between his legs, leaving a flush in its wake. </p><p>Phil&rsquo;s hand works its way between them, finding the telltale bump of Dan&rsquo;s erection and pressing against it. Dan gasps, pulling back from the kiss to look into Phil&rsquo;s eyes. He should say something, make sure Phil is really sure he wants to do this, but the words die with a firm push of Phil&rsquo;s fingers. He rubs against Dan in soft, gentle movements, still above his boxers. It&rsquo;s too teasing to be enough, but Dan shuts his eyes anyway, choking back a moan of bliss. </p><p>&ldquo;Do you want me to stop?&rdquo; Phil asks, his voice quiet and husky.</p><p>Dan&rsquo;s eyes fly open, and he shakes his head. Phil doesn&rsquo;t seem to need any further confirmation. He dips his hand into the waistband of Dan&rsquo;s boxers, curling his fingers around the length of him. Dan chokes on something &ndash; the air, maybe &ndash; thrown by the confidence with which Phil moves considering this is, as far as Dan knows, his first time doing anything like this.</p><p>Dan&rsquo;s never been particularly vocal in bed unless asked, so he just buries his face in Phil&rsquo;s shoulder, whimpering as Phil&rsquo;s hand pumps a steady rhythm around him, gradually becoming slicker, messier as the build of his orgasm drags over Dan&rsquo;s body. Phil&rsquo;s movements are unpracticed, his hand is at an awkward angle, and he hasn&rsquo;t even pulled Dan&rsquo;s boxers down, but somehow it&rsquo;s beyond incredible.</p><p>Dan comes hard, unable to stop himself crying out as Phil sinks his teeth into the exposed skin of his neck, sucking a mark there. He shudders as the pleasure ebbs away, going limp in Phil&rsquo;s arms. Phil pulls his hand out from Dan&rsquo;s boxers, wiping it on the Muse logo. A few seconds of stunned silence pass in the wake of what just occurred, and then Dan moves, jumping to attention like a soldier going about his routine. He pushes his lips back into Phil&rsquo;s, just as hungry as before, and slides a hand down his torso, from collarbone to groin.</p><p>Phil catches hold of his wrist.</p><p>&ldquo;Hey, it&rsquo;s fine,&rdquo; Phil says hurriedly. Through the Muse t-shirt, Dan can feel his heart pounding.</p><p>He stares at Phil, confused. &ldquo;Let me&hellip; help you out.&rdquo;</p><p>Phil smiles at him, though it seems a bit strained. &ldquo;I&rsquo;m fine, really. Let&rsquo;s just go to sleep, yeah?&rdquo;</p><p>Dan scans his face, trying to suss out why on earth somebody would refuse a return offer in this situation, but he comes up short. Hey, maybe Phil is just a little strange. Maybe his first time nerves kicked in a little later than expected.</p><p>&ldquo;Are you sure?&rdquo; Dan asks. His tongue flicks out to play with his lip ring, flirtatious. &ldquo;I don&rsquo;t mind, you know.&rdquo;</p><p>Phil&rsquo;s gaze hones in on the lip ring, and he swallows thickly. &ldquo;Y-yeah, really. I&rsquo;m just tired. Sleep.&rdquo;</p><p>Reluctantly, Dan shuffles down, getting comfy again. It&rsquo;s difficult, because he&rsquo;d ideally like a shower right now, preferably one with Phil, but it&rsquo;s obviously not going to happen, so Dan&rsquo;s gonna just have to suck it up. But not literally, apparently.</p><p>&ldquo;Okay,&rdquo; Dan says after some thought. He shuffles closer to Phil, a warm and hopeful glow pulsating in his gut for the first time in years. &ldquo;Goodnight.&rdquo;</p><p>There&rsquo;s a long time before Phil replies.</p><p>&ldquo;Night.&rdquo;</p><p><b>(<a href=\"http://danfanciesphil.tumblr.com/post/178893484577/edgelorddan-x-obliviousbisexualphil-au-chapter\">Chapter Seven!</a>)</b></p>",
                "content_abstract": "<p>\n<p><b>Edgelord!Dan x ObliviousBisexual!Phil AU [CHAPTER SIX]<br /></b><b>(based off the 80&prime;s classic Some Kind of Wonderful)</b></p>\n<p><b>Synopsis: </b><i>Dan has one friend, and only because he was forced into it. Phil is loud, excitable, and irritatingly happy all of the time. Phil seems to find Dan&rsquo;s perpetual attitude funny, and despite Dan&rsquo;s best efforts to shun him and everyone else, wants to be around him all the time. That is, until Phil starts talking about Amanda Jones.<br /></i><b>Word Count:</b> WIP (Estimated 12-15 chapters) updates every Tuesday<br /><b>Rating:</b> Explicit<br /><b>Warnings:</b> Smoking, swearing, implied prostitution, broken home, class divide/classism, pining, light homophobia, sex <br /><br /></p>\n<p><b>[<a href=\"http://danfanciesphil.tumblr.com/post/177738852529/some-kind-of-folliful-new-fic\">Chapter One</a>]<br />[<a href=\"http://danfanciesphil.tumblr.com/post/177982263491/some-kind-of-folliful-new-chapter\">Chapter Two</a>]<br />[<a href=\"http://danfanciesphil.tumblr.com/post/178227297225/some-kind-of-folliful-new-chapter\">Chapter Three</a>]<br />[<a href=\"http://danfanciesphil.tumblr.com/post/178454752236/some-kind-of-folliful-new-chapter\">Chapter Four</a>]<br />[<a href=\"http://danfanciesphil.tumblr.com/post/178671704545/some-kind-of-folliful-new-chapter\">Chapter Five</a>]</b></p>\n<p><b>[<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Farchiveofourown.org%2Fworks%2F15894954%2Fchapters%2F37042212&amp;t=YWVmOTliMzc0MTkyZDFjZTFkMzVmMzM4NmFlOGJjZDJmODI1Njk5YixVNUVvdGxGag%3D%3D&amp;b=t%3AA-PgA5Z7k9tbi8i-ePCy7Q&amp;p=https%3A%2F%2Ffeels-forever.tumblr.com%2Fpost%2F177763348310%2Fsome-kind-of-folliful-new-fic&amp;m=1\">Ao3</a>!]</b></p>\n<p>Dan hates the closing shift.</p>\n<p>Or rather, he hates it <i>usually</i>.</p>\n<p>He hates the hour it takes to shut the caf&eacute; down after the last customer leaves. He hates having to clean the entire coffee machine inside and out. He hates the pressure of counting the money in the till, especially as he sucks at maths.</p>\n<p>He hates having to wipe down every table and surface. He hates having to restock the milk in the fridge and the sugar on the counter. He loathes having to switch off every single light one by one, letting the shadows crawl out of their corners and smother the place. He usually does this final task at the last possible moment, so that he can just walk straight to the door and leave as soon as possible. The caf&eacute;, which is quite a sweet, pretty place with a soft, happy feel in the daytime, becomes something evil in the dark.</p>\n<p>Tonight however, it&rsquo;s not so bad. The late shift is given to Dan at least once a week, because he&rsquo;s worked here a lot longer than most of the other staff, and so can be trusted. He&rsquo;s done it so many times that he could do it blindfolded, he&rsquo;s sure, so Louise allows him to do it on his own.</p>\n<p>Tonight, he&rsquo;s not on his own.</p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "phan-stan-gram",
        "blog": {
            "name": "phan-stan-gram",
            "title": "Phanstagram",
            "description": "<p>umm the second ‘n’ is silent </p><p>side project of autumn-in-phandom</p>",
            "url": "https://phan-stan-gram.tumblr.com/",
            "uuid": "t:MVjSuUTuyow9yl73neJisA",
            "updated": 1561064763
        },
        "id": 178676179325,
        "post_url": "https://phan-stan-gram.tumblr.com/post/178676179325/just-fill-that-hole-with-bread-dan-fill-it-with",
        "slug": "just-fill-that-hole-with-bread-dan-fill-it-with",
        "date": "2018-10-02 21:00:24 GMT",
        "timestamp": 1538514024,
        "state": "published",
        "format": "html",
        "reblog_key": "cukVtLVE",
        "tags": [
            "phan",
            "dan and phil",
            "daniel howell",
            "instastory",
            "franco manca",
            "instaphan",
            "phanstagram",
            "queue & ace",
            "keeping this short",
            "as the screenshots were crappy quality",
            "and a bit frightening"
        ],
        "short_url": "https://tmblr.co/Zdz9sa2cPxY5z",
        "summary": "‘Just fill that hole with bread, Dan. Fill it with bread.’ 🍕 02.10.18",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 77,
        "caption": "<p>‘Just fill that hole with bread, Dan. Fill it with bread.’ 🍕 02.10.18<br/></p>",
        "reblog": {
            "comment": "<p>‘Just fill that hole with bread, Dan. Fill it with bread.’ 🍕 02.10.18<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "phan-stan-gram",
                    "active": true,
                    "theme": {
                        "header_full_width": 1098,
                        "header_full_height": 1099,
                        "header_focus_width": 1098,
                        "header_focus_height": 617,
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "238,1098,855,0",
                        "header_image": "https://static.tumblr.com/3e2517b73e58381e4f926a73aa57d35f/uwaajpm/YbSpralf1/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/b8b1cd9544fb6c035aa090194f9104c4/uwaajpm/uTypralf3/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/3e2517b73e58381e4f926a73aa57d35f/uwaajpm/YbSpralf1/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FF3886",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#BB34C1",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178676179325"
                },
                "content_raw": "<p>‘Just fill that hole with bread, Dan. Fill it with bread.’ 🍕 02.10.18<br></p>",
                "content": "<p>&lsquo;Just fill that hole with bread, Dan. Fill it with bread.&rsquo; &#127829; 02.10.18<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "22",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/90ca9ef4f70cf232f4c19e552906f497/tumblr_pfzp0ocvZX1x7oweco1_1280.jpg",
                    "width": 717,
                    "height": 1280
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/90ca9ef4f70cf232f4c19e552906f497/tumblr_pfzp0ocvZX1x7oweco1_1280.jpg",
                        "width": 717,
                        "height": 1280
                    },
                    {
                        "url": "https://66.media.tumblr.com/90ca9ef4f70cf232f4c19e552906f497/tumblr_pfzp0ocvZX1x7oweco1_640.jpg",
                        "width": 538,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/90ca9ef4f70cf232f4c19e552906f497/tumblr_pfzp0ocvZX1x7oweco1_540.jpg",
                        "width": 454,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/90ca9ef4f70cf232f4c19e552906f497/tumblr_pfzp0ocvZX1x7oweco1_500.jpg",
                        "width": 420,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/90ca9ef4f70cf232f4c19e552906f497/tumblr_pfzp0ocvZX1x7oweco1_400.jpg",
                        "width": 336,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/90ca9ef4f70cf232f4c19e552906f497/tumblr_pfzp0ocvZX1x7oweco1_250.jpg",
                        "width": 224,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/90ca9ef4f70cf232f4c19e552906f497/tumblr_pfzp0ocvZX1x7oweco1_100.jpg",
                        "width": 100,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/90ca9ef4f70cf232f4c19e552906f497/tumblr_pfzp0ocvZX1x7oweco1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/6840d0a3a398cfc4e7ed5ef0e3a376f3/tumblr_pfzp0ocvZX1x7oweco2_1280.jpg",
                    "width": 714,
                    "height": 1280
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/6840d0a3a398cfc4e7ed5ef0e3a376f3/tumblr_pfzp0ocvZX1x7oweco2_1280.jpg",
                        "width": 714,
                        "height": 1280
                    },
                    {
                        "url": "https://66.media.tumblr.com/6840d0a3a398cfc4e7ed5ef0e3a376f3/tumblr_pfzp0ocvZX1x7oweco2_640.jpg",
                        "width": 536,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/6840d0a3a398cfc4e7ed5ef0e3a376f3/tumblr_pfzp0ocvZX1x7oweco2_540.jpg",
                        "width": 452,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/6840d0a3a398cfc4e7ed5ef0e3a376f3/tumblr_pfzp0ocvZX1x7oweco2_500.jpg",
                        "width": 418,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/6840d0a3a398cfc4e7ed5ef0e3a376f3/tumblr_pfzp0ocvZX1x7oweco2_400.jpg",
                        "width": 335,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/6840d0a3a398cfc4e7ed5ef0e3a376f3/tumblr_pfzp0ocvZX1x7oweco2_250.jpg",
                        "width": 223,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/6840d0a3a398cfc4e7ed5ef0e3a376f3/tumblr_pfzp0ocvZX1x7oweco2_100.jpg",
                        "width": 100,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/6840d0a3a398cfc4e7ed5ef0e3a376f3/tumblr_pfzp0ocvZX1x7oweco2_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/1c37763b97535572d987a2fae49732c3/tumblr_pfzp0ocvZX1x7oweco4_1280.jpg",
                    "width": 714,
                    "height": 1277
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/1c37763b97535572d987a2fae49732c3/tumblr_pfzp0ocvZX1x7oweco4_1280.jpg",
                        "width": 714,
                        "height": 1277
                    },
                    {
                        "url": "https://66.media.tumblr.com/1c37763b97535572d987a2fae49732c3/tumblr_pfzp0ocvZX1x7oweco4_640.jpg",
                        "width": 537,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/1c37763b97535572d987a2fae49732c3/tumblr_pfzp0ocvZX1x7oweco4_540.jpg",
                        "width": 453,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/1c37763b97535572d987a2fae49732c3/tumblr_pfzp0ocvZX1x7oweco4_500.jpg",
                        "width": 419,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/1c37763b97535572d987a2fae49732c3/tumblr_pfzp0ocvZX1x7oweco4_400.jpg",
                        "width": 335,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/1c37763b97535572d987a2fae49732c3/tumblr_pfzp0ocvZX1x7oweco4_250.jpg",
                        "width": 224,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/1c37763b97535572d987a2fae49732c3/tumblr_pfzp0ocvZX1x7oweco4_100.jpg",
                        "width": 100,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/1c37763b97535572d987a2fae49732c3/tumblr_pfzp0ocvZX1x7oweco4_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/5cec181f54954f27f3c0f3cf0e309062/tumblr_pfzp0ocvZX1x7oweco8_1280.jpg",
                    "width": 718,
                    "height": 1280
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/5cec181f54954f27f3c0f3cf0e309062/tumblr_pfzp0ocvZX1x7oweco8_1280.jpg",
                        "width": 718,
                        "height": 1280
                    },
                    {
                        "url": "https://66.media.tumblr.com/5cec181f54954f27f3c0f3cf0e309062/tumblr_pfzp0ocvZX1x7oweco8_640.jpg",
                        "width": 539,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/5cec181f54954f27f3c0f3cf0e309062/tumblr_pfzp0ocvZX1x7oweco8_540.jpg",
                        "width": 454,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/5cec181f54954f27f3c0f3cf0e309062/tumblr_pfzp0ocvZX1x7oweco8_500.jpg",
                        "width": 421,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/5cec181f54954f27f3c0f3cf0e309062/tumblr_pfzp0ocvZX1x7oweco8_400.jpg",
                        "width": 337,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/5cec181f54954f27f3c0f3cf0e309062/tumblr_pfzp0ocvZX1x7oweco8_250.jpg",
                        "width": 224,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/5cec181f54954f27f3c0f3cf0e309062/tumblr_pfzp0ocvZX1x7oweco8_100.jpg",
                        "width": 100,
                        "height": 178
                    },
                    {
                        "url": "https://66.media.tumblr.com/5cec181f54954f27f3c0f3cf0e309062/tumblr_pfzp0ocvZX1x7oweco8_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "phanstastories",
        "blog": {
            "name": "phanstastories",
            "title": "your reupload center for dnp’s insta stories!",
            "description": "don’t use instagram but don’t wanna miss out on the insta story fun? this is the blog for you!",
            "url": "https://phanstastories.tumblr.com/",
            "uuid": "t:BWVgb1flYShFoaxpdchQFA",
            "updated": 1561257875
        },
        "id": 178675987744,
        "post_url": "https://phanstastories.tumblr.com/post/178675987744/dans-second-insta-story-10218-d-i-was",
        "slug": "dans-second-insta-story-10218-d-i-was",
        "date": "2018-10-02 20:52:50 GMT",
        "timestamp": 1538513570,
        "state": "published",
        "format": "html",
        "reblog_key": "j8kmbH1t",
        "tags": [
            "phan",
            "dan and phil",
            "daniel howell",
            "ii insta stories",
            "phandom",
            "dnp",
            "dap",
            "danisnotonfire",
            "dan howell",
            "danielhowell",
            "amazingphil",
            "phil lester",
            "dan",
            "10/2/18",
            "brook"
        ],
        "short_url": "https://tmblr.co/Z98w8a2cPwpKW",
        "summary": "dan’s second insta story + 10/2/18 + d: “i was feeling sad, so i ordered...quite a lot of pizza. just fill that hole with bread,...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 186,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"360\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s.mp4\",\"type\":\"video/mp4\",\"width\":360,\"height\":640},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":360,\"height\":640}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s.mp4\" type=\"video/mp4\"></source></video></figure><p>dan’s second insta story + 10/2/18 + d: “i was feeling sad, so i ordered&hellip;quite a lot of pizza. just fill that hole with bread, dan. fill it with bread. </p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"360\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s.mp4\",\"type\":\"video/mp4\",\"width\":360,\"height\":640},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":360,\"height\":640}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s.mp4\" type=\"video/mp4\"></source></video></figure><p>dan’s second insta story + 10/2/18 + d: “i was feeling sad, so i ordered…quite a lot of pizza. just fill that hole with bread, dan. fill it with bread. </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "phanstastories",
                    "active": true,
                    "theme": {
                        "header_full_width": 1131,
                        "header_full_height": 707,
                        "header_focus_width": 1131,
                        "header_focus_height": 636,
                        "avatar_shape": "square",
                        "background_color": "#3B3B3B",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "35,1131,671,0",
                        "header_image": "https://static.tumblr.com/ccdf9f6dbc9ba77c26e7990394efb6ec/wy5ekib/KClpgti76/tumblr_static_2mns252vwrmso0wg8gowg80ks.png",
                        "header_image_focused": "https://static.tumblr.com/ccdf9f6dbc9ba77c26e7990394efb6ec/wy5ekib/1Uopgti78/tumblr_static_tumblr_static_2mns252vwrmso0wg8gowg80ks_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/ccdf9f6dbc9ba77c26e7990394efb6ec/wy5ekib/KClpgti76/tumblr_static_2mns252vwrmso0wg8gowg80ks_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#DD3C45",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#DD7560",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675987744"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"360\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s.mp4\",\"type\":\"video/mp4\",\"width\":360,\"height\":640},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":360,\"height\":640}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s.mp4\" type=\"video/mp4\"></source></video></figure><p>dan’s second insta story + 10/2/18 + d: “i was feeling sad, so i ordered…quite a lot of pizza. just fill that hole with bread, dan. fill it with bread. </p></p>",
                "content": "<p><figure class=\"tmblr-full\" data-npf=\"{&quot;type&quot;:&quot;video&quot;,&quot;provider&quot;:&quot;tumblr&quot;,&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s.mp4&quot;,&quot;media&quot;:{&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s.mp4&quot;,&quot;type&quot;:&quot;video/mp4&quot;,&quot;width&quot;:360,&quot;height&quot;:640},&quot;poster&quot;:[{&quot;url&quot;:&quot;https://66.media.tumblr.com/tumblr_pfzolfthAJ1xrqf1s_frame1.jpg&quot;,&quot;type&quot;:&quot;image/jpeg&quot;,&quot;width&quot;:360,&quot;height&quot;:640}]}\"></figure><p>dan&rsquo;s second insta story + 10/2/18 + d: &ldquo;i was feeling sad, so i ordered&hellip;quite a lot of pizza. just fill that hole with bread, dan. fill it with bread. </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "phanstastories",
        "blog": {
            "name": "phanstastories",
            "title": "your reupload center for dnp’s insta stories!",
            "description": "don’t use instagram but don’t wanna miss out on the insta story fun? this is the blog for you!",
            "url": "https://phanstastories.tumblr.com/",
            "uuid": "t:BWVgb1flYShFoaxpdchQFA",
            "updated": 1561257875
        },
        "id": 178675937780,
        "post_url": "https://phanstastories.tumblr.com/post/178675937780/phils-first-insta-story-10218-p-so-i",
        "slug": "phils-first-insta-story-10218-p-so-i",
        "date": "2018-10-02 20:51:00 GMT",
        "timestamp": 1538513460,
        "state": "published",
        "format": "html",
        "reblog_key": "rUPRpzRE",
        "tags": [
            "phan",
            "dan and phil",
            "amazingphil",
            "ii insta stories",
            "phandom",
            "dnp",
            "dap",
            "phil lester",
            "daniel howell",
            "danisnotonfire",
            "dan howell",
            "danielhowell",
            "phil",
            "10/2/18",
            "brook"
        ],
        "short_url": "https://tmblr.co/Z98w8a2cPwd7q",
        "summary": "phil’s first insta story + 10/2/18 + p: “so, i just got excited about stranger things series 3 because i’m wearing my stranger...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 47,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"360\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s.mp4\",\"type\":\"video/mp4\",\"width\":360,\"height\":640},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":360,\"height\":640}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s.mp4\" type=\"video/mp4\"></source></video></figure><p>phil’s first insta story + 10/2/18 + p: “so, i just got excited about stranger things series 3 because i’m wearing my stranger things jumper, and then i googled it, and it’s not coming out until summer 2019! it’s a spooky show! what am i meant to do with my life now?! </p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"360\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s.mp4\",\"type\":\"video/mp4\",\"width\":360,\"height\":640},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":360,\"height\":640}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s.mp4\" type=\"video/mp4\"></source></video></figure><p>phil’s first insta story + 10/2/18 + p: “so, i just got excited about stranger things series 3 because i’m wearing my stranger things jumper, and then i googled it, and it’s not coming out until summer 2019! it’s a spooky show! what am i meant to do with my life now?! </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "phanstastories",
                    "active": true,
                    "theme": {
                        "header_full_width": 1131,
                        "header_full_height": 707,
                        "header_focus_width": 1131,
                        "header_focus_height": 636,
                        "avatar_shape": "square",
                        "background_color": "#3B3B3B",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "35,1131,671,0",
                        "header_image": "https://static.tumblr.com/ccdf9f6dbc9ba77c26e7990394efb6ec/wy5ekib/KClpgti76/tumblr_static_2mns252vwrmso0wg8gowg80ks.png",
                        "header_image_focused": "https://static.tumblr.com/ccdf9f6dbc9ba77c26e7990394efb6ec/wy5ekib/1Uopgti78/tumblr_static_tumblr_static_2mns252vwrmso0wg8gowg80ks_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/ccdf9f6dbc9ba77c26e7990394efb6ec/wy5ekib/KClpgti76/tumblr_static_2mns252vwrmso0wg8gowg80ks_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#DD3C45",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#DD7560",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675937780"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"360\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s.mp4\",\"type\":\"video/mp4\",\"width\":360,\"height\":640},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":360,\"height\":640}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s.mp4\" type=\"video/mp4\"></source></video></figure><p>phil’s first insta story + 10/2/18 + p: “so, i just got excited about stranger things series 3 because i’m wearing my stranger things jumper, and then i googled it, and it’s not coming out until summer 2019! it’s a spooky show! what am i meant to do with my life now?! </p></p>",
                "content": "<p><figure class=\"tmblr-full\" data-npf=\"{&quot;type&quot;:&quot;video&quot;,&quot;provider&quot;:&quot;tumblr&quot;,&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s.mp4&quot;,&quot;media&quot;:{&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s.mp4&quot;,&quot;type&quot;:&quot;video/mp4&quot;,&quot;width&quot;:360,&quot;height&quot;:640},&quot;poster&quot;:[{&quot;url&quot;:&quot;https://66.media.tumblr.com/tumblr_pfzoi9NAPs1xrqf1s_frame1.jpg&quot;,&quot;type&quot;:&quot;image/jpeg&quot;,&quot;width&quot;:360,&quot;height&quot;:640}]}\"></figure><p>phil&rsquo;s first insta story + 10/2/18 + p: &ldquo;so, i just got excited about stranger things series 3 because i&rsquo;m wearing my stranger things jumper, and then i googled it, and it&rsquo;s not coming out until summer 2019! it&rsquo;s a spooky show! what am i meant to do with my life now?! </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "dramaphan",
        "blog": {
            "name": "dramaphan",
            "title": "Yo I Comment On The Drama When Shit Hits The Fan",
            "description": "<p>Phandom drama? It's more likely than you think. </p><p>. </p><p>My ask box is always open if you need a place to be dramatic, share theories, conspiracies, opinions, or general grievances. Fire away, my babies. Nothing is off limits. (Except for the things that are.)</p><p>. </p><p>Icon by phanniephobic, header by cinnamonnutlester</p>",
            "url": "https://dramaphan.tumblr.com/",
            "uuid": "t:p6m1pvFA6dzAWEXu7C836Q",
            "updated": 1561750120
        },
        "id": 178675834946,
        "post_url": "https://dramaphan.tumblr.com/post/178675834946/4",
        "slug": "4",
        "date": "2018-10-02 20:47:04 GMT",
        "timestamp": 1538513224,
        "state": "published",
        "format": "html",
        "reblog_key": "9F1kk9e7",
        "tags": [
            "phan",
            "amazingphil",
            "danisnotonfire",
            "danandphilgames",
            "daniel howell",
            "danisnotinteresting",
            "lessamazingphil",
            "phil lester",
            "dan and phil",
            "dan howell"
        ],
        "short_url": "https://tmblr.co/ZUy2jf2cPwE12",
        "summary": "4",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 19,
        "title": null,
        "body": "<h1>4</h1><p>4 pizzas. </p><p><br/></p><p>How deep is that hole, damn. </p>",
        "reblog": {
            "comment": "<p><h1>4</h1><p>4 pizzas. </p><p><br></p><p>How deep is that hole, damn. </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "dramaphan",
                    "active": true,
                    "theme": {
                        "header_full_width": 400,
                        "header_full_height": 238,
                        "header_focus_width": 400,
                        "header_focus_height": 225,
                        "avatar_shape": "circle",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "5,400,230,0",
                        "header_image": "https://static.tumblr.com/b30dc431ab3f361688fddb60e7973bc9/psnhpcl/Yg2pkmg5k/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/f3c2e67a9f28701a4eacf133264cb464/psnhpcl/iWjpkmg5k/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/b30dc431ab3f361688fddb60e7973bc9/psnhpcl/Yg2pkmg5k/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#60CAE0",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#CCCCCC",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675834946"
                },
                "content_raw": "<p><h1>4</h1><p>4 pizzas. </p><p><br></p><p>How deep is that hole, damn. </p></p>",
                "content": "<p><h1>4</h1><p>4 pizzas. </p><p><br /></p><p>How deep is that hole, damn. </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "it-hitsdifferent",
        "blog": {
            "name": "it-hitsdifferent",
            "title": "I guess I'm a phannie",
            "description": "Cass//She/Her",
            "url": "https://it-hitsdifferent.tumblr.com/",
            "uuid": "t:Fk80B6DSk3leyrrXgsO0Gw",
            "updated": 1561758921
        },
        "id": 178675816239,
        "post_url": "https://it-hitsdifferent.tumblr.com/post/178675816239/dan-and-phil-eating-2-pizzas-each-we-stan-boys",
        "slug": "dan-and-phil-eating-2-pizzas-each-we-stan-boys",
        "date": "2018-10-02 20:46:11 GMT",
        "timestamp": 1538513171,
        "state": "published",
        "format": "html",
        "reblog_key": "8FTdE2eX",
        "tags": [
            "dan and phil",
            "phan",
            "daniel howell",
            "amazingphil"
        ],
        "short_url": "https://tmblr.co/ZFk52e2cPw9Sl",
        "summary": "dan and phil eating 2 pizzas each?  we stan boys who love carbs and grease",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 133,
        "title": null,
        "body": "<p>dan and phil eating 2 pizzas each? </p><p>we stan boys who love carbs and grease</p>",
        "reblog": {
            "comment": "<p>dan and phil eating 2 pizzas each? </p><p>we stan boys who love carbs and grease</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "it-hitsdifferent",
                    "active": true,
                    "theme": {
                        "header_full_width": 550,
                        "header_full_height": 229,
                        "header_focus_width": 383,
                        "header_focus_height": 229,
                        "avatar_shape": "square",
                        "background_color": "#040404",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,478,229,95",
                        "header_image": "https://static.tumblr.com/f9363ef2062e1e9d5729ad316c1a6a2f/yagkgpk/9BFprj2a5/tumblr_static_elgza2miu94os8gc40ow8kgsc.jpg",
                        "header_image_focused": "https://static.tumblr.com/4a606b198a19c78f9659ae92f487a9cd/yagkgpk/dxOpt7be0/tumblr_static_tumblr_static_elgza2miu94os8gc40ow8kgsc_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f9363ef2062e1e9d5729ad316c1a6a2f/yagkgpk/9BFprj2a5/tumblr_static_elgza2miu94os8gc40ow8kgsc_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Sans Serif",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675816239"
                },
                "content_raw": "<p>dan and phil eating 2 pizzas each? </p><p>we stan boys who love carbs and grease</p>",
                "content": "<p>dan and phil eating 2 pizzas each?&nbsp;</p><p>we stan boys who love carbs and grease</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "orlandophan",
        "blog": {
            "name": "orlandophan",
            "title": "Molly",
            "description": "<a href=\"http://heyyitzmolly.tumblr.com\">Main Blog</a> / <a href=\"https://orlandophan.tumblr.com/aboutme\">About</a> / <a href=\"https://twitter.com/orlandophan\">Also Me</a>",
            "url": "https://orlandophan.tumblr.com/",
            "uuid": "t:4AE7z3glGt9Cr8cbdodsfA",
            "updated": 1561423560
        },
        "id": 178675786433,
        "post_url": "https://orlandophan.tumblr.com/post/178675786433/dan-and-phil-are-just-gonna-sit-down-and-rewatch",
        "slug": "dan-and-phil-are-just-gonna-sit-down-and-rewatch",
        "date": "2018-10-02 20:45:01 GMT",
        "timestamp": 1538513101,
        "state": "published",
        "format": "html",
        "reblog_key": "lXGceN6D",
        "tags": [
            "phan",
            "phandom"
        ],
        "short_url": "https://tmblr.co/Z6pDoc2cPw2B1",
        "summary": "Dan and Phil are just gonna sit down and rewatch some stranger things while eating pizza with too many dips.. sorry I don’t make...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 25,
        "title": null,
        "body": "<p>Dan and Phil are just gonna sit down and rewatch some stranger things while eating pizza with too many dips.. sorry I don’t make the rules</p>",
        "reblog": {
            "comment": "<p>Dan and Phil are just gonna sit down and rewatch some stranger things while eating pizza with too many dips.. sorry I don’t make the rules</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "orlandophan",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#85A2CB",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_01.png?_v=f67ca5ac5d1c4a0526964674cb5a0605",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_01.png?_v=f67ca5ac5d1c4a0526964674cb5a0605",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_01.png?_v=f67ca5ac5d1c4a0526964674cb5a0605",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#ffffff",
                        "title_font": "Arquitecta",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675786433"
                },
                "content_raw": "<p>Dan and Phil are just gonna sit down and rewatch some stranger things while eating pizza with too many dips.. sorry I don’t make the rules</p>",
                "content": "<p>Dan and Phil are just gonna sit down and rewatch some stranger things while eating pizza with too many dips.. sorry I don&rsquo;t make the rules</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "futurebunnyfluff",
        "blog": {
            "name": "futurebunnyfluff",
            "title": "artist and bird mom of 2",
            "description": "im more active on insta lol ✨@futurebunnyfluff✨ Commisions: open ✨✨",
            "url": "https://futurebunnyfluff.tumblr.com/",
            "uuid": "t:2phnrqTejhCzM2MaUHsILg",
            "updated": 1561610316
        },
        "id": 178675599188,
        "post_url": "https://futurebunnyfluff.tumblr.com/post/178675599188/have-this-shitty-doodle-i-did-based-on-dans-new",
        "slug": "have-this-shitty-doodle-i-did-based-on-dans-new",
        "date": "2018-10-02 20:37:53 GMT",
        "timestamp": 1538512673,
        "state": "published",
        "format": "html",
        "reblog_key": "jp9Nm5Do",
        "tags": [
            "daniel howell",
            "phan",
            "phan art",
            "my art",
            "its a doodle but still",
            "dan howell",
            "dnp art",
            "dnp"
        ],
        "short_url": "https://tmblr.co/ZB55uf2cPvKTK",
        "summary": "Have this shitty doodle i did based on Dan's new insta story",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 8,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"4160\" data-orig-width=\"3120\"><img src=\"https://66.media.tumblr.com/1a0bfac20dab29dffda477b3ce36f175/tumblr_pfznz0xQB31uvv7yw_540.jpg\" data-orig-height=\"4160\" data-orig-width=\"3120\"/></figure><p>Have this shitty doodle i did based on Dan&rsquo;s new insta story</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"4160\" data-orig-width=\"3120\"><img src=\"https://66.media.tumblr.com/1a0bfac20dab29dffda477b3ce36f175/tumblr_pfznz0xQB31uvv7yw_540.jpg\" data-orig-height=\"4160\" data-orig-width=\"3120\"></figure><p>Have this shitty doodle i did based on Dan’s new insta story</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "futurebunnyfluff",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#D0FFE1",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/6fca10bfa78fe1230202d3210c512f76/u2adinu/ptvpq4cmi/tumblr_static_1108215444-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/6fca10bfa78fe1230202d3210c512f76/u2adinu/ptvpq4cmi/tumblr_static_1108215444-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/6fca10bfa78fe1230202d3210c512f76/u2adinu/ptvpq4cmi/tumblr_static_1108215444-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#4BC580",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#0D9CCA",
                        "title_font": "Ziclets",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675599188"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"4160\" data-orig-width=\"3120\"><img src=\"https://66.media.tumblr.com/1a0bfac20dab29dffda477b3ce36f175/tumblr_pfznz0xQB31uvv7yw_540.jpg\" data-orig-height=\"4160\" data-orig-width=\"3120\"></figure><p>Have this shitty doodle i did based on Dan’s new insta story</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/1a0bfac20dab29dffda477b3ce36f175/tumblr_pfznz0xQB31uvv7yw_540.jpg\" class=\"\"/></figure><p>Have this shitty doodle i did based on Dan&rsquo;s new insta story</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "philsgaypillow",
        "blog": {
            "name": "philsgaypillow",
            "title": "a gay piece of home",
            "description": "abbie|19|hufflepuff|she/her|👩🏻‍🎨<a href=\"https://www.redbubble.com/people/philsfavpillow?asc=u\"> my art </a>👩🏻‍🎨 <a href=\"https://www.gofundme.com/eleanor-needs-vaccinations\"> eleanor </a>.🌸🌿header by <a href=\"https://lemonheadlester.tumblr.com/\">lemonheadlester</a>🌿🌸",
            "url": "https://philsgaypillow.tumblr.com/",
            "uuid": "t:LJqE-W38sSlnY9Ug1lP-Xw",
            "updated": 1561751193
        },
        "id": 178675592738,
        "post_url": "https://philsgaypillow.tumblr.com/post/178675592738/why-do-disney-channel-shows-and-movies-reference",
        "slug": "why-do-disney-channel-shows-and-movies-reference",
        "date": "2018-10-02 20:37:39 GMT",
        "timestamp": 1538512659,
        "state": "published",
        "format": "html",
        "reblog_key": "cg86Bb34",
        "tags": [
            "phan",
            "nobody cares abbie"
        ],
        "short_url": "https://tmblr.co/ZmKzJZ2cPvIuY",
        "summary": "Why do Disney channel shows and movies reference phan so much?",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>Why do Disney channel shows and movies reference phan so much?</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>Why do Disney channel shows and movies reference phan so much?</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "philsgaypillow",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/eee494be4dd6cb055a7815ca9b15eaf3/objc245/ujgpm6beq/tumblr_static_-518407589-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/eee494be4dd6cb055a7815ca9b15eaf3/objc245/ujgpm6beq/tumblr_static_-518407589-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/eee494be4dd6cb055a7815ca9b15eaf3/objc245/ujgpm6beq/tumblr_static_-518407589-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#F3D2CC",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#B8E2CD",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675592738"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>Why do Disney channel shows and movies reference phan so much?</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\">Why do Disney channel shows and movies reference phan so much?</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "dip-the-pip",
        "blog": {
            "name": "dip-the-pip",
            "title": "Procrastination Station",
            "description": "<p>never take me seriously. just don’t. </p><p>19/bi</p>",
            "url": "https://dip-the-pip.tumblr.com/",
            "uuid": "t:7nOEFLLeskWL7s3pSb14xA",
            "updated": 1561759591
        },
        "id": 178675536362,
        "post_url": "https://dip-the-pip.tumblr.com/post/178675536362/for-real-though-i-hope-dnp-find-another-show-to",
        "slug": "for-real-though-i-hope-dnp-find-another-show-to",
        "date": "2018-10-02 20:35:29 GMT",
        "timestamp": 1538512529,
        "state": "published",
        "format": "html",
        "reblog_key": "OL3jJv3B",
        "tags": [
            "dan and phil",
            "dan howell",
            "phan",
            "phil lester",
            "krispeaks"
        ],
        "short_url": "https://tmblr.co/Z9Ednk2cPv57g",
        "summary": "For real though, I hope dnp find another show to watch on Netflix since Stranger Things isn’t back, and I hope they enjoy their...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 199,
        "title": null,
        "body": "<p>For real though, I hope dnp find another show to watch on Netflix since Stranger Things isn’t back, and I hope they enjoy their pizza, relax, and spend quality time together </p>",
        "reblog": {
            "comment": "<p>For real though, I hope dnp find another show to watch on Netflix since Stranger Things isn’t back, and I hope they enjoy their pizza, relax, and spend quality time together </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "dip-the-pip",
                    "active": true,
                    "theme": {
                        "header_full_width": 3000,
                        "header_full_height": 1055,
                        "header_focus_width": 1798,
                        "header_focus_height": 1012,
                        "avatar_shape": "square",
                        "background_color": "#6cddcf",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "43,2543,1055,745",
                        "header_image": "https://static.tumblr.com/6f33dccb4d0231045d8b0f3a8ce3e9d5/pmhdyfy/ioppnq6my/tumblr_static_3c3xphhj1yw444kg8kccsww4g.jpg",
                        "header_image_focused": "https://static.tumblr.com/ccc8ddae3b4aeef277fd1673abd64956/pmhdyfy/Vjxpnq6n1/tumblr_static_tumblr_static_3c3xphhj1yw444kg8kccsww4g_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/6f33dccb4d0231045d8b0f3a8ce3e9d5/pmhdyfy/ioppnq6my/tumblr_static_3c3xphhj1yw444kg8kccsww4g_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#3a3d65",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675536362"
                },
                "content_raw": "<p>For real though, I hope dnp find another show to watch on Netflix since Stranger Things isn’t back, and I hope they enjoy their pizza, relax, and spend quality time together </p>",
                "content": "<p>For real though, I hope dnp find another show to watch on Netflix since Stranger Things isn&rsquo;t back, and I hope they enjoy their pizza, relax, and spend quality time together </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "dailydnp",
        "blog": {
            "name": "dailydnp",
            "title": "dan and phil updates",
            "description": "<a href=\"http://dailydnp.tumblr.com/aboutme\">olivia</a>, eighteen\n<p>\n\n\n<p> daily posts and <a href=\"http://dailydnp.tumblr.com/tagged/mine\">updates</a>\n<p> about dan and phil\n<p> -<p>\n\ni track #dailydnp if you want me <p> to see/reblog anything\n\n<p>",
            "url": "https://dailydnp.tumblr.com/",
            "uuid": "t:CzIppMJE3x8UAVrRSPeCsA",
            "updated": 1561752029
        },
        "id": 178675433162,
        "post_url": "https://dailydnp.tumblr.com/post/178675433162",
        "slug": "",
        "date": "2018-10-02 20:31:32 GMT",
        "timestamp": 1538512292,
        "state": "published",
        "format": "html",
        "reblog_key": "HicXeMiL",
        "tags": [
            "daniel howell",
            "danisnotonfire",
            "amazingphil",
            "dan and phil",
            "phan",
            "mine",
            "t likes"
        ],
        "short_url": "https://tmblr.co/ZPpDZc2cPuhxA",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 14,
        "title": null,
        "body": "<p><figure class=\"tmblr-full\" data-orig-height=\"662\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/f6e1d8477bc3cbdf34c0868702acf73c/tumblr_pfznokAOEf1s3ci1e_540.jpg\" data-orig-height=\"662\" data-orig-width=\"750\" alt=\"image\"/></figure></p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"662\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/f6e1d8477bc3cbdf34c0868702acf73c/tumblr_pfznokAOEf1s3ci1e_540.jpg\" data-orig-height=\"662\" data-orig-width=\"750\" alt=\"image\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "dailydnp",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 914,
                        "header_focus_width": 1280,
                        "header_focus_height": 720,
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "36,1280,756,0",
                        "header_image": "https://static.tumblr.com/ac1f04ec1db369b9371b258f1d285876/u6cm2fo/nawpr4q6i/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/18e9c8a7edc2e5431371a525d807f12a/u6cm2fo/3hhpr6z95/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/ac1f04ec1db369b9371b258f1d285876/u6cm2fo/nawpr4q6i/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#EBB1D6",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#FFBBE6",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675433162"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"662\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/f6e1d8477bc3cbdf34c0868702acf73c/tumblr_pfznokAOEf1s3ci1e_540.jpg\" data-orig-height=\"662\" data-orig-width=\"750\" alt=\"image\"></figure></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f6e1d8477bc3cbdf34c0868702acf73c/tumblr_pfznokAOEf1s3ci1e_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "dnpsuck",
        "blog": {
            "name": "dnpsuck",
            "title": "like ACTUAL soulmates",
            "description": "<center><b><a href=http://dnpsuck.tumblr.com/about> Lola</b></a>. 22. Brazil. she/her;<br>Britney Spears stan first, human second.<br>Sometimes I make <a href=http://dnpsuck.tumblr.com/tagged/gif*>gifs</a>!<br><br>[<a href=http://ko-fi.com/dnpsuck>ko-fi</a>]",
            "url": "https://dnpsuck.tumblr.com/",
            "uuid": "t:llCoVwXbfxPaU0ILFXnfeQ",
            "updated": 1561749943
        },
        "id": 178675258920,
        "post_url": "https://dnpsuck.tumblr.com/post/178675258920/dan-festive-genies-thats-just-crap",
        "slug": "dan-festive-genies-thats-just-crap",
        "date": "2018-10-02 20:24:56 GMT",
        "timestamp": 1538511896,
        "state": "published",
        "format": "html",
        "reblog_key": "pluygPLy",
        "tags": [
            "amazingphil",
            "phil lester",
            "phan",
            "dan and phil",
            "gif*",
            "gif*phil"
        ],
        "short_url": "https://tmblr.co/ZDT2Iy2cPu1Oe",
        "summary": "DAN: Festive genies? That’s just crap.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 360,
        "caption": "<blockquote><p><small><b>DAN:</b> <i>Festive genies? That’s just crap.</i></small></p></blockquote>",
        "reblog": {
            "comment": "<p><blockquote><p><small><b>DAN:</b> <i>Festive genies? That’s just crap.</i></small></p></blockquote></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "dnpsuck",
                    "active": true,
                    "theme": {
                        "header_full_width": 820,
                        "header_full_height": 312,
                        "header_focus_width": 555,
                        "header_focus_height": 312,
                        "avatar_shape": "square",
                        "background_color": "#f4f4f8",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,687,312,132",
                        "header_image": "https://static.tumblr.com/8f965370eb67645834ec1399a73376b5/wo3guet/YN4pkf6ae/tumblr_static_t914ildugfko8cs8ccksoc00.gif",
                        "header_image_focused": "https://static.tumblr.com/8f965370eb67645834ec1399a73376b5/wo3guet/Qnrpkf6ae/tumblr_static_tumblr_static_t914ildugfko8cs8ccksoc00_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/8f965370eb67645834ec1399a73376b5/wo3guet/YN4pkf6ae/tumblr_static_t914ildugfko8cs8ccksoc00_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#538f1b",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#666666",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675258920"
                },
                "content_raw": "<p><blockquote><p><small><b>DAN:</b> <i>Festive genies? That’s just crap.</i></small></p></blockquote></p>",
                "content": "<p><blockquote><p><small><b>DAN:</b> <i>Festive genies? That&rsquo;s just crap.</i></small></p></blockquote></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "2",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/96e07450a51018435be33b0ae8b4190c/tumblr_pfqwgocblJ1qc8833o1_400.gif",
                    "width": 268,
                    "height": 375
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/96e07450a51018435be33b0ae8b4190c/tumblr_pfqwgocblJ1qc8833o1_400.gif",
                        "width": 268,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/96e07450a51018435be33b0ae8b4190c/tumblr_pfqwgocblJ1qc8833o1_250.gif",
                        "width": 250,
                        "height": 350
                    },
                    {
                        "url": "https://66.media.tumblr.com/96e07450a51018435be33b0ae8b4190c/tumblr_pfqwgocblJ1qc8833o1_100.gif",
                        "width": 100,
                        "height": 140
                    },
                    {
                        "url": "https://66.media.tumblr.com/96e07450a51018435be33b0ae8b4190c/tumblr_pfqwgocblJ1qc8833o1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/5bf95d75b3df49f1d29c999a6477556d/tumblr_pfqwgocblJ1qc8833o2_400.gif",
                    "width": 268,
                    "height": 375
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/5bf95d75b3df49f1d29c999a6477556d/tumblr_pfqwgocblJ1qc8833o2_400.gif",
                        "width": 268,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/5bf95d75b3df49f1d29c999a6477556d/tumblr_pfqwgocblJ1qc8833o2_250.gif",
                        "width": 250,
                        "height": 350
                    },
                    {
                        "url": "https://66.media.tumblr.com/5bf95d75b3df49f1d29c999a6477556d/tumblr_pfqwgocblJ1qc8833o2_100.gif",
                        "width": 100,
                        "height": 140
                    },
                    {
                        "url": "https://66.media.tumblr.com/5bf95d75b3df49f1d29c999a6477556d/tumblr_pfqwgocblJ1qc8833o2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "thereisnobearonthisisland-arc",
        "blog": {
            "name": "thereisnobearonthisisland-arc",
            "title": "@werebothstubborn",
            "description": "<p><a href=\"https://thereisnobearonthisisland.tumblr.com/about\">this is an archive</a></p>",
            "url": "https://thereisnobearonthisisland-arc.tumblr.com/",
            "uuid": "t:xhX0G8R_tIdMQgtgQbXJMg",
            "updated": 1553889192
        },
        "id": 178675241759,
        "post_url": "https://thereisnobearonthisisland-arc.tumblr.com/post/178675241759/phils-gonna-burrito-dan-in-some-blankets-and-feed",
        "slug": "phils-gonna-burrito-dan-in-some-blankets-and-feed",
        "date": "2018-10-02 20:24:16 GMT",
        "timestamp": 1538511856,
        "state": "published",
        "format": "html",
        "reblog_key": "2QwE1jlf",
        "tags": [
            "phan",
            "dnp",
            "phan insta stories",
            "phil !!!!",
            "comfort your bf !!!!!"
        ],
        "short_url": "https://tmblr.co/Z_sUec2cPtzCV",
        "summary": "phil’s gonna burrito dan in some blankets and feed him pizza from his own goddamn hands, sorry i don’t make the rules",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 557,
        "title": null,
        "body": "<p>phil’s gonna burrito dan in some blankets and feed him pizza from his own goddamn hands, sorry i don’t make the rules</p>",
        "reblog": {
            "comment": "<p>phil’s gonna burrito dan in some blankets and feed him pizza from his own goddamn hands, sorry i don’t make the rules</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thereisnobearonthisisland-arc",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 886,
                        "header_focus_width": 1280,
                        "header_focus_height": 720,
                        "avatar_shape": "square",
                        "background_color": "#B2B0AE",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "108,1280,828,0",
                        "header_image": "https://static.tumblr.com/afa1fc8ed6a137bee21a9f3bd06245b7/bjcyuuy/sbqpjrb7f/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/a151c81cbdfc83d594d03319bf21ba18/bjcyuuy/W7hpjrb7h/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/afa1fc8ed6a137bee21a9f3bd06245b7/bjcyuuy/sbqpjrb7f/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#780025",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Pratt Pro",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675241759"
                },
                "content_raw": "<p>phil’s gonna burrito dan in some blankets and feed him pizza from his own goddamn hands, sorry i don’t make the rules</p>",
                "content": "<p>phil&rsquo;s gonna burrito dan in some blankets and feed him pizza from his own goddamn hands, sorry i don&rsquo;t make the rules</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "dailydnp",
        "blog": {
            "name": "dailydnp",
            "title": "dan and phil updates",
            "description": "<a href=\"http://dailydnp.tumblr.com/aboutme\">olivia</a>, eighteen\n<p>\n\n\n<p> daily posts and <a href=\"http://dailydnp.tumblr.com/tagged/mine\">updates</a>\n<p> about dan and phil\n<p> -<p>\n\ni track #dailydnp if you want me <p> to see/reblog anything\n\n<p>",
            "url": "https://dailydnp.tumblr.com/",
            "uuid": "t:CzIppMJE3x8UAVrRSPeCsA",
            "updated": 1561752029
        },
        "id": 178675181633,
        "post_url": "https://dailydnp.tumblr.com/post/178675181633/danielhowell-via-instagram-story-021018",
        "slug": "danielhowell-via-instagram-story-021018",
        "date": "2018-10-02 20:21:59 GMT",
        "timestamp": 1538511719,
        "state": "published",
        "format": "html",
        "reblog_key": "ijcwNi76",
        "tags": [
            "daniel howell",
            "danisnotonfire",
            "amazingphil",
            "dan and phil",
            "phan",
            "mine",
            "insta story"
        ],
        "short_url": "https://tmblr.co/ZPpDZc2cPtkX1",
        "summary": "danielhowell via instagram story 02/10/18",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 70,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"360\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m.mp4\",\"type\":\"video/mp4\",\"width\":360,\"height\":640},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":360,\"height\":640}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m.mp4\" type=\"video/mp4\"></source></video></figure><p>danielhowell via instagram story 02/10/18</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"360\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m.mp4\",\"type\":\"video/mp4\",\"width\":360,\"height\":640},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":360,\"height\":640}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m.mp4\" type=\"video/mp4\"></source></video></figure><p>danielhowell via instagram story 02/10/18</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "dailydnp",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 914,
                        "header_focus_width": 1280,
                        "header_focus_height": 720,
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "36,1280,756,0",
                        "header_image": "https://static.tumblr.com/ac1f04ec1db369b9371b258f1d285876/u6cm2fo/nawpr4q6i/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/18e9c8a7edc2e5431371a525d807f12a/u6cm2fo/3hhpr6z95/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/ac1f04ec1db369b9371b258f1d285876/u6cm2fo/nawpr4q6i/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#EBB1D6",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#FFBBE6",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675181633"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"360\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m.mp4\",\"type\":\"video/mp4\",\"width\":360,\"height\":640},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":360,\"height\":640}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m.mp4\" type=\"video/mp4\"></source></video></figure><p>danielhowell via instagram story 02/10/18</p></p>",
                "content": "<p><figure class=\"tmblr-full\" data-npf=\"{&quot;type&quot;:&quot;video&quot;,&quot;provider&quot;:&quot;tumblr&quot;,&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m.mp4&quot;,&quot;media&quot;:{&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m.mp4&quot;,&quot;type&quot;:&quot;video/mp4&quot;,&quot;width&quot;:360,&quot;height&quot;:640},&quot;poster&quot;:[{&quot;url&quot;:&quot;https://66.media.tumblr.com/tumblr_pfzn64B0pd1wdnf0m_frame1.jpg&quot;,&quot;type&quot;:&quot;image/jpeg&quot;,&quot;width&quot;:360,&quot;height&quot;:640}]}\"></figure><p>danielhowell via instagram story 02/10/18</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "phloridas",
        "blog": {
            "name": "phloridas",
            "title": "dnp pay my loans challenge",
            "description": "<p><a href=\"https://phloridas.tumblr.com/about\">+claire</a>; 22, she/her</p><p>“if you write, you can turn your lessons into your legacy” - t.s.</p><p>icon and header by the lovely <a href=\"https://yiffandquiff.tumblr.com\">alexis</a>! </p><p>—</p><p><a href=\"https://archiveofourown.org/users/phloridas\">[ ao3 ]</a> | <a href=\"https://phloridas.tumblr.com/fics\">fics</a></p><p><a href=\"https://whenthenightends.tumblr.com\">ts blog</a> | <a href=\"https://semiautonatic.tumblr.com\">tøp blog</a> | <a href=\"https://theharryagenda.tumblr.com\">1d blog</a></p><p>—</p><p><a href=\"https://ko-fi.com/phloridas\">my ko-fi</a></p>",
            "url": "https://phloridas.tumblr.com/",
            "uuid": "t:k1iSwdsKXLCI3ww03ZTF0g",
            "updated": 1561759955
        },
        "id": 178675178636,
        "post_url": "https://phloridas.tumblr.com/post/178675178636/dan-clearly-has-enough-pizza-for-two-people-and",
        "slug": "dan-clearly-has-enough-pizza-for-two-people-and",
        "date": "2018-10-02 20:21:52 GMT",
        "timestamp": 1538511712,
        "state": "published",
        "format": "html",
        "reblog_key": "91oX00JI",
        "tags": [
            "phan",
            "dan and phil",
            "claire’s commentary",
            "was phloridas"
        ],
        "short_url": "https://tmblr.co/ZNdUor2cPtjoC",
        "summary": "dan clearly has enough pizza for two people and what no i’m totally not crying at the subtle domesticity of that what are you...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 124,
        "title": null,
        "body": "<p>dan clearly has enough pizza for two people and what no i’m totally not crying at the subtle domesticity of that what are you talking about I’M JUST SO SOFT FOR THEM ALRIGHT</p>",
        "reblog": {
            "comment": "<p>dan clearly has enough pizza for two people and what no i’m totally not crying at the subtle domesticity of that what are you talking about I’M JUST SO SOFT FOR THEM ALRIGHT</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "phloridas",
                    "active": true,
                    "theme": {
                        "header_full_width": 1242,
                        "header_full_height": 746,
                        "header_focus_width": 1242,
                        "header_focus_height": 699,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1242,699,0",
                        "header_image": "https://static.tumblr.com/4403fe9512b7b1581be5e37d66283de4/itfj18g/0xLpt9uwq/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/57351c6cc68bf41e1d1aeaa4cf6ee5e2/itfj18g/ieVpt9uwr/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/4403fe9512b7b1581be5e37d66283de4/itfj18g/0xLpt9uwq/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#002BFF",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#2531C4",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675178636"
                },
                "content_raw": "<p>dan clearly has enough pizza for two people and what no i’m totally not crying at the subtle domesticity of that what are you talking about I’M JUST SO SOFT FOR THEM ALRIGHT</p>",
                "content": "<p>dan clearly has enough pizza for two people and what no i&rsquo;m totally not crying at the subtle domesticity of that what are you talking about I&rsquo;M JUST SO SOFT FOR THEM ALRIGHT</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "philsgaypillow",
        "blog": {
            "name": "philsgaypillow",
            "title": "a gay piece of home",
            "description": "abbie|19|hufflepuff|she/her|👩🏻‍🎨<a href=\"https://www.redbubble.com/people/philsfavpillow?asc=u\"> my art </a>👩🏻‍🎨 <a href=\"https://www.gofundme.com/eleanor-needs-vaccinations\"> eleanor </a>.🌸🌿header by <a href=\"https://lemonheadlester.tumblr.com/\">lemonheadlester</a>🌿🌸",
            "url": "https://philsgaypillow.tumblr.com/",
            "uuid": "t:LJqE-W38sSlnY9Ug1lP-Xw",
            "updated": 1561751193
        },
        "id": 178675152403,
        "post_url": "https://philsgaypillow.tumblr.com/post/178675152403/inktober-dan-and-phil-addition-day-two-angel",
        "slug": "inktober-dan-and-phil-addition-day-two-angel",
        "date": "2018-10-02 20:20:48 GMT",
        "timestamp": 1538511648,
        "state": "published",
        "format": "html",
        "reblog_key": "roiyfECs",
        "tags": [
            "dan and phil",
            "phan",
            "spooky phan art",
            "abbie's phan art",
            "phan art"
        ],
        "short_url": "https://tmblr.co/ZmKzJZ2cPtdOJ",
        "summary": "Inktober Dan and Phil addition day two: Angel",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 3,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Inktober Dan and Phil addition day two:</b> Angel</p><figure class=\"tmblr-full\" data-orig-height=\"1440\" data-orig-width=\"1765\"><img src=\"https://66.media.tumblr.com/c2d36adfedea25db95cc21499105b6e7/tumblr_pfzn6nrkXa1v3n2m0_540.jpg\" data-orig-height=\"1440\" data-orig-width=\"1765\"/></figure>",
        "reblog": {
            "comment": "<p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Inktober Dan and Phil addition day two:</b> Angel</p><figure class=\"tmblr-full\" data-orig-height=\"1440\" data-orig-width=\"1765\"><img src=\"https://66.media.tumblr.com/c2d36adfedea25db95cc21499105b6e7/tumblr_pfzn6nrkXa1v3n2m0_540.jpg\" data-orig-height=\"1440\" data-orig-width=\"1765\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "philsgaypillow",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/eee494be4dd6cb055a7815ca9b15eaf3/objc245/ujgpm6beq/tumblr_static_-518407589-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/eee494be4dd6cb055a7815ca9b15eaf3/objc245/ujgpm6beq/tumblr_static_-518407589-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/eee494be4dd6cb055a7815ca9b15eaf3/objc245/ujgpm6beq/tumblr_static_-518407589-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#F3D2CC",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#B8E2CD",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675152403"
                },
                "content_raw": "<p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Inktober Dan and Phil addition day two:</b> Angel</p><figure class=\"tmblr-full\" data-orig-height=\"1440\" data-orig-width=\"1765\"><img src=\"https://66.media.tumblr.com/c2d36adfedea25db95cc21499105b6e7/tumblr_pfzn6nrkXa1v3n2m0_540.jpg\" data-orig-height=\"1440\" data-orig-width=\"1765\"></figure></p>",
                "content": "<p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Inktober Dan and Phil addition day two:</b> Angel</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c2d36adfedea25db95cc21499105b6e7/tumblr_pfzn6nrkXa1v3n2m0_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "dip-the-pip",
        "blog": {
            "name": "dip-the-pip",
            "title": "Procrastination Station",
            "description": "<p>never take me seriously. just don’t. </p><p>19/bi</p>",
            "url": "https://dip-the-pip.tumblr.com/",
            "uuid": "t:7nOEFLLeskWL7s3pSb14xA",
            "updated": 1561759591
        },
        "id": 178675115922,
        "post_url": "https://dip-the-pip.tumblr.com/post/178675115922/i-relate-strongly-to-dans-pizza-story-im-out",
        "slug": "i-relate-strongly-to-dans-pizza-story-im-out",
        "date": "2018-10-02 20:19:26 GMT",
        "timestamp": 1538511566,
        "state": "published",
        "format": "html",
        "reblog_key": "N36H0vW8",
        "tags": [
            "krispeaks",
            "dan and phil",
            "dan howell",
            "phan",
            "phil lester"
        ],
        "short_url": "https://tmblr.co/Z9Ednk2cPtUUI",
        "summary": "I relate strongly to Dan’s pizza story\nI’m out right now getting pizza to fill the Void with cheesy goodness",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 85,
        "title": null,
        "body": "<p>I relate strongly to Dan’s pizza story</p><p>I’m out right now getting pizza to fill the Void with cheesy goodness </p>",
        "reblog": {
            "comment": "<p>I relate strongly to Dan’s pizza story</p><p>I’m out right now getting pizza to fill the Void with cheesy goodness </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "dip-the-pip",
                    "active": true,
                    "theme": {
                        "header_full_width": 3000,
                        "header_full_height": 1055,
                        "header_focus_width": 1798,
                        "header_focus_height": 1012,
                        "avatar_shape": "square",
                        "background_color": "#6cddcf",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "43,2543,1055,745",
                        "header_image": "https://static.tumblr.com/6f33dccb4d0231045d8b0f3a8ce3e9d5/pmhdyfy/ioppnq6my/tumblr_static_3c3xphhj1yw444kg8kccsww4g.jpg",
                        "header_image_focused": "https://static.tumblr.com/ccc8ddae3b4aeef277fd1673abd64956/pmhdyfy/Vjxpnq6n1/tumblr_static_tumblr_static_3c3xphhj1yw444kg8kccsww4g_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/6f33dccb4d0231045d8b0f3a8ce3e9d5/pmhdyfy/ioppnq6my/tumblr_static_3c3xphhj1yw444kg8kccsww4g_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#3a3d65",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675115922"
                },
                "content_raw": "<p>I relate strongly to Dan’s pizza story</p><p>I’m out right now getting pizza to fill the Void with cheesy goodness </p>",
                "content": "<p>I relate strongly to Dan&rsquo;s pizza story</p><p>I&rsquo;m out right now getting pizza to fill the Void with cheesy goodness </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "it-hitsdifferent",
        "blog": {
            "name": "it-hitsdifferent",
            "title": "I guess I'm a phannie",
            "description": "Cass//She/Her",
            "url": "https://it-hitsdifferent.tumblr.com/",
            "uuid": "t:Fk80B6DSk3leyrrXgsO0Gw",
            "updated": 1561758921
        },
        "id": 178675019979,
        "post_url": "https://it-hitsdifferent.tumblr.com/post/178675019979/phil-grow-a-mustache-challenge",
        "slug": "phil-grow-a-mustache-challenge",
        "date": "2018-10-02 20:15:39 GMT",
        "timestamp": 1538511339,
        "state": "published",
        "format": "html",
        "reblog_key": "zADW95YH",
        "tags": [
            "dan and phil",
            "phan",
            "daniel howell",
            "amazingphil"
        ],
        "short_url": "https://tmblr.co/ZFk52e2cPt73B",
        "summary": "phil grow a mustache challenge",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 56,
        "title": null,
        "body": "<p>phil grow a mustache challenge</p>",
        "reblog": {
            "comment": "<p>phil grow a mustache challenge</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "it-hitsdifferent",
                    "active": true,
                    "theme": {
                        "header_full_width": 550,
                        "header_full_height": 229,
                        "header_focus_width": 383,
                        "header_focus_height": 229,
                        "avatar_shape": "square",
                        "background_color": "#040404",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,478,229,95",
                        "header_image": "https://static.tumblr.com/f9363ef2062e1e9d5729ad316c1a6a2f/yagkgpk/9BFprj2a5/tumblr_static_elgza2miu94os8gc40ow8kgsc.jpg",
                        "header_image_focused": "https://static.tumblr.com/4a606b198a19c78f9659ae92f487a9cd/yagkgpk/dxOpt7be0/tumblr_static_tumblr_static_elgza2miu94os8gc40ow8kgsc_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f9363ef2062e1e9d5729ad316c1a6a2f/yagkgpk/9BFprj2a5/tumblr_static_elgza2miu94os8gc40ow8kgsc_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Sans Serif",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178675019979"
                },
                "content_raw": "<p>phil grow a mustache challenge</p>",
                "content": "<p>phil grow a mustache challenge</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "wickiria",
        "blog": {
            "name": "wickiria",
            "title": "not smart, can't art, full of heart",
            "description": ":) she/her, oc art, multi-fandom, INTPInsta:@wickiria",
            "url": "https://wickiria.tumblr.com/",
            "uuid": "t:Ipi3qiXRL3HGosHlqjBNxA",
            "updated": 1561740739
        },
        "id": 178674558272,
        "post_url": "https://wickiria.tumblr.com/post/178674558272/star-of-the-show-phil-and-sarcastic-stagehand-dan",
        "slug": "star-of-the-show-phil-and-sarcastic-stagehand-dan",
        "date": "2018-10-02 19:58:58 GMT",
        "timestamp": 1538510338,
        "state": "published",
        "format": "html",
        "reblog_key": "9ldlns2D",
        "tags": [
            "dan and phil",
            "phan",
            "phanart",
            "daniel howell",
            "amazingphil",
            "phan au",
            "dnp",
            "dnp art",
            "dan and phil art",
            "myart",
            "theater geek! dan",
            "disney nerds"
        ],
        "short_url": "https://tmblr.co/ZH6Xpa2cPrML0",
        "summary": "Star of the show Phil and sarcastic stagehand Dan both love musicals. But with Phil being the Disney prince of people’s dreams...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 21,
        "caption": "<p>Star of the show Phil and sarcastic stagehand Dan both love musicals. But with Phil being the Disney prince of people’s dreams and Dan with the aesthetic of J.D., they both argue quite often, to the disdain of the school, about whether broadway or disney truly makes the best musicals. anger leads to hate, hate leads to suffering, and suffering leads to a friendship no one saw coming.</p><p><br/></p><p>aye so this is my submission for <a class=\"tumblelog\" href=\"https://tmblr.co/mBDBWtWzQvZA2YRqscytVWQ\">@dyxnamic-art</a> ‘s contrast challenge. This idea literally came to me at midnight a while back so it might be a bit random welp but you know thats how it is.</p><p>also loosly based of thomas sander’s video, The Dark Side of Disney. Thats where the quotes from anyways</p><p>ok thats it bye</p>",
        "reblog": {
            "comment": "<p>Star of the show Phil and sarcastic stagehand Dan both love musicals. But with Phil being the Disney prince of people’s dreams and Dan with the aesthetic of J.D., they both argue quite often, to the disdain of the school, about whether broadway or disney truly makes the best musicals. anger leads to hate, hate leads to suffering, and suffering leads to a friendship no one saw coming.</p><p><br></p><p>aye so this is my submission for <a class=\"tumblelog\" href=\"https://tmblr.co/mBDBWtWzQvZA2YRqscytVWQ\">@dyxnamic-art</a> ‘s contrast challenge. This idea literally came to me at midnight a while back so it might be a bit random welp but you know thats how it is.</p><p>also loosly based of thomas sander’s video, The Dark Side of Disney. Thats where the quotes from anyways</p><p>ok thats it bye</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "wickiria",
                    "active": true,
                    "theme": {
                        "header_full_width": 1000,
                        "header_full_height": 1200,
                        "header_focus_width": 1000,
                        "header_focus_height": 563,
                        "avatar_shape": "square",
                        "background_color": "#dccbe7",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "318,1000,881,0",
                        "header_image": "https://static.tumblr.com/be42d8467f60339c86d9d74dce0024f6/owomz4c/khJpjugsn/tumblr_static_d716pxkexr4kwo0kgccsgck4k.jpg",
                        "header_image_focused": "https://static.tumblr.com/535a0ec2745da2879cc619b8597dd146/owomz4c/DvIpq9xln/tumblr_static_tumblr_static_d716pxkexr4kwo0kgccsgck4k_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_02_focused_v3.png?_v=b976ee00195b1b7806c94ae285ca46a7",
                        "header_stretch": true,
                        "link_color": "#43324e",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#211927",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "178674558272"
                },
                "content_raw": "<p>Star of the show Phil and sarcastic stagehand Dan both love musicals. But with Phil being the Disney prince of people’s dreams and Dan with the aesthetic of J.D., they both argue quite often, to the disdain of the school, about whether broadway or disney truly makes the best musicals. anger leads to hate, hate leads to suffering, and suffering leads to a friendship no one saw coming.</p><p><br></p><p>aye so this is my submission for <a class=\"tumblelog\" href=\"https://tmblr.co/mBDBWtWzQvZA2YRqscytVWQ\">@dyxnamic-art</a> ‘s contrast challenge. This idea literally came to me at midnight a while back so it might be a bit random welp but you know thats how it is.</p><p>also loosly based of thomas sander’s video, The Dark Side of Disney. Thats where the quotes from anyways</p><p>ok thats it bye</p>",
                "content": "<p>Star of the show Phil and sarcastic stagehand Dan both love musicals. But with Phil being the Disney prince of people&rsquo;s dreams and Dan with the aesthetic of J.D., they both argue quite often, to the disdain of the school, about whether broadway or disney truly makes the best musicals. anger leads to hate, hate leads to suffering, and suffering leads to a friendship no one saw coming.</p><p><br /></p><p>aye so this is my submission for <a href=\"https://tmblr.co/mBDBWtWzQvZA2YRqscytVWQ\">@dyxnamic-art</a>&nbsp;&lsquo;s contrast challenge. This idea literally came to me at midnight a while back so it might be a bit random welp but you know thats how it is.</p><p>also loosly based of thomas sander&rsquo;s video, The Dark Side of Disney. Thats where the quotes from anyways</p><p>ok thats it bye</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://wickiria.tumblr.com/image/178674558272",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/8f7d0453dde38327cfdb62b1c3c5c5f0/tumblr_pfzm6aE3qd1x7dqteo1_1280.jpg",
                    "width": 1200,
                    "height": 1000
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/8f7d0453dde38327cfdb62b1c3c5c5f0/tumblr_pfzm6aE3qd1x7dqteo1_1280.jpg",
                        "width": 1200,
                        "height": 1000
                    },
                    {
                        "url": "https://66.media.tumblr.com/8f7d0453dde38327cfdb62b1c3c5c5f0/tumblr_pfzm6aE3qd1x7dqteo1_640.jpg",
                        "width": 640,
                        "height": 533
                    },
                    {
                        "url": "https://66.media.tumblr.com/8f7d0453dde38327cfdb62b1c3c5c5f0/tumblr_pfzm6aE3qd1x7dqteo1_540.jpg",
                        "width": 540,
                        "height": 450
                    },
                    {
                        "url": "https://66.media.tumblr.com/8f7d0453dde38327cfdb62b1c3c5c5f0/tumblr_pfzm6aE3qd1x7dqteo1_500.jpg",
                        "width": 500,
                        "height": 417
                    },
                    {
                        "url": "https://66.media.tumblr.com/8f7d0453dde38327cfdb62b1c3c5c5f0/tumblr_pfzm6aE3qd1x7dqteo1_400.jpg",
                        "width": 400,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/8f7d0453dde38327cfdb62b1c3c5c5f0/tumblr_pfzm6aE3qd1x7dqteo1_250.jpg",
                        "width": 250,
                        "height": 208
                    },
                    {
                        "url": "https://66.media.tumblr.com/8f7d0453dde38327cfdb62b1c3c5c5f0/tumblr_pfzm6aE3qd1x7dqteo1_100.jpg",
                        "width": 100,
                        "height": 83
                    },
                    {
                        "url": "https://66.media.tumblr.com/8f7d0453dde38327cfdb62b1c3c5c5f0/tumblr_pfzm6aE3qd1x7dqteo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]