[
    {
        "type": "text",
        "blog_name": "acourtofhopeanddreams",
        "blog": {
            "name": "acourtofhopeanddreams",
            "title": "Enjoy the little things!",
            "description": "Open your heart\nTo the love of the world\nIt only needs one person\nTouching it with \nA word\nA look\nA smile\nA kiss",
            "url": "https://acourtofhopeanddreams.tumblr.com/",
            "uuid": "t:BS7jn3JbIcnDmWP5dKvmaA",
            "updated": 1561404390
        },
        "id": 179528807690,
        "post_url": "https://acourtofhopeanddreams.tumblr.com/post/179528807690/escaping-from-jon-snow",
        "slug": "escaping-from-jon-snow",
        "date": "2018-10-28 20:38:11 GMT",
        "timestamp": 1540759091,
        "state": "published",
        "format": "html",
        "reblog_key": "DnQ9CVCj",
        "tags": [
            "jonsansaweek",
            "jonsansasource",
            "jonsa",
            "jon snow",
            "Sansa Stark",
            "game of thrones",
            "got",
            "got fanfiction",
            "game of thrones fanfiction",
            "sansa stark fanfiction",
            "jon snow fanfiction",
            "day 7: free choice",
            "stalking jack the ripper"
        ],
        "short_url": "https://tmblr.co/Z8dw4y2dCm3KA",
        "summary": "Escaping from Jon Snow",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 18,
        "title": "Escaping from Jon Snow",
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"300\" data-orig-width=\"400\"><img src=\"https://66.media.tumblr.com/7ed3ddb1093912b53672af26962fe859/tumblr_inline_phbt4hSg801qdb55z_1280.gif\" data-orig-height=\"300\" data-orig-width=\"400\"/></figure><p><b>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>&rsquo;s JonSansaWeek Day 7 - Free Choice</b></p><blockquote><p><small>Once upon a time Sansa had sworn to catch Jack the Ripper, but when she discovered that it was her future husband Jon Snow, she decided to save his life. When the overwhelming hunger to kill returned, Sansa started making lists of people who deserved to die but escaped reality. Sansa had a taste of power now. And now Sansa wants more: She wants to kill her own demons.</small></p><p><small><i>Historical AU: I think it can be read as a stand alone, but to enjoy it to the fullest I&rsquo;d say look around in my JonSa tag and go find Part 1: Stalking Jon the Ripper and Part 2: Hunting Jon Snow.</i></small></p><p><small><i>Triggerwarnings: Character death (it&rsquo;s Joffrey, you&rsquo;re gonna love it), the killers as the good guys, some implying of smut and well&hellip;that&rsquo;s? It&rsquo;s a Jack the Ripper story, you know what to expect, right?</i></small></p></blockquote><p>Once upon a time Sansa had sworn to stop the infamous Jack the Ripper before he could kill another victim. Now she was surrounded by newspaper articles and handwritten notes targeting countless of people to a cruel fate by the hands of her husband. And not once had she actually felt guilty about being the judge so Jon could be the executioner.</p><p>When she had traveled to that dark part of London where a young lady like herself shouldn’t be seen, she had wanted to make a difference. She had wanted to show the entire world that women were capable of just as much as any man, that they were just as smart and intelligent, that they were just as talented and gifted. </p><p>It had not worked out exactly like she had planned, with everyone in the world being in awe because a woman, a young lady, had caught the infamous Jack the Ripper where all men had failed, but maybe this was even better. </p><p>For the first time in her entire life she actually had the feeling she had a certain kind of power. And now she had tasted it, she wanted more. </p><p>“Jon?” Sansa looked up from her paperwork and hasty scribbling. </p><p>Sitting in his chair, with his ankle on his knee and the newspaper folded open, Jon seemed like a man like there were so many. Every morning he left early with a briefcase in his hand and wearing a hat covering his dark curls. Each day he spent behind a desk, doing boring paperwork to earn whatever they needed to pay the rent and make themselves comfortable. But with each normal day that passed, the monster inside him grew stronger and stronger. Until his hands trembled when he touched her. Until flames burned in his eyes whenever he looked at her. Until a growl escaped his lips when he kissed her. </p><p>“Yes?” Jon looked up from his newspaper. The frown on his forehead never fully disappeared, but it was deeper than it had been yesterday. </p><!-- more --><p>“I have a new name for you.” Sansa took a deep breath while she stood up from her seat. Her hands shook when she grabbed a couple of articles and handwritten notes and she forced herself to smile when she sat down on the armrest of Jon’s comfortable chair. “His name is Joffrey Baratheon.” She tried to keep her voice steady, but failed slightly. “He has never been officially caught, but I made a list of all the crimes he committed and added what little officially proof there was.”</p><p>Jon put his newspaper on the table in front of him and he took the articles and handwritten notes from her. His eyes scanned the words and even though he probably read as fast as he could, Sansa had the feeling he took hours. </p><p>Her heart was beating in her chest, almost breaking her ribs while hammering against it. Somewhere in the back of her mind she heard a whispering voice that she was slowly passing a point of no return if she would not stop and change direction. But passing the point of no return was exactly what Sansa wanted. </p><p>“You really outdid yourself with this one.” Jon looked up at her, a hint of pride in his eyes and a glimmer of a smile around his lips. “It will be my pleasure to free the world of him tonight.”</p><p>Sansa curled her lips up into a smile and ignored the voice in the back of her mind that warned her not to do it once more. “I want to come with you.” She straightened her back and lifted her chin. “Tonight I want to come with you.”</p><p>“Sansa…” Jon shook his head and widened his eyes. “I know that you love me, even though you know very well what I am and what I’m capable of. But this is something I need to do alone. I don’t want you to see me when I give in to my monster. I don’t want you to see what I look like when I kill.”</p><p>“I don’t want to look.” Sansa took another deep breath and stood up. “I want to be the one to do it. I want to kill Joffrey Baratheon and I want him to know that it was me.”</p><p>Jon reached for her hands and pulled her between his legs. He had read the articles, he had read her hand written notes, he didn’t need to ask and she didn’t need to tell. “Are you sure?” He pressed the palm of his hand to her cheek. “Once you do this and once you go there, there’s no way back. You know that.”</p><p>Sansa nodded. “I know.”</p><p>Jon cocked his head and then he wrapped his arms around Sansa and pressed her to his chest. “You don’t deserve any of this, Sansa Stark. You don’t deserve to be married to a murderer. You don’t deserve feeding him people to kill. You don’t deserve any of this.”</p><p>“You keep saying that.” Sansa stepped back and she placed her hands firmly on his shoulders. “What we do, it’s a good thing. We’re cleansing this world of criminals. We’re freeing women, children and even men from monsters. I deserve to deal with my monsters.”</p><p>Jon closed his eyes and he grabbed her wrists firmly. “Dealing with your monsters like this, it will awaken a monster in you, Sansa.”</p><p>“Will you love me any less when I do, Jon Snow?” Sansa whispered and she grabbed his chin to force Jon to look up at her. She was not afraid of him and had never been, but she was afraid of his answer now. </p><p>“No.” Jon shook his head and he stood up. His arms slid around her waist. There was blood on them, more blood than Sansa could imagine, but still they felt safe and strong. “I will not love you any less.” He brushed her lips with his before he firmly kissed her. There was a certain hunger in his kiss, as if she was not just kissed by the man, but also by the monster. “I will only love you more.” </p><p>Sansa wrapped her arms around his neck and parted her lips to invite his tongue in. Tonight she would add actual blood to the blood that was already on her hands. And instead of feeling guilty about it, instead of regretting it, instead of fearing and dreading it, she was looking forward to it.</p><p>The hours until dawn seemed to last days. The last minutes before the night black darkness covered London, and whatever was hiding in the shadows, seemed to last hours.</p><p>But eventually Jon and Sansa closed the front door of their house and went out for an evening stroll along the Theems and through the parks. They had their arms linked and once in a while they stole a glance or a kiss, like married couples do. Whoever saw them, could never know that they both carried sharp knives in the pockets of their black jackets. Whoever witnessed them, could never suspect that London’s famous killer had not retired, but was only posing as the respectable husband of a respectable lady. And whoever met them, would never have guessed that the respectable lady was eager to awaken her own monster.</p><p>They walked past Joffrey’s house, where he was living with lady Margaery. </p><p>Sansa doubted if Margaery would feel sorry when her husband wouldn’t return from his daily visit to the local bar tonight. Life as a widow was without a doubt much better than living with a man like Joffrey for whom nothing was ever enough. Margaery must know about the little adventures her husband was having every night, in dirty hotel rooms and dark alleys, with women who had no choice but to obey him, knowing that if they would survive it, they would not leave the place unscarred. Maybe Margaery was even afraid that one day Joffrey would find a way to end her life without being suspected of it. </p><p>She would have to fear no longer.</p><p>Sansa and Jon walked further and further. The houses become less and less pretty. The smell became less and less bearable. The people crowding the street became less and less friendly. They stood still in front of a hotel. The weak lights were flickering and even though muffled screams filled the air, nobody seemed to even look or come to anyone’s aid.</p><p>The door screeched when Jon pushed it open. Sansa’s black dress, tightening around her body to accentuate her curves, seemed hopelessly out of place. They weren’t here to stay anyway. </p><p>“I’m here with Miffy Waters, like Lord Baratheon has asked.” Jon curled his fingers around Sansa’s wrist. His sharp nails pierced her skin, but Sansa didn’t scream. </p><p>She looked as helpless as she had felt all those years ago, but this time knowing that she would not walk away bruised and scarred and broken. This time she would walk away with bloodstained clothes and bloodied hands, a smile on her face and the satisfying feeling of revenge tasting sweet on her lips.</p><p>“Room 13. Lord Baratheon is already waiting for you.” The old man nodded towards the hallway. He didn’t seem worried. He didn’t seem concerned. Maybe he deserved to be on the list too. Maybe they could take care of him on their way back.</p><p>The hallway was that dark that is was almost impossible to read the signs and the numbers on the doors. But they halted in front of room 13. The door stood slightly open and without saying a word Jon looked at her one last time before they stepped in.</p><p>The voice in the back of her mind had gone awfully quiet. It had learned already that arguing about this wouldn’t change anything. She had already made up her mind and she would no back down or chicken out. No matter the consequences.</p><p>“Joffrey?” Sansa walked into the room. Her high heels made no sound on the soft tapestry. But she could hear her own heart beating in her ears. </p><p>“Sansa?” Joffrey laid on the bed with his hands folded behind his head. He looked comfortable and at ease and the sadistic smile on his face only brightened when he recognized her. “Who would have thought that you would be behind the name of the most famous hooker in London!” He still thought she was the weak and pathetic girl he had left behind all those years ago.</p><p>But instead of shying away from him, Sansa smiled back. “I’m full of surprises, Joffrey.” She looked at the door when Jon stepped in. “And you picked the perfect place for my biggest surprise ever.”</p><p>Jon closed the door behind him and he folded his hands in front of him while he blocked the only possible route of escape for Joffrey. </p><p>“What are you doing, Sansa?” Joffrey’s voice went three octaves up and his muscles tensed. </p><p>“Have you ever heard of Jack the Ripper?” Sansa placed a hand on Joffrey’s chest and pressed him down on the bed. “And how he’s never been caught?” She straddled him and reached for the knife, striped to her hip. “I took a few lessons from him and he came with me to watch me take my exam.” She didn’t give Joffrey the chance to answer, to realize what was happening and what she would do. She didn’t give him the chance to fight. With one smooth movement she slid Joffrey’s throat and with a satisfied grin on her face she watched the blood seeping from the wound. A few drops fell on her dress, but Sansa focussed on the soundless screams for help on Joffrey’s lips, on the light in his eyes that slowly dimmed, on his hands, clasping the wound as if he could undo the damage by just holding tightly. </p><p>A pleasant tingling in her chest warmed her entire body and soul and once Joffrey was nothing but a body without life a laugh escaped her throat. </p><p>She had thought that making those lists and being the judge gave her power. But that was nothing compared to the power she felt right now.</p><p>“You have no idea how beautiful you look right now.” Jon sat down behind her and wrapped his arms around her. His lips were touching her ear and then he kissed her neck and collarbone. “And you have no idea how much I love you right now.”</p><p>Sansa closed her eyes and cocked her head, taking in the kisses while Jon’s hands wandered over her chest until they found her breasts. “The hotelmanager knows what’s going on here and he just lets it happen. You should kill him.” Sansa whispered while she wrapped an arm around his neck. “And I want to watch you do it.&ldquo;</p>",
        "body_abstract": "\n<figure class=\"tmblr-full\" data-orig-height=\"300\" data-orig-width=\"400\"><img src=\"https://66.media.tumblr.com/7ed3ddb1093912b53672af26962fe859/tumblr_inline_phbt4hSg801qdb55z_1280.gif\" data-orig-height=\"300\" data-orig-width=\"400\"></figure><p><b>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>&rsquo;s JonSansaWeek Day 7 - Free Choice</b></p>\n<blockquote>\n<p><small>Once upon a time Sansa had sworn to catch Jack the Ripper, but when she discovered that it was her future husband Jon Snow, she decided to save his life. When the overwhelming hunger to kill returned, Sansa started making lists of people who deserved to die but escaped reality. Sansa had a taste of power now. And now Sansa wants more: She wants to kill her own demons.</small></p>\n<p><small><i>Historical AU: I think it can be read as a stand alone, but to enjoy it to the fullest I&rsquo;d say look around in my JonSa tag and go find Part 1: Stalking Jon the Ripper and Part 2: Hunting Jon Snow.</i></small></p>\n<p><small><i>Triggerwarnings: Character death (it&rsquo;s Joffrey, you&rsquo;re gonna love it), the killers as the good guys, some implying of smut and well&hellip;that&rsquo;s? It&rsquo;s a Jack the Ripper story, you know what to expect, right?</i></small></p>\n</blockquote>\n<p>Once upon a time Sansa had sworn to stop the infamous Jack the Ripper before he could kill another victim. Now she was surrounded by newspaper articles and handwritten notes targeting countless of people to a cruel fate by the hands of her husband. And not once had she actually felt guilty about being the judge so Jon could be the executioner.</p>\n<p>When she had traveled to that dark part of London where a young lady like herself shouldn&rsquo;t be seen, she had wanted to make a difference. She had wanted to show the entire world that women were capable of just as much as any man, that they were just as smart and intelligent, that they were just as talented and gifted. </p>\n<p>It had not worked out exactly like she had planned, with everyone in the world being in awe because a woman, a young lady, had caught the infamous Jack the Ripper where all men had failed, but maybe this was even better. </p>\n<p>For the first time in her entire life she actually had the feeling she had a certain kind of power. And now she had tasted it, she wanted more. </p>\n<p>&ldquo;Jon?&rdquo; Sansa looked up from her paperwork and hasty scribbling. </p>\n<p>Sitting in his chair, with his ankle on his knee and the newspaper folded open, Jon seemed like a man like there were so many. Every morning he left early with a briefcase in his hand and wearing a hat covering his dark curls. Each day he spent behind a desk, doing boring paperwork to earn whatever they needed to pay the rent and make themselves comfortable. But with each normal day that passed, the monster inside him grew stronger and stronger. Until his hands trembled when he touched her. Until flames burned in his eyes whenever he looked at her. Until a growl escaped his lips when he kissed her. </p>\n<p>&ldquo;Yes?&rdquo; Jon looked up from his newspaper. The frown on his forehead never fully disappeared, but it was deeper than it had been yesterday. </p>\n",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"300\" data-orig-width=\"400\"><img src=\"https://66.media.tumblr.com/7ed3ddb1093912b53672af26962fe859/tumblr_inline_phbt4hSg801qdb55z_1280.gif\" data-orig-height=\"300\" data-orig-width=\"400\"></figure><p><b>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>’s JonSansaWeek Day 7 - Free Choice</b></p><blockquote><p><small>Once upon a time Sansa had sworn to catch Jack the Ripper, but when she discovered that it was her future husband Jon Snow, she decided to save his life. When the overwhelming hunger to kill returned, Sansa started making lists of people who deserved to die but escaped reality. Sansa had a taste of power now. And now Sansa wants more: She wants to kill her own demons.</small></p><p><small><i>Historical AU: I think it can be read as a stand alone, but to enjoy it to the fullest I’d say look around in my JonSa tag and go find Part 1: Stalking Jon the Ripper and Part 2: Hunting Jon Snow.</i></small></p><p><small><i>Triggerwarnings: Character death (it’s Joffrey, you’re gonna love it), the killers as the good guys, some implying of smut and well…that’s? It’s a Jack the Ripper story, you know what to expect, right?</i></small></p></blockquote><p>Once upon a time Sansa had sworn to stop the infamous Jack the Ripper before he could kill another victim. Now she was surrounded by newspaper articles and handwritten notes targeting countless of people to a cruel fate by the hands of her husband. And not once had she actually felt guilty about being the judge so Jon could be the executioner.</p><p>When she had traveled to that dark part of London where a young lady like herself shouldn’t be seen, she had wanted to make a difference. She had wanted to show the entire world that women were capable of just as much as any man, that they were just as smart and intelligent, that they were just as talented and gifted. </p><p>It had not worked out exactly like she had planned, with everyone in the world being in awe because a woman, a young lady, had caught the infamous Jack the Ripper where all men had failed, but maybe this was even better. </p><p>For the first time in her entire life she actually had the feeling she had a certain kind of power. And now she had tasted it, she wanted more. </p><p>“Jon?” Sansa looked up from her paperwork and hasty scribbling. </p><p>Sitting in his chair, with his ankle on his knee and the newspaper folded open, Jon seemed like a man like there were so many. Every morning he left early with a briefcase in his hand and wearing a hat covering his dark curls. Each day he spent behind a desk, doing boring paperwork to earn whatever they needed to pay the rent and make themselves comfortable. But with each normal day that passed, the monster inside him grew stronger and stronger. Until his hands trembled when he touched her. Until flames burned in his eyes whenever he looked at her. Until a growl escaped his lips when he kissed her. </p><p>“Yes?” Jon looked up from his newspaper. The frown on his forehead never fully disappeared, but it was deeper than it had been yesterday. </p>[[MORE]]<p>“I have a new name for you.” Sansa took a deep breath while she stood up from her seat. Her hands shook when she grabbed a couple of articles and handwritten notes and she forced herself to smile when she sat down on the armrest of Jon’s comfortable chair. “His name is Joffrey Baratheon.” She tried to keep her voice steady, but failed slightly. “He has never been officially caught, but I made a list of all the crimes he committed and added what little officially proof there was.”</p><p>Jon put his newspaper on the table in front of him and he took the articles and handwritten notes from her. His eyes scanned the words and even though he probably read as fast as he could, Sansa had the feeling he took hours. </p><p>Her heart was beating in her chest, almost breaking her ribs while hammering against it. Somewhere in the back of her mind she heard a whispering voice that she was slowly passing a point of no return if she would not stop and change direction. But passing the point of no return was exactly what Sansa wanted. </p><p>“You really outdid yourself with this one.” Jon looked up at her, a hint of pride in his eyes and a glimmer of a smile around his lips. “It will be my pleasure to free the world of him tonight.”</p><p>Sansa curled her lips up into a smile and ignored the voice in the back of her mind that warned her not to do it once more. “I want to come with you.” She straightened her back and lifted her chin. “Tonight I want to come with you.”</p><p>“Sansa…” Jon shook his head and widened his eyes. “I know that you love me, even though you know very well what I am and what I’m capable of. But this is something I need to do alone. I don’t want you to see me when I give in to my monster. I don’t want you to see what I look like when I kill.”</p><p>“I don’t want to look.” Sansa took another deep breath and stood up. “I want to be the one to do it. I want to kill Joffrey Baratheon and I want him to know that it was me.”</p><p>Jon reached for her hands and pulled her between his legs. He had read the articles, he had read her hand written notes, he didn’t need to ask and she didn’t need to tell. “Are you sure?” He pressed the palm of his hand to her cheek. “Once you do this and once you go there, there’s no way back. You know that.”</p><p>Sansa nodded. “I know.”</p><p>Jon cocked his head and then he wrapped his arms around Sansa and pressed her to his chest. “You don’t deserve any of this, Sansa Stark. You don’t deserve to be married to a murderer. You don’t deserve feeding him people to kill. You don’t deserve any of this.”</p><p>“You keep saying that.” Sansa stepped back and she placed her hands firmly on his shoulders. “What we do, it’s a good thing. We’re cleansing this world of criminals. We’re freeing women, children and even men from monsters. I deserve to deal with my monsters.”</p><p>Jon closed his eyes and he grabbed her wrists firmly. “Dealing with your monsters like this, it will awaken a monster in you, Sansa.”</p><p>“Will you love me any less when I do, Jon Snow?” Sansa whispered and she grabbed his chin to force Jon to look up at her. She was not afraid of him and had never been, but she was afraid of his answer now. </p><p>“No.” Jon shook his head and he stood up. His arms slid around her waist. There was blood on them, more blood than Sansa could imagine, but still they felt safe and strong. “I will not love you any less.” He brushed her lips with his before he firmly kissed her. There was a certain hunger in his kiss, as if she was not just kissed by the man, but also by the monster. “I will only love you more.” </p><p>Sansa wrapped her arms around his neck and parted her lips to invite his tongue in. Tonight she would add actual blood to the blood that was already on her hands. And instead of feeling guilty about it, instead of regretting it, instead of fearing and dreading it, she was looking forward to it.</p><p>The hours until dawn seemed to last days. The last minutes before the night black darkness covered London, and whatever was hiding in the shadows, seemed to last hours.</p><p>But eventually Jon and Sansa closed the front door of their house and went out for an evening stroll along the Theems and through the parks. They had their arms linked and once in a while they stole a glance or a kiss, like married couples do. Whoever saw them, could never know that they both carried sharp knives in the pockets of their black jackets. Whoever witnessed them, could never suspect that London’s famous killer had not retired, but was only posing as the respectable husband of a respectable lady. And whoever met them, would never have guessed that the respectable lady was eager to awaken her own monster.</p><p>They walked past Joffrey’s house, where he was living with lady Margaery. </p><p>Sansa doubted if Margaery would feel sorry when her husband wouldn’t return from his daily visit to the local bar tonight. Life as a widow was without a doubt much better than living with a man like Joffrey for whom nothing was ever enough. Margaery must know about the little adventures her husband was having every night, in dirty hotel rooms and dark alleys, with women who had no choice but to obey him, knowing that if they would survive it, they would not leave the place unscarred. Maybe Margaery was even afraid that one day Joffrey would find a way to end her life without being suspected of it. </p><p>She would have to fear no longer.</p><p>Sansa and Jon walked further and further. The houses become less and less pretty. The smell became less and less bearable. The people crowding the street became less and less friendly. They stood still in front of a hotel. The weak lights were flickering and even though muffled screams filled the air, nobody seemed to even look or come to anyone’s aid.</p><p>The door screeched when Jon pushed it open. Sansa’s black dress, tightening around her body to accentuate her curves, seemed hopelessly out of place. They weren’t here to stay anyway. </p><p>“I’m here with Miffy Waters, like Lord Baratheon has asked.” Jon curled his fingers around Sansa’s wrist. His sharp nails pierced her skin, but Sansa didn’t scream. </p><p>She looked as helpless as she had felt all those years ago, but this time knowing that she would not walk away bruised and scarred and broken. This time she would walk away with bloodstained clothes and bloodied hands, a smile on her face and the satisfying feeling of revenge tasting sweet on her lips.</p><p>“Room 13. Lord Baratheon is already waiting for you.” The old man nodded towards the hallway. He didn’t seem worried. He didn’t seem concerned. Maybe he deserved to be on the list too. Maybe they could take care of him on their way back.</p><p>The hallway was that dark that is was almost impossible to read the signs and the numbers on the doors. But they halted in front of room 13. The door stood slightly open and without saying a word Jon looked at her one last time before they stepped in.</p><p>The voice in the back of her mind had gone awfully quiet. It had learned already that arguing about this wouldn’t change anything. She had already made up her mind and she would no back down or chicken out. No matter the consequences.</p><p>“Joffrey?” Sansa walked into the room. Her high heels made no sound on the soft tapestry. But she could hear her own heart beating in her ears. </p><p>“Sansa?” Joffrey laid on the bed with his hands folded behind his head. He looked comfortable and at ease and the sadistic smile on his face only brightened when he recognized her. “Who would have thought that you would be behind the name of the most famous hooker in London!” He still thought she was the weak and pathetic girl he had left behind all those years ago.</p><p>But instead of shying away from him, Sansa smiled back. “I’m full of surprises, Joffrey.” She looked at the door when Jon stepped in. “And you picked the perfect place for my biggest surprise ever.”</p><p>Jon closed the door behind him and he folded his hands in front of him while he blocked the only possible route of escape for Joffrey. </p><p>“What are you doing, Sansa?” Joffrey’s voice went three octaves up and his muscles tensed. </p><p>“Have you ever heard of Jack the Ripper?” Sansa placed a hand on Joffrey’s chest and pressed him down on the bed. “And how he’s never been caught?” She straddled him and reached for the knife, striped to her hip. “I took a few lessons from him and he came with me to watch me take my exam.” She didn’t give Joffrey the chance to answer, to realize what was happening and what she would do. She didn’t give him the chance to fight. With one smooth movement she slid Joffrey’s throat and with a satisfied grin on her face she watched the blood seeping from the wound. A few drops fell on her dress, but Sansa focussed on the soundless screams for help on Joffrey’s lips, on the light in his eyes that slowly dimmed, on his hands, clasping the wound as if he could undo the damage by just holding tightly. </p><p>A pleasant tingling in her chest warmed her entire body and soul and once Joffrey was nothing but a body without life a laugh escaped her throat. </p><p>She had thought that making those lists and being the judge gave her power. But that was nothing compared to the power she felt right now.</p><p>“You have no idea how beautiful you look right now.” Jon sat down behind her and wrapped his arms around her. His lips were touching her ear and then he kissed her neck and collarbone. “And you have no idea how much I love you right now.”</p><p>Sansa closed her eyes and cocked her head, taking in the kisses while Jon’s hands wandered over her chest until they found her breasts. “The hotelmanager knows what’s going on here and he just lets it happen. You should kill him.” Sansa whispered while she wrapped an arm around his neck. “And I want to watch you do it.“</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "acourtofhopeanddreams",
                    "active": true,
                    "theme": {
                        "header_full_width": 600,
                        "header_full_height": 300,
                        "header_focus_width": 533,
                        "header_focus_height": 300,
                        "avatar_shape": "square",
                        "background_color": "#d11d1d",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,566,300,33",
                        "header_image": "https://static.tumblr.com/7782d7a0e4100830708f02baf3f0e357/myrfjlp/iFbpqvvuo/tumblr_static_cq37wlgbuqgcs0w00o4s800o0.gif",
                        "header_image_focused": "https://static.tumblr.com/7782d7a0e4100830708f02baf3f0e357/myrfjlp/i68pqvvus/tumblr_static_tumblr_static_cq37wlgbuqgcs0w00o4s800o0_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/7782d7a0e4100830708f02baf3f0e357/myrfjlp/iFbpqvvuo/tumblr_static_cq37wlgbuqgcs0w00o4s800o0_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#fcb68f",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#fcb68f",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179528807690"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"300\" data-orig-width=\"400\"><img src=\"https://66.media.tumblr.com/7ed3ddb1093912b53672af26962fe859/tumblr_inline_phbt4hSg801qdb55z_1280.gif\" data-orig-height=\"300\" data-orig-width=\"400\"></figure><p><b>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>’s JonSansaWeek Day 7 - Free Choice</b></p><blockquote><p><small>Once upon a time Sansa had sworn to catch Jack the Ripper, but when she discovered that it was her future husband Jon Snow, she decided to save his life. When the overwhelming hunger to kill returned, Sansa started making lists of people who deserved to die but escaped reality. Sansa had a taste of power now. And now Sansa wants more: She wants to kill her own demons.</small></p><p><small><i>Historical AU: I think it can be read as a stand alone, but to enjoy it to the fullest I’d say look around in my JonSa tag and go find Part 1: Stalking Jon the Ripper and Part 2: Hunting Jon Snow.</i></small></p><p><small><i>Triggerwarnings: Character death (it’s Joffrey, you’re gonna love it), the killers as the good guys, some implying of smut and well…that’s? It’s a Jack the Ripper story, you know what to expect, right?</i></small></p></blockquote><p>Once upon a time Sansa had sworn to stop the infamous Jack the Ripper before he could kill another victim. Now she was surrounded by newspaper articles and handwritten notes targeting countless of people to a cruel fate by the hands of her husband. And not once had she actually felt guilty about being the judge so Jon could be the executioner.</p><p>When she had traveled to that dark part of London where a young lady like herself shouldn’t be seen, she had wanted to make a difference. She had wanted to show the entire world that women were capable of just as much as any man, that they were just as smart and intelligent, that they were just as talented and gifted. </p><p>It had not worked out exactly like she had planned, with everyone in the world being in awe because a woman, a young lady, had caught the infamous Jack the Ripper where all men had failed, but maybe this was even better. </p><p>For the first time in her entire life she actually had the feeling she had a certain kind of power. And now she had tasted it, she wanted more. </p><p>“Jon?” Sansa looked up from her paperwork and hasty scribbling. </p><p>Sitting in his chair, with his ankle on his knee and the newspaper folded open, Jon seemed like a man like there were so many. Every morning he left early with a briefcase in his hand and wearing a hat covering his dark curls. Each day he spent behind a desk, doing boring paperwork to earn whatever they needed to pay the rent and make themselves comfortable. But with each normal day that passed, the monster inside him grew stronger and stronger. Until his hands trembled when he touched her. Until flames burned in his eyes whenever he looked at her. Until a growl escaped his lips when he kissed her. </p><p>“Yes?” Jon looked up from his newspaper. The frown on his forehead never fully disappeared, but it was deeper than it had been yesterday. </p>[[MORE]]<p>“I have a new name for you.” Sansa took a deep breath while she stood up from her seat. Her hands shook when she grabbed a couple of articles and handwritten notes and she forced herself to smile when she sat down on the armrest of Jon’s comfortable chair. “His name is Joffrey Baratheon.” She tried to keep her voice steady, but failed slightly. “He has never been officially caught, but I made a list of all the crimes he committed and added what little officially proof there was.”</p><p>Jon put his newspaper on the table in front of him and he took the articles and handwritten notes from her. His eyes scanned the words and even though he probably read as fast as he could, Sansa had the feeling he took hours. </p><p>Her heart was beating in her chest, almost breaking her ribs while hammering against it. Somewhere in the back of her mind she heard a whispering voice that she was slowly passing a point of no return if she would not stop and change direction. But passing the point of no return was exactly what Sansa wanted. </p><p>“You really outdid yourself with this one.” Jon looked up at her, a hint of pride in his eyes and a glimmer of a smile around his lips. “It will be my pleasure to free the world of him tonight.”</p><p>Sansa curled her lips up into a smile and ignored the voice in the back of her mind that warned her not to do it once more. “I want to come with you.” She straightened her back and lifted her chin. “Tonight I want to come with you.”</p><p>“Sansa…” Jon shook his head and widened his eyes. “I know that you love me, even though you know very well what I am and what I’m capable of. But this is something I need to do alone. I don’t want you to see me when I give in to my monster. I don’t want you to see what I look like when I kill.”</p><p>“I don’t want to look.” Sansa took another deep breath and stood up. “I want to be the one to do it. I want to kill Joffrey Baratheon and I want him to know that it was me.”</p><p>Jon reached for her hands and pulled her between his legs. He had read the articles, he had read her hand written notes, he didn’t need to ask and she didn’t need to tell. “Are you sure?” He pressed the palm of his hand to her cheek. “Once you do this and once you go there, there’s no way back. You know that.”</p><p>Sansa nodded. “I know.”</p><p>Jon cocked his head and then he wrapped his arms around Sansa and pressed her to his chest. “You don’t deserve any of this, Sansa Stark. You don’t deserve to be married to a murderer. You don’t deserve feeding him people to kill. You don’t deserve any of this.”</p><p>“You keep saying that.” Sansa stepped back and she placed her hands firmly on his shoulders. “What we do, it’s a good thing. We’re cleansing this world of criminals. We’re freeing women, children and even men from monsters. I deserve to deal with my monsters.”</p><p>Jon closed his eyes and he grabbed her wrists firmly. “Dealing with your monsters like this, it will awaken a monster in you, Sansa.”</p><p>“Will you love me any less when I do, Jon Snow?” Sansa whispered and she grabbed his chin to force Jon to look up at her. She was not afraid of him and had never been, but she was afraid of his answer now. </p><p>“No.” Jon shook his head and he stood up. His arms slid around her waist. There was blood on them, more blood than Sansa could imagine, but still they felt safe and strong. “I will not love you any less.” He brushed her lips with his before he firmly kissed her. There was a certain hunger in his kiss, as if she was not just kissed by the man, but also by the monster. “I will only love you more.” </p><p>Sansa wrapped her arms around his neck and parted her lips to invite his tongue in. Tonight she would add actual blood to the blood that was already on her hands. And instead of feeling guilty about it, instead of regretting it, instead of fearing and dreading it, she was looking forward to it.</p><p>The hours until dawn seemed to last days. The last minutes before the night black darkness covered London, and whatever was hiding in the shadows, seemed to last hours.</p><p>But eventually Jon and Sansa closed the front door of their house and went out for an evening stroll along the Theems and through the parks. They had their arms linked and once in a while they stole a glance or a kiss, like married couples do. Whoever saw them, could never know that they both carried sharp knives in the pockets of their black jackets. Whoever witnessed them, could never suspect that London’s famous killer had not retired, but was only posing as the respectable husband of a respectable lady. And whoever met them, would never have guessed that the respectable lady was eager to awaken her own monster.</p><p>They walked past Joffrey’s house, where he was living with lady Margaery. </p><p>Sansa doubted if Margaery would feel sorry when her husband wouldn’t return from his daily visit to the local bar tonight. Life as a widow was without a doubt much better than living with a man like Joffrey for whom nothing was ever enough. Margaery must know about the little adventures her husband was having every night, in dirty hotel rooms and dark alleys, with women who had no choice but to obey him, knowing that if they would survive it, they would not leave the place unscarred. Maybe Margaery was even afraid that one day Joffrey would find a way to end her life without being suspected of it. </p><p>She would have to fear no longer.</p><p>Sansa and Jon walked further and further. The houses become less and less pretty. The smell became less and less bearable. The people crowding the street became less and less friendly. They stood still in front of a hotel. The weak lights were flickering and even though muffled screams filled the air, nobody seemed to even look or come to anyone’s aid.</p><p>The door screeched when Jon pushed it open. Sansa’s black dress, tightening around her body to accentuate her curves, seemed hopelessly out of place. They weren’t here to stay anyway. </p><p>“I’m here with Miffy Waters, like Lord Baratheon has asked.” Jon curled his fingers around Sansa’s wrist. His sharp nails pierced her skin, but Sansa didn’t scream. </p><p>She looked as helpless as she had felt all those years ago, but this time knowing that she would not walk away bruised and scarred and broken. This time she would walk away with bloodstained clothes and bloodied hands, a smile on her face and the satisfying feeling of revenge tasting sweet on her lips.</p><p>“Room 13. Lord Baratheon is already waiting for you.” The old man nodded towards the hallway. He didn’t seem worried. He didn’t seem concerned. Maybe he deserved to be on the list too. Maybe they could take care of him on their way back.</p><p>The hallway was that dark that is was almost impossible to read the signs and the numbers on the doors. But they halted in front of room 13. The door stood slightly open and without saying a word Jon looked at her one last time before they stepped in.</p><p>The voice in the back of her mind had gone awfully quiet. It had learned already that arguing about this wouldn’t change anything. She had already made up her mind and she would no back down or chicken out. No matter the consequences.</p><p>“Joffrey?” Sansa walked into the room. Her high heels made no sound on the soft tapestry. But she could hear her own heart beating in her ears. </p><p>“Sansa?” Joffrey laid on the bed with his hands folded behind his head. He looked comfortable and at ease and the sadistic smile on his face only brightened when he recognized her. “Who would have thought that you would be behind the name of the most famous hooker in London!” He still thought she was the weak and pathetic girl he had left behind all those years ago.</p><p>But instead of shying away from him, Sansa smiled back. “I’m full of surprises, Joffrey.” She looked at the door when Jon stepped in. “And you picked the perfect place for my biggest surprise ever.”</p><p>Jon closed the door behind him and he folded his hands in front of him while he blocked the only possible route of escape for Joffrey. </p><p>“What are you doing, Sansa?” Joffrey’s voice went three octaves up and his muscles tensed. </p><p>“Have you ever heard of Jack the Ripper?” Sansa placed a hand on Joffrey’s chest and pressed him down on the bed. “And how he’s never been caught?” She straddled him and reached for the knife, striped to her hip. “I took a few lessons from him and he came with me to watch me take my exam.” She didn’t give Joffrey the chance to answer, to realize what was happening and what she would do. She didn’t give him the chance to fight. With one smooth movement she slid Joffrey’s throat and with a satisfied grin on her face she watched the blood seeping from the wound. A few drops fell on her dress, but Sansa focussed on the soundless screams for help on Joffrey’s lips, on the light in his eyes that slowly dimmed, on his hands, clasping the wound as if he could undo the damage by just holding tightly. </p><p>A pleasant tingling in her chest warmed her entire body and soul and once Joffrey was nothing but a body without life a laugh escaped her throat. </p><p>She had thought that making those lists and being the judge gave her power. But that was nothing compared to the power she felt right now.</p><p>“You have no idea how beautiful you look right now.” Jon sat down behind her and wrapped his arms around her. His lips were touching her ear and then he kissed her neck and collarbone. “And you have no idea how much I love you right now.”</p><p>Sansa closed her eyes and cocked her head, taking in the kisses while Jon’s hands wandered over her chest until they found her breasts. “The hotelmanager knows what’s going on here and he just lets it happen. You should kill him.” Sansa whispered while she wrapped an arm around his neck. “And I want to watch you do it.“</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/7ed3ddb1093912b53672af26962fe859/tumblr_inline_phbt4hSg801qdb55z_1280.gif\" class=\"\"/></figure><p><b>Written for <a href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>&rsquo;s JonSansaWeek Day 7 - Free Choice</b></p><blockquote><p><small>Once upon a time Sansa had sworn to catch Jack the Ripper, but when she discovered that it was her future husband Jon Snow, she decided to save his life. When the overwhelming hunger to kill returned, Sansa started making lists of people who deserved to die but escaped reality. Sansa had a taste of power now. And now Sansa wants more: She wants to kill her own demons.</small></p><p><small><i>Historical AU: I think it can be read as a stand alone, but to enjoy it to the fullest I&rsquo;d say look around in my JonSa tag and go find Part 1: Stalking Jon the Ripper and Part 2: Hunting Jon Snow.</i></small></p><p><small><i>Triggerwarnings: Character death (it&rsquo;s Joffrey, you&rsquo;re gonna love it), the killers as the good guys, some implying of smut and well&hellip;that&rsquo;s? It&rsquo;s a Jack the Ripper story, you know what to expect, right?</i></small></p></blockquote><p>Once upon a time Sansa had sworn to stop the infamous Jack the Ripper before he could kill another victim. Now she was surrounded by newspaper articles and handwritten notes targeting countless of people to a cruel fate by the hands of her husband. And not once had she actually felt guilty about being the judge so Jon could be the executioner.</p><p>When she had traveled to that dark part of London where a young lady like herself shouldn&rsquo;t be seen, she had wanted to make a difference. She had wanted to show the entire world that women were capable of just as much as any man, that they were just as smart and intelligent, that they were just as talented and gifted. </p><p>It had not worked out exactly like she had planned, with everyone in the world being in awe because a woman, a young lady, had caught the infamous Jack the Ripper where all men had failed, but maybe this was even better. </p><p>For the first time in her entire life she actually had the feeling she had a certain kind of power. And now she had tasted it, she wanted more. </p><p>&ldquo;Jon?&rdquo; Sansa looked up from her paperwork and hasty scribbling. </p><p>Sitting in his chair, with his ankle on his knee and the newspaper folded open, Jon seemed like a man like there were so many. Every morning he left early with a briefcase in his hand and wearing a hat covering his dark curls. Each day he spent behind a desk, doing boring paperwork to earn whatever they needed to pay the rent and make themselves comfortable. But with each normal day that passed, the monster inside him grew stronger and stronger. Until his hands trembled when he touched her. Until flames burned in his eyes whenever he looked at her. Until a growl escaped his lips when he kissed her. </p><p>&ldquo;Yes?&rdquo; Jon looked up from his newspaper. The frown on his forehead never fully disappeared, but it was deeper than it had been yesterday. </p><p>&ldquo;I have a new name for you.&rdquo; Sansa took a deep breath while she stood up from her seat. Her hands shook when she grabbed a couple of articles and handwritten notes and she forced herself to smile when she sat down on the armrest of Jon&rsquo;s comfortable chair. &ldquo;His name is Joffrey Baratheon.&rdquo; She tried to keep her voice steady, but failed slightly. &ldquo;He has never been officially caught, but I made a list of all the crimes he committed and added what little officially proof there was.&rdquo;</p><p>Jon put his newspaper on the table in front of him and he took the articles and handwritten notes from her. His eyes scanned the words and even though he probably read as fast as he could, Sansa had the feeling he took hours. </p><p>Her heart was beating in her chest, almost breaking her ribs while hammering against it. Somewhere in the back of her mind she heard a whispering voice that she was slowly passing a point of no return if she would not stop and change direction. But passing the point of no return was exactly what Sansa wanted. </p><p>&ldquo;You really outdid yourself with this one.&rdquo; Jon looked up at her, a hint of pride in his eyes and a glimmer of a smile around his lips. &ldquo;It will be my pleasure to free the world of him tonight.&rdquo;</p><p>Sansa curled her lips up into a smile and ignored the voice in the back of her mind that warned her not to do it once more. &ldquo;I want to come with you.&rdquo; She straightened her back and lifted her chin. &ldquo;Tonight I want to come with you.&rdquo;</p><p>&ldquo;Sansa&hellip;&rdquo; Jon shook his head and widened his eyes. &ldquo;I know that you love me, even though you know very well what I am and what I&rsquo;m capable of. But this is something I need to do alone. I don&rsquo;t want you to see me when I give in to my monster. I don&rsquo;t want you to see what I look like when I kill.&rdquo;</p><p>&ldquo;I don&rsquo;t want to look.&rdquo; Sansa took another deep breath and stood up. &ldquo;I want to be the one to do it. I want to kill Joffrey Baratheon and I want him to know that it was me.&rdquo;</p><p>Jon reached for her hands and pulled her between his legs. He had read the articles, he had read her hand written notes, he didn&rsquo;t need to ask and she didn&rsquo;t need to tell. &ldquo;Are you sure?&rdquo; He pressed the palm of his hand to her cheek. &ldquo;Once you do this and once you go there, there&rsquo;s no way back. You know that.&rdquo;</p><p>Sansa nodded. &ldquo;I know.&rdquo;</p><p>Jon cocked his head and then he wrapped his arms around Sansa and pressed her to his chest. &ldquo;You don&rsquo;t deserve any of this, Sansa Stark. You don&rsquo;t deserve to be married to a murderer. You don&rsquo;t deserve feeding him people to kill. You don&rsquo;t deserve any of this.&rdquo;</p><p>&ldquo;You keep saying that.&rdquo; Sansa stepped back and she placed her hands firmly on his shoulders. &ldquo;What we do, it&rsquo;s a good thing. We&rsquo;re cleansing this world of criminals. We&rsquo;re freeing women, children and even men from monsters. I deserve to deal with my monsters.&rdquo;</p><p>Jon closed his eyes and he grabbed her wrists firmly. &ldquo;Dealing with your monsters like this, it will awaken a monster in you, Sansa.&rdquo;</p><p>&ldquo;Will you love me any less when I do, Jon Snow?&rdquo; Sansa whispered and she grabbed his chin to force Jon to look up at her. She was not afraid of him and had never been, but she was afraid of his answer now. </p><p>&ldquo;No.&rdquo; Jon shook his head and he stood up. His arms slid around her waist. There was blood on them, more blood than Sansa could imagine, but still they felt safe and strong. &ldquo;I will not love you any less.&rdquo; He brushed her lips with his before he firmly kissed her. There was a certain hunger in his kiss, as if she was not just kissed by the man, but also by the monster. &ldquo;I will only love you more.&rdquo; </p><p>Sansa wrapped her arms around his neck and parted her lips to invite his tongue in. Tonight she would add actual blood to the blood that was already on her hands. And instead of feeling guilty about it, instead of regretting it, instead of fearing and dreading it, she was looking forward to it.</p><p>The hours until dawn seemed to last days. The last minutes before the night black darkness covered London, and whatever was hiding in the shadows, seemed to last hours.</p><p>But eventually Jon and Sansa closed the front door of their house and went out for an evening stroll along the Theems and through the parks. They had their arms linked and once in a while they stole a glance or a kiss, like married couples do. Whoever saw them, could never know that they both carried sharp knives in the pockets of their black jackets. Whoever witnessed them, could never suspect that London&rsquo;s famous killer had not retired, but was only posing as the respectable husband of a respectable lady. And whoever met them, would never have guessed that the respectable lady was eager to awaken her own monster.</p><p>They walked past Joffrey&rsquo;s house, where he was living with lady Margaery. </p><p>Sansa doubted if Margaery would feel sorry when her husband wouldn&rsquo;t return from his daily visit to the local bar tonight. Life as a widow was without a doubt much better than living with a man like Joffrey for whom nothing was ever enough. Margaery must know about the little adventures her husband was having every night, in dirty hotel rooms and dark alleys, with women who had no choice but to obey him, knowing that if they would survive it, they would not leave the place unscarred. Maybe Margaery was even afraid that one day Joffrey would find a way to end her life without being suspected of it. </p><p>She would have to fear no longer.</p><p>Sansa and Jon walked further and further. The houses become less and less pretty. The smell became less and less bearable. The people crowding the street became less and less friendly. They stood still in front of a hotel. The weak lights were flickering and even though muffled screams filled the air, nobody seemed to even look or come to anyone&rsquo;s aid.</p><p>The door screeched when Jon pushed it open. Sansa&rsquo;s black dress, tightening around her body to accentuate her curves, seemed hopelessly out of place. They weren&rsquo;t here to stay anyway. </p><p>&ldquo;I&rsquo;m here with Miffy Waters, like Lord Baratheon has asked.&rdquo; Jon curled his fingers around Sansa&rsquo;s wrist. His sharp nails pierced her skin, but Sansa didn&rsquo;t scream. </p><p>She looked as helpless as she had felt all those years ago, but this time knowing that she would not walk away bruised and scarred and broken. This time she would walk away with bloodstained clothes and bloodied hands, a smile on her face and the satisfying feeling of revenge tasting sweet on her lips.</p><p>&ldquo;Room 13. Lord Baratheon is already waiting for you.&rdquo; The old man nodded towards the hallway. He didn&rsquo;t seem worried. He didn&rsquo;t seem concerned. Maybe he deserved to be on the list too. Maybe they could take care of him on their way back.</p><p>The hallway was that dark that is was almost impossible to read the signs and the numbers on the doors. But they halted in front of room 13. The door stood slightly open and without saying a word Jon looked at her one last time before they stepped in.</p><p>The voice in the back of her mind had gone awfully quiet. It had learned already that arguing about this wouldn&rsquo;t change anything. She had already made up her mind and she would no back down or chicken out. No matter the consequences.</p><p>&ldquo;Joffrey?&rdquo; Sansa walked into the room. Her high heels made no sound on the soft tapestry. But she could hear her own heart beating in her ears. </p><p>&ldquo;Sansa?&rdquo; Joffrey laid on the bed with his hands folded behind his head. He looked comfortable and at ease and the sadistic smile on his face only brightened when he recognized her. &ldquo;Who would have thought that you would be behind the name of the most famous hooker in London!&rdquo; He still thought she was the weak and pathetic girl he had left behind all those years ago.</p><p>But instead of shying away from him, Sansa smiled back. &ldquo;I&rsquo;m full of surprises, Joffrey.&rdquo; She looked at the door when Jon stepped in. &ldquo;And you picked the perfect place for my biggest surprise ever.&rdquo;</p><p>Jon closed the door behind him and he folded his hands in front of him while he blocked the only possible route of escape for Joffrey. </p><p>&ldquo;What are you doing, Sansa?&rdquo; Joffrey&rsquo;s voice went three octaves up and his muscles tensed. </p><p>&ldquo;Have you ever heard of Jack the Ripper?&rdquo; Sansa placed a hand on Joffrey&rsquo;s chest and pressed him down on the bed. &ldquo;And how he&rsquo;s never been caught?&rdquo; She straddled him and reached for the knife, striped to her hip. &ldquo;I took a few lessons from him and he came with me to watch me take my exam.&rdquo; She didn&rsquo;t give Joffrey the chance to answer, to realize what was happening and what she would do. She didn&rsquo;t give him the chance to fight. With one smooth movement she slid Joffrey&rsquo;s throat and with a satisfied grin on her face she watched the blood seeping from the wound. A few drops fell on her dress, but Sansa focussed on the soundless screams for help on Joffrey&rsquo;s lips, on the light in his eyes that slowly dimmed, on his hands, clasping the wound as if he could undo the damage by just holding tightly. </p><p>A pleasant tingling in her chest warmed her entire body and soul and once Joffrey was nothing but a body without life a laugh escaped her throat. </p><p>She had thought that making those lists and being the judge gave her power. But that was nothing compared to the power she felt right now.</p><p>&ldquo;You have no idea how beautiful you look right now.&rdquo; Jon sat down behind her and wrapped his arms around her. His lips were touching her ear and then he kissed her neck and collarbone. &ldquo;And you have no idea how much I love you right now.&rdquo;</p><p>Sansa closed her eyes and cocked her head, taking in the kisses while Jon&rsquo;s hands wandered over her chest until they found her breasts. &ldquo;The hotelmanager knows what&rsquo;s going on here and he just lets it happen. You should kill him.&rdquo; Sansa whispered while she wrapped an arm around his neck. &ldquo;And I want to watch you do it.&ldquo;</p></p>",
                "content_abstract": "<p>\n<figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/7ed3ddb1093912b53672af26962fe859/tumblr_inline_phbt4hSg801qdb55z_1280.gif\" class=\"\"/></figure>\n<p><b>Written for <a href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>&rsquo;s JonSansaWeek Day 7 - Free Choice</b></p>\n<blockquote>\n<p><small>Once upon a time Sansa had sworn to catch Jack the Ripper, but when she discovered that it was her future husband Jon Snow, she decided to save his life. When the overwhelming hunger to kill returned, Sansa started making lists of people who deserved to die but escaped reality. Sansa had a taste of power now. And now Sansa wants more: She wants to kill her own demons.</small></p>\n<p><small><i>Historical AU: I think it can be read as a stand alone, but to enjoy it to the fullest I&rsquo;d say look around in my JonSa tag and go find Part 1: Stalking Jon the Ripper and Part 2: Hunting Jon Snow.</i></small></p>\n<p><small><i>Triggerwarnings: Character death (it&rsquo;s Joffrey, you&rsquo;re gonna love it), the killers as the good guys, some implying of smut and well&hellip;that&rsquo;s? It&rsquo;s a Jack the Ripper story, you know what to expect, right?</i></small></p>\n</blockquote>\n<p>Once upon a time Sansa had sworn to stop the infamous Jack the Ripper before he could kill another victim. Now she was surrounded by newspaper articles and handwritten notes targeting countless of people to a cruel fate by the hands of her husband. And not once had she actually felt guilty about being the judge so Jon could be the executioner.</p>\n<p>When she had traveled to that dark part of London where a young lady like herself shouldn&rsquo;t be seen, she had wanted to make a difference. She had wanted to show the entire world that women were capable of just as much as any man, that they were just as smart and intelligent, that they were just as talented and gifted. </p>\n<p>It had not worked out exactly like she had planned, with everyone in the world being in awe because a woman, a young lady, had caught the infamous Jack the Ripper where all men had failed, but maybe this was even better. </p>\n<p>For the first time in her entire life she actually had the feeling she had a certain kind of power. And now she had tasted it, she wanted more. </p>\n<p>&ldquo;Jon?&rdquo; Sansa looked up from her paperwork and hasty scribbling. </p>\n<p>Sitting in his chair, with his ankle on his knee and the newspaper folded open, Jon seemed like a man like there were so many. Every morning he left early with a briefcase in his hand and wearing a hat covering his dark curls. Each day he spent behind a desk, doing boring paperwork to earn whatever they needed to pay the rent and make themselves comfortable. But with each normal day that passed, the monster inside him grew stronger and stronger. Until his hands trembled when he touched her. Until flames burned in his eyes whenever he looked at her. Until a growl escaped his lips when he kissed her. </p>\n<p>&ldquo;Yes?&rdquo; Jon looked up from his newspaper. The frown on his forehead never fully disappeared, but it was deeper than it had been yesterday. </p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "gotdaily",
        "blog": {
            "name": "gotdaily",
            "title": "GOTDAILY",
            "description": "<p>GOTDAILY is a blog dedicated to HBO's Game of Thrones and George R.R. Martin's ASOIAF series. We track #gotdaily.</p>",
            "url": "https://gotdaily.tumblr.com/",
            "uuid": "t:t2Rex2-HO9jH-re9mMYIQg",
            "updated": 1561729255
        },
        "id": 179523818031,
        "post_url": "https://gotdaily.tumblr.com/post/179523818031/he-was-no-true-stark-had-never-been-one-but-he",
        "slug": "he-was-no-true-stark-had-never-been-one-but-he",
        "date": "2018-10-28 17:54:22 GMT",
        "timestamp": 1540749262,
        "state": "published",
        "format": "html",
        "reblog_key": "PS7ypnhe",
        "tags": [
            "jon snow",
            "jonsnowedit",
            "jonsnowsource",
            "game of thrones",
            "gotedit",
            "asoiafedit",
            "bw",
            "edit",
            "by rebecca"
        ],
        "short_url": "https://tmblr.co/ZdVysY2dCT18l",
        "summary": "He was no true Stark, had never been one… but he could die like one. Let them say that Eddard Stark had fathered four sons, not...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "post_author": "arthurpendragan",
        "note_count": 654,
        "caption": "<blockquote><blockquote><p><sub><i>He was no true <b>Stark</b>, had never been one… but he could <b>die</b> like one. Let them say that Eddard Stark had fathered <b>four</b> sons, not three. </i></sub></p></blockquote></blockquote>",
        "reblog": {
            "comment": "<p><blockquote><blockquote><p><sub><i>He was no true <b>Stark</b>, had never been one… but he could <b>die</b> like one. Let them say that Eddard Stark had fathered <b>four</b> sons, not three. </i></sub></p></blockquote></blockquote></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "gotdaily",
                    "active": true,
                    "theme": {
                        "header_full_width": 420,
                        "header_full_height": 350,
                        "header_focus_width": 420,
                        "header_focus_height": 237,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "56,420,293,0",
                        "header_image": "https://static.tumblr.com/aa54dfa7228168a483eb32eccd9eaa9c/71h0kg7/a5Cpdvvvs/tumblr_static_ayvmhtea71ssgksg008kks0kk.jpg",
                        "header_image_focused": "https://static.tumblr.com/aa54dfa7228168a483eb32eccd9eaa9c/71h0kg7/u62pdvx03/tumblr_static_tumblr_static_ayvmhtea71ssgksg008kks0kk_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_04_focused_v3.png?_v=7c4e5e82cf797042596e2e64af1c383f",
                        "header_stretch": true,
                        "link_color": "#C9C7D6",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Avalon",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179523818031"
                },
                "content_raw": "<p><blockquote><blockquote><p><sub><i>He was no true <b>Stark</b>, had never been one… but he could <b>die</b> like one. Let them say that Eddard Stark had fathered <b>four</b> sons, not three. </i></sub></p></blockquote></blockquote></p>",
                "content": "<p><blockquote><blockquote><p><sub><i>He was no true <b>Stark</b>, had never been one&hellip; but he could <b>die</b> like one. Let them say that Eddard Stark had fathered <b>four</b> sons, not three. </i></sub></p></blockquote></blockquote></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "11",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/f62609edd5f58c76842c6967161d9534/tumblr_ph5rg9U76X1xe6ngko1_540.gif",
                    "width": 540,
                    "height": 540
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/f62609edd5f58c76842c6967161d9534/tumblr_ph5rg9U76X1xe6ngko1_540.gif",
                        "width": 540,
                        "height": 540
                    },
                    {
                        "url": "https://66.media.tumblr.com/f62609edd5f58c76842c6967161d9534/tumblr_ph5rg9U76X1xe6ngko1_500.gif",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/f62609edd5f58c76842c6967161d9534/tumblr_ph5rg9U76X1xe6ngko1_400.gif",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/f62609edd5f58c76842c6967161d9534/tumblr_ph5rg9U76X1xe6ngko1_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/f62609edd5f58c76842c6967161d9534/tumblr_ph5rg9U76X1xe6ngko1_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/f62609edd5f58c76842c6967161d9534/tumblr_ph5rg9U76X1xe6ngko1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/540b252d060a29498736313678e48312/tumblr_ph5rg9U76X1xe6ngko2_540.gif",
                    "width": 540,
                    "height": 540
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/540b252d060a29498736313678e48312/tumblr_ph5rg9U76X1xe6ngko2_540.gif",
                        "width": 540,
                        "height": 540
                    },
                    {
                        "url": "https://66.media.tumblr.com/540b252d060a29498736313678e48312/tumblr_ph5rg9U76X1xe6ngko2_500.gif",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/540b252d060a29498736313678e48312/tumblr_ph5rg9U76X1xe6ngko2_400.gif",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/540b252d060a29498736313678e48312/tumblr_ph5rg9U76X1xe6ngko2_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/540b252d060a29498736313678e48312/tumblr_ph5rg9U76X1xe6ngko2_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/540b252d060a29498736313678e48312/tumblr_ph5rg9U76X1xe6ngko2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "daerysa",
        "blog": {
            "name": "daerysa",
            "title": "Daerysa welcome!",
            "description": "",
            "url": "https://daerysa.tumblr.com/",
            "uuid": "t:_wRJPNkmwhL8KvH2QcpC-g",
            "updated": 1561657597
        },
        "id": 179523064381,
        "post_url": "https://daerysa.tumblr.com/post/179523064381",
        "slug": "",
        "date": "2018-10-28 17:27:20 GMT",
        "timestamp": 1540747640,
        "state": "published",
        "format": "html",
        "reblog_key": "bDRTDgd6",
        "tags": [
            "jon snow",
            "jon stark",
            "jon x sam",
            "jon x samwell",
            "sam x jon",
            "samwell x jon",
            "samwell tarly",
            "sam tarly",
            "jon",
            "john bradley",
            "kit harington",
            "house tarly",
            "house stark",
            "got",
            "got gif",
            "game of thrones gif",
            "game of thrones",
            "asoiaf",
            "a song of ice and fire",
            "the watcher on the wall",
            "the wall"
        ],
        "short_url": "https://tmblr.co/Zahbxs2dCQ98z",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 115,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"281\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/be8fefd63f1d30c2e9598290855b7b14/tumblr_phbkhkHGUL1rgvfhu_540.gif\" data-orig-height=\"281\" data-orig-width=\"500\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"281\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/7200bd7c6b7615669b1b202ef5a0f670/tumblr_phbkhkFnlU1rgvfhu_540.gif\" data-orig-height=\"281\" data-orig-width=\"500\"/></figure>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"281\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/be8fefd63f1d30c2e9598290855b7b14/tumblr_phbkhkHGUL1rgvfhu_540.gif\" data-orig-height=\"281\" data-orig-width=\"500\"></figure><figure class=\"tmblr-full\" data-orig-height=\"281\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/7200bd7c6b7615669b1b202ef5a0f670/tumblr_phbkhkFnlU1rgvfhu_540.gif\" data-orig-height=\"281\" data-orig-width=\"500\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "daerysa",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 200,
                        "header_focus_width": 355,
                        "header_focus_height": 200,
                        "avatar_shape": "square",
                        "background_color": "#529ECC",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,427,200,72",
                        "header_image": "https://static.tumblr.com/0e769ef1f75322c1b7ed38ebf65922ab/zz2rvl5/KVco6v9m7/tumblr_static_eu0ywceogvks8gkgowookks8s.gif",
                        "header_image_focused": "https://static.tumblr.com/0e769ef1f75322c1b7ed38ebf65922ab/zz2rvl5/CDTo6v9m9/tumblr_static_tumblr_static_eu0ywceogvks8gkgowookks8s_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/0e769ef1f75322c1b7ed38ebf65922ab/zz2rvl5/KVco6v9m7/tumblr_static_eu0ywceogvks8gkgowookks8s_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179523064381"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"281\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/be8fefd63f1d30c2e9598290855b7b14/tumblr_phbkhkHGUL1rgvfhu_540.gif\" data-orig-height=\"281\" data-orig-width=\"500\"></figure><figure class=\"tmblr-full\" data-orig-height=\"281\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/7200bd7c6b7615669b1b202ef5a0f670/tumblr_phbkhkFnlU1rgvfhu_540.gif\" data-orig-height=\"281\" data-orig-width=\"500\"></figure></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/be8fefd63f1d30c2e9598290855b7b14/tumblr_phbkhkHGUL1rgvfhu_540.gif\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/7200bd7c6b7615669b1b202ef5a0f670/tumblr_phbkhkFnlU1rgvfhu_540.gif\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "vnoveneil",
        "blog": {
            "name": "vnoveneil",
            "title": "Neila Volkov",
            "description": "Author, Digital Artist, and a die hard daydreamer. Open to commissions anytime~ ^_^",
            "url": "https://vnoveneil.tumblr.com/",
            "uuid": "t:RoygSMko7RTF-jYk8P_jhg",
            "updated": 1559099490
        },
        "id": 179522763806,
        "post_url": "https://vnoveneil.tumblr.com/post/179522763806/a-quick-digital-art-of-jon-snow-from-game-of",
        "slug": "a-quick-digital-art-of-jon-snow-from-game-of",
        "date": "2018-10-28 17:17:02 GMT",
        "timestamp": 1540747022,
        "state": "published",
        "format": "html",
        "reblog_key": "WmmZVer4",
        "tags": [
            "jonsnow",
            "game of thrones",
            "gameofthrones",
            "jon snow",
            "gotfanart",
            "got fanart",
            "Fanart",
            "fantasy",
            "Novel",
            "king of the north",
            "bastard",
            "jon stark",
            "photoshop",
            "original art",
            "originalartwork",
            "fan art",
            "asoiaf",
            "commisions open",
            "Commision",
            "art commisions"
        ],
        "short_url": "https://tmblr.co/ZbaC2j2dCO-mU",
        "summary": "A quick digital art of Jon Snow from Game of Thrones.  Commissions are open, so PM me for inquiries. :)",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 103,
        "caption": "<p>A quick digital art of Jon Snow from Game of Thrones.</p><p><br/></p><p>Commissions are open, so PM me for inquiries. :)</p>",
        "reblog": {
            "comment": "<p>A quick digital art of Jon Snow from Game of Thrones.</p><p><br></p><p>Commissions are open, so PM me for inquiries. :)</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "vnoveneil",
                    "active": true,
                    "theme": {
                        "header_full_width": 1656,
                        "header_full_height": 2463,
                        "header_focus_width": 1220,
                        "header_focus_height": 686,
                        "avatar_shape": "circle",
                        "background_color": "#bfcad1",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "162,1220,848,0",
                        "header_image": "https://static.tumblr.com/5a05bbd6acdb566d0be29e07fe951f5f/fi80qvo/ALkphbk9l/tumblr_static_cau3xddhi4g0s4owggowo4scc.jpg",
                        "header_image_focused": "https://static.tumblr.com/5a05bbd6acdb566d0be29e07fe951f5f/fi80qvo/O0mphbk9o/tumblr_static_tumblr_static_cau3xddhi4g0s4owggowo4scc_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/5a05bbd6acdb566d0be29e07fe951f5f/fi80qvo/ALkphbk9l/tumblr_static_cau3xddhi4g0s4owggowo4scc_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#898989",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179522763806"
                },
                "content_raw": "<p>A quick digital art of Jon Snow from Game of Thrones.</p><p><br></p><p>Commissions are open, so PM me for inquiries. :)</p>",
                "content": "<p>A quick digital art of Jon Snow from Game of Thrones.</p><p><br /></p><p>Commissions are open, so PM me for inquiries. :)</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://vnoveneil.tumblr.com/image/179522763806",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/01c57c56b4884924964c8badc31092ba/tumblr_phbk0eJOJh1ukw57oo1_1280.jpg",
                    "width": 1280,
                    "height": 1449
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/01c57c56b4884924964c8badc31092ba/tumblr_phbk0eJOJh1ukw57oo1_1280.jpg",
                        "width": 1280,
                        "height": 1449
                    },
                    {
                        "url": "https://66.media.tumblr.com/01c57c56b4884924964c8badc31092ba/tumblr_phbk0eJOJh1ukw57oo1_640.jpg",
                        "width": 640,
                        "height": 724
                    },
                    {
                        "url": "https://66.media.tumblr.com/01c57c56b4884924964c8badc31092ba/tumblr_phbk0eJOJh1ukw57oo1_540.jpg",
                        "width": 540,
                        "height": 611
                    },
                    {
                        "url": "https://66.media.tumblr.com/01c57c56b4884924964c8badc31092ba/tumblr_phbk0eJOJh1ukw57oo1_500.jpg",
                        "width": 500,
                        "height": 566
                    },
                    {
                        "url": "https://66.media.tumblr.com/01c57c56b4884924964c8badc31092ba/tumblr_phbk0eJOJh1ukw57oo1_400.jpg",
                        "width": 400,
                        "height": 453
                    },
                    {
                        "url": "https://66.media.tumblr.com/01c57c56b4884924964c8badc31092ba/tumblr_phbk0eJOJh1ukw57oo1_250.jpg",
                        "width": 250,
                        "height": 283
                    },
                    {
                        "url": "https://66.media.tumblr.com/01c57c56b4884924964c8badc31092ba/tumblr_phbk0eJOJh1ukw57oo1_100.jpg",
                        "width": 100,
                        "height": 113
                    },
                    {
                        "url": "https://66.media.tumblr.com/01c57c56b4884924964c8badc31092ba/tumblr_phbk0eJOJh1ukw57oo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "goodqueenaly",
        "blog": {
            "name": "goodqueenaly",
            "title": "Good Queen Alysanne",
            "description": "<p>Nina. ASOIAF + David Bowie + random stories of history. I write stuff.</p>",
            "url": "https://goodqueenaly.tumblr.com/",
            "uuid": "t:WyuuHqjHtkgQlbN5yuboMA",
            "updated": 1561742253
        },
        "id": 179522537833,
        "post_url": "https://goodqueenaly.tumblr.com/post/179522537833/what-could-happen-to-jon-if-ned-dies-during-the",
        "slug": "what-could-happen-to-jon-if-ned-dies-during-the",
        "date": "2018-10-28 17:09:11 GMT",
        "timestamp": 1540746551,
        "state": "published",
        "format": "html",
        "reblog_key": "XI7j2LXH",
        "tags": [
            "alternate universe",
            "kingsguard",
            "jon snow",
            "tower of joy"
        ],
        "short_url": "https://tmblr.co/Zja1Qh2dCO8bf",
        "summary": "What could happen to Jon if Ned dies during the war? Gerold Hightower, Arthur Dayne and Oswell Whent take him to Braavos with...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 22,
        "asking_name": "kheftiu-asar",
        "asking_url": "https://kheftiu-asar.tumblr.com/",
        "question": "What could happen to Jon if Ned dies during the war? Gerold Hightower, Arthur Dayne and Oswell Whent take him to Braavos with Willem Darry? Gerold says that the kingsguard does not flee but surely they have to do something when they hear about the deaths of Rhaegar and Aerys, the flight of Rhaella to Dragonstone and in general the downfall of the regime that they serve. Dorne may be the closest and safest harbor for a while but they wouldn't take the baby to Elia's family.",
        "answer": "<p><a class=\"tumblelog\" href=\"https://tmblr.co/m4rA6TO-EQRRVGq9rEiUF5w\">@turtle-paced</a> answered <a href=\"http://turtle-paced.tumblr.com/post/179497951737/hi-turtle-if-ned-never-finds-the-tower-of-joy\">effectively the same question</a>, so I don’t want to completely repeat points, but I will add a few thoughts.</p><p>For one, of course, we still have almost no idea what sort of information the individuals at the Tower of Joy were receiving, and in what sort of timely fashion they were getting it. The news of Rhaegar’s death, and the subsequent fall of the capital and the formal proclamation of the new Baratheon regime, might have taken quite a bit of time to get to Starfall (through which, I would assume, the Tower of Joy’s inhabitants were receiving their information). That’s time that would in turn affect what sort of options they would have, and information (or lack of information) that could affect their decisions. (For example: the Kingsguard <i>might </i>have known by the time Ned came that Willem Darry was on Dragonstone with the queen and Viserys, but when would they have known that the queen had died birthing Daenerys, and that Ser Willem had taken Viserys and the new baby to Braavos?)</p><p>That aside, I don’t know that the Kingsguard at the Tower of Joy would have had many options anyway. They could have kept hiding in the Red Mountains, presumably supplied by Arthur Dayne’s kin at Starfall, knowing or having reason to know that Robert would never stop looking for Lyanna (nor, indeed, the Starks) and that chances were very good someone would find them eventually. They could have tried seeking asylum formally with the Martells (as the Martells themselves tried to resist Baratheon rule), but that would have been a virtually impossible gambit to undertake - Princes Doran and Oberyn would have had every reason to look askance at the child of Rhaegar’s dead mistress (or so I think they would have presumed Lyanna to have been), for whom the prince had so humiliated his wife at the Tourney of Harrenhal and again in abandoning her and their children to run off with Lyanna. They might have fled into exile, though even getting to Essos would have been difficult (they would have been taking a large chance no one would recognize three Kingsguard knights, especially with two of them being among the most famous knights of their day) and treacherous (sailing through the pirate-infested Stepstones and up through Baratheon waters where Stannis’ fleet might well have caught them). Nor would they have necessarily had a good time of it in Essos, with little in the way of funding, preparation, or clear direction.</p><p>And again, <a href=\"http://goodqueenaly.tumblr.com/post/171803656428/why-the-kingsguard-at-the-tower-of-joy-didnt-took\">as I said before</a>, I don’t know that the Kingsguard themselves would have known exactly what to do. Rhaegar would never have left them with instructions for “what to do in the event of my death” - I seriously doubt Rhaegar ever thought he was going to die, at least not while his prophetic plans were still being played out. The Kingsguard had been obedient to what I think Rhaegar instructed - something along the lines of “guard the tower until I return, and don’t let anyone else enter or leave” - but inventing their own plan would have been another matter entirely. None of them had been prepared to manage a court-in-exile for a royal pretender, assuming they would even raise Jon as such (knowing of the existence of Viserys and Daenerys), still less to raise Jon to the prophetic destiny Rhaegar had presumably imagined for him. </p><p>In sum, I doubt baby not-named-Jon would have had an easy time of it. Uncle Ned was willing and indeed determined to raise him in safety and identity secrecy, but the Kingsguard left with him would have been in a much stickier situation, and few if anyone else looking for Lyanna would have had much in the way of sympathy for Rhaegar’s last child (least of all Robert).</p>",
        "reblog": {
            "comment": "<p><a class=\"tumblelog\" href=\"https://tmblr.co/m4rA6TO-EQRRVGq9rEiUF5w\">@turtle-paced</a> answered <a href=\"http://turtle-paced.tumblr.com/post/179497951737/hi-turtle-if-ned-never-finds-the-tower-of-joy\">effectively the same question</a>, so I don’t want to completely repeat points, but I will add a few thoughts.</p><p>For one, of course, we still have almost no idea what sort of information the individuals at the Tower of Joy were receiving, and in what sort of timely fashion they were getting it. The news of Rhaegar’s death, and the subsequent fall of the capital and the formal proclamation of the new Baratheon regime, might have taken quite a bit of time to get to Starfall (through which, I would assume, the Tower of Joy’s inhabitants were receiving their information). That’s time that would in turn affect what sort of options they would have, and information (or lack of information) that could affect their decisions. (For example: the Kingsguard <i>might </i>have known by the time Ned came that Willem Darry was on Dragonstone with the queen and Viserys, but when would they have known that the queen had died birthing Daenerys, and that Ser Willem had taken Viserys and the new baby to Braavos?)</p><p>That aside, I don’t know that the Kingsguard at the Tower of Joy would have had many options anyway. They could have kept hiding in the Red Mountains, presumably supplied by Arthur Dayne’s kin at Starfall, knowing or having reason to know that Robert would never stop looking for Lyanna (nor, indeed, the Starks) and that chances were very good someone would find them eventually. They could have tried seeking asylum formally with the Martells (as the Martells themselves tried to resist Baratheon rule), but that would have been a virtually impossible gambit to undertake - Princes Doran and Oberyn would have had every reason to look askance at the child of Rhaegar’s dead mistress (or so I think they would have presumed Lyanna to have been), for whom the prince had so humiliated his wife at the Tourney of Harrenhal and again in abandoning her and their children to run off with Lyanna. They might have fled into exile, though even getting to Essos would have been difficult (they would have been taking a large chance no one would recognize three Kingsguard knights, especially with two of them being among the most famous knights of their day) and treacherous (sailing through the pirate-infested Stepstones and up through Baratheon waters where Stannis’ fleet might well have caught them). Nor would they have necessarily had a good time of it in Essos, with little in the way of funding, preparation, or clear direction.</p><p>And again, <a href=\"http://goodqueenaly.tumblr.com/post/171803656428/why-the-kingsguard-at-the-tower-of-joy-didnt-took\">as I said before</a>, I don’t know that the Kingsguard themselves would have known exactly what to do. Rhaegar would never have left them with instructions for “what to do in the event of my death” - I seriously doubt Rhaegar ever thought he was going to die, at least not while his prophetic plans were still being played out. The Kingsguard had been obedient to what I think Rhaegar instructed - something along the lines of “guard the tower until I return, and don’t let anyone else enter or leave” - but inventing their own plan would have been another matter entirely. None of them had been prepared to manage a court-in-exile for a royal pretender, assuming they would even raise Jon as such (knowing of the existence of Viserys and Daenerys), still less to raise Jon to the prophetic destiny Rhaegar had presumably imagined for him. </p><p>In sum, I doubt baby not-named-Jon would have had an easy time of it. Uncle Ned was willing and indeed determined to raise him in safety and identity secrecy, but the Kingsguard left with him would have been in a much stickier situation, and few if anyone else looking for Lyanna would have had much in the way of sympathy for Rhaegar’s last child (least of all Robert).</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "goodqueenaly",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 960,
                        "header_focus_width": 1243,
                        "header_focus_height": 700,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "112,1280,812,37",
                        "header_image": "https://static.tumblr.com/47b89d6efac11f51fc42c7d8fd494efd/epucfus/I8wppwc2z/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/a9db84396b27cbbba257db2d7aa9067b/epucfus/MgMppwc31/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/47b89d6efac11f51fc42c7d8fd494efd/epucfus/I8wppwc2z/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ea3175",
                        "title_font": "Avalon",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179522537833"
                },
                "content_raw": "<p><a class=\"tumblelog\" href=\"https://tmblr.co/m4rA6TO-EQRRVGq9rEiUF5w\">@turtle-paced</a> answered <a href=\"http://turtle-paced.tumblr.com/post/179497951737/hi-turtle-if-ned-never-finds-the-tower-of-joy\">effectively the same question</a>, so I don’t want to completely repeat points, but I will add a few thoughts.</p><p>For one, of course, we still have almost no idea what sort of information the individuals at the Tower of Joy were receiving, and in what sort of timely fashion they were getting it. The news of Rhaegar’s death, and the subsequent fall of the capital and the formal proclamation of the new Baratheon regime, might have taken quite a bit of time to get to Starfall (through which, I would assume, the Tower of Joy’s inhabitants were receiving their information). That’s time that would in turn affect what sort of options they would have, and information (or lack of information) that could affect their decisions. (For example: the Kingsguard <i>might </i>have known by the time Ned came that Willem Darry was on Dragonstone with the queen and Viserys, but when would they have known that the queen had died birthing Daenerys, and that Ser Willem had taken Viserys and the new baby to Braavos?)</p><p>That aside, I don’t know that the Kingsguard at the Tower of Joy would have had many options anyway. They could have kept hiding in the Red Mountains, presumably supplied by Arthur Dayne’s kin at Starfall, knowing or having reason to know that Robert would never stop looking for Lyanna (nor, indeed, the Starks) and that chances were very good someone would find them eventually. They could have tried seeking asylum formally with the Martells (as the Martells themselves tried to resist Baratheon rule), but that would have been a virtually impossible gambit to undertake - Princes Doran and Oberyn would have had every reason to look askance at the child of Rhaegar’s dead mistress (or so I think they would have presumed Lyanna to have been), for whom the prince had so humiliated his wife at the Tourney of Harrenhal and again in abandoning her and their children to run off with Lyanna. They might have fled into exile, though even getting to Essos would have been difficult (they would have been taking a large chance no one would recognize three Kingsguard knights, especially with two of them being among the most famous knights of their day) and treacherous (sailing through the pirate-infested Stepstones and up through Baratheon waters where Stannis’ fleet might well have caught them). Nor would they have necessarily had a good time of it in Essos, with little in the way of funding, preparation, or clear direction.</p><p>And again, <a href=\"http://goodqueenaly.tumblr.com/post/171803656428/why-the-kingsguard-at-the-tower-of-joy-didnt-took\">as I said before</a>, I don’t know that the Kingsguard themselves would have known exactly what to do. Rhaegar would never have left them with instructions for “what to do in the event of my death” - I seriously doubt Rhaegar ever thought he was going to die, at least not while his prophetic plans were still being played out. The Kingsguard had been obedient to what I think Rhaegar instructed - something along the lines of “guard the tower until I return, and don’t let anyone else enter or leave” - but inventing their own plan would have been another matter entirely. None of them had been prepared to manage a court-in-exile for a royal pretender, assuming they would even raise Jon as such (knowing of the existence of Viserys and Daenerys), still less to raise Jon to the prophetic destiny Rhaegar had presumably imagined for him. </p><p>In sum, I doubt baby not-named-Jon would have had an easy time of it. Uncle Ned was willing and indeed determined to raise him in safety and identity secrecy, but the Kingsguard left with him would have been in a much stickier situation, and few if anyone else looking for Lyanna would have had much in the way of sympathy for Rhaegar’s last child (least of all Robert).</p>",
                "content": "<p><a href=\"https://tmblr.co/m4rA6TO-EQRRVGq9rEiUF5w\">@turtle-paced</a> answered <a href=\"http://turtle-paced.tumblr.com/post/179497951737/hi-turtle-if-ned-never-finds-the-tower-of-joy\">effectively the same question</a>, so I don&rsquo;t want to completely repeat points, but I will add a few thoughts.</p><p>For one, of course, we still have almost no idea what sort of information the individuals at the Tower of Joy were receiving, and in what sort of timely fashion they were getting it. The news of Rhaegar&rsquo;s death, and the subsequent fall of the capital and the formal proclamation of the new Baratheon regime, might have taken quite a bit of time to get to Starfall (through which, I would assume, the Tower of Joy&rsquo;s inhabitants were receiving their information). That&rsquo;s time that would in turn affect what sort of options they would have, and information (or lack of information) that could affect their decisions. (For example: the Kingsguard <i>might </i>have known by the time Ned came that Willem Darry was on Dragonstone with the queen and Viserys, but when would they have known that the queen had died birthing Daenerys, and that Ser Willem had taken Viserys and the new baby to Braavos?)</p><p>That aside, I don&rsquo;t know that the Kingsguard at the Tower of Joy would have had many options anyway. They could have kept hiding in the Red Mountains, presumably supplied by Arthur Dayne&rsquo;s kin at Starfall, knowing or having reason to know that Robert would never stop looking for Lyanna (nor, indeed, the Starks) and that chances were very good someone would find them eventually. They could have tried seeking asylum formally with the Martells (as the Martells themselves tried to resist Baratheon rule), but that would have been a virtually impossible gambit to undertake - Princes Doran and Oberyn would have had every reason to look askance at the child of Rhaegar&rsquo;s dead mistress (or so I think they would have presumed Lyanna to have been), for whom the prince had so humiliated his wife at the Tourney of Harrenhal and again in abandoning her and their children to run off with Lyanna. They might have fled into exile, though even getting to Essos would have been difficult (they would have been taking a large chance no one would recognize three Kingsguard knights, especially with two of them being among the most famous knights of their day) and treacherous (sailing through the pirate-infested Stepstones and up through Baratheon waters where Stannis&rsquo; fleet might well have caught them). Nor would they have necessarily had a good time of it in Essos, with little in the way of funding, preparation, or clear direction.</p><p>And again, <a href=\"http://goodqueenaly.tumblr.com/post/171803656428/why-the-kingsguard-at-the-tower-of-joy-didnt-took\">as I said before</a>, I don&rsquo;t know that the Kingsguard themselves would have known exactly what to do. Rhaegar would never have left them with instructions for&nbsp;&ldquo;what to do in the event of my death&rdquo; - I seriously doubt Rhaegar ever thought he was going to die, at least not while his prophetic plans were still being played out. The Kingsguard had been obedient to what I think Rhaegar instructed - something along the lines of&nbsp;&ldquo;guard the tower until I return, and don&rsquo;t let anyone else enter or leave&rdquo; - but inventing their own plan would have been another matter entirely. None of them had been prepared to manage a court-in-exile for a royal pretender, assuming they would even raise Jon as such (knowing of the existence of Viserys and Daenerys), still less to raise Jon to the prophetic destiny Rhaegar had presumably imagined for him.&nbsp;</p><p>In sum, I doubt baby not-named-Jon would have had an easy time of it. Uncle Ned was willing and indeed determined to raise him in safety and identity secrecy, but the Kingsguard left with him would have been in a much stickier situation, and few if anyone else looking for Lyanna would have had much in the way of sympathy for Rhaegar&rsquo;s last child (least of all Robert).</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "daenerys1417",
        "blog": {
            "name": "daenerys1417",
            "title": "Jonerys Trash",
            "description": "Dany Stan | Fanfic Writer | Jonerys is Canon <p><a href=\"https://archiveofourown.org/users/Daenerys1417/works\">Read my fanfics on AO3</a></p>",
            "url": "https://daenerys1417.tumblr.com/",
            "uuid": "t:uGz_RQrENLRcMLxsViUd6g",
            "updated": 1561739905
        },
        "id": 179519799110,
        "post_url": "https://daenerys1417.tumblr.com/post/179519799110/dany-a-student-at-kings-landing-university",
        "slug": "dany-a-student-at-kings-landing-university",
        "date": "2018-10-28 15:35:08 GMT",
        "timestamp": 1540740908,
        "state": "published",
        "format": "html",
        "reblog_key": "P9wpQUiS",
        "tags": [
            "jonerys",
            "jon snow",
            "daenerys targaryen",
            "fanfic coming soon",
            "halloween",
            "modern au",
            "trick or treat",
            "bumps in the night",
            "haunted castle"
        ],
        "short_url": "https://tmblr.co/Za_X_c2dCDhz6",
        "summary": "Dany, a student at King’s Landing University, reluctantly agrees to attend a costume party at Castle Black, rumored to be one of...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 77,
        "title": null,
        "body": "<h1>The Haunting of Castle Black</h1><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1062\"><img src=\"https://66.media.tumblr.com/566c05188cba8ac546b7e02974ec432d/tumblr_phbfaj8bKx1v6ox13_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1062\"/></figure><p><i>Dany, a student at King’s Landing University, reluctantly agrees to attend a costume party at Castle Black, rumored to be one of the most haunted places in Westeros.  Reports of ghost sightings and unexplained noises are a common occurrence, but what of bumps in the night from a hot, mysterious stranger?</i></p><p><br/></p><h2>Coming Soon&hellip;</h2>",
        "reblog": {
            "comment": "<p><h1>The Haunting of Castle Black</h1><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1062\"><img src=\"https://66.media.tumblr.com/566c05188cba8ac546b7e02974ec432d/tumblr_phbfaj8bKx1v6ox13_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1062\"></figure><p><i>Dany, a student at King’s Landing University, reluctantly agrees to attend a costume party at Castle Black, rumored to be one of the most haunted places in Westeros.  Reports of ghost sightings and unexplained noises are a common occurrence, but what of bumps in the night from a hot, mysterious stranger?</i></p><p><br></p><h2>Coming Soon…</h2></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "daenerys1417",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 808,
                        "header_focus_width": 1096,
                        "header_focus_height": 616,
                        "avatar_shape": "circle",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1258,616,162",
                        "header_image": "https://static.tumblr.com/c6eda7b42d68f561ec478840c81765b7/qdvkfek/uiXpq42ik/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/b7ea81c2723cf89f4968454d7ba30188/qdvkfek/pgRpq42im/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/c6eda7b42d68f561ec478840c81765b7/qdvkfek/uiXpq42ik/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#e50808",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Arquitecta",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179519799110"
                },
                "content_raw": "<p><h1>The Haunting of Castle Black</h1><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1062\"><img src=\"https://66.media.tumblr.com/566c05188cba8ac546b7e02974ec432d/tumblr_phbfaj8bKx1v6ox13_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1062\"></figure><p><i>Dany, a student at King’s Landing University, reluctantly agrees to attend a costume party at Castle Black, rumored to be one of the most haunted places in Westeros.  Reports of ghost sightings and unexplained noises are a common occurrence, but what of bumps in the night from a hot, mysterious stranger?</i></p><p><br></p><h2>Coming Soon…</h2></p>",
                "content": "<p><h1>The Haunting of Castle Black</h1><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/566c05188cba8ac546b7e02974ec432d/tumblr_phbfaj8bKx1v6ox13_540.jpg\" class=\"\"/></figure><p><i>Dany, a student at King&rsquo;s Landing University, reluctantly agrees to attend a costume party at Castle Black, rumored to be one of the most haunted places in Westeros.  Reports of ghost sightings and unexplained noises are a common occurrence, but what of bumps in the night from a hot, mysterious stranger?</i></p><p><br /></p><h2>Coming Soon&hellip;</h2></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "chillyravenart",
        "blog": {
            "name": "chillyravenart",
            "title": "Hi, can I interest you in our lord & saviour Rhaegar Targaryen?",
            "description": "Yasmin, Slytherin, stanning Targaryens since Aegon's Conquest |<a href=\"https://www.instagram.com/chillyravenart/\">Instagram</a>|<a href=\"https://twitter.com/chillyravenart\">Twitter</a>|<a href=\"https://drive.google.com/open?id=1bDRg8OFxMxh7I4gz6MqQwOUovCt8RHourUId9bs-kj0\">Commissions</a>",
            "url": "https://chillyravenart.tumblr.com/",
            "uuid": "t:wWUMEkM0HTPLDjIx9hQQjQ",
            "updated": 1561758210
        },
        "id": 179519612941,
        "post_url": "https://chillyravenart.tumblr.com/post/179519612941/starklings-at-hogwarts-as-requested-by",
        "slug": "starklings-at-hogwarts-as-requested-by",
        "date": "2018-10-28 15:28:28 GMT",
        "timestamp": 1540740508,
        "state": "published",
        "format": "html",
        "reblog_key": "hklxyXLZ",
        "tags": [
            "asoiaf fanart",
            "harry potter fan art",
            "crossover",
            "gameofthrones",
            "jon snow",
            "Robb Stark",
            "arya stark",
            "sansa stark",
            "bran stark",
            "hogwarts",
            "starklings",
            "starklingsathogwarts",
            "chillyravenart",
            "artists on tumblr"
        ],
        "short_url": "https://tmblr.co/Z7P9fa2dCC_WD",
        "summary": "Starklings at Hogwarts as requested by @goodqueenalys - I’d love to do more HP/ASOIAF crossovers soon, this was great fun! And...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 206,
        "caption": "<p><b>Starklings at Hogwarts</b> as requested by <a class=\"tumblelog\" href=\"https://tmblr.co/m3PgW2CPLSB0cJWRpwT3fcw\">@goodqueenalys</a> - I’d love to do more HP/ASOIAF crossovers soon, this was great fun! And Hogwarts now has another special set of redheads ;)</p><p>Note: I deemed Rickon too young to officially be at Hogwarts but dw, he’s at home zooming around on a toy broomstick!</p><p>Those who want to request a drawing, please check this <a href=\"https://chillyravenart.tumblr.com/post/179351307256/requests\"><b>post</b> </a>out, a winner will be picked tomorrow!</p>",
        "reblog": {
            "comment": "<p><b>Starklings at Hogwarts</b> as requested by <a class=\"tumblelog\" href=\"https://tmblr.co/m3PgW2CPLSB0cJWRpwT3fcw\">@goodqueenalys</a> - I’d love to do more HP/ASOIAF crossovers soon, this was great fun! And Hogwarts now has another special set of redheads ;)</p><p>Note: I deemed Rickon too young to officially be at Hogwarts but dw, he’s at home zooming around on a toy broomstick!</p><p>Those who want to request a drawing, please check this <a href=\"https://chillyravenart.tumblr.com/post/179351307256/requests\"><b>post</b> </a>out, a winner will be picked tomorrow!</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "chillyravenart",
                    "active": true,
                    "theme": {
                        "header_full_width": 1600,
                        "header_full_height": 1143,
                        "header_focus_width": 1088,
                        "header_focus_height": 611,
                        "avatar_shape": "circle",
                        "background_color": "#CCB6DB",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "70,1355,681,267",
                        "header_image": "https://static.tumblr.com/df34ea0da3b1e703699b32320bbc1fcd/hhztbe0/Ccrptthdo/tumblr_static_-517391006-content.png",
                        "header_image_focused": "https://static.tumblr.com/ac7d10f46a79fad94d2b1c5326278256/hhztbe0/hZCpttnks/tumblr_static_tumblr_static_-517391006-content_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/df34ea0da3b1e703699b32320bbc1fcd/hhztbe0/Ccrptthdo/tumblr_static_-517391006-content_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#8F6DA5",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Alternate Gothic",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179519612941"
                },
                "content_raw": "<p><b>Starklings at Hogwarts</b> as requested by <a class=\"tumblelog\" href=\"https://tmblr.co/m3PgW2CPLSB0cJWRpwT3fcw\">@goodqueenalys</a> - I’d love to do more HP/ASOIAF crossovers soon, this was great fun! And Hogwarts now has another special set of redheads ;)</p><p>Note: I deemed Rickon too young to officially be at Hogwarts but dw, he’s at home zooming around on a toy broomstick!</p><p>Those who want to request a drawing, please check this <a href=\"https://chillyravenart.tumblr.com/post/179351307256/requests\"><b>post</b> </a>out, a winner will be picked tomorrow!</p>",
                "content": "<p><b>Starklings at Hogwarts</b> as requested by <a href=\"https://tmblr.co/m3PgW2CPLSB0cJWRpwT3fcw\">@goodqueenalys</a> - I&rsquo;d love to do more HP/ASOIAF crossovers soon, this was great fun! And Hogwarts now has another special set of redheads ;)</p><p>Note: I deemed Rickon too young to officially be at Hogwarts but dw, he&rsquo;s at home zooming around on a toy broomstick!</p><p>Those who want to request a drawing, please check this <a href=\"https://chillyravenart.tumblr.com/post/179351307256/requests\"><b>post</b> </a>out, a winner will be picked tomorrow!</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "11",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/b777a3e02c95cc9626a7cc203afbeb07/tumblr_phbezgo6Ib1x9pa3co1_400.png",
                    "width": 269,
                    "height": 169
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/b777a3e02c95cc9626a7cc203afbeb07/tumblr_phbezgo6Ib1x9pa3co1_400.png",
                        "width": 269,
                        "height": 169
                    },
                    {
                        "url": "https://66.media.tumblr.com/b777a3e02c95cc9626a7cc203afbeb07/tumblr_phbezgo6Ib1x9pa3co1_250.png",
                        "width": 250,
                        "height": 157
                    },
                    {
                        "url": "https://66.media.tumblr.com/b777a3e02c95cc9626a7cc203afbeb07/tumblr_phbezgo6Ib1x9pa3co1_100.png",
                        "width": 100,
                        "height": 63
                    },
                    {
                        "url": "https://66.media.tumblr.com/b777a3e02c95cc9626a7cc203afbeb07/tumblr_phbezgo6Ib1x9pa3co1_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/291112bffa28e434b04b837e013742e4/tumblr_phbezgo6Ib1x9pa3co2_1280.png",
                    "width": 1127,
                    "height": 1920
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/291112bffa28e434b04b837e013742e4/tumblr_phbezgo6Ib1x9pa3co2_1280.png",
                        "width": 1127,
                        "height": 1920
                    },
                    {
                        "url": "https://66.media.tumblr.com/291112bffa28e434b04b837e013742e4/tumblr_phbezgo6Ib1x9pa3co2_640.png",
                        "width": 563,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/291112bffa28e434b04b837e013742e4/tumblr_phbezgo6Ib1x9pa3co2_540.png",
                        "width": 475,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/291112bffa28e434b04b837e013742e4/tumblr_phbezgo6Ib1x9pa3co2_500.png",
                        "width": 440,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/291112bffa28e434b04b837e013742e4/tumblr_phbezgo6Ib1x9pa3co2_400.png",
                        "width": 352,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/291112bffa28e434b04b837e013742e4/tumblr_phbezgo6Ib1x9pa3co2_250.png",
                        "width": 235,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/291112bffa28e434b04b837e013742e4/tumblr_phbezgo6Ib1x9pa3co2_100.png",
                        "width": 100,
                        "height": 170
                    },
                    {
                        "url": "https://66.media.tumblr.com/291112bffa28e434b04b837e013742e4/tumblr_phbezgo6Ib1x9pa3co2_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "jonsaagenda",
        "blog": {
            "name": "jonsaagenda",
            "title": "jonsa is the only right answer",
            "description": "I am 22 | Virgo | Muslim | This is a side blog all about Jonsa and GOT/ASOIAF related things | NOT wank free, you've been warned | my main is @sansasnowstark | @ Jonsa fam, feel free to message me anytime you want to discuss jonsa or anything else | ps. sansa/abuser shippers DO NOT INTERACT...",
            "url": "https://jonsaagenda.tumblr.com/",
            "uuid": "t:oPQj2VKS29XZMuYZXVXopw",
            "updated": 1558517741
        },
        "id": 179519344734,
        "post_url": "https://jonsaagenda.tumblr.com/post/179519344734",
        "slug": "",
        "date": "2018-10-28 15:18:35 GMT",
        "timestamp": 1540739915,
        "state": "published",
        "format": "html",
        "reblog_key": "9xl8shyr",
        "tags": [
            "jon snow",
            "sansa stark",
            "jonsa",
            "jon x sansa",
            "game of thrones",
            "my edit",
            "actually jonsa",
            "jonsa edit",
            "jonsaedit",
            "king in the north",
            "queen in the north",
            "starklings"
        ],
        "short_url": "https://tmblr.co/Z-fvra2dCBz1U",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 97,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1773\" data-orig-width=\"997\"><img src=\"https://66.media.tumblr.com/cbdad2327553ee9cb795b0d2d6a3cc73/tumblr_phbeixlibX1tx38v5_1280.jpg\" data-orig-height=\"1773\" data-orig-width=\"997\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1773\" data-orig-width=\"997\"><img src=\"https://66.media.tumblr.com/cd6c80c466909d9f7260c228b52cc058/tumblr_phbeiyY4ML1tx38v5_1280.jpg\" data-orig-height=\"1773\" data-orig-width=\"997\"/></figure></div>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1773\" data-orig-width=\"997\"><img src=\"https://66.media.tumblr.com/cbdad2327553ee9cb795b0d2d6a3cc73/tumblr_phbeixlibX1tx38v5_1280.jpg\" data-orig-height=\"1773\" data-orig-width=\"997\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1773\" data-orig-width=\"997\"><img src=\"https://66.media.tumblr.com/cd6c80c466909d9f7260c228b52cc058/tumblr_phbeiyY4ML1tx38v5_1280.jpg\" data-orig-height=\"1773\" data-orig-width=\"997\"></figure></div></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jonsaagenda",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#604E5A",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/d330692cdac41f7a2072b7e3bbbfc270/jh5rnzr/1lZpkzo1l/tumblr_static_1114653214-content.gif",
                        "header_image_focused": "https://static.tumblr.com/d330692cdac41f7a2072b7e3bbbfc270/jh5rnzr/1lZpkzo1l/tumblr_static_1114653214-content_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/d330692cdac41f7a2072b7e3bbbfc270/jh5rnzr/1lZpkzo1l/tumblr_static_1114653214-content_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFF2FA",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179519344734"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1773\" data-orig-width=\"997\"><img src=\"https://66.media.tumblr.com/cbdad2327553ee9cb795b0d2d6a3cc73/tumblr_phbeixlibX1tx38v5_1280.jpg\" data-orig-height=\"1773\" data-orig-width=\"997\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1773\" data-orig-width=\"997\"><img src=\"https://66.media.tumblr.com/cd6c80c466909d9f7260c228b52cc058/tumblr_phbeiyY4ML1tx38v5_1280.jpg\" data-orig-height=\"1773\" data-orig-width=\"997\"></figure></div></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/cbdad2327553ee9cb795b0d2d6a3cc73/tumblr_phbeixlibX1tx38v5_1280.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/cd6c80c466909d9f7260c228b52cc058/tumblr_phbeiyY4ML1tx38v5_1280.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "thronesdragons",
        "blog": {
            "name": "thronesdragons",
            "title": "Game of Thrones",
            "description": "<p><span style=\"color: #00; font-family: Helvetica, Arial, sans-serif; font-size: 12px;\"><a href=\"https://thronesdragons.tumblr.com/\">Game of Thrones (GOT)</a> Fans : Pictures, Art, Memes and More!</span></p>",
            "url": "https://thronesdragons.tumblr.com/",
            "uuid": "t:kfrbcbINX-athn6CZWMlWQ",
            "updated": 1560200770
        },
        "id": 179516697707,
        "post_url": "https://thronesdragons.tumblr.com/post/179516697707/more-emilydawnl-last-years-got-halloween",
        "slug": "more-emilydawnl-last-years-got-halloween",
        "date": "2018-10-28 13:38:33 GMT",
        "timestamp": 1540733913,
        "state": "published",
        "format": "html",
        "reblog_key": "EX8nlZxB",
        "tags": [
            "Game of Thrones",
            "Got",
            "Jon Snow",
            "Targaryen",
            "Stark",
            "Westeros",
            "Dragons"
        ],
        "short_url": "https://tmblr.co/Zj9jIc2dC1snh",
        "summary": "[[MORE]] @emilydawnl -  Last year‘s GOT Halloween costume with my three little dragons was probably my favorite ever 🐉🔥\n#got...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 31,
        "caption": "<p><!-- more --> @emilydawnl -  Last year‘s GOT Halloween costume with my three little dragons was probably my favorite ever 🐉🔥<br/>\n#got #gameofthrones #daenerystargaryen #dragons #halloween</p>",
        "caption_abstract": "<p></p>",
        "reblog": {
            "comment": "<p>[[MORE]] @emilydawnl -  Last year‘s GOT Halloween costume with my three little dragons was probably my favorite ever 🐉🔥<br>\n#got #gameofthrones #daenerystargaryen #dragons #halloween</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thronesdragons",
                    "active": true,
                    "theme": {
                        "header_full_width": 1063,
                        "header_full_height": 354,
                        "header_focus_width": 621,
                        "header_focus_height": 349,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c.jpg",
                        "header_image_focused": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/CZ2oyee5j/tumblr_static_tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179516697707"
                },
                "content_raw": "<p>[[MORE]] @emilydawnl -  Last year‘s GOT Halloween costume with my three little dragons was probably my favorite ever 🐉🔥<br>\n#got #gameofthrones #daenerystargaryen #dragons #halloween</p>",
                "content": "<p> @emilydawnl -  Last year&lsquo;s GOT Halloween costume with my three little dragons was probably my favorite ever &#128009;&#128293;<br />\n#got #gameofthrones #daenerystargaryen #dragons #halloween</p>",
                "content_abstract": "",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://thronesdragons.tumblr.com/image/179516697707",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/28a6f5b6585dadaef71efc80731065e3/tumblr_phb9w9B2b61wfiwxso1_640.jpg",
                    "width": 640,
                    "height": 800
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/28a6f5b6585dadaef71efc80731065e3/tumblr_phb9w9B2b61wfiwxso1_640.jpg",
                        "width": 640,
                        "height": 800
                    },
                    {
                        "url": "https://66.media.tumblr.com/28a6f5b6585dadaef71efc80731065e3/tumblr_phb9w9B2b61wfiwxso1_540.jpg",
                        "width": 540,
                        "height": 675
                    },
                    {
                        "url": "https://66.media.tumblr.com/28a6f5b6585dadaef71efc80731065e3/tumblr_phb9w9B2b61wfiwxso1_500.jpg",
                        "width": 500,
                        "height": 625
                    },
                    {
                        "url": "https://66.media.tumblr.com/28a6f5b6585dadaef71efc80731065e3/tumblr_phb9w9B2b61wfiwxso1_400.jpg",
                        "width": 400,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/28a6f5b6585dadaef71efc80731065e3/tumblr_phb9w9B2b61wfiwxso1_250.jpg",
                        "width": 250,
                        "height": 313
                    },
                    {
                        "url": "https://66.media.tumblr.com/28a6f5b6585dadaef71efc80731065e3/tumblr_phb9w9B2b61wfiwxso1_100.jpg",
                        "width": 100,
                        "height": 125
                    },
                    {
                        "url": "https://66.media.tumblr.com/28a6f5b6585dadaef71efc80731065e3/tumblr_phb9w9B2b61wfiwxso1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "turtle-paced",
        "blog": {
            "name": "turtle-paced",
            "title": "turtle-paced",
            "description": "Writing at the speed of the race course paradox.",
            "url": "https://turtle-paced.tumblr.com/",
            "uuid": "t:ynLJaHxb9zOYvnCFZxmIiQ",
            "updated": 1561719469
        },
        "id": 179514052987,
        "post_url": "https://turtle-paced.tumblr.com/post/179514052987/and-what-do-you-think-jon-snow-will-think-about",
        "slug": "and-what-do-you-think-jon-snow-will-think-about",
        "date": "2018-10-28 11:31:06 GMT",
        "timestamp": 1540726266,
        "state": "published",
        "format": "html",
        "reblog_key": "j93EXfj9",
        "tags": [
            "ASoIaF",
            "jon snow",
            "aegon 'vi' targaryen",
            "speculation",
            "asks"
        ],
        "short_url": "https://tmblr.co/Zn1Nwj2dBtn5x",
        "summary": "And what do you think Jon Snow will think about Aegon once he inevitably knows about his own parentage? Of course to Jon, the...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 22,
        "asking_name": "anon-foreverandever",
        "asking_url": "https://anon-foreverandever.tumblr.com/",
        "question": "And what do you think Jon Snow will think about Aegon once he inevitably knows about his own parentage? Of course to Jon, the siblings with whom he grew are more important, but is there any chance that maybe he goes to Aegon just because it would be some kind of \"reliving\" the feeling of having a (supposedly) older brother (like with Robb)? That is supposing a timeframe where he doesn't learn of Sansa or Arya whereabouts when he goes south, which is hardly possible, but still, I ask you.",
        "answer": "<p>No, I don’t think Jon heads for Aegon. If Jon believes Aegon is the real Rhaegar-spawned deal, I think his reaction is a ships-that-pass-in-the-night sort of deal. Aegon is the brother he could have had; for better or for worse, the brothers he’s got are Robb, Bran, and Rickon.</p>",
        "reblog": {
            "comment": "<p>No, I don’t think Jon heads for Aegon. If Jon believes Aegon is the real Rhaegar-spawned deal, I think his reaction is a ships-that-pass-in-the-night sort of deal. Aegon is the brother he could have had; for better or for worse, the brothers he’s got are Robb, Bran, and Rickon.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "turtle-paced",
                    "active": true,
                    "theme": {
                        "header_full_width": 1694,
                        "header_full_height": 636,
                        "header_focus_width": 1131,
                        "header_focus_height": 636,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1412,636,281",
                        "header_image": "https://static.tumblr.com/fe73805acd3fe89c90d60432886e610c/dh5g9kz/6A6nt8687/tumblr_static_6kvpxnpl5xk44kokgwso4sock.jpg",
                        "header_image_focused": "https://static.tumblr.com/fe73805acd3fe89c90d60432886e610c/dh5g9kz/FBWnt8689/tumblr_static_tumblr_static_6kvpxnpl5xk44kokgwso4sock_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/fe73805acd3fe89c90d60432886e610c/dh5g9kz/6A6nt8687/tumblr_static_6kvpxnpl5xk44kokgwso4sock_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#347153",
                        "title_font": "Verdana",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179514052987"
                },
                "content_raw": "<p>No, I don’t think Jon heads for Aegon. If Jon believes Aegon is the real Rhaegar-spawned deal, I think his reaction is a ships-that-pass-in-the-night sort of deal. Aegon is the brother he could have had; for better or for worse, the brothers he’s got are Robb, Bran, and Rickon.</p>",
                "content": "<p>No, I don&rsquo;t think Jon heads for Aegon. If Jon believes Aegon is the real Rhaegar-spawned deal, I think his reaction is a ships-that-pass-in-the-night sort of deal. Aegon is the brother he could have had; for better or for worse, the brothers he&rsquo;s got are Robb, Bran, and Rickon.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "diogodxlot",
        "blog": {
            "name": "diogodxlot",
            "title": "ole's at the wheel",
            "description": "charvi, 17 / glory glory man united • hala madrid",
            "url": "https://diogodxlot.tumblr.com/",
            "uuid": "t:vS1H8BkZbwYRxHfFnEG2aQ",
            "updated": 1560696593
        },
        "id": 179511503334,
        "post_url": "https://diogodxlot.tumblr.com/post/179511503334/jon-snow-lockscreen-reblog-or-like-if-you-save",
        "slug": "jon-snow-lockscreen-reblog-or-like-if-you-save",
        "date": "2018-10-28 08:56:49 GMT",
        "timestamp": 1540717009,
        "state": "published",
        "format": "html",
        "reblog_key": "M5tSKPli",
        "tags": [
            "lockscreen",
            "jon snow",
            "jon snow lockscreen",
            "jon snow wallpaper"
        ],
        "short_url": "https://tmblr.co/ZguKwg2dBk2dc",
        "summary": "Jon Snow lockscreen\nreblog or like if you save it!🌻\n• I take requests so send me an ask if you have any! •",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 24,
        "title": null,
        "body": "<p>Jon Snow lockscreen</p><figure class=\"tmblr-full\" data-orig-height=\"3416\" data-orig-width=\"1920\"><img src=\"https://66.media.tumblr.com/1923bc825f7478240bab90b3ce4fd1aa/tumblr_phawumNPF01un2ea4_540.jpg\" data-orig-height=\"3416\" data-orig-width=\"1920\"/></figure><p>reblog or like if you save it!🌻</p><p><b><i>• I take requests so send me an ask if you have any! •</i></b></p>",
        "reblog": {
            "comment": "<p>Jon Snow lockscreen</p><figure class=\"tmblr-full\" data-orig-height=\"3416\" data-orig-width=\"1920\"><img src=\"https://66.media.tumblr.com/1923bc825f7478240bab90b3ce4fd1aa/tumblr_phawumNPF01un2ea4_540.jpg\" data-orig-height=\"3416\" data-orig-width=\"1920\"></figure><p>reblog or like if you save it!🌻</p><p><b><i>• I take requests so send me an ask if you have any! •</i></b></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "diogodxlot",
                    "active": true,
                    "theme": {
                        "header_full_width": 677,
                        "header_full_height": 360,
                        "header_focus_width": 640,
                        "header_focus_height": 359,
                        "avatar_shape": "circle",
                        "background_color": "#EEBAAF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,675,359,35",
                        "header_image": "https://static.tumblr.com/e43e0047af77d9ea8d305510d8ebf771/dtljpfs/51splxf87/tumblr_static_1141554272-content.gif",
                        "header_image_focused": "https://static.tumblr.com/e43e0047af77d9ea8d305510d8ebf771/dtljpfs/iJVplxf8b/tumblr_static_tumblr_static_1141554272-content_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/e43e0047af77d9ea8d305510d8ebf771/dtljpfs/51splxf87/tumblr_static_1141554272-content_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#CCA49D",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#E8A395",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179511503334"
                },
                "content_raw": "<p>Jon Snow lockscreen</p><figure class=\"tmblr-full\" data-orig-height=\"3416\" data-orig-width=\"1920\"><img src=\"https://66.media.tumblr.com/1923bc825f7478240bab90b3ce4fd1aa/tumblr_phawumNPF01un2ea4_540.jpg\" data-orig-height=\"3416\" data-orig-width=\"1920\"></figure><p>reblog or like if you save it!🌻</p><p><b><i>• I take requests so send me an ask if you have any! •</i></b></p>",
                "content": "<p>Jon Snow lockscreen</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/1923bc825f7478240bab90b3ce4fd1aa/tumblr_phawumNPF01un2ea4_540.jpg\" class=\"\"/></figure><p>reblog or like if you save it!&#127803;</p><p><b><i>&bull; I take requests so send me an ask if you have any! &bull;</i></b></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "stray-arrows",
        "blog": {
            "name": "stray-arrows",
            "title": " ☾ KING IN THE NORTH ☆ ",
            "description": "iss your ~problematic~ fave |  JON SNOW | CLERITH | CLOUD STRIFE | \n JONERYS | \nMATT MURDOCK | SPACE |  karedevil | kastle | mattelektra | ben poindexter | RICK GRIMES | richonne | CARYL | ichiruki | sasusaku | GAME OF THRONES | aliens | synthwave | the walking dead (1-6) ♥",
            "url": "https://stray-arrows.tumblr.com/",
            "uuid": "t:s0wMvU8xH6AoFIV7_wZFDw",
            "updated": 1561713299
        },
        "id": 179510795757,
        "post_url": "https://stray-arrows.tumblr.com/post/179510795757/how-about-a-new-tag-called-just-jon-snow",
        "slug": "how-about-a-new-tag-called-just-jon-snow",
        "date": "2018-10-28 08:16:07 GMT",
        "timestamp": 1540714567,
        "state": "published",
        "format": "html",
        "reblog_key": "T7d0j0n9",
        "tags": [
            "got",
            "jon snow",
            "game of thrones"
        ],
        "short_url": "https://tmblr.co/ZveGhx2dBhLtj",
        "summary": "how about a new tag called “#just jon snow” ",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 4,
        "title": null,
        "body": "<p>how about a new tag called “#just jon snow” </p>",
        "reblog": {
            "comment": "<p>how about a new tag called “#just jon snow” </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "stray-arrows",
                    "active": true,
                    "theme": {
                        "header_full_width": 604,
                        "header_full_height": 340,
                        "header_focus_width": 604,
                        "header_focus_height": 339,
                        "avatar_shape": "square",
                        "background_color": "#F6F6F6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,604,339,0",
                        "header_image": "https://static.tumblr.com/f0afea764177bbfa85f97cfedcf676d8/rm7knor/dlepr116x/tumblr_static_35jhbxpepi68w40cso8csc8ko.jpg",
                        "header_image_focused": "https://static.tumblr.com/b709c61ac97389a2bc6359acc0c3c969/rm7knor/idepr116y/tumblr_static_tumblr_static_35jhbxpepi68w40cso8csc8ko_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f0afea764177bbfa85f97cfedcf676d8/rm7knor/dlepr116x/tumblr_static_35jhbxpepi68w40cso8csc8ko_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#7f1d1d",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#6f161a",
                        "title_font": "1785 GLC Baskerville",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179510795757"
                },
                "content_raw": "<p>how about a new tag called “#just jon snow” </p>",
                "content": "<p>how about a new tag called&nbsp;&ldquo;#just jon snow&rdquo;&nbsp;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "hypomone535",
        "blog": {
            "name": "hypomone535",
            "title": "Dream of Ice and Fire",
            "description": "<p>I am a Stark of Winterfell</p><p>I am a writer of Jonsa </p>",
            "url": "https://hypomone535.tumblr.com/",
            "uuid": "t:1rvkmACCLHexvyj1H81kfw",
            "updated": 1560903238
        },
        "id": 179508250907,
        "post_url": "https://hypomone535.tumblr.com/post/179508250907/goodnight-im-going-to-bed-to-dream-about-jon-and",
        "slug": "goodnight-im-going-to-bed-to-dream-about-jon-and",
        "date": "2018-10-28 06:07:47 GMT",
        "timestamp": 1540706867,
        "state": "published",
        "format": "html",
        "reblog_key": "V2Ccm2l4",
        "tags": [
            "jonsa",
            "jon snow",
            "asoiaf",
            "sansa stark",
            "winter is here",
            "winds of winter",
            "actually jonsa",
            "game of thrones",
            "got8",
            "winterfell",
            "jonsa is endgame bye",
            "jonsa is my ship",
            "jonsa is endgame",
            "jonsa fandom",
            "jonsa family",
            "jonsa is coming",
            "goodnight"
        ],
        "short_url": "https://tmblr.co/ZQGAFd2dBXeaR",
        "summary": "Goodnight! I’m going to bed to dream about Jon and how he will profess his love to Sansa 👋🏻👋🏻",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 27,
        "title": null,
        "body": "<h1>Goodnight! I’m going to bed to dream about Jon and how he will profess his love to Sansa 👋🏻👋🏻</h1>",
        "reblog": {
            "comment": "<p><h1>Goodnight! I’m going to bed to dream about Jon and how he will profess his love to Sansa 👋🏻👋🏻</h1></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "hypomone535",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 1280,
                        "header_focus_width": 1280,
                        "header_focus_height": 720,
                        "avatar_shape": "square",
                        "background_color": "#BED6E4",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "52,1280,772,0",
                        "header_image": "https://static.tumblr.com/6ae1f6e5e8c9b3c6a9d24b2bd41cce6a/g1rztab/YGyp6ixzg/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/6ae1f6e5e8c9b3c6a9d24b2bd41cce6a/g1rztab/oubp6ixzj/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/6ae1f6e5e8c9b3c6a9d24b2bd41cce6a/g1rztab/YGyp6ixzg/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179508250907"
                },
                "content_raw": "<p><h1>Goodnight! I’m going to bed to dream about Jon and how he will profess his love to Sansa 👋🏻👋🏻</h1></p>",
                "content": "<p><h1>Goodnight! I&rsquo;m going to bed to dream about Jon and how he will profess his love to Sansa &#128075;&#127995;&#128075;&#127995;</h1></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "kwonbomi",
        "blog": {
            "name": "kwonbomi",
            "title": "",
            "description": "Multi-fandom blog. Occasional art blog.  <a href=\"http://kwonbomi.tumblr.com/tagged/my+art\">ART TAG</a> Currently Jonerys trash. SasuSaku is my guilty pleasure. Disney is my inspiration.",
            "url": "https://kwonbomi.tumblr.com/",
            "uuid": "t:vXFxAHJdsiTxSPLodAkwMw",
            "updated": 1561656237
        },
        "id": 179502769132,
        "post_url": "https://kwonbomi.tumblr.com/post/179502769132/the-final-piece-i-owed-for-the-jonerys-charity",
        "slug": "the-final-piece-i-owed-for-the-jonerys-charity",
        "date": "2018-10-28 02:14:44 GMT",
        "timestamp": 1540692884,
        "state": "published",
        "format": "html",
        "reblog_key": "2QMnxVPE",
        "tags": [
            "jonerys charity drive",
            "jonerys",
            "jon snow",
            "daenerys targaryen",
            "jon and dany",
            "jon x dany",
            "my art",
            "kwonbomi",
            "jonerys fic art",
            "jonerys fanart"
        ],
        "short_url": "https://tmblr.co/Z8qsXp2dBCkFi",
        "summary": "The final piece i owed for the Jonerys charity drive for @mhysaofdragons!!! :) This fits in with the “cuddling” prompt. It’s a...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1642,
        "caption": "<p>The final piece i owed for the Jonerys charity drive for <a class=\"tumblelog\" href=\"https://tmblr.co/me0ia9AS76vMZnm5qiSWLmA\">@mhysaofdragons</a>!!! :) This fits in with the “cuddling” prompt. It’s a scene from the newest chapter of her fic <a href=\"https://archiveofourown.org/works/11516265/chapters/25845600\">Say You’ll Remember Me</a>  (which i love so much btw). Go read it if you haven’t already! also give her some love cause it’s her birthday today!<br/></p><p>Anyways! HAPPY BIRTHDAY KRISTEN!!!! &lt;3</p>",
        "reblog": {
            "comment": "<p>The final piece i owed for the Jonerys charity drive for <a class=\"tumblelog\" href=\"https://tmblr.co/me0ia9AS76vMZnm5qiSWLmA\">@mhysaofdragons</a>!!! :) This fits in with the “cuddling” prompt. It’s a scene from the newest chapter of her fic <a href=\"https://archiveofourown.org/works/11516265/chapters/25845600\">Say You’ll Remember Me</a>  (which i love so much btw). Go read it if you haven’t already! also give her some love cause it’s her birthday today!<br></p><p>Anyways! HAPPY BIRTHDAY KRISTEN!!!! &lt;3</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "kwonbomi",
                    "active": true,
                    "theme": {
                        "header_full_width": 3000,
                        "header_full_height": 1055,
                        "header_focus_width": 1875,
                        "header_focus_height": 1055,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,2392,1055,517",
                        "header_image": "https://static.tumblr.com/cf96e828f58286bbda2db6a3000a1bac/eukjiuj/fdIpbtpsm/tumblr_static_1nry6tdu3ftw4oskwk8gkw4co.png",
                        "header_image_focused": "https://static.tumblr.com/cf96e828f58286bbda2db6a3000a1bac/eukjiuj/eampbtpsp/tumblr_static_tumblr_static_1nry6tdu3ftw4oskwk8gkw4co_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/cf96e828f58286bbda2db6a3000a1bac/eukjiuj/fdIpbtpsm/tumblr_static_1nry6tdu3ftw4oskwk8gkw4co_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179502769132"
                },
                "content_raw": "<p>The final piece i owed for the Jonerys charity drive for <a class=\"tumblelog\" href=\"https://tmblr.co/me0ia9AS76vMZnm5qiSWLmA\">@mhysaofdragons</a>!!! :) This fits in with the “cuddling” prompt. It’s a scene from the newest chapter of her fic <a href=\"https://archiveofourown.org/works/11516265/chapters/25845600\">Say You’ll Remember Me</a>  (which i love so much btw). Go read it if you haven’t already! also give her some love cause it’s her birthday today!<br></p><p>Anyways! HAPPY BIRTHDAY KRISTEN!!!! &lt;3</p>",
                "content": "<p>The final piece i owed for the Jonerys charity drive for <a href=\"https://tmblr.co/me0ia9AS76vMZnm5qiSWLmA\">@mhysaofdragons</a>!!! :) This fits in with the&nbsp;&ldquo;cuddling&rdquo; prompt. It&rsquo;s a scene from the newest chapter of her fic <a href=\"https://archiveofourown.org/works/11516265/chapters/25845600\">Say You&rsquo;ll Remember Me</a>&nbsp; (which i love so much btw). Go read it if you haven&rsquo;t already! also give her some love cause it&rsquo;s her birthday today!<br /></p><p>Anyways! HAPPY BIRTHDAY KRISTEN!!!! &lt;3</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://kwonbomi.tumblr.com/image/179502769132",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/6e7554b1409093ab3eba877e29df5d49/tumblr_phae8kzGr11t4abm8o1_1280.png",
                    "width": 904,
                    "height": 909
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/6e7554b1409093ab3eba877e29df5d49/tumblr_phae8kzGr11t4abm8o1_1280.png",
                        "width": 904,
                        "height": 909
                    },
                    {
                        "url": "https://66.media.tumblr.com/6e7554b1409093ab3eba877e29df5d49/tumblr_phae8kzGr11t4abm8o1_640.png",
                        "width": 640,
                        "height": 644
                    },
                    {
                        "url": "https://66.media.tumblr.com/6e7554b1409093ab3eba877e29df5d49/tumblr_phae8kzGr11t4abm8o1_540.png",
                        "width": 540,
                        "height": 543
                    },
                    {
                        "url": "https://66.media.tumblr.com/6e7554b1409093ab3eba877e29df5d49/tumblr_phae8kzGr11t4abm8o1_500.png",
                        "width": 500,
                        "height": 503
                    },
                    {
                        "url": "https://66.media.tumblr.com/6e7554b1409093ab3eba877e29df5d49/tumblr_phae8kzGr11t4abm8o1_400.png",
                        "width": 400,
                        "height": 402
                    },
                    {
                        "url": "https://66.media.tumblr.com/6e7554b1409093ab3eba877e29df5d49/tumblr_phae8kzGr11t4abm8o1_250.png",
                        "width": 250,
                        "height": 251
                    },
                    {
                        "url": "https://66.media.tumblr.com/6e7554b1409093ab3eba877e29df5d49/tumblr_phae8kzGr11t4abm8o1_100.png",
                        "width": 100,
                        "height": 101
                    },
                    {
                        "url": "https://66.media.tumblr.com/6e7554b1409093ab3eba877e29df5d49/tumblr_phae8kzGr11t4abm8o1_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "jonerys-art",
        "blog": {
            "name": "jonerys-art",
            "title": "Ice + Fire",
            "description": "Blog dedicated to art of Jon Snow and Daenerys Targaryen.",
            "url": "https://jonerys-art.tumblr.com/",
            "uuid": "t:1-9pFvudselAunl9tZfwrw",
            "updated": 1561748451
        },
        "id": 179501091063,
        "post_url": "https://jonerys-art.tumblr.com/post/179501091063/game-of-thrones-poster-by-oregon-pizza",
        "slug": "game-of-thrones-poster-by-oregon-pizza",
        "date": "2018-10-28 01:00:46 GMT",
        "timestamp": 1540688446,
        "state": "published",
        "format": "html",
        "reblog_key": "J4crCYSV",
        "tags": [
            "oregon pizza illustration",
            "jon snow",
            "daenerys targaryen",
            "cersei lannister",
            "tyrion lannister",
            "drogon",
            "ensemble",
            "fanart"
        ],
        "short_url": "https://tmblr.co/Z-JR_c2dB6KZt",
        "summary": "Game of Thrones poster by Oregon Pizza Illustration on Behance",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 21,
        "caption": "<p><a href=\"https://www.behance.net/gallery/70562377/GAME-OF-THRONES-poster-art\">Game of Thrones poster</a> by <a href=\"https://www.behance.net/oregonpizza\">Oregon Pizza Illustration</a> on Behance<br/></p>",
        "reblog": {
            "comment": "<p><a href=\"https://www.behance.net/gallery/70562377/GAME-OF-THRONES-poster-art\">Game of Thrones poster</a> by <a href=\"https://www.behance.net/oregonpizza\">Oregon Pizza Illustration</a> on Behance<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jonerys-art",
                    "active": true,
                    "theme": {
                        "header_full_width": 1000,
                        "header_full_height": 500,
                        "header_focus_width": 889,
                        "header_focus_height": 500,
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,944,500,55",
                        "header_image": "https://static.tumblr.com/72dd6c4f457757b33929767edd460918/o2g22ll/e3Spqjv6f/tumblr_static_a959ww7tj08wksskg0kw4c4sg.png",
                        "header_image_focused": "https://static.tumblr.com/9587af85262eb5e77402fc78e18d2855/o2g22ll/vg5pqjv6h/tumblr_static_tumblr_static_a959ww7tj08wksskg0kw4c4sg_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/72dd6c4f457757b33929767edd460918/o2g22ll/e3Spqjv6f/tumblr_static_a959ww7tj08wksskg0kw4c4sg_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#75b1d6",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179501091063"
                },
                "content_raw": "<p><a href=\"https://www.behance.net/gallery/70562377/GAME-OF-THRONES-poster-art\">Game of Thrones poster</a> by <a href=\"https://www.behance.net/oregonpizza\">Oregon Pizza Illustration</a> on Behance<br></p>",
                "content": "<p><a href=\"https://www.behance.net/gallery/70562377/GAME-OF-THRONES-poster-art\">Game of Thrones poster</a> by <a href=\"https://www.behance.net/oregonpizza\">Oregon Pizza Illustration</a> on Behance<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://jonerys-art.tumblr.com/image/179501091063",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/60eaa0f1bda3aa61eda21a146c580d40/tumblr_pfl7qzMh3y1wz1imko1_1280.jpg",
                    "width": 1280,
                    "height": 914
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/60eaa0f1bda3aa61eda21a146c580d40/tumblr_pfl7qzMh3y1wz1imko1_1280.jpg",
                        "width": 1280,
                        "height": 914
                    },
                    {
                        "url": "https://66.media.tumblr.com/60eaa0f1bda3aa61eda21a146c580d40/tumblr_pfl7qzMh3y1wz1imko1_640.jpg",
                        "width": 640,
                        "height": 457
                    },
                    {
                        "url": "https://66.media.tumblr.com/60eaa0f1bda3aa61eda21a146c580d40/tumblr_pfl7qzMh3y1wz1imko1_540.jpg",
                        "width": 540,
                        "height": 386
                    },
                    {
                        "url": "https://66.media.tumblr.com/60eaa0f1bda3aa61eda21a146c580d40/tumblr_pfl7qzMh3y1wz1imko1_500.jpg",
                        "width": 500,
                        "height": 357
                    },
                    {
                        "url": "https://66.media.tumblr.com/60eaa0f1bda3aa61eda21a146c580d40/tumblr_pfl7qzMh3y1wz1imko1_400.jpg",
                        "width": 400,
                        "height": 286
                    },
                    {
                        "url": "https://66.media.tumblr.com/60eaa0f1bda3aa61eda21a146c580d40/tumblr_pfl7qzMh3y1wz1imko1_250.jpg",
                        "width": 250,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/60eaa0f1bda3aa61eda21a146c580d40/tumblr_pfl7qzMh3y1wz1imko1_100.jpg",
                        "width": 100,
                        "height": 71
                    },
                    {
                        "url": "https://66.media.tumblr.com/60eaa0f1bda3aa61eda21a146c580d40/tumblr_pfl7qzMh3y1wz1imko1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "lovelylemoncake",
        "blog": {
            "name": "lovelylemoncake",
            "title": "Ironborn Babe",
            "description": "Sansa | 17 | talented bitch | She/Her | Aspergers Syndrome | Theon Greyjoy Enthusiast | Lots of Theonsa art here",
            "url": "https://lovelylemoncake.tumblr.com/",
            "uuid": "t:Tv46JiHcJaxNIY7O6WscAA",
            "updated": 1561733415
        },
        "id": 179501088354,
        "post_url": "https://lovelylemoncake.tumblr.com/post/179501088354/jon-ygritte",
        "slug": "jon-ygritte",
        "date": "2018-10-28 01:00:41 GMT",
        "timestamp": 1540688441,
        "state": "published",
        "format": "html",
        "reblog_key": "8ZZdnmfw",
        "tags": [
            "jongritte",
            "jon x ygritte",
            "jon snow",
            "ygritte",
            "kissing",
            "otp",
            "queued",
            "doodles",
            "game of thrones",
            "got",
            "asoiaf",
            "my art",
            "mine"
        ],
        "short_url": "https://tmblr.co/ZqIfDg2dB6JvY",
        "summary": "🖤 Jon + Ygritte 🖤",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 8,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"960\"><img src=\"https://66.media.tumblr.com/875ad395a35e0523ec341cf6729dd026/tumblr_pha5uwPi091usf3jp_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"960\"/></figure><p class=\"npf_quirky\" data-npf='{\"subtype\":\"quirky\"}'>🖤 Jon + Ygritte 🖤</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"960\"><img src=\"https://66.media.tumblr.com/875ad395a35e0523ec341cf6729dd026/tumblr_pha5uwPi091usf3jp_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"960\"></figure><p class=\"npf_quirky\" data-npf='{\"subtype\":\"quirky\"}'>🖤 Jon + Ygritte 🖤</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "lovelylemoncake",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 281,
                        "header_focus_width": 499,
                        "header_focus_height": 281,
                        "avatar_shape": "square",
                        "background_color": "#bad0f1",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,499,281,0",
                        "header_image": "https://static.tumblr.com/87a8febc12912e21aad93e956496037e/sjblx4z/Ic4pne6wr/tumblr_static_eulinq81fago840g0cog0o4s8.gif",
                        "header_image_focused": "https://static.tumblr.com/87a8febc12912e21aad93e956496037e/sjblx4z/Ne2pne6wt/tumblr_static_tumblr_static_eulinq81fago840g0cog0o4s8_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/87a8febc12912e21aad93e956496037e/sjblx4z/Ic4pne6wr/tumblr_static_eulinq81fago840g0cog0o4s8_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#5289DB",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#330c1a",
                        "title_font": "Square Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179501088354"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"960\"><img src=\"https://66.media.tumblr.com/875ad395a35e0523ec341cf6729dd026/tumblr_pha5uwPi091usf3jp_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"960\"></figure><p class=\"npf_quirky\" data-npf='{\"subtype\":\"quirky\"}'>🖤 Jon + Ygritte 🖤</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/875ad395a35e0523ec341cf6729dd026/tumblr_pha5uwPi091usf3jp_540.jpg\" class=\"\"/></figure><p class=\"npf_quirky\" data-npf=\"{&quot;subtype&quot;:&quot;quirky&quot;}\">&#128420; Jon + Ygritte &#128420;</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "thronesdragons",
        "blog": {
            "name": "thronesdragons",
            "title": "Game of Thrones",
            "description": "<p><span style=\"color: #00; font-family: Helvetica, Arial, sans-serif; font-size: 12px;\"><a href=\"https://thronesdragons.tumblr.com/\">Game of Thrones (GOT)</a> Fans : Pictures, Art, Memes and More!</span></p>",
            "url": "https://thronesdragons.tumblr.com/",
            "uuid": "t:kfrbcbINX-athn6CZWMlWQ",
            "updated": 1560200770
        },
        "id": 179500538992,
        "post_url": "https://thronesdragons.tumblr.com/post/179500538992/more-night-king-and-night-queen",
        "slug": "more-night-king-and-night-queen",
        "date": "2018-10-28 00:38:46 GMT",
        "timestamp": 1540687126,
        "state": "published",
        "format": "html",
        "reblog_key": "N6TIWvkJ",
        "tags": [
            "Game of Thrones",
            "Got",
            "Jon Snow",
            "Targaryen",
            "Stark",
            "Westeros",
            "Dragons"
        ],
        "short_url": "https://tmblr.co/Zj9jIc2dB4Dnm",
        "summary": "[[MORE]] Night King and Night Queen? .\n.\n#gameofthrones #got #daenerystargaryen #nightking",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 20,
        "caption": "<p><!-- more --> Night King and Night Queen? .<br/>\n.<br/>\n#gameofthrones #got #daenerystargaryen #nightking</p>",
        "caption_abstract": "<p></p>",
        "reblog": {
            "comment": "<p>[[MORE]] Night King and Night Queen? .<br>\n.<br>\n#gameofthrones #got #daenerystargaryen #nightking</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thronesdragons",
                    "active": true,
                    "theme": {
                        "header_full_width": 1063,
                        "header_full_height": 354,
                        "header_focus_width": 621,
                        "header_focus_height": 349,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c.jpg",
                        "header_image_focused": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/CZ2oyee5j/tumblr_static_tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179500538992"
                },
                "content_raw": "<p>[[MORE]] Night King and Night Queen? .<br>\n.<br>\n#gameofthrones #got #daenerystargaryen #nightking</p>",
                "content": "<p> Night King and Night Queen? .<br />\n.<br />\n#gameofthrones #got #daenerystargaryen #nightking</p>",
                "content_abstract": "",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://thronesdragons.tumblr.com/image/179500538992",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/98c8e17aa47d16b246b378440f23443f/tumblr_pha9smlBNn1wfiwxso1_640.jpg",
                    "width": 640,
                    "height": 446
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/98c8e17aa47d16b246b378440f23443f/tumblr_pha9smlBNn1wfiwxso1_640.jpg",
                        "width": 640,
                        "height": 446
                    },
                    {
                        "url": "https://66.media.tumblr.com/98c8e17aa47d16b246b378440f23443f/tumblr_pha9smlBNn1wfiwxso1_540.jpg",
                        "width": 540,
                        "height": 376
                    },
                    {
                        "url": "https://66.media.tumblr.com/98c8e17aa47d16b246b378440f23443f/tumblr_pha9smlBNn1wfiwxso1_500.jpg",
                        "width": 500,
                        "height": 348
                    },
                    {
                        "url": "https://66.media.tumblr.com/98c8e17aa47d16b246b378440f23443f/tumblr_pha9smlBNn1wfiwxso1_400.jpg",
                        "width": 400,
                        "height": 279
                    },
                    {
                        "url": "https://66.media.tumblr.com/98c8e17aa47d16b246b378440f23443f/tumblr_pha9smlBNn1wfiwxso1_250.jpg",
                        "width": 250,
                        "height": 174
                    },
                    {
                        "url": "https://66.media.tumblr.com/98c8e17aa47d16b246b378440f23443f/tumblr_pha9smlBNn1wfiwxso1_100.jpg",
                        "width": 100,
                        "height": 70
                    },
                    {
                        "url": "https://66.media.tumblr.com/98c8e17aa47d16b246b378440f23443f/tumblr_pha9smlBNn1wfiwxso1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "jonsnownoshow",
        "blog": {
            "name": "jonsnownoshow",
            "title": "Jon Snow Show",
            "description": "",
            "url": "https://jonsnownoshow.tumblr.com/",
            "uuid": "t:ZLZNMk1JM9mMVdPY_RPhWw",
            "updated": 1561518825
        },
        "id": 179500472030,
        "post_url": "https://jonsnownoshow.tumblr.com/post/179500472030/kiss-for-the-queen-by-viianki",
        "slug": "kiss-for-the-queen-by-viianki",
        "date": "2018-10-28 00:35:57 GMT",
        "timestamp": 1540686957,
        "state": "published",
        "format": "html",
        "reblog_key": "F523dVK1",
        "tags": [
            "jon snow",
            "daenerys targaryen",
            "jon x daenerys",
            "jon x dany",
            "game of thrones",
            "got art",
            "A Song of Ice and Fire"
        ],
        "short_url": "https://tmblr.co/ZJ4Gsj2dB3zRU",
        "summary": "Kiss for the Queen by Viianki",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 356,
        "caption": "<p>Kiss for the Queen by Viianki</p>",
        "reblog": {
            "comment": "<p>Kiss for the Queen by Viianki</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jonsnownoshow",
                    "active": true,
                    "theme": {
                        "header_full_width": 600,
                        "header_full_height": 373,
                        "header_focus_width": 600,
                        "header_focus_height": 337,
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "32,600,369,0",
                        "header_image": "https://static.tumblr.com/1508866162d278687493c1c520da380e/jzz31xf/HvQo6wnum/tumblr_static_9nrmpzn337cwgksskwks088cs.jpg",
                        "header_image_focused": "https://static.tumblr.com/1508866162d278687493c1c520da380e/jzz31xf/dfqo6wnun/tumblr_static_tumblr_static_9nrmpzn337cwgksskwks088cs_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/1508866162d278687493c1c520da380e/jzz31xf/HvQo6wnum/tumblr_static_9nrmpzn337cwgksskwks088cs_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179500472030"
                },
                "content_raw": "<p>Kiss for the Queen by Viianki</p>",
                "content": "<p>Kiss for the Queen by Viianki</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://jonsnownoshow.tumblr.com/image/179500472030",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/acf7d3b934399dde583f390c2d4de719/tumblr_pha9nxgXAL1ucrb15o1_1280.jpg",
                    "width": 976,
                    "height": 818
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/acf7d3b934399dde583f390c2d4de719/tumblr_pha9nxgXAL1ucrb15o1_1280.jpg",
                        "width": 976,
                        "height": 818
                    },
                    {
                        "url": "https://66.media.tumblr.com/acf7d3b934399dde583f390c2d4de719/tumblr_pha9nxgXAL1ucrb15o1_640.jpg",
                        "width": 640,
                        "height": 536
                    },
                    {
                        "url": "https://66.media.tumblr.com/acf7d3b934399dde583f390c2d4de719/tumblr_pha9nxgXAL1ucrb15o1_540.jpg",
                        "width": 540,
                        "height": 453
                    },
                    {
                        "url": "https://66.media.tumblr.com/acf7d3b934399dde583f390c2d4de719/tumblr_pha9nxgXAL1ucrb15o1_500.jpg",
                        "width": 500,
                        "height": 419
                    },
                    {
                        "url": "https://66.media.tumblr.com/acf7d3b934399dde583f390c2d4de719/tumblr_pha9nxgXAL1ucrb15o1_400.jpg",
                        "width": 400,
                        "height": 335
                    },
                    {
                        "url": "https://66.media.tumblr.com/acf7d3b934399dde583f390c2d4de719/tumblr_pha9nxgXAL1ucrb15o1_250.jpg",
                        "width": 250,
                        "height": 210
                    },
                    {
                        "url": "https://66.media.tumblr.com/acf7d3b934399dde583f390c2d4de719/tumblr_pha9nxgXAL1ucrb15o1_100.jpg",
                        "width": 100,
                        "height": 84
                    },
                    {
                        "url": "https://66.media.tumblr.com/acf7d3b934399dde583f390c2d4de719/tumblr_pha9nxgXAL1ucrb15o1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "christabellanikolai",
        "blog": {
            "name": "christabellanikolai",
            "title": "Christabella Nikolai ~Off Hiatus~",
            "description": "Jonerys fanfiction writer who pissed the fandom off with 'The Untitled', taking a break from my previous stories and currently working on 'Winter's End'.",
            "url": "https://christabellanikolai.tumblr.com/",
            "uuid": "t:WigCP5ChZXBI2TSlU22-wQ",
            "updated": 1561757089
        },
        "id": 179499999243,
        "post_url": "https://christabellanikolai.tumblr.com/post/179499999243/here-is-to-hoping-people-get-my-costume-this",
        "slug": "here-is-to-hoping-people-get-my-costume-this",
        "date": "2018-10-28 00:17:01 GMT",
        "timestamp": 1540685821,
        "state": "published",
        "format": "html",
        "reblog_key": "e4vAK7wc",
        "tags": [
            "jonerys",
            "daenerys x jon",
            "daenerys targaryen",
            "jon snow",
            "game of thrones"
        ],
        "short_url": "https://tmblr.co/ZEBK6d2dB2A0B",
        "summary": "Here is to hoping people get my costume this Halloween...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 16,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/54ea02ea865836683423cdbe19d64a33/tumblr_pha8sdWFQT1v5n2xo_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"/></figure><p>Here is to hoping people get my costume this Halloween&hellip; </p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/54ea02ea865836683423cdbe19d64a33/tumblr_pha8sdWFQT1v5n2xo_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"></figure><p>Here is to hoping people get my costume this Halloween… </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "christabellanikolai",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/438ce368bc035db5c550eed3eaf3c254/4t4ldt1/PdJozdqm3/tumblr_static_9mw0nichgr48w4sscwog4w8sc.png",
                        "header_image_focused": "https://static.tumblr.com/438ce368bc035db5c550eed3eaf3c254/4t4ldt1/PdJozdqm3/tumblr_static_9mw0nichgr48w4sscwog4w8sc.png",
                        "header_image_scaled": "https://static.tumblr.com/438ce368bc035db5c550eed3eaf3c254/4t4ldt1/PdJozdqm3/tumblr_static_9mw0nichgr48w4sscwog4w8sc.png",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#F6F6F6",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179499999243"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/54ea02ea865836683423cdbe19d64a33/tumblr_pha8sdWFQT1v5n2xo_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"></figure><p>Here is to hoping people get my costume this Halloween… </p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/54ea02ea865836683423cdbe19d64a33/tumblr_pha8sdWFQT1v5n2xo_540.jpg\" class=\"\"/></figure><p>Here is to hoping people get my costume this Halloween&hellip; </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "starkthrone",
        "blog": {
            "name": "starkthrone",
            "title": "House Stark🐺",
            "description": "<p> →Winter is here⤵︎</p>",
            "url": "https://starkthrone.tumblr.com/",
            "uuid": "t:UNPCBGsgKpJsXvHF3KSy8Q",
            "updated": 1561681862
        },
        "id": 179499331474,
        "post_url": "https://starkthrone.tumblr.com/post/179499331474/ned-lyanna-stark-6x10",
        "slug": "ned-lyanna-stark-6x10",
        "date": "2018-10-27 23:51:12 GMT",
        "timestamp": 1540684272,
        "state": "published",
        "format": "html",
        "reblog_key": "CU0WvGjF",
        "tags": [
            "game of thrones",
            "arya stark",
            "daenerys targaryen",
            "jon snow",
            "sansa stark",
            "jaime lannister",
            "tyrion lannister",
            "lyanna stark",
            "ned stark",
            "rhaegar targaryen",
            "got edit"
        ],
        "short_url": "https://tmblr.co/Z7NKPd2dA-c_I",
        "summary": "Ned & Lyanna Stark  6x10",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 78,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"640\"><img src=\"https://66.media.tumblr.com/b06c657eed973dfa8a05861c2570cd4e/tumblr_pha7lcbIln1sp38h9_540.jpg\" data-orig-height=\"640\" data-orig-width=\"640\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"640\"><img src=\"https://66.media.tumblr.com/1cc0c44753584217942111d7077d9144/tumblr_pha7lcFy3a1sp38h9_540.jpg\" data-orig-height=\"640\" data-orig-width=\"640\"/></figure><p><i><b>Ned &amp; Lyanna Stark  </b></i>6x10</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"640\"><img src=\"https://66.media.tumblr.com/b06c657eed973dfa8a05861c2570cd4e/tumblr_pha7lcbIln1sp38h9_540.jpg\" data-orig-height=\"640\" data-orig-width=\"640\"></figure><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"640\"><img src=\"https://66.media.tumblr.com/1cc0c44753584217942111d7077d9144/tumblr_pha7lcFy3a1sp38h9_540.jpg\" data-orig-height=\"640\" data-orig-width=\"640\"></figure><p><i><b>Ned & Lyanna Stark  </b></i>6x10</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "starkthrone",
                    "active": true,
                    "theme": {
                        "header_full_width": 632,
                        "header_full_height": 632,
                        "header_focus_width": 632,
                        "header_focus_height": 355,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "277,632,632,0",
                        "header_image": "https://static.tumblr.com/1cd5867eda748cf22ca4a838cc6de248/tfvuwjx/Lcfpqbyt3/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/314807bf82c30c33d8ec7ae06e00f60f/tfvuwjx/zjGpqbyt4/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/1cd5867eda748cf22ca4a838cc6de248/tfvuwjx/Lcfpqbyt3/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FC4081",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#0F9CEF",
                        "title_font": "Gibson",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179499331474"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"640\"><img src=\"https://66.media.tumblr.com/b06c657eed973dfa8a05861c2570cd4e/tumblr_pha7lcbIln1sp38h9_540.jpg\" data-orig-height=\"640\" data-orig-width=\"640\"></figure><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"640\"><img src=\"https://66.media.tumblr.com/1cc0c44753584217942111d7077d9144/tumblr_pha7lcFy3a1sp38h9_540.jpg\" data-orig-height=\"640\" data-orig-width=\"640\"></figure><p><i><b>Ned & Lyanna Stark  </b></i>6x10</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/b06c657eed973dfa8a05861c2570cd4e/tumblr_pha7lcbIln1sp38h9_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/1cc0c44753584217942111d7077d9144/tumblr_pha7lcFy3a1sp38h9_540.jpg\" class=\"\"/></figure><p><i><b>Ned &amp; Lyanna Stark  </b></i>6x10</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]