[
    {
        "type": "text",
        "blog_name": "acourtofhopeanddreams",
        "blog": {
            "name": "acourtofhopeanddreams",
            "title": "Enjoy the little things!",
            "description": "Open your heart\nTo the love of the world\nIt only needs one person\nTouching it with \nA word\nA look\nA smile\nA kiss",
            "url": "https://acourtofhopeanddreams.tumblr.com/",
            "uuid": "t:BS7jn3JbIcnDmWP5dKvmaA",
            "updated": 1561404390
        },
        "id": 179357548685,
        "post_url": "https://acourtofhopeanddreams.tumblr.com/post/179357548685/song-of-ice-and-fire",
        "slug": "song-of-ice-and-fire",
        "date": "2018-10-23 19:36:22 GMT",
        "timestamp": 1540323382,
        "state": "published",
        "format": "html",
        "reblog_key": "COmfony1",
        "tags": [
            "jonsansaweek",
            "jonsansasource",
            "jon snow",
            "Sansa Stark",
            "jonsa",
            "jon snow fanfiction",
            "sansa stark fanfiction",
            "game of thrones",
            "game of thrones fanfiction",
            "got",
            "got fanfiction",
            "day 2: ASOIAF or GOT",
            "ASOIAF"
        ],
        "short_url": "https://tmblr.co/Z8dw4y2d2Ym2D",
        "summary": "Song of Ice and Fire",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 48,
        "title": "Song of Ice and Fire",
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"281\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/tumblr_m9jbq1gJQG1re162ao1_500.gif\" data-orig-height=\"281\" data-orig-width=\"500\"/></figure><p><b>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a> Day 2: <i>ASOIAF</i> or GoT</b></p><blockquote><p><small><i>Jon is a composer looking for a singer, Sansa is a singer looking for songs to sing. It&rsquo;s a match made in heaven.</i></small></p><p><i><small>Modern AU</small></i></p></blockquote><p>“Hello?” The ticks of Sansa’s high heels echoed all around her. The lack of light made it almost impossible for her to see anything and a shiver rolled down her spine while she wrapped her arms around herself in an attempt to keep herself calm. “I&rsquo;m here for the audition?” She bit her lip and resisted the urge to check her phone once more. </p><p>This was the correct address. She had written it down two times. She had checked it four times and she had even walked the route a few days ago already to make sure she wouldn’t get lost today.</p><p>“Hello?” She swallowed. Due to the absolute silence she could hear her own heart beating in her chest. </p><p>What if someone pulled a prank on her? What if this audition was fake? What if somehow this was a trick to get her drugged and force her to do things she didn’t even want to think about?</p><p>She had read those stories. She had seen the warnings all of the internet. And yet, she had not thought that this audition was one of those things. It had seemed too real and when she had googled the composer she had found way more information about him that she had wanted.</p><p>Like that one picture where he was playing his guitar, a frown on his forehead and a concentrated look on his face. His long black curls covered half of his face, but somehow Sansa had been mesmerized by the photo. </p><p>“Jon? Jon Snow?” She was just about to turn around when the lights all of a sudden turned on. A high pitched scream escaped her lips and Sansa didn’t dare to look at the door opening behind her.</p><!-- more --><p>“I&rsquo;m so sorry…” A warm, deep voice interrupted the deafening silence and a man with a guitar case hurried past her towards the corner of the room. “I promise I’m usually never late.” He started to unpack his backpack and case, plugging both the microphone and the guitar in. “Ghost, my dog, thought this was the perfect moment to feed himself my cables. I had to get new ones to give you a fair chance.” Finally he looked up and his eyes widened while his jaws dropped when his glance met hers.</p><p>“Jon Snow?” Sansa straightened her back and lifted her chin. Her heartbeat had not fully slowed down yet and she could stil feel chicken skin covering her entire body. But with as much confidence as she could muster she walked towards the young man and held out her hand. “I&rsquo;m Sansa Stark. I came here for the audition?”</p><p>Jon kept on staring at her when he placed his hand in hers and shook it. “Jon, Jon Snow.” He let out a deep breath and almost stumbled over his own feet when he walked backwards to continue getting everything ready. “But you already know that, else you wouldn’t be here.”</p><p>Strangely enough his clumsiness eased her nerves a little and Sansa’s smile relaxed slightly while she watched how he placed the guitar on a chair and tried to guess the right height for the microphone. </p><p>His hands trembled a little while he searched for his sheet music. He was not exactly what Sansa had expected, but right now she was not sure if that was a bad or maybe more of a good thing.</p><p>“I don’t know if you’ll like the songs.” Jon looked up and shrugged. “I mean, I’m looking for a singer and the sooner the better, but…” He scratched the back of his neck. “If you don’t like it, you can say you don’t wanna do this. It’s not just me picking you, it’s you picking me too.”</p><p>Sansa nodded and despite this being her audition, she got the feeling that she was the one having to make him feel at ease. “I&rsquo;m sure everything will be fine.” She walked towards the music stand and stared at the song, at the tones, at the lyrics. She had never been that good at reading and singing straight from the sheet, but with the right musical arrangement, she would hopefully not fail too badly.</p><p>“Are you ready?” Jon walked to the seat in the corner and reached for his guitar. His fingers tuned the strings a little and then he nodded at her once more. “Do you want something to drink first? Water? Tea?” He swallowed, as if he all of sudden realized he should have asked her this before showing her the sheet music and grabbing his guitar.</p><p>“I&rsquo;ll be fine. I drank something at home and warmed up my voice. I’m ready when you are.” Sansa smiled at him and then she stared at the sheet music again. “You’ve picked an interesting title here.” She cocked her head slightly. “A Song of Ice and Fire.”</p><p>“It&rsquo;s just…” Jon paused for a moment. “It’s just a working title. If this works out between us, we can go over the text and title together and see if we have to change anything.”</p><p>Sansa shook her head. “I meant it as a compliment, Jon. I like it. It stands out. It’s different.” She reached for the microphone and took it out of the stand. “Whenever you start playing, I’ll start singing.” She smiled once more and waited.</p><p>For a few long seconds nothing happened, but then Jon’s fingers started to move, started to play. The intro of his song echoed through the room, sounding so different from her ticking heals and her high pitched scream. In a way his song was mesmerizing and enchanting and Sansa almost forgot that she was supposed to add the lyrics.</p><p>But as soon as she started singing, she felt everything click and come together. She had no problem following the melody, perfectly harmonizing with the chords from the guitar. And even though the lyrics were brand new to her, she didn’t stutter and didn’t trip over words. This was what her voice was made for. This was what she had been looking for all this time.</p><p>When the song was eventually over she didn’t want to open her eyes, but the silence slowly drove away the magical feeling and she could no longer live in a moment that had already passed. “That was…”</p><p>“Enchanting.” Jon finished her sentence and jumped up from his seat, his guitar still in his hands. “That was perfect. Absolutely perfect.” He placed a hand on her shoulder. “That was how I wanted the song to sound, how it sounded in my dreams…” He kissed her cheek, but as soon as he realized what he had done he stepped back. “I&rsquo;m sorry, that was…”</p><p>“It&rsquo;s okay.” Sansa smiled and she pressed the palm of her hand to his cheek. “I recognize a perfect match when I feel one.” She pecked his cheek too and then she stepped back. “One more song before we grab a coffee to talk over the details of our musical future?”</p><p>Jon nodded eagerly and he searched for another sheet of music. </p><p>But that one song turned into three and into ten. And eventually those ten songs turned into a lifetime of songs and love.</p>",
        "body_abstract": "\n<figure class=\"tmblr-full\" data-orig-height=\"281\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/tumblr_m9jbq1gJQG1re162ao1_500.gif\" data-orig-height=\"281\" data-orig-width=\"500\"></figure><p><b>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a> Day 2: <i>ASOIAF</i> or GoT</b></p>\n<blockquote>\n<p><small><i>Jon is a composer looking for a singer, Sansa is a singer looking for songs to sing. It&rsquo;s a match made in heaven.</i></small></p>\n<p><i><small>Modern AU</small></i></p>\n</blockquote>\n<p>&ldquo;Hello?&rdquo; The ticks of Sansa&rsquo;s high heels echoed all around her. The lack of light made it almost impossible for her to see anything and a shiver rolled down her spine while she wrapped her arms around herself in an attempt to keep herself calm. &ldquo;I&rsquo;m here for the audition?&rdquo; She bit her lip and resisted the urge to check her phone once more. </p>\n<p>This was the correct address. She had written it down two times. She had checked it four times and she had even walked the route a few days ago already to make sure she wouldn&rsquo;t get lost today.</p>\n<p>&ldquo;Hello?&rdquo; She swallowed. Due to the absolute silence she could hear her own heart beating in her chest. </p>\n<p>What if someone pulled a prank on her? What if this audition was fake? What if somehow this was a trick to get her drugged and force her to do things she didn&rsquo;t even want to think about?</p>\n<p>She had read those stories. She had seen the warnings all of the internet. And yet, she had not thought that this audition was one of those things. It had seemed too real and when she had googled the composer she had found way more information about him that she had wanted.</p>\n<p>Like that one picture where he was playing his guitar, a frown on his forehead and a concentrated look on his face. His long black curls covered half of his face, but somehow Sansa had been mesmerized by the photo. </p>\n<p>&ldquo;Jon? Jon Snow?&rdquo; She was just about to turn around when the lights all of a sudden turned on. A high pitched scream escaped her lips and Sansa didn&rsquo;t dare to look at the door opening behind her.</p>\n",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"281\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/tumblr_m9jbq1gJQG1re162ao1_500.gif\" data-orig-height=\"281\" data-orig-width=\"500\"></figure><p><b>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a> Day 2: <i>ASOIAF</i> or GoT</b></p><blockquote><p><small><i>Jon is a composer looking for a singer, Sansa is a singer looking for songs to sing. It’s a match made in heaven.</i></small></p><p><i><small>Modern AU</small></i></p></blockquote><p>“Hello?” The ticks of Sansa’s high heels echoed all around her. The lack of light made it almost impossible for her to see anything and a shiver rolled down her spine while she wrapped her arms around herself in an attempt to keep herself calm. “I’m here for the audition?” She bit her lip and resisted the urge to check her phone once more. </p><p>This was the correct address. She had written it down two times. She had checked it four times and she had even walked the route a few days ago already to make sure she wouldn’t get lost today.</p><p>“Hello?” She swallowed. Due to the absolute silence she could hear her own heart beating in her chest. </p><p>What if someone pulled a prank on her? What if this audition was fake? What if somehow this was a trick to get her drugged and force her to do things she didn’t even want to think about?</p><p>She had read those stories. She had seen the warnings all of the internet. And yet, she had not thought that this audition was one of those things. It had seemed too real and when she had googled the composer she had found way more information about him that she had wanted.</p><p>Like that one picture where he was playing his guitar, a frown on his forehead and a concentrated look on his face. His long black curls covered half of his face, but somehow Sansa had been mesmerized by the photo. </p><p>“Jon? Jon Snow?” She was just about to turn around when the lights all of a sudden turned on. A high pitched scream escaped her lips and Sansa didn’t dare to look at the door opening behind her.</p>[[MORE]]<p>“I’m so sorry…” A warm, deep voice interrupted the deafening silence and a man with a guitar case hurried past her towards the corner of the room. “I promise I’m usually never late.” He started to unpack his backpack and case, plugging both the microphone and the guitar in. “Ghost, my dog, thought this was the perfect moment to feed himself my cables. I had to get new ones to give you a fair chance.” Finally he looked up and his eyes widened while his jaws dropped when his glance met hers.</p><p>“Jon Snow?” Sansa straightened her back and lifted her chin. Her heartbeat had not fully slowed down yet and she could stil feel chicken skin covering her entire body. But with as much confidence as she could muster she walked towards the young man and held out her hand. “I’m Sansa Stark. I came here for the audition?”</p><p>Jon kept on staring at her when he placed his hand in hers and shook it. “Jon, Jon Snow.” He let out a deep breath and almost stumbled over his own feet when he walked backwards to continue getting everything ready. “But you already know that, else you wouldn’t be here.”</p><p>Strangely enough his clumsiness eased her nerves a little and Sansa’s smile relaxed slightly while she watched how he placed the guitar on a chair and tried to guess the right height for the microphone. </p><p>His hands trembled a little while he searched for his sheet music. He was not exactly what Sansa had expected, but right now she was not sure if that was a bad or maybe more of a good thing.</p><p>“I don’t know if you’ll like the songs.” Jon looked up and shrugged. “I mean, I’m looking for a singer and the sooner the better, but…” He scratched the back of his neck. “If you don’t like it, you can say you don’t wanna do this. It’s not just me picking you, it’s you picking me too.”</p><p>Sansa nodded and despite this being her audition, she got the feeling that she was the one having to make him feel at ease. “I’m sure everything will be fine.” She walked towards the music stand and stared at the song, at the tones, at the lyrics. She had never been that good at reading and singing straight from the sheet, but with the right musical arrangement, she would hopefully not fail too badly.</p><p>“Are you ready?” Jon walked to the seat in the corner and reached for his guitar. His fingers tuned the strings a little and then he nodded at her once more. “Do you want something to drink first? Water? Tea?” He swallowed, as if he all of sudden realized he should have asked her this before showing her the sheet music and grabbing his guitar.</p><p>“I’ll be fine. I drank something at home and warmed up my voice. I’m ready when you are.” Sansa smiled at him and then she stared at the sheet music again. “You’ve picked an interesting title here.” She cocked her head slightly. “A Song of Ice and Fire.”</p><p>“It’s just…” Jon paused for a moment. “It’s just a working title. If this works out between us, we can go over the text and title together and see if we have to change anything.”</p><p>Sansa shook her head. “I meant it as a compliment, Jon. I like it. It stands out. It’s different.” She reached for the microphone and took it out of the stand. “Whenever you start playing, I’ll start singing.” She smiled once more and waited.</p><p>For a few long seconds nothing happened, but then Jon’s fingers started to move, started to play. The intro of his song echoed through the room, sounding so different from her ticking heals and her high pitched scream. In a way his song was mesmerizing and enchanting and Sansa almost forgot that she was supposed to add the lyrics.</p><p>But as soon as she started singing, she felt everything click and come together. She had no problem following the melody, perfectly harmonizing with the chords from the guitar. And even though the lyrics were brand new to her, she didn’t stutter and didn’t trip over words. This was what her voice was made for. This was what she had been looking for all this time.</p><p>When the song was eventually over she didn’t want to open her eyes, but the silence slowly drove away the magical feeling and she could no longer live in a moment that had already passed. “That was…”</p><p>“Enchanting.” Jon finished her sentence and jumped up from his seat, his guitar still in his hands. “That was perfect. Absolutely perfect.” He placed a hand on her shoulder. “That was how I wanted the song to sound, how it sounded in my dreams…” He kissed her cheek, but as soon as he realized what he had done he stepped back. “I’m sorry, that was…”</p><p>“It’s okay.” Sansa smiled and she pressed the palm of her hand to his cheek. “I recognize a perfect match when I feel one.” She pecked his cheek too and then she stepped back. “One more song before we grab a coffee to talk over the details of our musical future?”</p><p>Jon nodded eagerly and he searched for another sheet of music. </p><p>But that one song turned into three and into ten. And eventually those ten songs turned into a lifetime of songs and love.</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "acourtofhopeanddreams",
                    "active": true,
                    "theme": {
                        "header_full_width": 600,
                        "header_full_height": 300,
                        "header_focus_width": 533,
                        "header_focus_height": 300,
                        "avatar_shape": "square",
                        "background_color": "#d11d1d",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,566,300,33",
                        "header_image": "https://static.tumblr.com/7782d7a0e4100830708f02baf3f0e357/myrfjlp/iFbpqvvuo/tumblr_static_cq37wlgbuqgcs0w00o4s800o0.gif",
                        "header_image_focused": "https://static.tumblr.com/7782d7a0e4100830708f02baf3f0e357/myrfjlp/i68pqvvus/tumblr_static_tumblr_static_cq37wlgbuqgcs0w00o4s800o0_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/7782d7a0e4100830708f02baf3f0e357/myrfjlp/iFbpqvvuo/tumblr_static_cq37wlgbuqgcs0w00o4s800o0_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#fcb68f",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#fcb68f",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179357548685"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"281\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/tumblr_m9jbq1gJQG1re162ao1_500.gif\" data-orig-height=\"281\" data-orig-width=\"500\"></figure><p><b>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a> Day 2: <i>ASOIAF</i> or GoT</b></p><blockquote><p><small><i>Jon is a composer looking for a singer, Sansa is a singer looking for songs to sing. It’s a match made in heaven.</i></small></p><p><i><small>Modern AU</small></i></p></blockquote><p>“Hello?” The ticks of Sansa’s high heels echoed all around her. The lack of light made it almost impossible for her to see anything and a shiver rolled down her spine while she wrapped her arms around herself in an attempt to keep herself calm. “I’m here for the audition?” She bit her lip and resisted the urge to check her phone once more. </p><p>This was the correct address. She had written it down two times. She had checked it four times and she had even walked the route a few days ago already to make sure she wouldn’t get lost today.</p><p>“Hello?” She swallowed. Due to the absolute silence she could hear her own heart beating in her chest. </p><p>What if someone pulled a prank on her? What if this audition was fake? What if somehow this was a trick to get her drugged and force her to do things she didn’t even want to think about?</p><p>She had read those stories. She had seen the warnings all of the internet. And yet, she had not thought that this audition was one of those things. It had seemed too real and when she had googled the composer she had found way more information about him that she had wanted.</p><p>Like that one picture where he was playing his guitar, a frown on his forehead and a concentrated look on his face. His long black curls covered half of his face, but somehow Sansa had been mesmerized by the photo. </p><p>“Jon? Jon Snow?” She was just about to turn around when the lights all of a sudden turned on. A high pitched scream escaped her lips and Sansa didn’t dare to look at the door opening behind her.</p>[[MORE]]<p>“I’m so sorry…” A warm, deep voice interrupted the deafening silence and a man with a guitar case hurried past her towards the corner of the room. “I promise I’m usually never late.” He started to unpack his backpack and case, plugging both the microphone and the guitar in. “Ghost, my dog, thought this was the perfect moment to feed himself my cables. I had to get new ones to give you a fair chance.” Finally he looked up and his eyes widened while his jaws dropped when his glance met hers.</p><p>“Jon Snow?” Sansa straightened her back and lifted her chin. Her heartbeat had not fully slowed down yet and she could stil feel chicken skin covering her entire body. But with as much confidence as she could muster she walked towards the young man and held out her hand. “I’m Sansa Stark. I came here for the audition?”</p><p>Jon kept on staring at her when he placed his hand in hers and shook it. “Jon, Jon Snow.” He let out a deep breath and almost stumbled over his own feet when he walked backwards to continue getting everything ready. “But you already know that, else you wouldn’t be here.”</p><p>Strangely enough his clumsiness eased her nerves a little and Sansa’s smile relaxed slightly while she watched how he placed the guitar on a chair and tried to guess the right height for the microphone. </p><p>His hands trembled a little while he searched for his sheet music. He was not exactly what Sansa had expected, but right now she was not sure if that was a bad or maybe more of a good thing.</p><p>“I don’t know if you’ll like the songs.” Jon looked up and shrugged. “I mean, I’m looking for a singer and the sooner the better, but…” He scratched the back of his neck. “If you don’t like it, you can say you don’t wanna do this. It’s not just me picking you, it’s you picking me too.”</p><p>Sansa nodded and despite this being her audition, she got the feeling that she was the one having to make him feel at ease. “I’m sure everything will be fine.” She walked towards the music stand and stared at the song, at the tones, at the lyrics. She had never been that good at reading and singing straight from the sheet, but with the right musical arrangement, she would hopefully not fail too badly.</p><p>“Are you ready?” Jon walked to the seat in the corner and reached for his guitar. His fingers tuned the strings a little and then he nodded at her once more. “Do you want something to drink first? Water? Tea?” He swallowed, as if he all of sudden realized he should have asked her this before showing her the sheet music and grabbing his guitar.</p><p>“I’ll be fine. I drank something at home and warmed up my voice. I’m ready when you are.” Sansa smiled at him and then she stared at the sheet music again. “You’ve picked an interesting title here.” She cocked her head slightly. “A Song of Ice and Fire.”</p><p>“It’s just…” Jon paused for a moment. “It’s just a working title. If this works out between us, we can go over the text and title together and see if we have to change anything.”</p><p>Sansa shook her head. “I meant it as a compliment, Jon. I like it. It stands out. It’s different.” She reached for the microphone and took it out of the stand. “Whenever you start playing, I’ll start singing.” She smiled once more and waited.</p><p>For a few long seconds nothing happened, but then Jon’s fingers started to move, started to play. The intro of his song echoed through the room, sounding so different from her ticking heals and her high pitched scream. In a way his song was mesmerizing and enchanting and Sansa almost forgot that she was supposed to add the lyrics.</p><p>But as soon as she started singing, she felt everything click and come together. She had no problem following the melody, perfectly harmonizing with the chords from the guitar. And even though the lyrics were brand new to her, she didn’t stutter and didn’t trip over words. This was what her voice was made for. This was what she had been looking for all this time.</p><p>When the song was eventually over she didn’t want to open her eyes, but the silence slowly drove away the magical feeling and she could no longer live in a moment that had already passed. “That was…”</p><p>“Enchanting.” Jon finished her sentence and jumped up from his seat, his guitar still in his hands. “That was perfect. Absolutely perfect.” He placed a hand on her shoulder. “That was how I wanted the song to sound, how it sounded in my dreams…” He kissed her cheek, but as soon as he realized what he had done he stepped back. “I’m sorry, that was…”</p><p>“It’s okay.” Sansa smiled and she pressed the palm of her hand to his cheek. “I recognize a perfect match when I feel one.” She pecked his cheek too and then she stepped back. “One more song before we grab a coffee to talk over the details of our musical future?”</p><p>Jon nodded eagerly and he searched for another sheet of music. </p><p>But that one song turned into three and into ten. And eventually those ten songs turned into a lifetime of songs and love.</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/tumblr_m9jbq1gJQG1re162ao1_500.gif\" class=\"\"/></figure><p><b>Written for <a href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a> Day 2: <i>ASOIAF</i> or GoT</b></p><blockquote><p><small><i>Jon is a composer looking for a singer, Sansa is a singer looking for songs to sing. It&rsquo;s a match made in heaven.</i></small></p><p><i><small>Modern AU</small></i></p></blockquote><p>&ldquo;Hello?&rdquo; The ticks of Sansa&rsquo;s high heels echoed all around her. The lack of light made it almost impossible for her to see anything and a shiver rolled down her spine while she wrapped her arms around herself in an attempt to keep herself calm. &ldquo;I&rsquo;m here for the audition?&rdquo; She bit her lip and resisted the urge to check her phone once more. </p><p>This was the correct address. She had written it down two times. She had checked it four times and she had even walked the route a few days ago already to make sure she wouldn&rsquo;t get lost today.</p><p>&ldquo;Hello?&rdquo; She swallowed. Due to the absolute silence she could hear her own heart beating in her chest. </p><p>What if someone pulled a prank on her? What if this audition was fake? What if somehow this was a trick to get her drugged and force her to do things she didn&rsquo;t even want to think about?</p><p>She had read those stories. She had seen the warnings all of the internet. And yet, she had not thought that this audition was one of those things. It had seemed too real and when she had googled the composer she had found way more information about him that she had wanted.</p><p>Like that one picture where he was playing his guitar, a frown on his forehead and a concentrated look on his face. His long black curls covered half of his face, but somehow Sansa had been mesmerized by the photo. </p><p>&ldquo;Jon? Jon Snow?&rdquo; She was just about to turn around when the lights all of a sudden turned on. A high pitched scream escaped her lips and Sansa didn&rsquo;t dare to look at the door opening behind her.</p><p>&ldquo;I&rsquo;m so sorry&hellip;&rdquo; A warm, deep voice interrupted the deafening silence and a man with a guitar case hurried past her towards the corner of the room. &ldquo;I promise I&rsquo;m usually never late.&rdquo; He started to unpack his backpack and case, plugging both the microphone and the guitar in. &ldquo;Ghost, my dog, thought this was the perfect moment to feed himself my cables. I had to get new ones to give you a fair chance.&rdquo; Finally he looked up and his eyes widened while his jaws dropped when his glance met hers.</p><p>&ldquo;Jon Snow?&rdquo; Sansa straightened her back and lifted her chin. Her heartbeat had not fully slowed down yet and she could stil feel chicken skin covering her entire body. But with as much confidence as she could muster she walked towards the young man and held out her hand. &ldquo;I&rsquo;m Sansa Stark. I came here for the audition?&rdquo;</p><p>Jon kept on staring at her when he placed his hand in hers and shook it. &ldquo;Jon, Jon Snow.&rdquo; He let out a deep breath and almost stumbled over his own feet when he walked backwards to continue getting everything ready. &ldquo;But you already know that, else you wouldn&rsquo;t be here.&rdquo;</p><p>Strangely enough his clumsiness eased her nerves a little and Sansa&rsquo;s smile relaxed slightly while she watched how he placed the guitar on a chair and tried to guess the right height for the microphone. </p><p>His hands trembled a little while he searched for his sheet music. He was not exactly what Sansa had expected, but right now she was not sure if that was a bad or maybe more of a good thing.</p><p>&ldquo;I don&rsquo;t know if you&rsquo;ll like the songs.&rdquo; Jon looked up and shrugged. &ldquo;I mean, I&rsquo;m looking for a singer and the sooner the better, but&hellip;&rdquo; He scratched the back of his neck. &ldquo;If you don&rsquo;t like it, you can say you don&rsquo;t wanna do this. It&rsquo;s not just me picking you, it&rsquo;s you picking me too.&rdquo;</p><p>Sansa nodded and despite this being her audition, she got the feeling that she was the one having to make him feel at ease. &ldquo;I&rsquo;m sure everything will be fine.&rdquo; She walked towards the music stand and stared at the song, at the tones, at the lyrics. She had never been that good at reading and singing straight from the sheet, but with the right musical arrangement, she would hopefully not fail too badly.</p><p>&ldquo;Are you ready?&rdquo; Jon walked to the seat in the corner and reached for his guitar. His fingers tuned the strings a little and then he nodded at her once more. &ldquo;Do you want something to drink first? Water? Tea?&rdquo; He swallowed, as if he all of sudden realized he should have asked her this before showing her the sheet music and grabbing his guitar.</p><p>&ldquo;I&rsquo;ll be fine. I drank something at home and warmed up my voice. I&rsquo;m ready when you are.&rdquo; Sansa smiled at him and then she stared at the sheet music again. &ldquo;You&rsquo;ve picked an interesting title here.&rdquo; She cocked her head slightly. &ldquo;A Song of Ice and Fire.&rdquo;</p><p>&ldquo;It&rsquo;s just&hellip;&rdquo; Jon paused for a moment. &ldquo;It&rsquo;s just a working title. If this works out between us, we can go over the text and title together and see if we have to change anything.&rdquo;</p><p>Sansa shook her head. &ldquo;I meant it as a compliment, Jon. I like it. It stands out. It&rsquo;s different.&rdquo; She reached for the microphone and took it out of the stand. &ldquo;Whenever you start playing, I&rsquo;ll start singing.&rdquo; She smiled once more and waited.</p><p>For a few long seconds nothing happened, but then Jon&rsquo;s fingers started to move, started to play. The intro of his song echoed through the room, sounding so different from her ticking heals and her high pitched scream. In a way his song was mesmerizing and enchanting and Sansa almost forgot that she was supposed to add the lyrics.</p><p>But as soon as she started singing, she felt everything click and come together. She had no problem following the melody, perfectly harmonizing with the chords from the guitar. And even though the lyrics were brand new to her, she didn&rsquo;t stutter and didn&rsquo;t trip over words. This was what her voice was made for. This was what she had been looking for all this time.</p><p>When the song was eventually over she didn&rsquo;t want to open her eyes, but the silence slowly drove away the magical feeling and she could no longer live in a moment that had already passed. &ldquo;That was&hellip;&rdquo;</p><p>&ldquo;Enchanting.&rdquo; Jon finished her sentence and jumped up from his seat, his guitar still in his hands. &ldquo;That was perfect. Absolutely perfect.&rdquo; He placed a hand on her shoulder. &ldquo;That was how I wanted the song to sound, how it sounded in my dreams&hellip;&rdquo; He kissed her cheek, but as soon as he realized what he had done he stepped back. &ldquo;I&rsquo;m sorry, that was&hellip;&rdquo;</p><p>&ldquo;It&rsquo;s okay.&rdquo; Sansa smiled and she pressed the palm of her hand to his cheek. &ldquo;I recognize a perfect match when I feel one.&rdquo; She pecked his cheek too and then she stepped back. &ldquo;One more song before we grab a coffee to talk over the details of our musical future?&rdquo;</p><p>Jon nodded eagerly and he searched for another sheet of music. </p><p>But that one song turned into three and into ten. And eventually those ten songs turned into a lifetime of songs and love.</p></p>",
                "content_abstract": "<p>\n<figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/tumblr_m9jbq1gJQG1re162ao1_500.gif\" class=\"\"/></figure>\n<p><b>Written for <a href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a> Day 2: <i>ASOIAF</i> or GoT</b></p>\n<blockquote>\n<p><small><i>Jon is a composer looking for a singer, Sansa is a singer looking for songs to sing. It&rsquo;s a match made in heaven.</i></small></p>\n<p><i><small>Modern AU</small></i></p>\n</blockquote>\n<p>&ldquo;Hello?&rdquo; The ticks of Sansa&rsquo;s high heels echoed all around her. The lack of light made it almost impossible for her to see anything and a shiver rolled down her spine while she wrapped her arms around herself in an attempt to keep herself calm. &ldquo;I&rsquo;m here for the audition?&rdquo; She bit her lip and resisted the urge to check her phone once more. </p>\n<p>This was the correct address. She had written it down two times. She had checked it four times and she had even walked the route a few days ago already to make sure she wouldn&rsquo;t get lost today.</p>\n<p>&ldquo;Hello?&rdquo; She swallowed. Due to the absolute silence she could hear her own heart beating in her chest. </p>\n<p>What if someone pulled a prank on her? What if this audition was fake? What if somehow this was a trick to get her drugged and force her to do things she didn&rsquo;t even want to think about?</p>\n<p>She had read those stories. She had seen the warnings all of the internet. And yet, she had not thought that this audition was one of those things. It had seemed too real and when she had googled the composer she had found way more information about him that she had wanted.</p>\n<p>Like that one picture where he was playing his guitar, a frown on his forehead and a concentrated look on his face. His long black curls covered half of his face, but somehow Sansa had been mesmerized by the photo. </p>\n<p>&ldquo;Jon? Jon Snow?&rdquo; She was just about to turn around when the lights all of a sudden turned on. A high pitched scream escaped her lips and Sansa didn&rsquo;t dare to look at the door opening behind her.</p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "daenerysiseverything",
        "blog": {
            "name": "daenerysiseverything",
            "title": "my queen",
            "description": "<p>fire cannot kill a dragon.♥</p>",
            "url": "https://daenerysiseverything.tumblr.com/",
            "uuid": "t:_1d5FsHVvzovu6YL1MS1JA",
            "updated": 1561721788
        },
        "id": 179354647650,
        "post_url": "https://daenerysiseverything.tumblr.com/post/179354647650/winter-has-come",
        "slug": "winter-has-come",
        "date": "2018-10-23 17:49:43 GMT",
        "timestamp": 1540316983,
        "state": "published",
        "format": "html",
        "reblog_key": "1xLZ7vQN",
        "tags": [
            "jonerys",
            "jon snow",
            "game of thrones",
            "asoiaf",
            "a song of ice and fire",
            "got",
            "white walkers",
            "the night king",
            "winter",
            "house stark",
            "joenerysiseverything",
            "fire"
        ],
        "short_url": "https://tmblr.co/Zcrjlb2d2NhnY",
        "summary": "winter has come.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 88,
        "caption": "<p><i>winter has come.</i></p>",
        "reblog": {
            "comment": "<p><i>winter has come.</i></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "daenerysiseverything",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 360,
                        "header_focus_width": 470,
                        "header_focus_height": 265,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,571,265,101",
                        "header_image": "https://static.tumblr.com/af68b52873c1b029e3b3809563596916/hdnook7/t8yp12hos/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/af68b52873c1b029e3b3809563596916/hdnook7/EkDp12hot/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/af68b52873c1b029e3b3809563596916/hdnook7/t8yp12hos/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#e77994",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#E77994",
                        "title_font": "Avalon",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179354647650"
                },
                "content_raw": "<p><i>winter has come.</i></p>",
                "content": "<p><i>winter has come.</i></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "2222",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/aa61c5a34dca87d498f99e2533f6501f/tumblr_ph2c6vDJH41wlp4jzo1_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/aa61c5a34dca87d498f99e2533f6501f/tumblr_ph2c6vDJH41wlp4jzo1_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/aa61c5a34dca87d498f99e2533f6501f/tumblr_ph2c6vDJH41wlp4jzo1_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/aa61c5a34dca87d498f99e2533f6501f/tumblr_ph2c6vDJH41wlp4jzo1_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/aa61c5a34dca87d498f99e2533f6501f/tumblr_ph2c6vDJH41wlp4jzo1_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/aa61c5a34dca87d498f99e2533f6501f/tumblr_ph2c6vDJH41wlp4jzo1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/7f7adc9335754b7261699d419cf30ed2/tumblr_ph2c6vDJH41wlp4jzo6_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/7f7adc9335754b7261699d419cf30ed2/tumblr_ph2c6vDJH41wlp4jzo6_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/7f7adc9335754b7261699d419cf30ed2/tumblr_ph2c6vDJH41wlp4jzo6_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/7f7adc9335754b7261699d419cf30ed2/tumblr_ph2c6vDJH41wlp4jzo6_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/7f7adc9335754b7261699d419cf30ed2/tumblr_ph2c6vDJH41wlp4jzo6_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/7f7adc9335754b7261699d419cf30ed2/tumblr_ph2c6vDJH41wlp4jzo6_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/305edc48326492feb8fe8b0020b54a0c/tumblr_ph2c6vDJH41wlp4jzo5_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/305edc48326492feb8fe8b0020b54a0c/tumblr_ph2c6vDJH41wlp4jzo5_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/305edc48326492feb8fe8b0020b54a0c/tumblr_ph2c6vDJH41wlp4jzo5_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/305edc48326492feb8fe8b0020b54a0c/tumblr_ph2c6vDJH41wlp4jzo5_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/305edc48326492feb8fe8b0020b54a0c/tumblr_ph2c6vDJH41wlp4jzo5_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/305edc48326492feb8fe8b0020b54a0c/tumblr_ph2c6vDJH41wlp4jzo5_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/eef1653b09d0ed69185ae6edc739892a/tumblr_ph2c6vDJH41wlp4jzo7_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/eef1653b09d0ed69185ae6edc739892a/tumblr_ph2c6vDJH41wlp4jzo7_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/eef1653b09d0ed69185ae6edc739892a/tumblr_ph2c6vDJH41wlp4jzo7_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/eef1653b09d0ed69185ae6edc739892a/tumblr_ph2c6vDJH41wlp4jzo7_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/eef1653b09d0ed69185ae6edc739892a/tumblr_ph2c6vDJH41wlp4jzo7_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/eef1653b09d0ed69185ae6edc739892a/tumblr_ph2c6vDJH41wlp4jzo7_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/cff6cf7046f5e3f04e1f98aef2874584/tumblr_ph2c6vDJH41wlp4jzo8_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/cff6cf7046f5e3f04e1f98aef2874584/tumblr_ph2c6vDJH41wlp4jzo8_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/cff6cf7046f5e3f04e1f98aef2874584/tumblr_ph2c6vDJH41wlp4jzo8_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/cff6cf7046f5e3f04e1f98aef2874584/tumblr_ph2c6vDJH41wlp4jzo8_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/cff6cf7046f5e3f04e1f98aef2874584/tumblr_ph2c6vDJH41wlp4jzo8_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/cff6cf7046f5e3f04e1f98aef2874584/tumblr_ph2c6vDJH41wlp4jzo8_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/26296814e5a6533e52d745c3cb178809/tumblr_ph2c6vDJH41wlp4jzo2_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/26296814e5a6533e52d745c3cb178809/tumblr_ph2c6vDJH41wlp4jzo2_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/26296814e5a6533e52d745c3cb178809/tumblr_ph2c6vDJH41wlp4jzo2_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/26296814e5a6533e52d745c3cb178809/tumblr_ph2c6vDJH41wlp4jzo2_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/26296814e5a6533e52d745c3cb178809/tumblr_ph2c6vDJH41wlp4jzo2_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/26296814e5a6533e52d745c3cb178809/tumblr_ph2c6vDJH41wlp4jzo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/a6474587f4d35f5f8e38a5e1f7dac2db/tumblr_ph2c6vDJH41wlp4jzo3_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/a6474587f4d35f5f8e38a5e1f7dac2db/tumblr_ph2c6vDJH41wlp4jzo3_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/a6474587f4d35f5f8e38a5e1f7dac2db/tumblr_ph2c6vDJH41wlp4jzo3_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/a6474587f4d35f5f8e38a5e1f7dac2db/tumblr_ph2c6vDJH41wlp4jzo3_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/a6474587f4d35f5f8e38a5e1f7dac2db/tumblr_ph2c6vDJH41wlp4jzo3_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/a6474587f4d35f5f8e38a5e1f7dac2db/tumblr_ph2c6vDJH41wlp4jzo3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/89c13ff62484c2c2b416f3a3af457c8b/tumblr_ph2c6vDJH41wlp4jzo4_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/89c13ff62484c2c2b416f3a3af457c8b/tumblr_ph2c6vDJH41wlp4jzo4_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/89c13ff62484c2c2b416f3a3af457c8b/tumblr_ph2c6vDJH41wlp4jzo4_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/89c13ff62484c2c2b416f3a3af457c8b/tumblr_ph2c6vDJH41wlp4jzo4_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/89c13ff62484c2c2b416f3a3af457c8b/tumblr_ph2c6vDJH41wlp4jzo4_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/89c13ff62484c2c2b416f3a3af457c8b/tumblr_ph2c6vDJH41wlp4jzo4_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "archmaestergilly",
        "blog": {
            "name": "archmaestergilly",
            "title": "never give up",
            "description": "tia | 20s | -nfp | you must look within yourself to save yourself from your other self, only then your true self will reveal itself",
            "url": "https://archmaestergilly.tumblr.com/",
            "uuid": "t:IB6fvC_SiM-2UEalaIEhkQ",
            "updated": 1561650271
        },
        "id": 179351268629,
        "post_url": "https://archmaestergilly.tumblr.com/post/179351268629/jon-arya-is-even-wearing-her-formal",
        "slug": "jon-arya-is-even-wearing-her-formal",
        "date": "2018-10-23 15:41:17 GMT",
        "timestamp": 1540309277,
        "state": "published",
        "format": "html",
        "reblog_key": "7kStmf1x",
        "tags": [
            "arya stark",
            "jon snow",
            "sansa stark",
            "jonsa",
            "incorrectgotquotes",
            "jon x sansa"
        ],
        "short_url": "https://tmblr.co/ZW_JTd2d2AoqL",
        "summary": "Jon: Arya is even wearing her formal jacket.\nSansa: is it the one without any blood on it?",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 51,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> Arya is even wearing her formal jacket.</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> is it the one without any blood on it?</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> Arya is even wearing her formal jacket.</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> is it the one without any blood on it?</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "archmaestergilly",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content.gif",
                        "header_image_focused": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#f5f2f2",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#D8709C",
                        "title_font": "Clarendon Text Pro",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179351268629"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> Arya is even wearing her formal jacket.</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> is it the one without any blood on it?</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Jon:</b> Arya is even wearing her formal jacket.</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Sansa:</b> is it the one without any blood on it?</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "archmaestergilly",
        "blog": {
            "name": "archmaestergilly",
            "title": "never give up",
            "description": "tia | 20s | -nfp | you must look within yourself to save yourself from your other self, only then your true self will reveal itself",
            "url": "https://archmaestergilly.tumblr.com/",
            "uuid": "t:IB6fvC_SiM-2UEalaIEhkQ",
            "updated": 1561650271
        },
        "id": 179350974069,
        "post_url": "https://archmaestergilly.tumblr.com/post/179350974069/jon-am-i-right-sansa-sansa-im-almost-sure",
        "slug": "jon-am-i-right-sansa-sansa-im-almost-sure",
        "date": "2018-10-23 15:28:58 GMT",
        "timestamp": 1540308538,
        "state": "published",
        "format": "html",
        "reblog_key": "8ZRooouG",
        "tags": [
            "jonsa",
            "jon x sansa",
            "jon snow",
            "sansa stark",
            "incorrectgotquotes"
        ],
        "short_url": "https://tmblr.co/ZW_JTd2d29gvr",
        "summary": "Jon: am I right, Sansa?\nSansa: I'm almost sure you're not, but to be fair, I wasn't listening.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 35,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> am I right, Sansa?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> I&rsquo;m almost sure you&rsquo;re not, but to be fair, I wasn&rsquo;t listening.</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> am I right, Sansa?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> I’m almost sure you’re not, but to be fair, I wasn’t listening.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "archmaestergilly",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content.gif",
                        "header_image_focused": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#f5f2f2",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#D8709C",
                        "title_font": "Clarendon Text Pro",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179350974069"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> am I right, Sansa?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> I’m almost sure you’re not, but to be fair, I wasn’t listening.</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Jon:</b> am I right, Sansa?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Sansa:</b> I&rsquo;m almost sure you&rsquo;re not, but to be fair, I wasn&rsquo;t listening.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "archmaestergilly",
        "blog": {
            "name": "archmaestergilly",
            "title": "never give up",
            "description": "tia | 20s | -nfp | you must look within yourself to save yourself from your other self, only then your true self will reveal itself",
            "url": "https://archmaestergilly.tumblr.com/",
            "uuid": "t:IB6fvC_SiM-2UEalaIEhkQ",
            "updated": 1561650271
        },
        "id": 179350916174,
        "post_url": "https://archmaestergilly.tumblr.com/post/179350916174/sansa-gets-a-papercut-jon-hasnt-she-been",
        "slug": "sansa-gets-a-papercut-jon-hasnt-she-been",
        "date": "2018-10-23 15:26:35 GMT",
        "timestamp": 1540308395,
        "state": "published",
        "format": "html",
        "reblog_key": "PYUk34ph",
        "tags": [
            "jonsa",
            "jon x sansa",
            "jon snow",
            "sansa stark",
            "incorrectgotquotes",
            "jon in kitten rage mode"
        ],
        "short_url": "https://tmblr.co/ZW_JTd2d29SnE",
        "summary": "Sansa: *gets a papercut*\nJon: HASN'T SHE BEEN THROUGH ENOUGH!",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 365,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> *gets a papercut*</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> HASN&rsquo;T SHE BEEN THROUGH ENOUGH!</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> *gets a papercut*</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> HASN’T SHE BEEN THROUGH ENOUGH!</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "archmaestergilly",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content.gif",
                        "header_image_focused": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#f5f2f2",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#D8709C",
                        "title_font": "Clarendon Text Pro",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179350916174"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> *gets a papercut*</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> HASN’T SHE BEEN THROUGH ENOUGH!</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Sansa:</b> *gets a papercut*</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Jon:</b> HASN&rsquo;T SHE BEEN THROUGH ENOUGH!</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "shebsart",
        "blog": {
            "name": "shebsart",
            "title": "renk renk düşünceler kaldı söylenmedik",
            "description": "REQUESTS CLOSED . 23 year old girl from Turkey who likes to watch, read and draw things. \nThis is my art blog where I share my art and talk in the tags.\nI follow, comment etc from my main blog.\nYou can call me Şebnem/Sheb, enjoy!",
            "url": "https://shebsart.tumblr.com/",
            "uuid": "t:zxYz76YKs4viRWvW6rHlJg",
            "updated": 1561672426
        },
        "id": 179350331472,
        "post_url": "https://shebsart.tumblr.com/post/179350331472/sigh-good-times",
        "slug": "sigh-good-times",
        "date": "2018-10-23 15:01:56 GMT",
        "timestamp": 1540306916,
        "state": "published",
        "format": "html",
        "reblog_key": "POrpWqzb",
        "tags": [
            "asoiaf",
            "theon greyjoy",
            "robb stark",
            "jon snow",
            "a song of ice and fire",
            "fanart",
            "my art",
            "grrm",
            "book",
            "theon looks so young",
            "you know the placement of their weapons is not random",
            "i tried symbolism ™"
        ],
        "short_url": "https://tmblr.co/Z5tAaj2d27E1G",
        "summary": "*sigh* good times",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1460,
        "caption": "<p>*sigh* good times</p>",
        "reblog": {
            "comment": "<p>*sigh* good times</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "shebsart",
                    "active": true,
                    "theme": {
                        "header_full_width": 2560,
                        "header_full_height": 955,
                        "header_focus_width": 730,
                        "header_focus_height": 409,
                        "avatar_shape": "circle",
                        "background_color": "#ede0cf",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1106,409,376",
                        "header_image": "https://static.tumblr.com/cb1fa000bedcd4c6d4e04e5ea8fc8c05/qolz7cj/B6Upsss4n/tumblr_static_808047186-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/29323805234079b2fbd78320ae5d6e04/qolz7cj/yDgpsss4p/tumblr_static_tumblr_static_808047186-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/cb1fa000bedcd4c6d4e04e5ea8fc8c05/qolz7cj/B6Upsss4n/tumblr_static_808047186-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#e17e66",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#684b44",
                        "title_font": "Clarendon Text Pro",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179350331472"
                },
                "content_raw": "<p>*sigh* good times</p>",
                "content": "<p>*sigh* good times</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://shebsart.tumblr.com/image/179350331472",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/91fb3631b1a5f05364f33a1d8db29578/tumblr_ph24c9L4Fh1uf89qwo2_1280.png",
                    "width": 1280,
                    "height": 1031
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/91fb3631b1a5f05364f33a1d8db29578/tumblr_ph24c9L4Fh1uf89qwo2_1280.png",
                        "width": 1280,
                        "height": 1031
                    },
                    {
                        "url": "https://66.media.tumblr.com/91fb3631b1a5f05364f33a1d8db29578/tumblr_ph24c9L4Fh1uf89qwo2_640.png",
                        "width": 640,
                        "height": 516
                    },
                    {
                        "url": "https://66.media.tumblr.com/91fb3631b1a5f05364f33a1d8db29578/tumblr_ph24c9L4Fh1uf89qwo2_540.png",
                        "width": 540,
                        "height": 435
                    },
                    {
                        "url": "https://66.media.tumblr.com/91fb3631b1a5f05364f33a1d8db29578/tumblr_ph24c9L4Fh1uf89qwo2_500.png",
                        "width": 500,
                        "height": 403
                    },
                    {
                        "url": "https://66.media.tumblr.com/91fb3631b1a5f05364f33a1d8db29578/tumblr_ph24c9L4Fh1uf89qwo2_400.png",
                        "width": 400,
                        "height": 322
                    },
                    {
                        "url": "https://66.media.tumblr.com/91fb3631b1a5f05364f33a1d8db29578/tumblr_ph24c9L4Fh1uf89qwo2_250.png",
                        "width": 250,
                        "height": 201
                    },
                    {
                        "url": "https://66.media.tumblr.com/91fb3631b1a5f05364f33a1d8db29578/tumblr_ph24c9L4Fh1uf89qwo2_100.png",
                        "width": 100,
                        "height": 81
                    },
                    {
                        "url": "https://66.media.tumblr.com/91fb3631b1a5f05364f33a1d8db29578/tumblr_ph24c9L4Fh1uf89qwo2_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "jeynewesterling",
        "blog": {
            "name": "jeynewesterling",
            "title": "I don't feel like a Grace",
            "description": "kal. mostly dogs, partially asoiaf. call me when the show's over.",
            "url": "https://jeynewesterling.tumblr.com/",
            "uuid": "t:pupjdy8qo9ODgt3Hrcpl6A",
            "updated": 1561751884
        },
        "id": 179350325807,
        "post_url": "https://jeynewesterling.tumblr.com/post/179350325807/a-fic-i-wish-youd-write-satin-x-jon-angst",
        "slug": "a-fic-i-wish-youd-write-satin-x-jon-angst",
        "date": "2018-10-23 15:01:41 GMT",
        "timestamp": 1540306901,
        "state": "published",
        "format": "html",
        "reblog_key": "gFdI50C2",
        "tags": [
            "jon x satin",
            "satin flowers",
            "jon snow",
            "bi jon snow",
            "unfic",
            "asoiaf",
            "my fic"
        ],
        "short_url": "https://tmblr.co/ZD9yOq2d27Cel",
        "summary": "A fic I wish you'd write: satin x jon angst",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 34,
        "asking_name": "ladystarks",
        "asking_url": "https://ladystarks.tumblr.com/",
        "question": "A fic I wish you'd write: satin x jon angst",
        "answer": "<p>The thing that stands before Jon, he knows it is Satin. His steward&rsquo;s body taken and desecrated by the Others. It is Satin&rsquo;s face that looks back at him, but not. Cold blue eyes, where Satin&rsquo;s had been warm and brown. Lips that had been soft now cracked, split. His Satin&rsquo;s skin had always been flushed, perpetually rosy, whether from the fire&rsquo;s heat or the ale or from Jon himself&hellip; This thing before him had skin as pale as snow, save for those black hands. Jon knew this wight was not Satin, not his loyal steward, not the boy he loved, but that didn&rsquo;t make it any easier to bring Longclaw down across his neck.</p><p><a href=\"http://jeynewesterling.tumblr.com/ask\">Send me a summary of a fic you&rsquo;d like me to write</a></p>",
        "reblog": {
            "comment": "<p>The thing that stands before Jon, he knows it is Satin. His steward’s body taken and desecrated by the Others. It is Satin’s face that looks back at him, but not. Cold blue eyes, where Satin’s had been warm and brown. Lips that had been soft now cracked, split. His Satin’s skin had always been flushed, perpetually rosy, whether from the fire’s heat or the ale or from Jon himself… This thing before him had skin as pale as snow, save for those black hands. Jon knew this wight was not Satin, not his loyal steward, not the boy he loved, but that didn’t make it any easier to bring Longclaw down across his neck.</p><p><a href=\"http://jeynewesterling.tumblr.com/ask\">Send me a summary of a fic you’d like me to write</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jeynewesterling",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 711,
                        "header_focus_width": 500,
                        "header_focus_height": 282,
                        "avatar_shape": "circle",
                        "background_color": "#101b2c",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "214,500,496,0",
                        "header_image": "https://static.tumblr.com/d8ca5607ae30868784b3aa82f78250f2/viho0pj/EOqppiqvu/tumblr_static_cgy12yyea6g4cwww0g4ggs04s.jpg",
                        "header_image_focused": "https://static.tumblr.com/fa770c6749df8135d4fb1d2c05aa87ec/viho0pj/ieEppiqvv/tumblr_static_tumblr_static_cgy12yyea6g4cwww0g4ggs04s_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/d8ca5607ae30868784b3aa82f78250f2/viho0pj/EOqppiqvu/tumblr_static_cgy12yyea6g4cwww0g4ggs04s_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179350325807"
                },
                "content_raw": "<p>The thing that stands before Jon, he knows it is Satin. His steward’s body taken and desecrated by the Others. It is Satin’s face that looks back at him, but not. Cold blue eyes, where Satin’s had been warm and brown. Lips that had been soft now cracked, split. His Satin’s skin had always been flushed, perpetually rosy, whether from the fire’s heat or the ale or from Jon himself… This thing before him had skin as pale as snow, save for those black hands. Jon knew this wight was not Satin, not his loyal steward, not the boy he loved, but that didn’t make it any easier to bring Longclaw down across his neck.</p><p><a href=\"http://jeynewesterling.tumblr.com/ask\">Send me a summary of a fic you’d like me to write</a></p>",
                "content": "<p>The thing that stands before Jon, he knows it is Satin. His steward&rsquo;s body taken and desecrated by the Others. It is Satin&rsquo;s face that looks back at him, but not. Cold blue eyes, where Satin&rsquo;s had been warm and brown. Lips that had been soft now cracked, split. His Satin&rsquo;s skin had always been flushed, perpetually rosy, whether from the fire&rsquo;s heat or the ale or from Jon himself&hellip; This thing before him had skin as pale as snow, save for those black hands. Jon knew this wight was not Satin, not his loyal steward, not the boy he loved, but that didn&rsquo;t make it any easier to bring Longclaw down across his neck.</p><p><a href=\"http://jeynewesterling.tumblr.com/ask\">Send me a summary of a fic you&rsquo;d like me to write</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "thronesdragons",
        "blog": {
            "name": "thronesdragons",
            "title": "Game of Thrones",
            "description": "<p><span style=\"color: #00; font-family: Helvetica, Arial, sans-serif; font-size: 12px;\"><a href=\"https://thronesdragons.tumblr.com/\">Game of Thrones (GOT)</a> Fans : Pictures, Art, Memes and More!</span></p>",
            "url": "https://thronesdragons.tumblr.com/",
            "uuid": "t:kfrbcbINX-athn6CZWMlWQ",
            "updated": 1560200770
        },
        "id": 179347072127,
        "post_url": "https://thronesdragons.tumblr.com/post/179347072127/more-what-is-something-you-think-will-happen",
        "slug": "more-what-is-something-you-think-will-happen",
        "date": "2018-10-23 12:38:37 GMT",
        "timestamp": 1540298317,
        "state": "published",
        "format": "html",
        "reblog_key": "JVv6URwY",
        "tags": [
            "Game of Thrones",
            "Got",
            "Jon Snow",
            "Targaryen",
            "Stark",
            "Westeros",
            "Dragons"
        ],
        "short_url": "https://tmblr.co/Zj9jIc2d1woH-",
        "summary": "[[MORE]] What is something you think, will happen in Season 8? ❄️ #gameofthrones #got #season8 #gameofthronesseason8 #dragons...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 40,
        "caption": "<p><!-- more --> What is something you think, will happen in Season 8? ❄️ #gameofthrones #got #season8 #gameofthronesseason8 #dragons #hbo</p>",
        "caption_abstract": "<p></p>",
        "reblog": {
            "comment": "<p>[[MORE]] What is something you think, will happen in Season 8? ❄️ #gameofthrones #got #season8 #gameofthronesseason8 #dragons #hbo</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thronesdragons",
                    "active": true,
                    "theme": {
                        "header_full_width": 1063,
                        "header_full_height": 354,
                        "header_focus_width": 621,
                        "header_focus_height": 349,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c.jpg",
                        "header_image_focused": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/CZ2oyee5j/tumblr_static_tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179347072127"
                },
                "content_raw": "<p>[[MORE]] What is something you think, will happen in Season 8? ❄️ #gameofthrones #got #season8 #gameofthronesseason8 #dragons #hbo</p>",
                "content": "<p> What is something you think, will happen in Season 8? &#10052;&#65039; #gameofthrones #got #season8 #gameofthronesseason8 #dragons #hbo</p>",
                "content_abstract": "",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://thronesdragons.tumblr.com/image/179347072127",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/6f11260fe1308ce1d72579b820a55c4b/tumblr_ph1xsdFDHP1wfiwxso1_640.jpg",
                    "width": 640,
                    "height": 800
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/6f11260fe1308ce1d72579b820a55c4b/tumblr_ph1xsdFDHP1wfiwxso1_640.jpg",
                        "width": 640,
                        "height": 800
                    },
                    {
                        "url": "https://66.media.tumblr.com/6f11260fe1308ce1d72579b820a55c4b/tumblr_ph1xsdFDHP1wfiwxso1_540.jpg",
                        "width": 540,
                        "height": 675
                    },
                    {
                        "url": "https://66.media.tumblr.com/6f11260fe1308ce1d72579b820a55c4b/tumblr_ph1xsdFDHP1wfiwxso1_500.jpg",
                        "width": 500,
                        "height": 625
                    },
                    {
                        "url": "https://66.media.tumblr.com/6f11260fe1308ce1d72579b820a55c4b/tumblr_ph1xsdFDHP1wfiwxso1_400.jpg",
                        "width": 400,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/6f11260fe1308ce1d72579b820a55c4b/tumblr_ph1xsdFDHP1wfiwxso1_250.jpg",
                        "width": 250,
                        "height": 313
                    },
                    {
                        "url": "https://66.media.tumblr.com/6f11260fe1308ce1d72579b820a55c4b/tumblr_ph1xsdFDHP1wfiwxso1_100.jpg",
                        "width": 100,
                        "height": 125
                    },
                    {
                        "url": "https://66.media.tumblr.com/6f11260fe1308ce1d72579b820a55c4b/tumblr_ph1xsdFDHP1wfiwxso1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "kiyasama",
        "blog": {
            "name": "kiyasama",
            "title": "The Doldrums",
            "description": "Where Sanity is Optional",
            "url": "https://kiyasama.tumblr.com/",
            "uuid": "t:myRhHsGiZtxOTRNGkDK2xg",
            "updated": 1561667431
        },
        "id": 179343749064,
        "post_url": "https://kiyasama.tumblr.com/post/179343749064/shadows-16-finale",
        "slug": "shadows-16-finale",
        "date": "2018-10-23 09:43:30 GMT",
        "timestamp": 1540287810,
        "state": "published",
        "format": "html",
        "reblog_key": "GD4Q7WX5",
        "tags": [
            "jonerys",
            "jon x dany",
            "jon snow",
            "daenerys targaryen",
            "daenerys stormborn",
            "game of thrones",
            "game of thrones fanction",
            "got fanfiction",
            "jonerys fanfiction",
            "modern au",
            "i am going to frame this and put it on my wall",
            "it's been fun all! thank you!"
        ],
        "short_url": "https://tmblr.co/ZIS3xt2d1k6-8",
        "summary": "Shadows 16 (Finale)",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 123,
        "title": "Shadows 16 (Finale)",
        "body": "<p>Well worth the wait, isn’t it? This lovely memento was created by the talented artist <b><a href=\"http://zlatam.com/\">ZlataM</a></b> (and I’d really appreciate it if this wasn’t reproduced or re-blogged without proper credit!)</p><p>With that said, it’s been a wonderful journey, and I appreciate each and every single person who has stuck with me since Day One! I hope you enjoy the conclusion, and that these characters and their stories remain with you long after the last word has been read. *bows gratefully*</p><p>(Chapter 16: <a href=\"https://archiveofourown.org/works/14442123/chapters/38351582\"><b>Light</b></a> excerpt)</p><blockquote><p>I\ncould wax poetic on how good he feels in my arms especially when he returns to\nme, how wonderful he tastes as I worship every inch of him, or how wonderful he\nsmells; that rare yet odd combination of rich earth, smoke, and salt. I could\ngush over how I’ll never tire of his kisses; from tender stolen ones to intense\npassionate ones that leave me a puddle and at his mercy. I could brag of how he\nstill manages to get the stares when we go out in public places, and how\nknowing he’s all mine makes me proud to be at his side. My wonderful, wonderful\nnorthern fool; <i>my King.</i></p></blockquote><h2><a href=\"https://archiveofourown.org/works/14442123/chapters/38351582\"><b>Continue on AO3</b></a></h2><figure class=\"tmblr-full\" data-orig-height=\"800\" data-orig-width=\"565\"><img src=\"https://66.media.tumblr.com/6cb4a301c7ce3b58f8c6162021df2b78/tumblr_inline_ph1plc632X1rz3tj7_540.jpg\" data-orig-height=\"800\" data-orig-width=\"565\"/></figure>",
        "reblog": {
            "comment": "<p><p>Well worth the wait, isn’t it? This lovely memento was created by the talented artist <b><a href=\"http://zlatam.com/\">ZlataM</a></b> (and I’d really appreciate it if this wasn’t reproduced or re-blogged without proper credit!)</p><p>With that said, it’s been a wonderful journey, and I appreciate each and every single person who has stuck with me since Day One! I hope you enjoy the conclusion, and that these characters and their stories remain with you long after the last word has been read. *bows gratefully*</p><p>(Chapter 16: <a href=\"https://archiveofourown.org/works/14442123/chapters/38351582\"><b>Light</b></a> excerpt)</p><blockquote><p>I\ncould wax poetic on how good he feels in my arms especially when he returns to\nme, how wonderful he tastes as I worship every inch of him, or how wonderful he\nsmells; that rare yet odd combination of rich earth, smoke, and salt. I could\ngush over how I’ll never tire of his kisses; from tender stolen ones to intense\npassionate ones that leave me a puddle and at his mercy. I could brag of how he\nstill manages to get the stares when we go out in public places, and how\nknowing he’s all mine makes me proud to be at his side. My wonderful, wonderful\nnorthern fool; <i>my King.</i></p></blockquote><h2><a href=\"https://archiveofourown.org/works/14442123/chapters/38351582\"><b>Continue on AO3</b></a></h2><figure class=\"tmblr-full\" data-orig-height=\"800\" data-orig-width=\"565\"><img src=\"https://66.media.tumblr.com/6cb4a301c7ce3b58f8c6162021df2b78/tumblr_inline_ph1plc632X1rz3tj7_540.jpg\" data-orig-height=\"800\" data-orig-width=\"565\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "kiyasama",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_03.png?_v=a0f20b51ed40eb5a930ab86effe42a40",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_03.png?_v=a0f20b51ed40eb5a930ab86effe42a40",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_03.png?_v=a0f20b51ed40eb5a930ab86effe42a40",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179343749064"
                },
                "content_raw": "<p><p>Well worth the wait, isn’t it? This lovely memento was created by the talented artist <b><a href=\"http://zlatam.com/\">ZlataM</a></b> (and I’d really appreciate it if this wasn’t reproduced or re-blogged without proper credit!)</p><p>With that said, it’s been a wonderful journey, and I appreciate each and every single person who has stuck with me since Day One! I hope you enjoy the conclusion, and that these characters and their stories remain with you long after the last word has been read. *bows gratefully*</p><p>(Chapter 16: <a href=\"https://archiveofourown.org/works/14442123/chapters/38351582\"><b>Light</b></a> excerpt)</p><blockquote><p>I\ncould wax poetic on how good he feels in my arms especially when he returns to\nme, how wonderful he tastes as I worship every inch of him, or how wonderful he\nsmells; that rare yet odd combination of rich earth, smoke, and salt. I could\ngush over how I’ll never tire of his kisses; from tender stolen ones to intense\npassionate ones that leave me a puddle and at his mercy. I could brag of how he\nstill manages to get the stares when we go out in public places, and how\nknowing he’s all mine makes me proud to be at his side. My wonderful, wonderful\nnorthern fool; <i>my King.</i></p></blockquote><h2><a href=\"https://archiveofourown.org/works/14442123/chapters/38351582\"><b>Continue on AO3</b></a></h2><figure class=\"tmblr-full\" data-orig-height=\"800\" data-orig-width=\"565\"><img src=\"https://66.media.tumblr.com/6cb4a301c7ce3b58f8c6162021df2b78/tumblr_inline_ph1plc632X1rz3tj7_540.jpg\" data-orig-height=\"800\" data-orig-width=\"565\"></figure></p>",
                "content": "<p><p>Well worth the wait, isn&rsquo;t it? This lovely memento was created by the talented artist <b><a href=\"http://zlatam.com/\">ZlataM</a></b> (and I&rsquo;d really appreciate it if this wasn&rsquo;t reproduced or re-blogged without proper credit!)</p><p>With that said, it&rsquo;s been a wonderful journey, and I appreciate each and every single person who has stuck with me since Day One! I hope you enjoy the conclusion, and that these characters and their stories remain with you long after the last word has been read. *bows gratefully*</p><p>(Chapter 16: <a href=\"https://archiveofourown.org/works/14442123/chapters/38351582\"><b>Light</b></a> excerpt)</p><blockquote><p>I\ncould wax poetic on how good he feels in my arms especially when he returns to\nme, how wonderful he tastes as I worship every inch of him, or how wonderful he\nsmells; that rare yet odd combination of rich earth, smoke, and salt. I could\ngush over how I&rsquo;ll never tire of his kisses; from tender stolen ones to intense\npassionate ones that leave me a puddle and at his mercy. I could brag of how he\nstill manages to get the stares when we go out in public places, and how\nknowing he&rsquo;s all mine makes me proud to be at his side. My wonderful, wonderful\nnorthern fool; <i>my King.</i></p></blockquote><h2><a href=\"https://archiveofourown.org/works/14442123/chapters/38351582\"><b>Continue on AO3</b></a></h2><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/6cb4a301c7ce3b58f8c6162021df2b78/tumblr_inline_ph1plc632X1rz3tj7_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "bad-dancer",
        "blog": {
            "name": "bad-dancer",
            "title": "Bad Dancer",
            "description": "“Who’s the real you? The person who did something awful, or the one who’s horrified by the awful thing you did? Is one part of you allowed to forgive the other?”",
            "url": "https://bad-dancer.tumblr.com/",
            "uuid": "t:xNLQbTPzU-eM5mPDSI1qmQ",
            "updated": 1561412069
        },
        "id": 179337856379,
        "post_url": "https://bad-dancer.tumblr.com/post/179337856379/jon-has-anyone-ever-in-any-point-of-your-life",
        "slug": "jon-has-anyone-ever-in-any-point-of-your-life",
        "date": "2018-10-23 04:35:17 GMT",
        "timestamp": 1540269317,
        "state": "published",
        "format": "html",
        "reblog_key": "BovutOHm",
        "tags": [
            "jienna",
            "jienna inspo",
            "jon snow",
            "sienna baratheon",
            "out in the wild"
        ],
        "short_url": "https://tmblr.co/ZaVggd2d1NeLx",
        "summary": "Jon: Has anyone ever in any point of your life told you they love you? Sienna: Does family count? Jon: Yes Sienna: Then no.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": null,
        "body": "<p><b>Jon:</b> Has anyone ever in any point of your life told you they love you?</p><p><b>Sienna:</b> Does family count?</p><p><b>Jon:</b> Yes</p><p><b>Sienna:</b> Then no.</p>",
        "reblog": {
            "comment": "<p><b>Jon:</b> Has anyone ever in any point of your life told you they love you?</p><p><b>Sienna:</b> Does family count?</p><p><b>Jon:</b> Yes</p><p><b>Sienna:</b> Then no.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "bad-dancer",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_11.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_11.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_11.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179337856379"
                },
                "content_raw": "<p><b>Jon:</b> Has anyone ever in any point of your life told you they love you?</p><p><b>Sienna:</b> Does family count?</p><p><b>Jon:</b> Yes</p><p><b>Sienna:</b> Then no.</p>",
                "content": "<p><b>Jon:</b> Has anyone ever in any point of your life told you they love you?</p><p><b>Sienna:</b> Does family count?</p><p><b>Jon:</b> Yes</p><p><b>Sienna:</b> Then no.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "ladystarks",
        "blog": {
            "name": "ladystarks",
            "title": "lo, the transforming power of love",
            "description": "ari, 22. gifmaker, artist, storyteller. previously @visenyastargaryen.",
            "url": "https://ladystarks.tumblr.com/",
            "uuid": "t:3J5JwiNlpG3iz5pDMNx9ag",
            "updated": 1561752040
        },
        "id": 179333087744,
        "post_url": "https://ladystarks.tumblr.com/post/179333087744/a-fic-where-jaime-is-jons-cool-stepdad-who-tries",
        "slug": "a-fic-where-jaime-is-jons-cool-stepdad-who-tries",
        "date": "2018-10-23 01:49:49 GMT",
        "timestamp": 1540259389,
        "state": "published",
        "format": "html",
        "reblog_key": "Yjf1nZBx",
        "tags": [
            "jon snow",
            "jaime x lyanna",
            "jaime lannister",
            "lyanna stark",
            "Sansa stark",
            "ask",
            "ask meme",
            "maii",
            "jonsa",
            "fic ideas"
        ],
        "short_url": "https://tmblr.co/Zv8V5o2d15S80",
        "summary": "A fic where Jaime is Jon's cool stepdad who tries to help him get together with Jon's crush Sansa",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 88,
        "asking_name": "ofthedirewolves",
        "asking_url": "https://ofthedirewolves.tumblr.com/",
        "question": "A fic where Jaime is Jon's cool stepdad who tries to help him get together with Jon's crush Sansa",
        "answer": "<p>Omggg this is a GOD TIER IDEA, especially since if Jaime is Jon&rsquo;s step dad, he&rsquo;s married to Lyanna (and everyone knows I&rsquo;m a Jaime x Lyanna ho!) </p><p>Jaime would totally be giving Jon advice that <i>would not work</i> with Sansa, like &ldquo;make a big gesture&rdquo; and &ldquo;Jon, challenge her to a sword fight, chicks dig swords&rdquo;, and he&rsquo;s trying to be super helpful but &hellip;no, Jaime, you have zero actual game, no matter how handsome you are. </p><p>Sansa is super confused, Jon is very starstruck and awkward, and at the end only Lyanna can save the day!</p>",
        "reblog": {
            "comment": "<p>Omggg this is a GOD TIER IDEA, especially since if Jaime is Jon’s step dad, he’s married to Lyanna (and everyone knows I’m a Jaime x Lyanna ho!) </p><p>Jaime would totally be giving Jon advice that <i>would not work</i> with Sansa, like “make a big gesture” and “Jon, challenge her to a sword fight, chicks dig swords”, and he’s trying to be super helpful but …no, Jaime, you have zero actual game, no matter how handsome you are. </p><p>Sansa is super confused, Jon is very starstruck and awkward, and at the end only Lyanna can save the day!</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ladystarks",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#dbf1fd",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/d08a1b8b967b7b3ef7ab6e5645d25e54/qrjctyl/YuVpny1fo/tumblr_static_4pbdmnpwr4844kkw80ow4w8cw.gif",
                        "header_image_focused": "https://static.tumblr.com/d08a1b8b967b7b3ef7ab6e5645d25e54/qrjctyl/YuVpny1fo/tumblr_static_4pbdmnpwr4844kkw80ow4w8cw_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/d08a1b8b967b7b3ef7ab6e5645d25e54/qrjctyl/YuVpny1fo/tumblr_static_4pbdmnpwr4844kkw80ow4w8cw_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#6c0906",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#7a0c0a",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179333087744"
                },
                "content_raw": "<p>Omggg this is a GOD TIER IDEA, especially since if Jaime is Jon’s step dad, he’s married to Lyanna (and everyone knows I’m a Jaime x Lyanna ho!) </p><p>Jaime would totally be giving Jon advice that <i>would not work</i> with Sansa, like “make a big gesture” and “Jon, challenge her to a sword fight, chicks dig swords”, and he’s trying to be super helpful but …no, Jaime, you have zero actual game, no matter how handsome you are. </p><p>Sansa is super confused, Jon is very starstruck and awkward, and at the end only Lyanna can save the day!</p>",
                "content": "<p>Omggg this is a GOD TIER IDEA, especially since if Jaime is Jon&rsquo;s step dad, he&rsquo;s married to Lyanna (and everyone knows I&rsquo;m a Jaime x Lyanna ho!) </p><p>Jaime would totally be giving Jon advice that <i>would not work</i> with Sansa, like &ldquo;make a big gesture&rdquo; and &ldquo;Jon, challenge her to a sword fight, chicks dig swords&rdquo;, and he&rsquo;s trying to be super helpful but &hellip;no, Jaime, you have zero actual game, no matter how handsome you are. </p><p>Sansa is super confused, Jon is very starstruck and awkward, and at the end only Lyanna can save the day!</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "danceyreagan",
        "blog": {
            "name": "danceyreagan",
            "title": "Im Goody Goody. You Just Do Your Thang Baby Smurf.",
            "description": "<p>Im a proud black woman. Brooklyn Nine-Nine, Peaky Blinders, Animal Kingdom, Game of Thrones and Queen Beyonce.</p><p>I write Isaiah Jesus</p><p>I do Headcanons. Inbox open.</p><p>Spoiler Free Zone! </p><p><a href=\"https://danceyreagan.tumblr.com/post/172251225294/masterlist\">MASTERLIST</a></p>",
            "url": "https://danceyreagan.tumblr.com/",
            "uuid": "t:lS7DD6OD1u1wI6_IxjBLUQ",
            "updated": 1561731283
        },
        "id": 179332649109,
        "post_url": "https://danceyreagan.tumblr.com/post/179332649109/jon-and-sansa-shippers",
        "slug": "jon-and-sansa-shippers",
        "date": "2018-10-23 01:34:15 GMT",
        "timestamp": 1540258455,
        "state": "published",
        "format": "html",
        "reblog_key": "iEQBIuS8",
        "tags": [
            "game of thrones",
            "Jon Snow",
            "sansa stark",
            "jonsa shippers need jesus",
            "yes im ship shaming"
        ],
        "short_url": "https://tmblr.co/Z9cRQe2d13n2L",
        "summary": "Jon and Sansa shippers? 🤮",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 40,
        "title": null,
        "body": "<h1>Jon and Sansa shippers? 🤮</h1><p>Even if they are only first cousins by birth, he was raised as her brother. Thats fucking gross. Jon is like a mini Ned when it comes to honor and he would never. Like actually never. </p>",
        "reblog": {
            "comment": "<p><h1>Jon and Sansa shippers? 🤮</h1><p>Even if they are only first cousins by birth, he was raised as her brother. Thats fucking gross. Jon is like a mini Ned when it comes to honor and he would never. Like actually never. </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "danceyreagan",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 480,
                        "header_focus_width": 548,
                        "header_focus_height": 308,
                        "avatar_shape": "square",
                        "background_color": "#346B50",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "85,594,393,46",
                        "header_image": "https://static.tumblr.com/321349b553486da96ac05f753168faed/nsywmrq/2fTpcyp4t/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/321349b553486da96ac05f753168faed/nsywmrq/fyIpcyp4u/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/321349b553486da96ac05f753168faed/nsywmrq/2fTpcyp4t/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#234357",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#234357",
                        "title_font": "Quadrat",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179332649109"
                },
                "content_raw": "<p><h1>Jon and Sansa shippers? 🤮</h1><p>Even if they are only first cousins by birth, he was raised as her brother. Thats fucking gross. Jon is like a mini Ned when it comes to honor and he would never. Like actually never. </p></p>",
                "content": "<p><h1>Jon and Sansa shippers? &#129326;</h1><p>Even if they are only first cousins by birth, he was raised as her brother. Thats fucking gross. Jon is like a mini Ned when it comes to honor and he would never. Like actually never. </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "jonerys-art",
        "blog": {
            "name": "jonerys-art",
            "title": "Ice + Fire",
            "description": "Blog dedicated to art of Jon Snow and Daenerys Targaryen.",
            "url": "https://jonerys-art.tumblr.com/",
            "uuid": "t:1-9pFvudselAunl9tZfwrw",
            "updated": 1561748451
        },
        "id": 179331726104,
        "post_url": "https://jonerys-art.tumblr.com/post/179331726104/jon-and-daenerys-by-aurelie-scour-on-behance",
        "slug": "jon-and-daenerys-by-aurelie-scour-on-behance",
        "date": "2018-10-23 01:00:50 GMT",
        "timestamp": 1540256450,
        "state": "published",
        "format": "html",
        "reblog_key": "b3vjYthL",
        "tags": [
            "aurelie scour",
            "jon snow",
            "daenerys targaryen",
            "portraits",
            "fanart"
        ],
        "short_url": "https://tmblr.co/Z-JR_c2d10FiO",
        "summary": "Jon and Daenerys by Aurelie Scour on Behance",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 12,
        "caption": "<p><a href=\"https://www.behance.net/gallery/4567645/Game-of-Thrones\">Jon and Daenerys</a> by <a href=\"https://www.behance.net/asart\">Aurelie Scour</a> on Behance<br/></p>",
        "reblog": {
            "comment": "<p><a href=\"https://www.behance.net/gallery/4567645/Game-of-Thrones\">Jon and Daenerys</a> by <a href=\"https://www.behance.net/asart\">Aurelie Scour</a> on Behance<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jonerys-art",
                    "active": true,
                    "theme": {
                        "header_full_width": 1000,
                        "header_full_height": 500,
                        "header_focus_width": 889,
                        "header_focus_height": 500,
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,944,500,55",
                        "header_image": "https://static.tumblr.com/72dd6c4f457757b33929767edd460918/o2g22ll/e3Spqjv6f/tumblr_static_a959ww7tj08wksskg0kw4c4sg.png",
                        "header_image_focused": "https://static.tumblr.com/9587af85262eb5e77402fc78e18d2855/o2g22ll/vg5pqjv6h/tumblr_static_tumblr_static_a959ww7tj08wksskg0kw4c4sg_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/72dd6c4f457757b33929767edd460918/o2g22ll/e3Spqjv6f/tumblr_static_a959ww7tj08wksskg0kw4c4sg_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#75b1d6",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179331726104"
                },
                "content_raw": "<p><a href=\"https://www.behance.net/gallery/4567645/Game-of-Thrones\">Jon and Daenerys</a> by <a href=\"https://www.behance.net/asart\">Aurelie Scour</a> on Behance<br></p>",
                "content": "<p><a href=\"https://www.behance.net/gallery/4567645/Game-of-Thrones\">Jon and Daenerys</a> by <a href=\"https://www.behance.net/asart\">Aurelie Scour</a> on Behance<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "2",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/d19eae9b486c57555450f7402379a943/tumblr_p8nl850PXR1wz1imko1_500.jpg",
                    "width": 450,
                    "height": 600
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/d19eae9b486c57555450f7402379a943/tumblr_p8nl850PXR1wz1imko1_500.jpg",
                        "width": 450,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/d19eae9b486c57555450f7402379a943/tumblr_p8nl850PXR1wz1imko1_400.jpg",
                        "width": 400,
                        "height": 533
                    },
                    {
                        "url": "https://66.media.tumblr.com/d19eae9b486c57555450f7402379a943/tumblr_p8nl850PXR1wz1imko1_250.jpg",
                        "width": 250,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/d19eae9b486c57555450f7402379a943/tumblr_p8nl850PXR1wz1imko1_100.jpg",
                        "width": 100,
                        "height": 133
                    },
                    {
                        "url": "https://66.media.tumblr.com/d19eae9b486c57555450f7402379a943/tumblr_p8nl850PXR1wz1imko1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/ab12827ab94d3df05b69d68c21c4a0a0/tumblr_p8nl850PXR1wz1imko2_500.jpg",
                    "width": 450,
                    "height": 600
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/ab12827ab94d3df05b69d68c21c4a0a0/tumblr_p8nl850PXR1wz1imko2_500.jpg",
                        "width": 450,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/ab12827ab94d3df05b69d68c21c4a0a0/tumblr_p8nl850PXR1wz1imko2_400.jpg",
                        "width": 400,
                        "height": 533
                    },
                    {
                        "url": "https://66.media.tumblr.com/ab12827ab94d3df05b69d68c21c4a0a0/tumblr_p8nl850PXR1wz1imko2_250.jpg",
                        "width": 250,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/ab12827ab94d3df05b69d68c21c4a0a0/tumblr_p8nl850PXR1wz1imko2_100.jpg",
                        "width": 100,
                        "height": 133
                    },
                    {
                        "url": "https://66.media.tumblr.com/ab12827ab94d3df05b69d68c21c4a0a0/tumblr_p8nl850PXR1wz1imko2_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "butterflies-dragons",
        "blog": {
            "name": "butterflies-dragons",
            "title": "Sometimes butterflies grow into dragons",
            "description": "",
            "url": "https://butterflies-dragons.tumblr.com/",
            "uuid": "t:qOp2V-Aompakif6TKfPSaA",
            "updated": 1561760005
        },
        "id": 179331546394,
        "post_url": "https://butterflies-dragons.tumblr.com/post/179331546394/he-sat-naked-under-the-elm-while-he-dried",
        "slug": "he-sat-naked-under-the-elm-while-he-dried",
        "date": "2018-10-23 00:54:27 GMT",
        "timestamp": 1540256067,
        "state": "published",
        "format": "html",
        "reblog_key": "Cgjzb8sD",
        "tags": [
            "Jon Snow",
            "dragonflies",
            "dragons",
            "foreshadowing",
            "The Hedge Knight",
            "The Hedge Knight is full of Jon Snow foreshadowing",
            "Dunk and Jon have a lot of similarities",
            "And we also have Prince Duncan Targaryen The Prince of Dragonflies with his own similarities with Jon Snow",
            "*wink* *wink*",
            ":eyes emoji:"
        ],
        "short_url": "https://tmblr.co/Z9H0uf2d0-ZqQ",
        "summary": "He sat naked under the elm while he dried, enjoying the warmth of the spring air on his skin as he watched a dragonfly move...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 137,
        "caption": "<h2><i>He sat naked under the elm while he dried, enjoying the warmth of the spring air on his skin as he watched a <b>dragonfly</b> move lazily among the reeds. <b>Why would they name it a dragonfly?</b> he wondered. <b>It looks nothing like a dragon. </b></i></h2><h2><b>—The Hedge Knight</b></h2>",
        "reblog": {
            "comment": "<p><h2><i>He sat naked under the elm while he dried, enjoying the warmth of the spring air on his skin as he watched a <b>dragonfly</b> move lazily among the reeds. <b>Why would they name it a dragonfly?</b> he wondered. <b>It looks nothing like a dragon. </b></i></h2><h2><b>—The Hedge Knight</b></h2></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "butterflies-dragons",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/382c6cd03fe3268fc7aec99df09f2a50/p71v1lp/Vb4prznh7/tumblr_static_9wbshccf5ts0cgggwk8skg880.gif",
                        "header_image_focused": "https://static.tumblr.com/382c6cd03fe3268fc7aec99df09f2a50/p71v1lp/Vb4prznh7/tumblr_static_9wbshccf5ts0cgggwk8skg880_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/382c6cd03fe3268fc7aec99df09f2a50/p71v1lp/Vb4prznh7/tumblr_static_9wbshccf5ts0cgggwk8skg880_2048_v2.gif",
                        "header_stretch": false,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179331546394"
                },
                "content_raw": "<p><h2><i>He sat naked under the elm while he dried, enjoying the warmth of the spring air on his skin as he watched a <b>dragonfly</b> move lazily among the reeds. <b>Why would they name it a dragonfly?</b> he wondered. <b>It looks nothing like a dragon. </b></i></h2><h2><b>—The Hedge Knight</b></h2></p>",
                "content": "<p><h2><i>He sat naked under the elm while he dried, enjoying the warmth of the spring air on his skin as he watched a <b>dragonfly</b> move lazily among the reeds. <b>Why would they name it a dragonfly?</b> he wondered. <b>It looks nothing like a dragon.&nbsp;</b></i></h2><h2><b>&mdash;The Hedge Knight</b></h2></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://butterflies-dragons.tumblr.com/image/179331546394",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/9252953e4778ab14d112ab80d71a3fae/tumblr_ph10yo8ZVg1vg36loo1_r1_1280.jpg",
                    "width": 1280,
                    "height": 853
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/9252953e4778ab14d112ab80d71a3fae/tumblr_ph10yo8ZVg1vg36loo1_r1_1280.jpg",
                        "width": 1280,
                        "height": 853
                    },
                    {
                        "url": "https://66.media.tumblr.com/9252953e4778ab14d112ab80d71a3fae/tumblr_ph10yo8ZVg1vg36loo1_r1_640.jpg",
                        "width": 640,
                        "height": 427
                    },
                    {
                        "url": "https://66.media.tumblr.com/9252953e4778ab14d112ab80d71a3fae/tumblr_ph10yo8ZVg1vg36loo1_r1_540.jpg",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/9252953e4778ab14d112ab80d71a3fae/tumblr_ph10yo8ZVg1vg36loo1_r1_500.jpg",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/9252953e4778ab14d112ab80d71a3fae/tumblr_ph10yo8ZVg1vg36loo1_r1_400.jpg",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/9252953e4778ab14d112ab80d71a3fae/tumblr_ph10yo8ZVg1vg36loo1_r1_250.jpg",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/9252953e4778ab14d112ab80d71a3fae/tumblr_ph10yo8ZVg1vg36loo1_r1_100.jpg",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/9252953e4778ab14d112ab80d71a3fae/tumblr_ph10yo8ZVg1vg36loo1_r1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "link",
        "blog_name": "jashykins",
        "blog": {
            "name": "jashykins",
            "title": "jashykins",
            "description": "I like to go by the name Jash online. I am 31 years old and engaged to a wonderful man known online as revrezner. I blog about mostly entertainment/fandom related things. I have EPD so if I ever seem to explode that's why and I'm sorry. If you're here from Dragon Cave: I have an offer to advertise on my blog.",
            "url": "https://jashykins.tumblr.com/",
            "uuid": "t:Jbu0w0xtn3w3GeZpI2BWBg",
            "updated": 1561758773
        },
        "id": 179325826657,
        "post_url": "https://jashykins.tumblr.com/post/179325826657/a-flame-extinguished-jashykins-game-of-thrones",
        "slug": "a-flame-extinguished-jashykins-game-of-thrones",
        "date": "2018-10-22 21:33:04 GMT",
        "timestamp": 1540243984,
        "state": "published",
        "format": "html",
        "reblog_key": "47l4hU0p",
        "tags": [
            "game of thrones",
            "jaime lannister",
            "jorah mormont",
            "jon snow"
        ],
        "short_url": "https://tmblr.co/Z9qs0v2d0flPX",
        "summary": "A Flame Extinguished - jashykins - Game of Thrones (TV) [Archive of Our Own]",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 3,
        "source_url": "https://t.umblr.com/redirect?z=https%3A%2F%2Farchiveofourown.org%2Fworks%2F14608632&t=ZTZjMWRjYTBiNmUwNGE5MDMxNmI5Yjc4NWUxYThhOTJlNDBhYTM2NSwxNzkzMjU4MjY2NTc%3D&b=t%3AJbu0w0xtn3w3GeZpI2BWBg&p=https%3A%2F%2Fjashykins.tumblr.com%2Fpost%2F179325826657%2Fa-flame-extinguished-jashykins-game-of-thrones&m=1",
        "source_title": "archiveofourown.org",
        "title": "A Flame Extinguished - jashykins - Game of Thrones (TV) [Archive of Our Own]",
        "url": "https://archiveofourown.org/works/14608632",
        "link_author": "Organization for Transformative Works",
        "excerpt": "An Archive of Our Own, a project of the Organization for Transformative Works",
        "publisher": "archiveofourown.org",
        "description": "<p>Chapters: 20/30<br/>Fandom: <a href=\"https://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)\">Game of Thrones (TV)</a><br/>Rating: Mature<br/>Warnings: Major Character Death<br/>Relationships: Jorah Mormont/Daenerys Targaryen, Jorah Mormont/Jon Snow<br/>Characters: Jorah Mormont, Daenerys Targaryen, Jon Snow, Jon Snow | Aegon Targaryen, Tyrion Lannister, Jaime Lannister, Sansa Stark, Samwell Tarly, Drogon (ASoIaF)<br/>Additional Tags: Prophecy, Azor Ahai Prophecy<br/>Summary: </p><p>On the way to Winterfell there is a devastating attack. The aftermath of the attack causes a large rift between Jorah Mormont and Jon Snow to form. Even as Jorah has to deal with his own emotions, the war against the dead won’t stop and worries about who will succeed Cersei Lannister abound.</p>",
        "reblog": {
            "comment": "<p>Chapters: 20/30<br>Fandom: <a href=\"https://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)\">Game of Thrones (TV)</a><br>Rating: Mature<br>Warnings: Major Character Death<br>Relationships: Jorah Mormont/Daenerys Targaryen, Jorah Mormont/Jon Snow<br>Characters: Jorah Mormont, Daenerys Targaryen, Jon Snow, Jon Snow | Aegon Targaryen, Tyrion Lannister, Jaime Lannister, Sansa Stark, Samwell Tarly, Drogon (ASoIaF)<br>Additional Tags: Prophecy, Azor Ahai Prophecy<br>Summary: </p><p>On the way to Winterfell there is a devastating attack. The aftermath of the attack causes a large rift between Jorah Mormont and Jon Snow to form. Even as Jorah has to deal with his own emotions, the war against the dead won’t stop and worries about who will succeed Cersei Lannister abound.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jashykins",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179325826657"
                },
                "content_raw": "<p>Chapters: 20/30<br>Fandom: <a href=\"https://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)\">Game of Thrones (TV)</a><br>Rating: Mature<br>Warnings: Major Character Death<br>Relationships: Jorah Mormont/Daenerys Targaryen, Jorah Mormont/Jon Snow<br>Characters: Jorah Mormont, Daenerys Targaryen, Jon Snow, Jon Snow | Aegon Targaryen, Tyrion Lannister, Jaime Lannister, Sansa Stark, Samwell Tarly, Drogon (ASoIaF)<br>Additional Tags: Prophecy, Azor Ahai Prophecy<br>Summary: </p><p>On the way to Winterfell there is a devastating attack. The aftermath of the attack causes a large rift between Jorah Mormont and Jon Snow to form. Even as Jorah has to deal with his own emotions, the war against the dead won’t stop and worries about who will succeed Cersei Lannister abound.</p>",
                "content": "<p>Chapters: 20/30<br />Fandom: <a href=\"https://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)\">Game of Thrones (TV)</a><br />Rating: Mature<br />Warnings: Major Character Death<br />Relationships: Jorah Mormont/Daenerys Targaryen, Jorah Mormont/Jon Snow<br />Characters: Jorah Mormont, Daenerys Targaryen, Jon Snow, Jon Snow | Aegon Targaryen, Tyrion Lannister, Jaime Lannister, Sansa Stark, Samwell Tarly, Drogon (ASoIaF)<br />Additional Tags: Prophecy, Azor Ahai Prophecy<br />Summary: </p><p>On the way to Winterfell there is a devastating attack. The aftermath of the attack causes a large rift between Jorah Mormont and Jon Snow to form. Even as Jorah has to deal with his own emotions, the war against the dead won&rsquo;t stop and worries about who will succeed Cersei Lannister abound.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "polkaduck",
        "blog": {
            "name": "polkaduck",
            "title": "Polkaduck",
            "description": "",
            "url": "https://polkaduck.tumblr.com/",
            "uuid": "t:gND-UvGsyIGIahzRrVE40g",
            "updated": 1561674948
        },
        "id": 179324244707,
        "post_url": "https://polkaduck.tumblr.com/post/179324244707/the-next-generation-of-got-part-3-lyanna",
        "slug": "the-next-generation-of-got-part-3-lyanna",
        "date": "2018-10-22 20:41:46 GMT",
        "timestamp": 1540240906,
        "state": "published",
        "format": "html",
        "reblog_key": "fqqAW3Un",
        "tags": [
            "game of thrones",
            "got",
            "game of thrones fan fic",
            "jon snow",
            "daenerys targaryen",
            "jonerys",
            "jonerys baby",
            "jonerys babies",
            "targlings",
            "targaryen restoration",
            "game of thrones season 8",
            "kit harington",
            "emilia clarke",
            "arya stark",
            "gendry waters",
            "maisie williams",
            "joe dempsie",
            "jack o'connell",
            "lyanna stark",
            "lyanna targaryen",
            "ned targaryen",
            "aemon targaryen",
            "sorry this one was really sad"
        ],
        "short_url": "https://tmblr.co/Zo7ZGw2d0ZjBZ",
        "summary": "The Next Generation of GOT Part 3:  Lyanna (Youngest child and only daughter of King Jon and Queen Daenerys) Robb (Eldest child...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 5,
        "source_url": "http://polkaduck.tumblr.com",
        "source_title": "polkaduck",
        "caption": "<p><b>The Next Generation of GOT</b></p><p><b>Part 3: </b></p><p>Lyanna (Youngest child and only daughter of King Jon and Queen Daenerys)<br/>Robb (Eldest child of Arya Stark and Gendry Baratheon)</p><p><b><br/></b></p><p><b>Lyanna Targaryen and Robb Baratheon</b></p><p><br/></p><p>The youngest child and only daughter of King Jon and Queen Daenerys, Lyanna had the look of her mother and the colouring of her father. Known affectionately as the Southern Wolf, it was said that she was every bit a Stark as she was a Targaryen. Her stubborn nature was softened by her charm and quick wit, and it was said that those who met her couldn&rsquo;t help but love her. </p><p>Her mother had endured a difficult labour with her, and during the worst of it, Maester Samwell had feared that both Daenerys and her child would not make it through. They did make it of course, both mother and child. Daenerys had said that she and Lyanna were too stubborn to let death take them so soon. Jon had been the first to hold her. She had been so small, born nearly two moons early, and half of her tiny body had fit into the palm of his hand. Jon had cried as he held her, and thanked the Gods that his wife and daughter had both survived such an ordeal.</p><p>King Jon loved all of his children equally, but all knew that Lyanna held a special place in Jon’s heart. So much like his sister Arya, and a tether to the mother who had died bringing him into the world, Lyanna was truly the light of her fathers life. </p><p>Betrothed to Robb Baratheon since her birth, Robb was five years her senior; born the same year as Lyanna’s eldest brother, Ned. From the time that Lyanna was in her fifteenth year, she travelled to Storms End to spend several months at a time with her Uncle and Aunt, Lord and Lady Baratheon. <br/></p><p>Lyanna and Robb’s relationship developed slowly, beginning first as a friendship. Robb had been hesitant at first, insisting that the crown princess was too young. And he had been right. Though Lyanna’s fiery nature and independence matured her in many ways, she was in truth still a child when she and Robb began their courtship. During the earlier years she spent at Storms End, Lyanna and Robb became fast friends, their similar senses of humour and proclivity for combat provided them with a steadfast foundation for a strong and lasting friendship. During her fourth visit to Storms End, shortly after Lyanna’s eighteenth name day, Robb was taken aback by how much Lyanna had changed since her last visit. As she stepped down from her horse that day in the courtyard of his family’s ancestral home, the sun casting shades of copper and caramel in her dark hair, he felt an unexpected wave of nervousness wash over him. He had to remind himself that the woman standing in front of him was the same girl he had known all his life, and that he had no cause to be so anxious. </p><p>They spent the first few weeks of Lyanna’s visit partaking in their usual pastimes, though Robb was much quieter than he usually was around Lyanna. He gave himself a pep talk before seeing her each day, and cursed himself for being so quiet afterwards. Lyanna hadn&rsquo;t seemed to notice the change in his demeanour however, and if she had she made no mention of it. During one of their walks through the woods surrounding Storms End, Lyanna had taken Robb&rsquo;s hand unexpectedly. His heart had begun to beat faster at her touch, and Lyanna had flashed him a wide smile that had both calmed and enlivened him. </p><p>One night after they had supped, Robb had walked Lyanna to her room. The hallway was empty and dark, save for a smattering of candles. “My lady.” Robb had said, bidding her goodnight, but he had lingered, his eyes catching hers, and for what felt like a very long moment, neither of them spoke. Lyanna looked at Robb, and let her eyes trail across his face. He was so handsome, she had thought. Tall and fierce, his black hair and dark eyes suited perfectly to his strong face. She moved towards him slowly then, and ever so gently pressed her lips to his. When she moved to part from him, Robb had a look of bewilderment etched across his face, his cheeks slightly pinker than they had been a moment before. Lyanna laughed gently. Seeing such a brave man reduced to an embarrassed boy at her touch thrilled her. <br/></p><p>“Relax Baratheon.” She had jested. “It was only a kiss.” Robb had watched her, his eyes never leaving her face, and a small smile played at the corner of Lyanna’s lips. She turned towards her room and closed the door behind her. Lyanna had teased Robb for his embarrassment, but as she stood alone in her room, her back pressed against her closed door, her heart pounding in her chest, she too felt the flush of heat that had spread to her cheeks. <br/></p><p>Their friendship blossomed into a passionate romance that year, and the two of them snuck off into the woods to be alone more than once. Although their union had been arranged, Lyanna had never felt that it had been forced upon her. She had thanked the Gods that she and Robb had been betrothed to one another, and thought that maybe they would have found each other no matter the circumstances. </p><p>Lyanna was already pregnant with their first child the day that she wed Robb, though no one but the two of them knew. Their love for one another had grown from passion as much as it had from friendship. Their first child was a girl, born only seven moons after they had wed. They had named her Daenerys, though her hair and eyes were much darker than that of the woman she was named for. Queen Daenerys had given her daughter a knowing look, a mixture of amusement and understanding, after the birth of Lyanna’s first child. Lyanna knew that her mother had also been pregnant on her wedding day.</p><p>Lyanna gave birth to another daughter a year later. They named her Arya, and she favoured her namesake in both looks and temperament. A son was born to her and Robb the following year. Brandon, they had called him. He had dark hair like his sisters, but unlike his siblings he had bright blue eyes instead of brown. </p><p>Lyanna fell pregnant once again, five years after she had given birth to her first child, and much like her mother’s labour with her, Lyanna endured a difficult birth with her last child. It stretched on for days, and the Maester feared the worst for both mother and child. The baby was a girl, a tiny wisp of a thing, with dark hair like her mother. And though her child had survived the arduous labour, Lyanna did not. The Maester was unable to stop her bleeding, and Lyanna had died in Robb&rsquo;s arms. It was said that the whole of the Seven Kingdoms wept when they heard of their Princess’s death. The Southern Wolf had perished, and with her went the joy that she had brought to those who had known her. Robb named their youngest daughter Lyanna. </p><p>King Jon had wept when he heard the news. His only daughter, the tiny girl he had held in his hands only moments after she had entered the world, had left it. Daenerys did not speak to anyone for many weeks following Lyanna’s death, and she remained sequestered in her chambers for even longer. Her Lyanna, her sweet fierce girl, was gone, and with her had gone Daenerys’ joy. The Queen was never the same after that. Many said the fire that had coursed through the Queens veins before her daughters death had left her once Lyanna had passed. </p><p>Ned had beaten his hands bloody against a wall when he had heard of his sisters death. When he closed his eyes, he did not see her as the woman she had grown into, but as the small girl who had clutched his hand as they walked through the hallways of the Red Keep. His whole life he had protected Lyanna, though she rarely ever needed it. But this time, he had failed her. He said as much to his wife. Catelyn had taken Ned’s face in her hands then, his cheeks wet and hot with tears, and she told him that there was nothing that he could have done to stop this from happening. That even a King could not stop the Gods. Catelyn felt her eyes burn as the words had left her mouth, and she could not stop the flood of tears that fell from her eyes as she thought of Lyanna. </p><p>Aemon had cried when he was told of Lyanna’s death. He did not believe it at first. It seemed almost impossible that his ferocious and headstrong sister could be taken from this world when she had so much life left to live. Litse had wept into Aemon’s chest when he told her of Lyanna’s passing. Lyanna had been a sister to Litse in every way but blood, and it filled her with the greatest sorrow to picture a world without Lyanna in it. </p><p>Aemon and Ned rode to Storms End with their father to retrieve Lyanna’s body. When they arrived, Arya and Gendry welcomed them in the courtyard, but Robb was nowhere to be found. Ned found him later, alone in his chambers, the curtains drawn and the candles unlit. Robb was as much Ned&rsquo;s friend as he was his brother by law, and the sorrow he felt for Robb ran as deep as his own. Ned had no words of comfort to offer, his own grief clouding his ability to console his friend, and so the two men sat in silence. It had been Aemon who had finally coaxed Robb from his chambers, his gentle heart and empathetic nature allowing him to reach Robb in a way that no one else had been able to. </p><p>In the end, Lyanna’s body was brought back to Kings Landing. Her final resting place a stones throw away from where she had been born. Robb and Lyanna’s youngest child was like her mother in every way. Not only did she have her mothers name, but her beauty and character as well. </p><p>Lord Robb was never the same after his wife’s death. It was said that the light had gone from his life when Lyanna had passed, and his only true joy came from raising the children they had made together. </p><p>Robb never married again. </p>",
        "reblog": {
            "comment": "<p><b>The Next Generation of GOT</b></p><p><b>Part 3: </b></p><p>Lyanna (Youngest child and only daughter of King Jon and Queen Daenerys)<br>Robb (Eldest child of Arya Stark and Gendry Baratheon)</p><p><b><br></b></p><p><b>Lyanna Targaryen and Robb Baratheon</b></p><p><br></p><p>The youngest child and only daughter of King Jon and Queen Daenerys, Lyanna had the look of her mother and the colouring of her father. Known affectionately as the Southern Wolf, it was said that she was every bit a Stark as she was a Targaryen. Her stubborn nature was softened by her charm and quick wit, and it was said that those who met her couldn’t help but love her. </p><p>Her mother had endured a difficult labour with her, and during the worst of it, Maester Samwell had feared that both Daenerys and her child would not make it through. They did make it of course, both mother and child. Daenerys had said that she and Lyanna were too stubborn to let death take them so soon. Jon had been the first to hold her. She had been so small, born nearly two moons early, and half of her tiny body had fit into the palm of his hand. Jon had cried as he held her, and thanked the Gods that his wife and daughter had both survived such an ordeal.</p><p>King Jon loved all of his children equally, but all knew that Lyanna held a special place in Jon’s heart. So much like his sister Arya, and a tether to the mother who had died bringing him into the world, Lyanna was truly the light of her fathers life. </p><p>Betrothed to Robb Baratheon since her birth, Robb was five years her senior; born the same year as Lyanna’s eldest brother, Ned. From the time that Lyanna was in her fifteenth year, she travelled to Storms End to spend several months at a time with her Uncle and Aunt, Lord and Lady Baratheon. <br></p><p>Lyanna and Robb’s relationship developed slowly, beginning first as a friendship. Robb had been hesitant at first, insisting that the crown princess was too young. And he had been right. Though Lyanna’s fiery nature and independence matured her in many ways, she was in truth still a child when she and Robb began their courtship. During the earlier years she spent at Storms End, Lyanna and Robb became fast friends, their similar senses of humour and proclivity for combat provided them with a steadfast foundation for a strong and lasting friendship. During her fourth visit to Storms End, shortly after Lyanna’s eighteenth name day, Robb was taken aback by how much Lyanna had changed since her last visit. As she stepped down from her horse that day in the courtyard of his family’s ancestral home, the sun casting shades of copper and caramel in her dark hair, he felt an unexpected wave of nervousness wash over him. He had to remind himself that the woman standing in front of him was the same girl he had known all his life, and that he had no cause to be so anxious. </p><p>They spent the first few weeks of Lyanna’s visit partaking in their usual pastimes, though Robb was much quieter than he usually was around Lyanna. He gave himself a pep talk before seeing her each day, and cursed himself for being so quiet afterwards. Lyanna hadn’t seemed to notice the change in his demeanour however, and if she had she made no mention of it. During one of their walks through the woods surrounding Storms End, Lyanna had taken Robb’s hand unexpectedly. His heart had begun to beat faster at her touch, and Lyanna had flashed him a wide smile that had both calmed and enlivened him. </p><p>One night after they had supped, Robb had walked Lyanna to her room. The hallway was empty and dark, save for a smattering of candles. “My lady.” Robb had said, bidding her goodnight, but he had lingered, his eyes catching hers, and for what felt like a very long moment, neither of them spoke. Lyanna looked at Robb, and let her eyes trail across his face. He was so handsome, she had thought. Tall and fierce, his black hair and dark eyes suited perfectly to his strong face. She moved towards him slowly then, and ever so gently pressed her lips to his. When she moved to part from him, Robb had a look of bewilderment etched across his face, his cheeks slightly pinker than they had been a moment before. Lyanna laughed gently. Seeing such a brave man reduced to an embarrassed boy at her touch thrilled her. <br></p><p>“Relax Baratheon.” She had jested. “It was only a kiss.” Robb had watched her, his eyes never leaving her face, and a small smile played at the corner of Lyanna’s lips. She turned towards her room and closed the door behind her. Lyanna had teased Robb for his embarrassment, but as she stood alone in her room, her back pressed against her closed door, her heart pounding in her chest, she too felt the flush of heat that had spread to her cheeks. <br></p><p>Their friendship blossomed into a passionate romance that year, and the two of them snuck off into the woods to be alone more than once. Although their union had been arranged, Lyanna had never felt that it had been forced upon her. She had thanked the Gods that she and Robb had been betrothed to one another, and thought that maybe they would have found each other no matter the circumstances. </p><p>Lyanna was already pregnant with their first child the day that she wed Robb, though no one but the two of them knew. Their love for one another had grown from passion as much as it had from friendship. Their first child was a girl, born only seven moons after they had wed. They had named her Daenerys, though her hair and eyes were much darker than that of the woman she was named for. Queen Daenerys had given her daughter a knowing look, a mixture of amusement and understanding, after the birth of Lyanna’s first child. Lyanna knew that her mother had also been pregnant on her wedding day.</p><p>Lyanna gave birth to another daughter a year later. They named her Arya, and she favoured her namesake in both looks and temperament. A son was born to her and Robb the following year. Brandon, they had called him. He had dark hair like his sisters, but unlike his siblings he had bright blue eyes instead of brown. </p><p>Lyanna fell pregnant once again, five years after she had given birth to her first child, and much like her mother’s labour with her, Lyanna endured a difficult birth with her last child. It stretched on for days, and the Maester feared the worst for both mother and child. The baby was a girl, a tiny wisp of a thing, with dark hair like her mother. And though her child had survived the arduous labour, Lyanna did not. The Maester was unable to stop her bleeding, and Lyanna had died in Robb’s arms. It was said that the whole of the Seven Kingdoms wept when they heard of their Princess’s death. The Southern Wolf had perished, and with her went the joy that she had brought to those who had known her. Robb named their youngest daughter Lyanna. </p><p>King Jon had wept when he heard the news. His only daughter, the tiny girl he had held in his hands only moments after she had entered the world, had left it. Daenerys did not speak to anyone for many weeks following Lyanna’s death, and she remained sequestered in her chambers for even longer. Her Lyanna, her sweet fierce girl, was gone, and with her had gone Daenerys’ joy. The Queen was never the same after that. Many said the fire that had coursed through the Queens veins before her daughters death had left her once Lyanna had passed. </p><p>Ned had beaten his hands bloody against a wall when he had heard of his sisters death. When he closed his eyes, he did not see her as the woman she had grown into, but as the small girl who had clutched his hand as they walked through the hallways of the Red Keep. His whole life he had protected Lyanna, though she rarely ever needed it. But this time, he had failed her. He said as much to his wife. Catelyn had taken Ned’s face in her hands then, his cheeks wet and hot with tears, and she told him that there was nothing that he could have done to stop this from happening. That even a King could not stop the Gods. Catelyn felt her eyes burn as the words had left her mouth, and she could not stop the flood of tears that fell from her eyes as she thought of Lyanna. </p><p>Aemon had cried when he was told of Lyanna’s death. He did not believe it at first. It seemed almost impossible that his ferocious and headstrong sister could be taken from this world when she had so much life left to live. Litse had wept into Aemon’s chest when he told her of Lyanna’s passing. Lyanna had been a sister to Litse in every way but blood, and it filled her with the greatest sorrow to picture a world without Lyanna in it. </p><p>Aemon and Ned rode to Storms End with their father to retrieve Lyanna’s body. When they arrived, Arya and Gendry welcomed them in the courtyard, but Robb was nowhere to be found. Ned found him later, alone in his chambers, the curtains drawn and the candles unlit. Robb was as much Ned’s friend as he was his brother by law, and the sorrow he felt for Robb ran as deep as his own. Ned had no words of comfort to offer, his own grief clouding his ability to console his friend, and so the two men sat in silence. It had been Aemon who had finally coaxed Robb from his chambers, his gentle heart and empathetic nature allowing him to reach Robb in a way that no one else had been able to. </p><p>In the end, Lyanna’s body was brought back to Kings Landing. Her final resting place a stones throw away from where she had been born. Robb and Lyanna’s youngest child was like her mother in every way. Not only did she have her mothers name, but her beauty and character as well. </p><p>Lord Robb was never the same after his wife’s death. It was said that the light had gone from his life when Lyanna had passed, and his only true joy came from raising the children they had made together. </p><p>Robb never married again. </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "polkaduck",
                    "active": true,
                    "theme": {
                        "header_full_width": 540,
                        "header_full_height": 350,
                        "header_focus_width": 540,
                        "header_focus_height": 303,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "23,540,326,0",
                        "header_image": "https://static.tumblr.com/d90d9892784f0e9d77f8ba329726bf41/zobqc3q/lY6ppposv/tumblr_static_1ni2tk5nj0w0w0oscogscggsc.gif",
                        "header_image_focused": "https://static.tumblr.com/d90d9892784f0e9d77f8ba329726bf41/zobqc3q/GtWppposy/tumblr_static_tumblr_static_1ni2tk5nj0w0w0oscogscggsc_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/d90d9892784f0e9d77f8ba329726bf41/zobqc3q/lY6ppposv/tumblr_static_1ni2tk5nj0w0w0oscogscggsc_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179324244707"
                },
                "content_raw": "<p><b>The Next Generation of GOT</b></p><p><b>Part 3: </b></p><p>Lyanna (Youngest child and only daughter of King Jon and Queen Daenerys)<br>Robb (Eldest child of Arya Stark and Gendry Baratheon)</p><p><b><br></b></p><p><b>Lyanna Targaryen and Robb Baratheon</b></p><p><br></p><p>The youngest child and only daughter of King Jon and Queen Daenerys, Lyanna had the look of her mother and the colouring of her father. Known affectionately as the Southern Wolf, it was said that she was every bit a Stark as she was a Targaryen. Her stubborn nature was softened by her charm and quick wit, and it was said that those who met her couldn’t help but love her. </p><p>Her mother had endured a difficult labour with her, and during the worst of it, Maester Samwell had feared that both Daenerys and her child would not make it through. They did make it of course, both mother and child. Daenerys had said that she and Lyanna were too stubborn to let death take them so soon. Jon had been the first to hold her. She had been so small, born nearly two moons early, and half of her tiny body had fit into the palm of his hand. Jon had cried as he held her, and thanked the Gods that his wife and daughter had both survived such an ordeal.</p><p>King Jon loved all of his children equally, but all knew that Lyanna held a special place in Jon’s heart. So much like his sister Arya, and a tether to the mother who had died bringing him into the world, Lyanna was truly the light of her fathers life. </p><p>Betrothed to Robb Baratheon since her birth, Robb was five years her senior; born the same year as Lyanna’s eldest brother, Ned. From the time that Lyanna was in her fifteenth year, she travelled to Storms End to spend several months at a time with her Uncle and Aunt, Lord and Lady Baratheon. <br></p><p>Lyanna and Robb’s relationship developed slowly, beginning first as a friendship. Robb had been hesitant at first, insisting that the crown princess was too young. And he had been right. Though Lyanna’s fiery nature and independence matured her in many ways, she was in truth still a child when she and Robb began their courtship. During the earlier years she spent at Storms End, Lyanna and Robb became fast friends, their similar senses of humour and proclivity for combat provided them with a steadfast foundation for a strong and lasting friendship. During her fourth visit to Storms End, shortly after Lyanna’s eighteenth name day, Robb was taken aback by how much Lyanna had changed since her last visit. As she stepped down from her horse that day in the courtyard of his family’s ancestral home, the sun casting shades of copper and caramel in her dark hair, he felt an unexpected wave of nervousness wash over him. He had to remind himself that the woman standing in front of him was the same girl he had known all his life, and that he had no cause to be so anxious. </p><p>They spent the first few weeks of Lyanna’s visit partaking in their usual pastimes, though Robb was much quieter than he usually was around Lyanna. He gave himself a pep talk before seeing her each day, and cursed himself for being so quiet afterwards. Lyanna hadn’t seemed to notice the change in his demeanour however, and if she had she made no mention of it. During one of their walks through the woods surrounding Storms End, Lyanna had taken Robb’s hand unexpectedly. His heart had begun to beat faster at her touch, and Lyanna had flashed him a wide smile that had both calmed and enlivened him. </p><p>One night after they had supped, Robb had walked Lyanna to her room. The hallway was empty and dark, save for a smattering of candles. “My lady.” Robb had said, bidding her goodnight, but he had lingered, his eyes catching hers, and for what felt like a very long moment, neither of them spoke. Lyanna looked at Robb, and let her eyes trail across his face. He was so handsome, she had thought. Tall and fierce, his black hair and dark eyes suited perfectly to his strong face. She moved towards him slowly then, and ever so gently pressed her lips to his. When she moved to part from him, Robb had a look of bewilderment etched across his face, his cheeks slightly pinker than they had been a moment before. Lyanna laughed gently. Seeing such a brave man reduced to an embarrassed boy at her touch thrilled her. <br></p><p>“Relax Baratheon.” She had jested. “It was only a kiss.” Robb had watched her, his eyes never leaving her face, and a small smile played at the corner of Lyanna’s lips. She turned towards her room and closed the door behind her. Lyanna had teased Robb for his embarrassment, but as she stood alone in her room, her back pressed against her closed door, her heart pounding in her chest, she too felt the flush of heat that had spread to her cheeks. <br></p><p>Their friendship blossomed into a passionate romance that year, and the two of them snuck off into the woods to be alone more than once. Although their union had been arranged, Lyanna had never felt that it had been forced upon her. She had thanked the Gods that she and Robb had been betrothed to one another, and thought that maybe they would have found each other no matter the circumstances. </p><p>Lyanna was already pregnant with their first child the day that she wed Robb, though no one but the two of them knew. Their love for one another had grown from passion as much as it had from friendship. Their first child was a girl, born only seven moons after they had wed. They had named her Daenerys, though her hair and eyes were much darker than that of the woman she was named for. Queen Daenerys had given her daughter a knowing look, a mixture of amusement and understanding, after the birth of Lyanna’s first child. Lyanna knew that her mother had also been pregnant on her wedding day.</p><p>Lyanna gave birth to another daughter a year later. They named her Arya, and she favoured her namesake in both looks and temperament. A son was born to her and Robb the following year. Brandon, they had called him. He had dark hair like his sisters, but unlike his siblings he had bright blue eyes instead of brown. </p><p>Lyanna fell pregnant once again, five years after she had given birth to her first child, and much like her mother’s labour with her, Lyanna endured a difficult birth with her last child. It stretched on for days, and the Maester feared the worst for both mother and child. The baby was a girl, a tiny wisp of a thing, with dark hair like her mother. And though her child had survived the arduous labour, Lyanna did not. The Maester was unable to stop her bleeding, and Lyanna had died in Robb’s arms. It was said that the whole of the Seven Kingdoms wept when they heard of their Princess’s death. The Southern Wolf had perished, and with her went the joy that she had brought to those who had known her. Robb named their youngest daughter Lyanna. </p><p>King Jon had wept when he heard the news. His only daughter, the tiny girl he had held in his hands only moments after she had entered the world, had left it. Daenerys did not speak to anyone for many weeks following Lyanna’s death, and she remained sequestered in her chambers for even longer. Her Lyanna, her sweet fierce girl, was gone, and with her had gone Daenerys’ joy. The Queen was never the same after that. Many said the fire that had coursed through the Queens veins before her daughters death had left her once Lyanna had passed. </p><p>Ned had beaten his hands bloody against a wall when he had heard of his sisters death. When he closed his eyes, he did not see her as the woman she had grown into, but as the small girl who had clutched his hand as they walked through the hallways of the Red Keep. His whole life he had protected Lyanna, though she rarely ever needed it. But this time, he had failed her. He said as much to his wife. Catelyn had taken Ned’s face in her hands then, his cheeks wet and hot with tears, and she told him that there was nothing that he could have done to stop this from happening. That even a King could not stop the Gods. Catelyn felt her eyes burn as the words had left her mouth, and she could not stop the flood of tears that fell from her eyes as she thought of Lyanna. </p><p>Aemon had cried when he was told of Lyanna’s death. He did not believe it at first. It seemed almost impossible that his ferocious and headstrong sister could be taken from this world when she had so much life left to live. Litse had wept into Aemon’s chest when he told her of Lyanna’s passing. Lyanna had been a sister to Litse in every way but blood, and it filled her with the greatest sorrow to picture a world without Lyanna in it. </p><p>Aemon and Ned rode to Storms End with their father to retrieve Lyanna’s body. When they arrived, Arya and Gendry welcomed them in the courtyard, but Robb was nowhere to be found. Ned found him later, alone in his chambers, the curtains drawn and the candles unlit. Robb was as much Ned’s friend as he was his brother by law, and the sorrow he felt for Robb ran as deep as his own. Ned had no words of comfort to offer, his own grief clouding his ability to console his friend, and so the two men sat in silence. It had been Aemon who had finally coaxed Robb from his chambers, his gentle heart and empathetic nature allowing him to reach Robb in a way that no one else had been able to. </p><p>In the end, Lyanna’s body was brought back to Kings Landing. Her final resting place a stones throw away from where she had been born. Robb and Lyanna’s youngest child was like her mother in every way. Not only did she have her mothers name, but her beauty and character as well. </p><p>Lord Robb was never the same after his wife’s death. It was said that the light had gone from his life when Lyanna had passed, and his only true joy came from raising the children they had made together. </p><p>Robb never married again. </p>",
                "content": "<p><b>The Next Generation of GOT</b></p><p><b>Part 3: </b></p><p>Lyanna (Youngest child and only daughter of King Jon and Queen Daenerys)<br />Robb (Eldest child of Arya Stark and Gendry Baratheon)</p><p><b><br /></b></p><p><b>Lyanna Targaryen and Robb Baratheon</b></p><p><br /></p><p>The youngest child and only daughter of King Jon and Queen Daenerys, Lyanna had the look of her mother and the colouring of her father. Known affectionately as the Southern Wolf, it was said that she was every bit a Stark as she was a Targaryen. Her stubborn nature was softened by her charm and quick wit, and it was said that those who met her couldn&rsquo;t help but love her. </p><p>Her mother had endured a difficult labour with her, and during the worst of it, Maester Samwell had feared that both Daenerys and her child would not make it through. They did make it of course, both mother and child. Daenerys had said that she and Lyanna were too stubborn to let death take them so soon. Jon had been the first to hold her. She had been so small, born nearly two moons early, and half of her tiny body had fit into the palm of his hand. Jon had cried as he held her, and thanked the Gods that his wife and daughter had both survived such an ordeal.</p><p>King Jon loved all of his children equally, but all knew that Lyanna held a special place in Jon&rsquo;s heart. So much like his sister Arya, and a tether to the mother who had died bringing him into the world, Lyanna was truly the light of her fathers life. </p><p>Betrothed to Robb Baratheon since her birth, Robb was five years her senior; born the same year as Lyanna&rsquo;s eldest brother, Ned. From the time that Lyanna was in her fifteenth year, she travelled to Storms End to spend several months at a time with her Uncle and Aunt, Lord and Lady Baratheon. <br /></p><p>Lyanna and Robb&rsquo;s relationship developed slowly, beginning first as a friendship. Robb had been hesitant at first, insisting that the crown princess was too young. And he had been right. Though Lyanna&rsquo;s fiery nature and independence matured her in many ways, she was in truth still a child when she and Robb began their courtship. During the earlier years she spent at Storms End, Lyanna and Robb became fast friends, their similar senses of humour and proclivity for combat provided them with a steadfast foundation for a strong and lasting friendship. During her fourth visit to Storms End, shortly after Lyanna&rsquo;s eighteenth name day, Robb was taken aback by how much Lyanna had changed since her last visit. As she stepped down from her horse that day in the courtyard of his family&rsquo;s ancestral home, the sun casting shades of copper and caramel in her dark hair, he felt an unexpected wave of nervousness wash over him. He had to remind himself that the woman standing in front of him was the same girl he had known all his life, and that he had no cause to be so anxious. </p><p>They spent the first few weeks of Lyanna&rsquo;s visit partaking in their usual pastimes, though Robb was much quieter than he usually was around Lyanna. He gave himself a pep talk before seeing her each day, and cursed himself for being so quiet afterwards. Lyanna hadn&rsquo;t seemed to notice the change in his demeanour however, and if she had she made no mention of it. During one of their walks through the woods surrounding Storms End, Lyanna had taken Robb&rsquo;s hand unexpectedly. His heart had begun to beat faster at her touch, and Lyanna had flashed him a wide smile that had both calmed and enlivened him. </p><p>One night after they had supped, Robb had walked Lyanna to her room. The hallway was empty and dark, save for a smattering of candles. &ldquo;My lady.&rdquo; Robb had said, bidding her goodnight, but he had lingered, his eyes catching hers, and for what felt like a very long moment, neither of them spoke. Lyanna looked at Robb, and let her eyes trail across his face. He was so handsome, she had thought. Tall and fierce, his black hair and dark eyes suited perfectly to his strong face. She moved towards him slowly then, and ever so gently pressed her lips to his. When she moved to part from him, Robb had a look of bewilderment etched across his face, his cheeks slightly pinker than they had been a moment before. Lyanna laughed gently. Seeing such a brave man reduced to an embarrassed boy at her touch thrilled her. <br /></p><p>&ldquo;Relax Baratheon.&rdquo; She had jested. &ldquo;It was only a kiss.&rdquo; Robb had watched her, his eyes never leaving her face, and a small smile played at the corner of Lyanna&rsquo;s lips. She turned towards her room and closed the door behind her. Lyanna had teased Robb for his embarrassment, but as she stood alone in her room, her back pressed against her closed door, her heart pounding in her chest, she too felt the flush of heat that had spread to her cheeks. <br /></p><p>Their friendship blossomed into a passionate romance that year, and the two of them snuck off into the woods to be alone more than once. Although their union had been arranged, Lyanna had never felt that it had been forced upon her. She had thanked the Gods that she and Robb had been betrothed to one another, and thought that maybe they would have found each other no matter the circumstances. </p><p>Lyanna was already pregnant with their first child the day that she wed Robb, though no one but the two of them knew. Their love for one another had grown from passion as much as it had from friendship. Their first child was a girl, born only seven moons after they had wed. They had named her Daenerys, though her hair and eyes were much darker than that of the woman she was named for. Queen Daenerys had given her daughter a knowing look, a mixture of amusement and understanding, after the birth of Lyanna&rsquo;s first child. Lyanna knew that her mother had also been pregnant on her wedding day.</p><p>Lyanna gave birth to another daughter a year later. They named her Arya, and she favoured her namesake in both looks and temperament. A son was born to her and Robb the following year. Brandon, they had called him. He had dark hair like his sisters, but unlike his siblings he had bright blue eyes instead of brown. </p><p>Lyanna fell pregnant once again, five years after she had given birth to her first child, and much like her mother&rsquo;s labour with her, Lyanna endured a difficult birth with her last child. It stretched on for days, and the Maester feared the worst for both mother and child. The baby was a girl, a tiny wisp of a thing, with dark hair like her mother. And though her child had survived the arduous labour, Lyanna did not. The Maester was unable to stop her bleeding, and Lyanna had died in Robb&rsquo;s arms. It was said that the whole of the Seven Kingdoms wept when they heard of their Princess&rsquo;s death. The Southern Wolf had perished, and with her went the joy that she had brought to those who had known her. Robb named their youngest daughter Lyanna. </p><p>King Jon had wept when he heard the news. His only daughter, the tiny girl he had held in his hands only moments after she had entered the world, had left it. Daenerys did not speak to anyone for many weeks following Lyanna&rsquo;s death, and she remained sequestered in her chambers for even longer. Her Lyanna, her sweet fierce girl, was gone, and with her had gone Daenerys&rsquo; joy. The Queen was never the same after that. Many said the fire that had coursed through the Queens veins before her daughters death had left her once Lyanna had passed. </p><p>Ned had beaten his hands bloody against a wall when he had heard of his sisters death. When he closed his eyes, he did not see her as the woman she had grown into, but as the small girl who had clutched his hand as they walked through the hallways of the Red Keep. His whole life he had protected Lyanna, though she rarely ever needed it. But this time, he had failed her. He said as much to his wife. Catelyn had taken Ned&rsquo;s face in her hands then, his cheeks wet and hot with tears, and she told him that there was nothing that he could have done to stop this from happening. That even a King could not stop the Gods. Catelyn felt her eyes burn as the words had left her mouth, and she could not stop the flood of tears that fell from her eyes as she thought of Lyanna. </p><p>Aemon had cried when he was told of Lyanna&rsquo;s death. He did not believe it at first. It seemed almost impossible that his ferocious and headstrong sister could be taken from this world when she had so much life left to live. Litse had wept into Aemon&rsquo;s chest when he told her of Lyanna&rsquo;s passing. Lyanna had been a sister to Litse in every way but blood, and it filled her with the greatest sorrow to picture a world without Lyanna in it.&nbsp;</p><p>Aemon and Ned rode to Storms End with their father to retrieve Lyanna&rsquo;s body. When they arrived, Arya and Gendry welcomed them in the courtyard, but Robb was nowhere to be found. Ned found him later, alone in his chambers, the curtains drawn and the candles unlit. Robb was as much Ned&rsquo;s friend as he was his brother by law, and the sorrow he felt for Robb ran as deep as his own. Ned had no words of comfort to offer, his own grief clouding his ability to console his friend, and so the two men sat in silence. It had been Aemon who had finally coaxed Robb from his chambers, his gentle heart and empathetic nature allowing him to reach Robb in a way that no one else had been able to. </p><p>In the end, Lyanna&rsquo;s body was brought back to Kings Landing. Her final resting place a stones throw away from where she had been born. Robb and Lyanna&rsquo;s youngest child was like her mother in every way. Not only did she have her mothers name, but her beauty and character as well. </p><p>Lord Robb was never the same after his wife&rsquo;s death. It was said that the light had gone from his life when Lyanna had passed, and his only true joy came from raising the children they had made together. </p><p>Robb never married again. </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "2222",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/772dafa6266baedd5883aa9ea27e1087/tumblr_ph0phm5K7k1r9sf5zo1_250.jpg",
                    "width": 240,
                    "height": 251
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/772dafa6266baedd5883aa9ea27e1087/tumblr_ph0phm5K7k1r9sf5zo1_250.jpg",
                        "width": 240,
                        "height": 251
                    },
                    {
                        "url": "https://66.media.tumblr.com/772dafa6266baedd5883aa9ea27e1087/tumblr_ph0phm5K7k1r9sf5zo1_100.jpg",
                        "width": 100,
                        "height": 105
                    },
                    {
                        "url": "https://66.media.tumblr.com/772dafa6266baedd5883aa9ea27e1087/tumblr_ph0phm5K7k1r9sf5zo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/3172c7bec765fea7a8b61ff6d94abc5b/tumblr_ph0phm5K7k1r9sf5zo2_250.gif",
                    "width": 245,
                    "height": 255
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/3172c7bec765fea7a8b61ff6d94abc5b/tumblr_ph0phm5K7k1r9sf5zo2_250.gif",
                        "width": 245,
                        "height": 255
                    },
                    {
                        "url": "https://66.media.tumblr.com/3172c7bec765fea7a8b61ff6d94abc5b/tumblr_ph0phm5K7k1r9sf5zo2_100.gif",
                        "width": 100,
                        "height": 104
                    },
                    {
                        "url": "https://66.media.tumblr.com/3172c7bec765fea7a8b61ff6d94abc5b/tumblr_ph0phm5K7k1r9sf5zo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/faa46d97dbfd22694ce3a0236dc13917/tumblr_ph0phm5K7k1r9sf5zo3_250.gif",
                    "width": 245,
                    "height": 275
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/faa46d97dbfd22694ce3a0236dc13917/tumblr_ph0phm5K7k1r9sf5zo3_250.gif",
                        "width": 245,
                        "height": 275
                    },
                    {
                        "url": "https://66.media.tumblr.com/faa46d97dbfd22694ce3a0236dc13917/tumblr_ph0phm5K7k1r9sf5zo3_100.gif",
                        "width": 100,
                        "height": 112
                    },
                    {
                        "url": "https://66.media.tumblr.com/faa46d97dbfd22694ce3a0236dc13917/tumblr_ph0phm5K7k1r9sf5zo3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/52b226ffdedb10190c807c19fc1587a6/tumblr_ph0phm5K7k1r9sf5zo4_500.gif",
                    "width": 476,
                    "height": 266
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/52b226ffdedb10190c807c19fc1587a6/tumblr_ph0phm5K7k1r9sf5zo4_500.gif",
                        "width": 476,
                        "height": 266
                    },
                    {
                        "url": "https://66.media.tumblr.com/52b226ffdedb10190c807c19fc1587a6/tumblr_ph0phm5K7k1r9sf5zo4_400.gif",
                        "width": 400,
                        "height": 224
                    },
                    {
                        "url": "https://66.media.tumblr.com/52b226ffdedb10190c807c19fc1587a6/tumblr_ph0phm5K7k1r9sf5zo4_250.gif",
                        "width": 250,
                        "height": 140
                    },
                    {
                        "url": "https://66.media.tumblr.com/52b226ffdedb10190c807c19fc1587a6/tumblr_ph0phm5K7k1r9sf5zo4_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/52b226ffdedb10190c807c19fc1587a6/tumblr_ph0phm5K7k1r9sf5zo4_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_1280.gif",
                    "width": 1010,
                    "height": 420
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_1280.gif",
                        "width": 1010,
                        "height": 420
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_640.gif",
                        "width": 640,
                        "height": 266
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_540.gif",
                        "width": 540,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_500.gif",
                        "width": 500,
                        "height": 208
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_400.gif",
                        "width": 400,
                        "height": 166
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_250.gif",
                        "width": 250,
                        "height": 104
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_100.gif",
                        "width": 100,
                        "height": 42
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_540.gif",
                    "width": 540,
                    "height": 220
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_540.gif",
                        "width": 540,
                        "height": 220
                    },
                    {
                        "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_500.gif",
                        "width": 500,
                        "height": 204
                    },
                    {
                        "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_400.gif",
                        "width": 400,
                        "height": 163
                    },
                    {
                        "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_250.gif",
                        "width": 250,
                        "height": 102
                    },
                    {
                        "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_100.gif",
                        "width": 100,
                        "height": 41
                    },
                    {
                        "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_1280.jpg",
                    "width": 1080,
                    "height": 1350
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_1280.jpg",
                        "width": 1080,
                        "height": 1350
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_640.jpg",
                        "width": 640,
                        "height": 800
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_540.jpg",
                        "width": 540,
                        "height": 675
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_500.jpg",
                        "width": 500,
                        "height": 625
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_400.jpg",
                        "width": 400,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_250.jpg",
                        "width": 250,
                        "height": 313
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_100.jpg",
                        "width": 100,
                        "height": 125
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/41f631b9f29f4db1eb5f5fd3797db1f4/tumblr_ph0phm5K7k1r9sf5zo8_400.jpg",
                    "width": 400,
                    "height": 548
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/41f631b9f29f4db1eb5f5fd3797db1f4/tumblr_ph0phm5K7k1r9sf5zo8_400.jpg",
                        "width": 400,
                        "height": 548
                    },
                    {
                        "url": "https://66.media.tumblr.com/41f631b9f29f4db1eb5f5fd3797db1f4/tumblr_ph0phm5K7k1r9sf5zo8_250.jpg",
                        "width": 250,
                        "height": 343
                    },
                    {
                        "url": "https://66.media.tumblr.com/41f631b9f29f4db1eb5f5fd3797db1f4/tumblr_ph0phm5K7k1r9sf5zo8_100.jpg",
                        "width": 100,
                        "height": 137
                    },
                    {
                        "url": "https://66.media.tumblr.com/41f631b9f29f4db1eb5f5fd3797db1f4/tumblr_ph0phm5K7k1r9sf5zo8_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "link",
        "blog_name": "ao3feed-jonrya",
        "blog": {
            "name": "ao3feed-jonrya",
            "title": "AO3feed-Jonrya",
            "description": "  An automated feed for Jon x Arya fics posted on AO3.",
            "url": "https://ao3feed-jonrya.tumblr.com/",
            "uuid": "t:vwJRJGkZFFBKOLkwu-cxuA",
            "updated": 1561275029
        },
        "id": 179323121245,
        "post_url": "https://ao3feed-jonrya.tumblr.com/post/179323121245/starks-will-come-again",
        "slug": "starks-will-come-again",
        "date": "2018-10-22 20:02:07 GMT",
        "timestamp": 1540238527,
        "state": "published",
        "format": "html",
        "reblog_key": "U3AxEUlN",
        "tags": [
            "arya stark",
            "jon snow",
            "jon x arya",
            "needleheart",
            "jonrya",
            "ao3feed",
            "fanfic",
            "IFTTT"
        ],
        "short_url": "https://tmblr.co/ZmpZRZ2d0VQvT",
        "summary": "Starks Will Come Again",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 2,
        "title": "Starks Will Come Again",
        "url": "http://archiveofourown.org/works/16375820",
        "link_author": null,
        "excerpt": null,
        "publisher": "archiveofourown.org",
        "description": "<p>by <a rel=\"author\" href=\"/users/Aryas_aria/pseuds/Aryas_aria\">Aryas_aria</a></p><p>Jon Snow awakes on the Wall, changed but still very much committed to freeing &ldquo;Arya&rdquo; from the Boltons.  Catching wind of Jon&rsquo;s resurrection, Littlefinger plots to use him to secure Sansa&rsquo;s seat in Winterfell, but he isn&rsquo;t the only one with eyes on the North. Back in the Riverlands, a fugitive Brynden Tully finds a mysterious grey- eyed girl at the Twins as Bran Stark returns from Beyond the Wall. Meanwhile, Cersei Lannister rules from King&rsquo;s Landing as three Dragons circle the island of Dragonstone. The seven kingdoms are at war and the Night King is coming. Will they be able to band together and defeat the Night king for good? Or will the iron Throne be the death of them all?</p><p>Words: 919, Chapters: 1/?, Language: English</p><ul><li>Fandoms: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)/works\">Game of Thrones (TV)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20-%20George%20R*d*%20R*d*%20Martin/works\">A Song of Ice and Fire - George R. R. Martin</a>\n</li>\n<li>Rating: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a>\n</li>\n<li>Warnings: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\">Graphic Depictions Of Violence</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Major%20Character%20Death/works\">Major Character Death</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Underage/works\">Underage</a>\n</li>\n<li>Categories: <a class=\"tag\" href=\"http://archiveofourown.org/tags/F*s*M/works\">F/M</a>\n</li>\n<li>Characters: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow/works\">Jon Snow</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20Stark/works\">Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sansa%20Stark/works\">Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Bran%20Stark/works\">Bran Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rickon%20Stark/works\">Rickon Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Robb%20Stark%20(mentioned)%20-%20Character/works\">Robb Stark (mentioned) - Character</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Stark%20(%20mentioned)/works\">Ned Stark ( mentioned)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Catelyn%20Tully%20Stark/works\">Catelyn Tully Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Lady%20Stoneheart/works\">Lady Stoneheart</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Edmure%20Tully/works\">Edmure Tully</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Blackfish/works\">The Blackfish</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brynden%20Tully/works\">Brynden Tully</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyrion%20Lannister/works\">Tyrion Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jamie%20Lannister/works\">Jamie Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20Lannister/works\">Cersei Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Olenna%20Tyrell/works\">Olenna Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Willas%20Tyrell/works\">Willas Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Margaery%20Tyrell/works\">Margaery Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Dayne/works\">Ned Dayne</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arianne%20Martell/works\">Arianne Martell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyene%20Sand/works\">Tyene Sand</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Beric%20Dondarrion%20(mentioned)/works\">Beric Dondarrion (mentioned)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Thoros%20of%20Myr/works\">Thoros of Myr</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brotherhood%20Without%20Banners/works\">Brotherhood Without Banners</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brother(s)%20of%20the%20Night's%20Watch/works\">Brother(s) of the Night&rsquo;s Watch</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Samwell%20Tarley/works\">Samwell Tarley</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20%22The%20Greatjon%22%20Umber/works\">Jon &ldquo;The Greatjon&rdquo; Umber</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sandor%20Clegane/works\">Sandor Clegane</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20%22The%20Smalljon%22%20Umber/works\">Jon &ldquo;The Smalljon&rdquo; Umber</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Robert%20%22Sweetrobin%22%20Arryn/works\">Robert &ldquo;Sweetrobin&rdquo; Arryn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Petyr%20Baelish/works\">Petyr Baelish</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Shireen%20Baratheon/works\">Shireen Baratheon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gendry%20Waters/works\">Gendry Waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Selyse%20Baratheon/works\">Selyse Baratheon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Melisandre%20of%20Asshai/works\">Melisandre of Asshai</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Daenerys%20Targaryen/works\">Daenerys Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen/works\">Aegon VI Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Theon%20Greyjoy/works\">Theon Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Asha%20Greyjoy/works\">Asha Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jaqen%20H'ghar/works\">Jaqen H'ghar</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Faceless%20Man/works\">The Faceless Man</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gregor%20Clegane/works\">Gregor Clegane</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brienne%20of%20Tarth/works\">Brienne of Tarth</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Poderick%20Payne/works\">Poderick Payne</a>\n</li>\n<li>Relationships: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Arya%20Stark/works\">Jon Snow/Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Daenerys%20Targaryen%20(somewhat)/works\">Jon Snow/Daenerys Targaryen (somewhat)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyrion%20Lannister*s*Sansa%20Stark/works\">Tyrion Lannister/Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen*s*Daenerys%20Targaryen/works\">Aegon VI Targaryen/Daenerys Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Shireen%20Baratheon*s*%20Gendry%20waters/works\">Shireen Baratheon/ Gendry waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20Lannister*s*%20Jaime%20Lannister/works\">Cersei Lannister/ Jaime Lannister</a>\n</li>\n<li>Additional Tags: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20a%20Targaryen/works\">Jon Snow is a Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Slow%20Burn/works\">Slow Burn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20not%20called%20Aegon/works\">Jon Snow is not called Aegon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/aegon%20is%20a%20pretender/works\">aegon is a pretender</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sansa%20is%20redeemable/works\">Sansa is redeemable</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20stark%20is%20more%20than%20a%20weapon/works\">Arya stark is more than a weapon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya-centric/works\">Arya-centric</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Faceless%20Arya/works\">Faceless Arya</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/bran%20is%20more%20than%20just%20a%20three%20eyed%20raven/works\">bran is more than just a three eyed raven</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Bran%20has%20EMOTIONS%20*a*%20feelings/works\">Bran has EMOTIONS &amp; feelings</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Hound%20has%20been%20redeemed/works\">The Hound has been redeemed</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20is%20evil%20but%20we%20love%20her%20for%20it/works\">Cersei is evil but we love her for it</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rickon%20stark%20is%20a%20live%20and%20an%20important%20member%20of%20house%20stark/works\">Rickon stark is a live and an important member of house stark</a>\n</li>\n</ul>",
        "reblog": {
            "comment": "<p><p>by <a rel=\"author\" href=\"/users/Aryas_aria/pseuds/Aryas_aria\">Aryas_aria</a></p><p>Jon Snow awakes on the Wall, changed but still very much committed to freeing “Arya” from the Boltons.  Catching wind of Jon’s resurrection, Littlefinger plots to use him to secure Sansa’s seat in Winterfell, but he isn’t the only one with eyes on the North. Back in the Riverlands, a fugitive Brynden Tully finds a mysterious grey- eyed girl at the Twins as Bran Stark returns from Beyond the Wall. Meanwhile, Cersei Lannister rules from King’s Landing as three Dragons circle the island of Dragonstone. The seven kingdoms are at war and the Night King is coming. Will they be able to band together and defeat the Night king for good? Or will the iron Throne be the death of them all?</p><p>Words: 919, Chapters: 1/?, Language: English</p><ul><li>Fandoms: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)/works\">Game of Thrones (TV)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20-%20George%20R*d*%20R*d*%20Martin/works\">A Song of Ice and Fire - George R. R. Martin</a>\n</li>\n<li>Rating: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a>\n</li>\n<li>Warnings: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\">Graphic Depictions Of Violence</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Major%20Character%20Death/works\">Major Character Death</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Underage/works\">Underage</a>\n</li>\n<li>Categories: <a class=\"tag\" href=\"http://archiveofourown.org/tags/F*s*M/works\">F/M</a>\n</li>\n<li>Characters: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow/works\">Jon Snow</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20Stark/works\">Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sansa%20Stark/works\">Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Bran%20Stark/works\">Bran Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rickon%20Stark/works\">Rickon Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Robb%20Stark%20(mentioned)%20-%20Character/works\">Robb Stark (mentioned) - Character</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Stark%20(%20mentioned)/works\">Ned Stark ( mentioned)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Catelyn%20Tully%20Stark/works\">Catelyn Tully Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Lady%20Stoneheart/works\">Lady Stoneheart</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Edmure%20Tully/works\">Edmure Tully</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Blackfish/works\">The Blackfish</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brynden%20Tully/works\">Brynden Tully</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyrion%20Lannister/works\">Tyrion Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jamie%20Lannister/works\">Jamie Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20Lannister/works\">Cersei Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Olenna%20Tyrell/works\">Olenna Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Willas%20Tyrell/works\">Willas Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Margaery%20Tyrell/works\">Margaery Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Dayne/works\">Ned Dayne</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arianne%20Martell/works\">Arianne Martell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyene%20Sand/works\">Tyene Sand</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Beric%20Dondarrion%20(mentioned)/works\">Beric Dondarrion (mentioned)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Thoros%20of%20Myr/works\">Thoros of Myr</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brotherhood%20Without%20Banners/works\">Brotherhood Without Banners</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brother(s)%20of%20the%20Night's%20Watch/works\">Brother(s) of the Night’s Watch</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Samwell%20Tarley/works\">Samwell Tarley</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20%22The%20Greatjon%22%20Umber/works\">Jon “The Greatjon” Umber</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sandor%20Clegane/works\">Sandor Clegane</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20%22The%20Smalljon%22%20Umber/works\">Jon “The Smalljon” Umber</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Robert%20%22Sweetrobin%22%20Arryn/works\">Robert “Sweetrobin” Arryn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Petyr%20Baelish/works\">Petyr Baelish</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Shireen%20Baratheon/works\">Shireen Baratheon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gendry%20Waters/works\">Gendry Waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Selyse%20Baratheon/works\">Selyse Baratheon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Melisandre%20of%20Asshai/works\">Melisandre of Asshai</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Daenerys%20Targaryen/works\">Daenerys Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen/works\">Aegon VI Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Theon%20Greyjoy/works\">Theon Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Asha%20Greyjoy/works\">Asha Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jaqen%20H'ghar/works\">Jaqen H'ghar</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Faceless%20Man/works\">The Faceless Man</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gregor%20Clegane/works\">Gregor Clegane</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brienne%20of%20Tarth/works\">Brienne of Tarth</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Poderick%20Payne/works\">Poderick Payne</a>\n</li>\n<li>Relationships: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Arya%20Stark/works\">Jon Snow/Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Daenerys%20Targaryen%20(somewhat)/works\">Jon Snow/Daenerys Targaryen (somewhat)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyrion%20Lannister*s*Sansa%20Stark/works\">Tyrion Lannister/Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen*s*Daenerys%20Targaryen/works\">Aegon VI Targaryen/Daenerys Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Shireen%20Baratheon*s*%20Gendry%20waters/works\">Shireen Baratheon/ Gendry waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20Lannister*s*%20Jaime%20Lannister/works\">Cersei Lannister/ Jaime Lannister</a>\n</li>\n<li>Additional Tags: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20a%20Targaryen/works\">Jon Snow is a Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Slow%20Burn/works\">Slow Burn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20not%20called%20Aegon/works\">Jon Snow is not called Aegon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/aegon%20is%20a%20pretender/works\">aegon is a pretender</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sansa%20is%20redeemable/works\">Sansa is redeemable</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20stark%20is%20more%20than%20a%20weapon/works\">Arya stark is more than a weapon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya-centric/works\">Arya-centric</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Faceless%20Arya/works\">Faceless Arya</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/bran%20is%20more%20than%20just%20a%20three%20eyed%20raven/works\">bran is more than just a three eyed raven</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Bran%20has%20EMOTIONS%20*a*%20feelings/works\">Bran has EMOTIONS &amp; feelings</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Hound%20has%20been%20redeemed/works\">The Hound has been redeemed</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20is%20evil%20but%20we%20love%20her%20for%20it/works\">Cersei is evil but we love her for it</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rickon%20stark%20is%20a%20live%20and%20an%20important%20member%20of%20house%20stark/works\">Rickon stark is a live and an important member of house stark</a>\n</li>\n</ul></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ao3feed-jonrya",
                    "active": true,
                    "theme": {
                        "header_full_width": 3000,
                        "header_full_height": 1055,
                        "header_focus_width": 1068,
                        "header_focus_height": 601,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "111,2041,712,973",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_05.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_image_focused": "https://static.tumblr.com/7032fac7091015e342cc53dc7f060a57/mailbkd/MTmpfkldy/tumblr_static_optica_pattern_05_focused_v3.png",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_05_focused_v3.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179323121245"
                },
                "content_raw": "<p><p>by <a rel=\"author\" href=\"/users/Aryas_aria/pseuds/Aryas_aria\">Aryas_aria</a></p><p>Jon Snow awakes on the Wall, changed but still very much committed to freeing “Arya” from the Boltons.  Catching wind of Jon’s resurrection, Littlefinger plots to use him to secure Sansa’s seat in Winterfell, but he isn’t the only one with eyes on the North. Back in the Riverlands, a fugitive Brynden Tully finds a mysterious grey- eyed girl at the Twins as Bran Stark returns from Beyond the Wall. Meanwhile, Cersei Lannister rules from King’s Landing as three Dragons circle the island of Dragonstone. The seven kingdoms are at war and the Night King is coming. Will they be able to band together and defeat the Night king for good? Or will the iron Throne be the death of them all?</p><p>Words: 919, Chapters: 1/?, Language: English</p><ul><li>Fandoms: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)/works\">Game of Thrones (TV)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20-%20George%20R*d*%20R*d*%20Martin/works\">A Song of Ice and Fire - George R. R. Martin</a>\n</li>\n<li>Rating: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a>\n</li>\n<li>Warnings: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\">Graphic Depictions Of Violence</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Major%20Character%20Death/works\">Major Character Death</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Underage/works\">Underage</a>\n</li>\n<li>Categories: <a class=\"tag\" href=\"http://archiveofourown.org/tags/F*s*M/works\">F/M</a>\n</li>\n<li>Characters: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow/works\">Jon Snow</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20Stark/works\">Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sansa%20Stark/works\">Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Bran%20Stark/works\">Bran Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rickon%20Stark/works\">Rickon Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Robb%20Stark%20(mentioned)%20-%20Character/works\">Robb Stark (mentioned) - Character</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Stark%20(%20mentioned)/works\">Ned Stark ( mentioned)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Catelyn%20Tully%20Stark/works\">Catelyn Tully Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Lady%20Stoneheart/works\">Lady Stoneheart</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Edmure%20Tully/works\">Edmure Tully</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Blackfish/works\">The Blackfish</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brynden%20Tully/works\">Brynden Tully</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyrion%20Lannister/works\">Tyrion Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jamie%20Lannister/works\">Jamie Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20Lannister/works\">Cersei Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Olenna%20Tyrell/works\">Olenna Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Willas%20Tyrell/works\">Willas Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Margaery%20Tyrell/works\">Margaery Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Dayne/works\">Ned Dayne</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arianne%20Martell/works\">Arianne Martell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyene%20Sand/works\">Tyene Sand</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Beric%20Dondarrion%20(mentioned)/works\">Beric Dondarrion (mentioned)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Thoros%20of%20Myr/works\">Thoros of Myr</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brotherhood%20Without%20Banners/works\">Brotherhood Without Banners</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brother(s)%20of%20the%20Night's%20Watch/works\">Brother(s) of the Night’s Watch</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Samwell%20Tarley/works\">Samwell Tarley</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20%22The%20Greatjon%22%20Umber/works\">Jon “The Greatjon” Umber</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sandor%20Clegane/works\">Sandor Clegane</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20%22The%20Smalljon%22%20Umber/works\">Jon “The Smalljon” Umber</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Robert%20%22Sweetrobin%22%20Arryn/works\">Robert “Sweetrobin” Arryn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Petyr%20Baelish/works\">Petyr Baelish</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Shireen%20Baratheon/works\">Shireen Baratheon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gendry%20Waters/works\">Gendry Waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Selyse%20Baratheon/works\">Selyse Baratheon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Melisandre%20of%20Asshai/works\">Melisandre of Asshai</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Daenerys%20Targaryen/works\">Daenerys Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen/works\">Aegon VI Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Theon%20Greyjoy/works\">Theon Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Asha%20Greyjoy/works\">Asha Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jaqen%20H'ghar/works\">Jaqen H'ghar</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Faceless%20Man/works\">The Faceless Man</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gregor%20Clegane/works\">Gregor Clegane</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brienne%20of%20Tarth/works\">Brienne of Tarth</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Poderick%20Payne/works\">Poderick Payne</a>\n</li>\n<li>Relationships: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Arya%20Stark/works\">Jon Snow/Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Daenerys%20Targaryen%20(somewhat)/works\">Jon Snow/Daenerys Targaryen (somewhat)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyrion%20Lannister*s*Sansa%20Stark/works\">Tyrion Lannister/Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen*s*Daenerys%20Targaryen/works\">Aegon VI Targaryen/Daenerys Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Shireen%20Baratheon*s*%20Gendry%20waters/works\">Shireen Baratheon/ Gendry waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20Lannister*s*%20Jaime%20Lannister/works\">Cersei Lannister/ Jaime Lannister</a>\n</li>\n<li>Additional Tags: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20a%20Targaryen/works\">Jon Snow is a Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Slow%20Burn/works\">Slow Burn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20not%20called%20Aegon/works\">Jon Snow is not called Aegon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/aegon%20is%20a%20pretender/works\">aegon is a pretender</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sansa%20is%20redeemable/works\">Sansa is redeemable</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20stark%20is%20more%20than%20a%20weapon/works\">Arya stark is more than a weapon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya-centric/works\">Arya-centric</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Faceless%20Arya/works\">Faceless Arya</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/bran%20is%20more%20than%20just%20a%20three%20eyed%20raven/works\">bran is more than just a three eyed raven</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Bran%20has%20EMOTIONS%20*a*%20feelings/works\">Bran has EMOTIONS &amp; feelings</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Hound%20has%20been%20redeemed/works\">The Hound has been redeemed</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20is%20evil%20but%20we%20love%20her%20for%20it/works\">Cersei is evil but we love her for it</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rickon%20stark%20is%20a%20live%20and%20an%20important%20member%20of%20house%20stark/works\">Rickon stark is a live and an important member of house stark</a>\n</li>\n</ul></p>",
                "content": "<p><p>by <a href=\"/users/Aryas_aria/pseuds/Aryas_aria\">Aryas_aria</a></p><p>Jon Snow awakes on the Wall, changed but still very much committed to freeing &ldquo;Arya&rdquo; from the Boltons.  Catching wind of Jon&rsquo;s resurrection, Littlefinger plots to use him to secure Sansa&rsquo;s seat in Winterfell, but he isn&rsquo;t the only one with eyes on the North. Back in the Riverlands, a fugitive Brynden Tully finds a mysterious grey- eyed girl at the Twins as Bran Stark returns from Beyond the Wall. Meanwhile, Cersei Lannister rules from King&rsquo;s Landing as three Dragons circle the island of Dragonstone. The seven kingdoms are at war and the Night King is coming. Will they be able to band together and defeat the Night king for good? Or will the iron Throne be the death of them all?</p><p>Words: 919, Chapters: 1/?, Language: English</p><ul><li>Fandoms: <a href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)/works\">Game of Thrones (TV)</a>, <a href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20-%20George%20R*d*%20R*d*%20Martin/works\">A Song of Ice and Fire - George R. R. Martin</a>\n</li>\n<li>Rating: <a href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a>\n</li>\n<li>Warnings: <a href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\">Graphic Depictions Of Violence</a>, <a href=\"http://archiveofourown.org/tags/Major%20Character%20Death/works\">Major Character Death</a>, <a href=\"http://archiveofourown.org/tags/Underage/works\">Underage</a>\n</li>\n<li>Categories: <a href=\"http://archiveofourown.org/tags/F*s*M/works\">F/M</a>\n</li>\n<li>Characters: <a href=\"http://archiveofourown.org/tags/Jon%20Snow/works\">Jon Snow</a>, <a href=\"http://archiveofourown.org/tags/Arya%20Stark/works\">Arya Stark</a>, <a href=\"http://archiveofourown.org/tags/Sansa%20Stark/works\">Sansa Stark</a>, <a href=\"http://archiveofourown.org/tags/Bran%20Stark/works\">Bran Stark</a>, <a href=\"http://archiveofourown.org/tags/Rickon%20Stark/works\">Rickon Stark</a>, <a href=\"http://archiveofourown.org/tags/Robb%20Stark%20(mentioned)%20-%20Character/works\">Robb Stark (mentioned) - Character</a>, <a href=\"http://archiveofourown.org/tags/Ned%20Stark%20(%20mentioned)/works\">Ned Stark ( mentioned)</a>, <a href=\"http://archiveofourown.org/tags/Catelyn%20Tully%20Stark/works\">Catelyn Tully Stark</a>, <a href=\"http://archiveofourown.org/tags/Lady%20Stoneheart/works\">Lady Stoneheart</a>, <a href=\"http://archiveofourown.org/tags/Edmure%20Tully/works\">Edmure Tully</a>, <a href=\"http://archiveofourown.org/tags/The%20Blackfish/works\">The Blackfish</a>, <a href=\"http://archiveofourown.org/tags/Brynden%20Tully/works\">Brynden Tully</a>, <a href=\"http://archiveofourown.org/tags/Tyrion%20Lannister/works\">Tyrion Lannister</a>, <a href=\"http://archiveofourown.org/tags/Jamie%20Lannister/works\">Jamie Lannister</a>, <a href=\"http://archiveofourown.org/tags/Cersei%20Lannister/works\">Cersei Lannister</a>, <a href=\"http://archiveofourown.org/tags/Olenna%20Tyrell/works\">Olenna Tyrell</a>, <a href=\"http://archiveofourown.org/tags/Willas%20Tyrell/works\">Willas Tyrell</a>, <a href=\"http://archiveofourown.org/tags/Margaery%20Tyrell/works\">Margaery Tyrell</a>, <a href=\"http://archiveofourown.org/tags/Ned%20Dayne/works\">Ned Dayne</a>, <a href=\"http://archiveofourown.org/tags/Arianne%20Martell/works\">Arianne Martell</a>, <a href=\"http://archiveofourown.org/tags/Tyene%20Sand/works\">Tyene Sand</a>, <a href=\"http://archiveofourown.org/tags/Beric%20Dondarrion%20(mentioned)/works\">Beric Dondarrion (mentioned)</a>, <a href=\"http://archiveofourown.org/tags/Thoros%20of%20Myr/works\">Thoros of Myr</a>, <a href=\"http://archiveofourown.org/tags/Brotherhood%20Without%20Banners/works\">Brotherhood Without Banners</a>, <a href=\"http://archiveofourown.org/tags/Brother(s)%20of%20the%20Night's%20Watch/works\">Brother(s) of the Night&rsquo;s Watch</a>, <a href=\"http://archiveofourown.org/tags/Samwell%20Tarley/works\">Samwell Tarley</a>, <a href=\"http://archiveofourown.org/tags/Jon%20%22The%20Greatjon%22%20Umber/works\">Jon &ldquo;The Greatjon&rdquo; Umber</a>, <a href=\"http://archiveofourown.org/tags/Sandor%20Clegane/works\">Sandor Clegane</a>, <a href=\"http://archiveofourown.org/tags/Jon%20%22The%20Smalljon%22%20Umber/works\">Jon &ldquo;The Smalljon&rdquo; Umber</a>, <a href=\"http://archiveofourown.org/tags/Robert%20%22Sweetrobin%22%20Arryn/works\">Robert &ldquo;Sweetrobin&rdquo; Arryn</a>, <a href=\"http://archiveofourown.org/tags/Petyr%20Baelish/works\">Petyr Baelish</a>, <a href=\"http://archiveofourown.org/tags/Shireen%20Baratheon/works\">Shireen Baratheon</a>, <a href=\"http://archiveofourown.org/tags/Gendry%20Waters/works\">Gendry Waters</a>, <a href=\"http://archiveofourown.org/tags/Selyse%20Baratheon/works\">Selyse Baratheon</a>, <a href=\"http://archiveofourown.org/tags/Melisandre%20of%20Asshai/works\">Melisandre of Asshai</a>, <a href=\"http://archiveofourown.org/tags/Daenerys%20Targaryen/works\">Daenerys Targaryen</a>, <a href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen/works\">Aegon VI Targaryen</a>, <a href=\"http://archiveofourown.org/tags/Theon%20Greyjoy/works\">Theon Greyjoy</a>, <a href=\"http://archiveofourown.org/tags/Asha%20Greyjoy/works\">Asha Greyjoy</a>, <a href=\"http://archiveofourown.org/tags/Jaqen%20H'ghar/works\">Jaqen H'ghar</a>, <a href=\"http://archiveofourown.org/tags/The%20Faceless%20Man/works\">The Faceless Man</a>, <a href=\"http://archiveofourown.org/tags/Gregor%20Clegane/works\">Gregor Clegane</a>, <a href=\"http://archiveofourown.org/tags/Brienne%20of%20Tarth/works\">Brienne of Tarth</a>, <a href=\"http://archiveofourown.org/tags/Poderick%20Payne/works\">Poderick Payne</a>\n</li>\n<li>Relationships: <a href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Arya%20Stark/works\">Jon Snow/Arya Stark</a>, <a href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Daenerys%20Targaryen%20(somewhat)/works\">Jon Snow/Daenerys Targaryen (somewhat)</a>, <a href=\"http://archiveofourown.org/tags/Tyrion%20Lannister*s*Sansa%20Stark/works\">Tyrion Lannister/Sansa Stark</a>, <a href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen*s*Daenerys%20Targaryen/works\">Aegon VI Targaryen/Daenerys Targaryen</a>, <a href=\"http://archiveofourown.org/tags/Shireen%20Baratheon*s*%20Gendry%20waters/works\">Shireen Baratheon/ Gendry waters</a>, <a href=\"http://archiveofourown.org/tags/Cersei%20Lannister*s*%20Jaime%20Lannister/works\">Cersei Lannister/ Jaime Lannister</a>\n</li>\n<li>Additional Tags: <a href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20a%20Targaryen/works\">Jon Snow is a Targaryen</a>, <a href=\"http://archiveofourown.org/tags/Slow%20Burn/works\">Slow Burn</a>, <a href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20not%20called%20Aegon/works\">Jon Snow is not called Aegon</a>, <a href=\"http://archiveofourown.org/tags/aegon%20is%20a%20pretender/works\">aegon is a pretender</a>, <a href=\"http://archiveofourown.org/tags/Sansa%20is%20redeemable/works\">Sansa is redeemable</a>, <a href=\"http://archiveofourown.org/tags/Arya%20stark%20is%20more%20than%20a%20weapon/works\">Arya stark is more than a weapon</a>, <a href=\"http://archiveofourown.org/tags/Arya-centric/works\">Arya-centric</a>, <a href=\"http://archiveofourown.org/tags/Faceless%20Arya/works\">Faceless Arya</a>, <a href=\"http://archiveofourown.org/tags/bran%20is%20more%20than%20just%20a%20three%20eyed%20raven/works\">bran is more than just a three eyed raven</a>, <a href=\"http://archiveofourown.org/tags/Bran%20has%20EMOTIONS%20*a*%20feelings/works\">Bran has EMOTIONS &amp; feelings</a>, <a href=\"http://archiveofourown.org/tags/The%20Hound%20has%20been%20redeemed/works\">The Hound has been redeemed</a>, <a href=\"http://archiveofourown.org/tags/Cersei%20is%20evil%20but%20we%20love%20her%20for%20it/works\">Cersei is evil but we love her for it</a>, <a href=\"http://archiveofourown.org/tags/Rickon%20stark%20is%20a%20live%20and%20an%20important%20member%20of%20house%20stark/works\">Rickon stark is a live and an important member of house stark</a>\n</li>\n</ul></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "quote",
        "blog_name": "gameofavatars",
        "blog": {
            "name": "gameofavatars",
            "title": "Game of Avatars",
            "description": "An incorrect quote blog for Game of Thrones/A Song of Ice and Fire and Avatar: The Last Airbender/The Legend of Korra.",
            "url": "https://gameofavatars.tumblr.com/",
            "uuid": "t:Zco9oibFkR7p5wFQcV7irw",
            "updated": 1549395042
        },
        "id": 179322488496,
        "post_url": "https://gameofavatars.tumblr.com/post/179322488496/i-abandoned-no-one",
        "slug": "i-abandoned-no-one",
        "date": "2018-10-22 19:40:24 GMT",
        "timestamp": 1540237224,
        "state": "published",
        "format": "html",
        "reblog_key": "xKFeZ0PQ",
        "tags": [
            "uko",
            "jon snow",
            "atla",
            "asoiaf",
            "a storm of swords",
            "atla book 3"
        ],
        "short_url": "https://tmblr.co/Z2Z64h2d0T0Qm",
        "summary": "I abandoned no one.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1,
        "text": "I abandoned no one.",
        "source": "Zuko, Book 3",
        "reblog": {
            "comment": "<p>Zuko, Book 3</p>",
            "tree_html": ""
        },
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "acourtofhopeanddreams",
        "blog": {
            "name": "acourtofhopeanddreams",
            "title": "Enjoy the little things!",
            "description": "Open your heart\nTo the love of the world\nIt only needs one person\nTouching it with \nA word\nA look\nA smile\nA kiss",
            "url": "https://acourtofhopeanddreams.tumblr.com/",
            "uuid": "t:BS7jn3JbIcnDmWP5dKvmaA",
            "updated": 1561404390
        },
        "id": 179322001805,
        "post_url": "https://acourtofhopeanddreams.tumblr.com/post/179322001805/first-kiss",
        "slug": "first-kiss",
        "date": "2018-10-22 19:23:05 GMT",
        "timestamp": 1540236185,
        "state": "published",
        "format": "html",
        "reblog_key": "4Yh4DL6m",
        "tags": [
            "jonsa",
            "jon snow",
            "Sansa Stark",
            "jonsansaweek",
            "jonsansasource",
            "jonsa fanfiction",
            "jon snow fanfiction",
            "sansa stark fanfiction",
            "day 1: Sansa's POV or Jon's POV",
            "make that and"
        ],
        "short_url": "https://tmblr.co/Z8dw4y2d0R9cD",
        "summary": "FIRST KISS",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 24,
        "title": "FIRST KISS",
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"280\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/a10726c10dd8bfad659d664dab13f412/tumblr_inline_ph0lcgy6y51qdb55z_1280.gif\" data-orig-height=\"280\" data-orig-width=\"500\"/></figure><blockquote><p><b><small>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>&rsquo;s JonSansaWeek Day 1: Sansa&rsquo;s POV or Jon&rsquo;S POV<br/></small></b></p><p><b><small><i>This little snippet has no setting and no certain universe. It&rsquo;s just their very first kiss, first described through Sansa&rsquo;s eyes and then through Jon&rsquo;s.<br/></i></small></b></p></blockquote><p><b><i>Sansa&rsquo;s POV</i></b></p><p>Sansa had read a thousand books about this moment, but somehow she was not sure if any of those books had really managed to capture how it truly felt. She felt a certain kind of pleasant nervousness in her stomach. Her skin tingled wherever his hands and body touched her and her heart was beating rapidly in her chest with longing excitement.</p><p>“Are you sure you want this?” Jon spoke softly and Sansa let out a deep breath, cursing because he dared to make her wait even one more moment, one more second. </p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. “I&rsquo;ve never been this sure about anything, Jon.” </p><p>In literally every book Sansa had ever read, the girl had been standing on the tips of her toes right now, but Sansa didn’t need to do so. She was glad that she was wearing her flats tonight instead of the high heels Margaery had tried to make her wear.</p><p>“You look beautiful tonight.” Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest, if that was even possible. </p><p>“Jon!” Sansa raised her voice while she closed her eyes. “Can you stop talking, please?” She licked her dry lips and pressed her forehead to his. “We’ve talked more than enough during the last few weeks. I want this. And I want this now.”</p><p>Jon curled his lips up into a smile and then his nose brushed hers. </p><!-- more --><p>She was not sure if he did it on purpose, if he knew how badly she wanted this, how deeply she was longing for this. For weeks she had wondered if Jon really felt the same for her as she felt for him and tonight she had not been capable of stopping herself anymore. </p><p>She had just asked him. She had just asked him if he thought about her day and night, just like she always seemed to be thinking about him these days. She had just asked him if he dreamed about her, just like all her dreams now seemed to be about him. She had just asked him if he sometimes wondered how it would be to kiss her, to touch her, to make love under a blanket of stars. </p><p>And he had said yes. His cheeks had reddened and pearls of sweat had covered his forehead. Sansa had not really understood why. She had been the one taking a risk. She had been the one taking the first step. </p><p>And now she was waiting for him to take the next one. And the longer it took, the more frustrated and excited she got.</p><p>When she felt his breath warming her waiting lips she closed her eyes and her arms circled around his neck. After what seemed to be another eternity his lips finally found hers.</p><p>They were surprisingly soft and tender and his kiss was slow and a little reluctantly.</p><p>But Sansa wanted more. Sansa needed more. And while her hands went through his dark curls, her lips parted to invite his tongue in.</p><p><b><i><br/></i></b></p><p><b><i>Jon&rsquo;s POV</i></b></p><p>Jon had kissed girls before. Most of the kisses hadn’t really meant much, apart from that one time he thought he had been in love. He was not sure what he and Ygritte had really felt for each other, but every time he looked at Sansa now he was certain it had not been love. This was love. What he felt now was love. And he was terrified that somehow he would break it.<br/></p><p>“Are you sure you want this?” He spoke softly, dreading the moment. Somehow he was still afraid that at some point she’d discover that she could get someone much better and much smarter than him.</p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. “I&rsquo;ve never been this sure about anything, Jon.”</p><p>He wasn’t sure why he couldn’t really believe her. He wasn&rsquo;t sure why there was always a voice in the back of his mind telling him that this was just a dream, that this was temporary, that somehow he’d find a way to ruin it, to break it. That somehow he wouldn’t get the girl.</p><p>“You look beautiful tonight.” Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest because he was afraid she would slip through his fingers if he wouldn’t.</p><p>“Jon!” Sansa raised her voice while she closed her eyes. “Can you stop talking, please?” She licked her lips and pressed her warm forehead to his. “We’ve talked more than enough during the last few weeks. I want this. And I want this now.”</p><p>A strange, but pleasant warmth spread through his body. He curled his lips up into a smile and he let his nose brush hers. He didn’t know why he was so terrified of just kissing her. He didn’t know why he was hesitating. He didn’t know why he couldn’t just lean in and do it.</p><p>He had never been someone’s first choice. He had never been someone’s everything and someone’s world. And he had never dared to make someone else his first choice, his everything, his world. He knew all too well how things could change all of a sudden. </p><p>Friends could become foes within an instant. Those closest to you could eventually betray you. Trusting someone too much, could eventually lead to misery and pain.</p><p>Somehow he didn’t dare to fully believe Sansa when she had told him that she thought about him all day, that she dreamed about him at night, that she had fantasized about kissing him and loving him. He knew he didn’t have a reason to doubt her, but it was still hard to believe that someone as amazing and beautiful as her, would fall for someone like him.</p><p>Maybe he would somehow start believing it when he did kiss her and when she would kiss him back. </p><p>He leaned in and waited a few more seconds before he pressed his lips to hers. Her arms circled around his neck, but in the back of his mind Jon could still hear a voice telling him that if he’d go any further, the dream would explode and he’d wake up. </p><p>But Sansa’s hands went through his hair and the moment she parted her lips to invite his tongue in he finally realized that she meant it.</p><p>She really meant it.</p><p>And eagerly, giving into his own hunger and desire eventually, he accepted her invitation.</p>",
        "body_abstract": "\n<figure class=\"tmblr-full\" data-orig-height=\"280\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/a10726c10dd8bfad659d664dab13f412/tumblr_inline_ph0lcgy6y51qdb55z_1280.gif\" data-orig-height=\"280\" data-orig-width=\"500\"></figure><blockquote>\n<p><b><small>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>&rsquo;s JonSansaWeek Day 1: Sansa&rsquo;s POV or Jon&rsquo;S POV<br></small></b></p>\n<p><b><small><i>This little snippet has no setting and no certain universe. It&rsquo;s just their very first kiss, first described through Sansa&rsquo;s eyes and then through Jon&rsquo;s.<br></i></small></b></p>\n</blockquote>\n<p><b><i>Sansa&rsquo;s POV</i></b></p>\n<p>Sansa had read a thousand books about this moment, but somehow she was not sure if any of those books had really managed to capture how it truly felt. She felt a certain kind of pleasant nervousness in her stomach. Her skin tingled wherever his hands and body touched her and her heart was beating rapidly in her chest with longing excitement.</p>\n<p>&ldquo;Are you sure you want this?&rdquo; Jon spoke softly and Sansa let out a deep breath, cursing because he dared to make her wait even one more moment, one more second. </p>\n<p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. &ldquo;I&rsquo;ve never been this sure about anything, Jon.&rdquo; </p>\n<p>In literally every book Sansa had ever read, the girl had been standing on the tips of her toes right now, but Sansa didn&rsquo;t need to do so. She was glad that she was wearing her flats tonight instead of the high heels Margaery had tried to make her wear.</p>\n<p>&ldquo;You look beautiful tonight.&rdquo; Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest, if that was even possible. </p>\n<p>&ldquo;Jon!&rdquo; Sansa raised her voice while she closed her eyes. &ldquo;Can you stop talking, please?&rdquo; She licked her dry lips and pressed her forehead to his. &ldquo;We&rsquo;ve talked more than enough during the last few weeks. I want this. And I want this now.&rdquo;</p>\n<p>Jon curled his lips up into a smile and then his nose brushed hers. </p>\n",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"280\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/a10726c10dd8bfad659d664dab13f412/tumblr_inline_ph0lcgy6y51qdb55z_1280.gif\" data-orig-height=\"280\" data-orig-width=\"500\"></figure><blockquote><p><b><small>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>’s JonSansaWeek Day 1: Sansa’s POV or Jon’S POV<br></small></b></p><p><b><small><i>This little snippet has no setting and no certain universe. It’s just their very first kiss, first described through Sansa’s eyes and then through Jon’s.<br></i></small></b></p></blockquote><p><b><i>Sansa’s POV</i></b></p><p>Sansa had read a thousand books about this moment, but somehow she was not sure if any of those books had really managed to capture how it truly felt. She felt a certain kind of pleasant nervousness in her stomach. Her skin tingled wherever his hands and body touched her and her heart was beating rapidly in her chest with longing excitement.</p><p>“Are you sure you want this?” Jon spoke softly and Sansa let out a deep breath, cursing because he dared to make her wait even one more moment, one more second. </p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. “I’ve never been this sure about anything, Jon.” </p><p>In literally every book Sansa had ever read, the girl had been standing on the tips of her toes right now, but Sansa didn’t need to do so. She was glad that she was wearing her flats tonight instead of the high heels Margaery had tried to make her wear.</p><p>“You look beautiful tonight.” Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest, if that was even possible. </p><p>“Jon!” Sansa raised her voice while she closed her eyes. “Can you stop talking, please?” She licked her dry lips and pressed her forehead to his. “We’ve talked more than enough during the last few weeks. I want this. And I want this now.”</p><p>Jon curled his lips up into a smile and then his nose brushed hers. </p>[[MORE]]<p>She was not sure if he did it on purpose, if he knew how badly she wanted this, how deeply she was longing for this. For weeks she had wondered if Jon really felt the same for her as she felt for him and tonight she had not been capable of stopping herself anymore. </p><p>She had just asked him. She had just asked him if he thought about her day and night, just like she always seemed to be thinking about him these days. She had just asked him if he dreamed about her, just like all her dreams now seemed to be about him. She had just asked him if he sometimes wondered how it would be to kiss her, to touch her, to make love under a blanket of stars. </p><p>And he had said yes. His cheeks had reddened and pearls of sweat had covered his forehead. Sansa had not really understood why. She had been the one taking a risk. She had been the one taking the first step. </p><p>And now she was waiting for him to take the next one. And the longer it took, the more frustrated and excited she got.</p><p>When she felt his breath warming her waiting lips she closed her eyes and her arms circled around his neck. After what seemed to be another eternity his lips finally found hers.</p><p>They were surprisingly soft and tender and his kiss was slow and a little reluctantly.</p><p>But Sansa wanted more. Sansa needed more. And while her hands went through his dark curls, her lips parted to invite his tongue in.</p><p><b><i><br></i></b></p><p><b><i>Jon’s POV</i></b></p><p>Jon had kissed girls before. Most of the kisses hadn’t really meant much, apart from that one time he thought he had been in love. He was not sure what he and Ygritte had really felt for each other, but every time he looked at Sansa now he was certain it had not been love. This was love. What he felt now was love. And he was terrified that somehow he would break it.<br></p><p>“Are you sure you want this?” He spoke softly, dreading the moment. Somehow he was still afraid that at some point she’d discover that she could get someone much better and much smarter than him.</p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. “I’ve never been this sure about anything, Jon.”</p><p>He wasn’t sure why he couldn’t really believe her. He wasn’t sure why there was always a voice in the back of his mind telling him that this was just a dream, that this was temporary, that somehow he’d find a way to ruin it, to break it. That somehow he wouldn’t get the girl.</p><p>“You look beautiful tonight.” Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest because he was afraid she would slip through his fingers if he wouldn’t.</p><p>“Jon!” Sansa raised her voice while she closed her eyes. “Can you stop talking, please?” She licked her lips and pressed her warm forehead to his. “We’ve talked more than enough during the last few weeks. I want this. And I want this now.”</p><p>A strange, but pleasant warmth spread through his body. He curled his lips up into a smile and he let his nose brush hers. He didn’t know why he was so terrified of just kissing her. He didn’t know why he was hesitating. He didn’t know why he couldn’t just lean in and do it.</p><p>He had never been someone’s first choice. He had never been someone’s everything and someone’s world. And he had never dared to make someone else his first choice, his everything, his world. He knew all too well how things could change all of a sudden. </p><p>Friends could become foes within an instant. Those closest to you could eventually betray you. Trusting someone too much, could eventually lead to misery and pain.</p><p>Somehow he didn’t dare to fully believe Sansa when she had told him that she thought about him all day, that she dreamed about him at night, that she had fantasized about kissing him and loving him. He knew he didn’t have a reason to doubt her, but it was still hard to believe that someone as amazing and beautiful as her, would fall for someone like him.</p><p>Maybe he would somehow start believing it when he did kiss her and when she would kiss him back. </p><p>He leaned in and waited a few more seconds before he pressed his lips to hers. Her arms circled around his neck, but in the back of his mind Jon could still hear a voice telling him that if he’d go any further, the dream would explode and he’d wake up. </p><p>But Sansa’s hands went through his hair and the moment she parted her lips to invite his tongue in he finally realized that she meant it.</p><p>She really meant it.</p><p>And eagerly, giving into his own hunger and desire eventually, he accepted her invitation.</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "acourtofhopeanddreams",
                    "active": true,
                    "theme": {
                        "header_full_width": 600,
                        "header_full_height": 300,
                        "header_focus_width": 533,
                        "header_focus_height": 300,
                        "avatar_shape": "square",
                        "background_color": "#d11d1d",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,566,300,33",
                        "header_image": "https://static.tumblr.com/7782d7a0e4100830708f02baf3f0e357/myrfjlp/iFbpqvvuo/tumblr_static_cq37wlgbuqgcs0w00o4s800o0.gif",
                        "header_image_focused": "https://static.tumblr.com/7782d7a0e4100830708f02baf3f0e357/myrfjlp/i68pqvvus/tumblr_static_tumblr_static_cq37wlgbuqgcs0w00o4s800o0_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/7782d7a0e4100830708f02baf3f0e357/myrfjlp/iFbpqvvuo/tumblr_static_cq37wlgbuqgcs0w00o4s800o0_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#fcb68f",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#fcb68f",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179322001805"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"280\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/a10726c10dd8bfad659d664dab13f412/tumblr_inline_ph0lcgy6y51qdb55z_1280.gif\" data-orig-height=\"280\" data-orig-width=\"500\"></figure><blockquote><p><b><small>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>’s JonSansaWeek Day 1: Sansa’s POV or Jon’S POV<br></small></b></p><p><b><small><i>This little snippet has no setting and no certain universe. It’s just their very first kiss, first described through Sansa’s eyes and then through Jon’s.<br></i></small></b></p></blockquote><p><b><i>Sansa’s POV</i></b></p><p>Sansa had read a thousand books about this moment, but somehow she was not sure if any of those books had really managed to capture how it truly felt. She felt a certain kind of pleasant nervousness in her stomach. Her skin tingled wherever his hands and body touched her and her heart was beating rapidly in her chest with longing excitement.</p><p>“Are you sure you want this?” Jon spoke softly and Sansa let out a deep breath, cursing because he dared to make her wait even one more moment, one more second. </p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. “I’ve never been this sure about anything, Jon.” </p><p>In literally every book Sansa had ever read, the girl had been standing on the tips of her toes right now, but Sansa didn’t need to do so. She was glad that she was wearing her flats tonight instead of the high heels Margaery had tried to make her wear.</p><p>“You look beautiful tonight.” Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest, if that was even possible. </p><p>“Jon!” Sansa raised her voice while she closed her eyes. “Can you stop talking, please?” She licked her dry lips and pressed her forehead to his. “We’ve talked more than enough during the last few weeks. I want this. And I want this now.”</p><p>Jon curled his lips up into a smile and then his nose brushed hers. </p>[[MORE]]<p>She was not sure if he did it on purpose, if he knew how badly she wanted this, how deeply she was longing for this. For weeks she had wondered if Jon really felt the same for her as she felt for him and tonight she had not been capable of stopping herself anymore. </p><p>She had just asked him. She had just asked him if he thought about her day and night, just like she always seemed to be thinking about him these days. She had just asked him if he dreamed about her, just like all her dreams now seemed to be about him. She had just asked him if he sometimes wondered how it would be to kiss her, to touch her, to make love under a blanket of stars. </p><p>And he had said yes. His cheeks had reddened and pearls of sweat had covered his forehead. Sansa had not really understood why. She had been the one taking a risk. She had been the one taking the first step. </p><p>And now she was waiting for him to take the next one. And the longer it took, the more frustrated and excited she got.</p><p>When she felt his breath warming her waiting lips she closed her eyes and her arms circled around his neck. After what seemed to be another eternity his lips finally found hers.</p><p>They were surprisingly soft and tender and his kiss was slow and a little reluctantly.</p><p>But Sansa wanted more. Sansa needed more. And while her hands went through his dark curls, her lips parted to invite his tongue in.</p><p><b><i><br></i></b></p><p><b><i>Jon’s POV</i></b></p><p>Jon had kissed girls before. Most of the kisses hadn’t really meant much, apart from that one time he thought he had been in love. He was not sure what he and Ygritte had really felt for each other, but every time he looked at Sansa now he was certain it had not been love. This was love. What he felt now was love. And he was terrified that somehow he would break it.<br></p><p>“Are you sure you want this?” He spoke softly, dreading the moment. Somehow he was still afraid that at some point she’d discover that she could get someone much better and much smarter than him.</p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. “I’ve never been this sure about anything, Jon.”</p><p>He wasn’t sure why he couldn’t really believe her. He wasn’t sure why there was always a voice in the back of his mind telling him that this was just a dream, that this was temporary, that somehow he’d find a way to ruin it, to break it. That somehow he wouldn’t get the girl.</p><p>“You look beautiful tonight.” Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest because he was afraid she would slip through his fingers if he wouldn’t.</p><p>“Jon!” Sansa raised her voice while she closed her eyes. “Can you stop talking, please?” She licked her lips and pressed her warm forehead to his. “We’ve talked more than enough during the last few weeks. I want this. And I want this now.”</p><p>A strange, but pleasant warmth spread through his body. He curled his lips up into a smile and he let his nose brush hers. He didn’t know why he was so terrified of just kissing her. He didn’t know why he was hesitating. He didn’t know why he couldn’t just lean in and do it.</p><p>He had never been someone’s first choice. He had never been someone’s everything and someone’s world. And he had never dared to make someone else his first choice, his everything, his world. He knew all too well how things could change all of a sudden. </p><p>Friends could become foes within an instant. Those closest to you could eventually betray you. Trusting someone too much, could eventually lead to misery and pain.</p><p>Somehow he didn’t dare to fully believe Sansa when she had told him that she thought about him all day, that she dreamed about him at night, that she had fantasized about kissing him and loving him. He knew he didn’t have a reason to doubt her, but it was still hard to believe that someone as amazing and beautiful as her, would fall for someone like him.</p><p>Maybe he would somehow start believing it when he did kiss her and when she would kiss him back. </p><p>He leaned in and waited a few more seconds before he pressed his lips to hers. Her arms circled around his neck, but in the back of his mind Jon could still hear a voice telling him that if he’d go any further, the dream would explode and he’d wake up. </p><p>But Sansa’s hands went through his hair and the moment she parted her lips to invite his tongue in he finally realized that she meant it.</p><p>She really meant it.</p><p>And eagerly, giving into his own hunger and desire eventually, he accepted her invitation.</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/a10726c10dd8bfad659d664dab13f412/tumblr_inline_ph0lcgy6y51qdb55z_1280.gif\" class=\"\"/></figure><blockquote><p><b><small>Written for <a href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>&rsquo;s JonSansaWeek Day 1: Sansa&rsquo;s POV or Jon&rsquo;S POV<br /></small></b></p><p><b><small><i>This little snippet has no setting and no certain universe. It&rsquo;s just their very first kiss, first described through Sansa&rsquo;s eyes and then through Jon&rsquo;s.<br /></i></small></b></p></blockquote><p><b><i>Sansa&rsquo;s POV</i></b></p><p>Sansa had read a thousand books about this moment, but somehow she was not sure if any of those books had really managed to capture how it truly felt. She felt a certain kind of pleasant nervousness in her stomach. Her skin tingled wherever his hands and body touched her and her heart was beating rapidly in her chest with longing excitement.</p><p>&ldquo;Are you sure you want this?&rdquo; Jon spoke softly and Sansa let out a deep breath, cursing because he dared to make her wait even one more moment, one more second. </p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. &ldquo;I&rsquo;ve never been this sure about anything, Jon.&rdquo; </p><p>In literally every book Sansa had ever read, the girl had been standing on the tips of her toes right now, but Sansa didn&rsquo;t need to do so. She was glad that she was wearing her flats tonight instead of the high heels Margaery had tried to make her wear.</p><p>&ldquo;You look beautiful tonight.&rdquo; Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest, if that was even possible. </p><p>&ldquo;Jon!&rdquo; Sansa raised her voice while she closed her eyes. &ldquo;Can you stop talking, please?&rdquo; She licked her dry lips and pressed her forehead to his. &ldquo;We&rsquo;ve talked more than enough during the last few weeks. I want this. And I want this now.&rdquo;</p><p>Jon curled his lips up into a smile and then his nose brushed hers. </p><p>She was not sure if he did it on purpose, if he knew how badly she wanted this, how deeply she was longing for this. For weeks she had wondered if Jon really felt the same for her as she felt for him and tonight she had not been capable of stopping herself anymore. </p><p>She had just asked him. She had just asked him if he thought about her day and night, just like she always seemed to be thinking about him these days. She had just asked him if he dreamed about her, just like all her dreams now seemed to be about him. She had just asked him if he sometimes wondered how it would be to kiss her, to touch her, to make love under a blanket of stars. </p><p>And he had said yes. His cheeks had reddened and pearls of sweat had covered his forehead. Sansa had not really understood why. She had been the one taking a risk. She had been the one taking the first step. </p><p>And now she was waiting for him to take the next one. And the longer it took, the more frustrated and excited she got.</p><p>When she felt his breath warming her waiting lips she closed her eyes and her arms circled around his neck. After what seemed to be another eternity his lips finally found hers.</p><p>They were surprisingly soft and tender and his kiss was slow and a little reluctantly.</p><p>But Sansa wanted more. Sansa needed more. And while her hands went through his dark curls, her lips parted to invite his tongue in.</p><p><b><i><br /></i></b></p><p><b><i>Jon&rsquo;s POV</i></b></p><p>Jon had kissed girls before. Most of the kisses hadn&rsquo;t really meant much, apart from that one time he thought he had been in love. He was not sure what he and Ygritte had really felt for each other, but every time he looked at Sansa now he was certain it had not been love. This was love. What he felt now was love. And he was terrified that somehow he would break it.<br /></p><p>&ldquo;Are you sure you want this?&rdquo; He spoke softly, dreading the moment. Somehow he was still afraid that at some point she&rsquo;d discover that she could get someone much better and much smarter than him.</p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. &ldquo;I&rsquo;ve never been this sure about anything, Jon.&rdquo;</p><p>He wasn&rsquo;t sure why he couldn&rsquo;t really believe her. He wasn&rsquo;t sure why there was always a voice in the back of his mind telling him that this was just a dream, that this was temporary, that somehow he&rsquo;d find a way to ruin it, to break it. That somehow he wouldn&rsquo;t get the girl.</p><p>&ldquo;You look beautiful tonight.&rdquo; Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest because he was afraid she would slip through his fingers if he wouldn&rsquo;t.</p><p>&ldquo;Jon!&rdquo; Sansa raised her voice while she closed her eyes. &ldquo;Can you stop talking, please?&rdquo; She licked her lips and pressed her warm forehead to his. &ldquo;We&rsquo;ve talked more than enough during the last few weeks. I want this. And I want this now.&rdquo;</p><p>A strange, but pleasant warmth spread through his body. He curled his lips up into a smile and he let his nose brush hers. He didn&rsquo;t know why he was so terrified of just kissing her. He didn&rsquo;t know why he was hesitating. He didn&rsquo;t know why he couldn&rsquo;t just lean in and do it.</p><p>He had never been someone&rsquo;s first choice. He had never been someone&rsquo;s everything and someone&rsquo;s world. And he had never dared to make someone else his first choice, his everything, his world. He knew all too well how things could change all of a sudden. </p><p>Friends could become foes within an instant. Those closest to you could eventually betray you. Trusting someone too much, could eventually lead to misery and pain.</p><p>Somehow he didn&rsquo;t dare to fully believe Sansa when she had told him that she thought about him all day, that she dreamed about him at night, that she had fantasized about kissing him and loving him. He knew he didn&rsquo;t have a reason to doubt her, but it was still hard to believe that someone as amazing and beautiful as her, would fall for someone like him.</p><p>Maybe he would somehow start believing it when he did kiss her and when she would kiss him back. </p><p>He leaned in and waited a few more seconds before he pressed his lips to hers. Her arms circled around his neck, but in the back of his mind Jon could still hear a voice telling him that if he&rsquo;d go any further, the dream would explode and he&rsquo;d wake up. </p><p>But Sansa&rsquo;s hands went through his hair and the moment she parted her lips to invite his tongue in he finally realized that she meant it.</p><p>She really meant it.</p><p>And eagerly, giving into his own hunger and desire eventually, he accepted her invitation.</p></p>",
                "content_abstract": "<p>\n<figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/a10726c10dd8bfad659d664dab13f412/tumblr_inline_ph0lcgy6y51qdb55z_1280.gif\" class=\"\"/></figure>\n<blockquote>\n<p><b><small>Written for <a href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>&rsquo;s JonSansaWeek Day 1: Sansa&rsquo;s POV or Jon&rsquo;S POV<br /></small></b></p>\n<p><b><small><i>This little snippet has no setting and no certain universe. It&rsquo;s just their very first kiss, first described through Sansa&rsquo;s eyes and then through Jon&rsquo;s.<br /></i></small></b></p>\n</blockquote>\n<p><b><i>Sansa&rsquo;s POV</i></b></p>\n<p>Sansa had read a thousand books about this moment, but somehow she was not sure if any of those books had really managed to capture how it truly felt. She felt a certain kind of pleasant nervousness in her stomach. Her skin tingled wherever his hands and body touched her and her heart was beating rapidly in her chest with longing excitement.</p>\n<p>&ldquo;Are you sure you want this?&rdquo; Jon spoke softly and Sansa let out a deep breath, cursing because he dared to make her wait even one more moment, one more second. </p>\n<p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. &ldquo;I&rsquo;ve never been this sure about anything, Jon.&rdquo; </p>\n<p>In literally every book Sansa had ever read, the girl had been standing on the tips of her toes right now, but Sansa didn&rsquo;t need to do so. She was glad that she was wearing her flats tonight instead of the high heels Margaery had tried to make her wear.</p>\n<p>&ldquo;You look beautiful tonight.&rdquo; Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest, if that was even possible. </p>\n<p>&ldquo;Jon!&rdquo; Sansa raised her voice while she closed her eyes. &ldquo;Can you stop talking, please?&rdquo; She licked her dry lips and pressed her forehead to his. &ldquo;We&rsquo;ve talked more than enough during the last few weeks. I want this. And I want this now.&rdquo;</p>\n<p>Jon curled his lips up into a smile and then his nose brushed hers. </p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "thronesdragons",
        "blog": {
            "name": "thronesdragons",
            "title": "Game of Thrones",
            "description": "<p><span style=\"color: #00; font-family: Helvetica, Arial, sans-serif; font-size: 12px;\"><a href=\"https://thronesdragons.tumblr.com/\">Game of Thrones (GOT)</a> Fans : Pictures, Art, Memes and More!</span></p>",
            "url": "https://thronesdragons.tumblr.com/",
            "uuid": "t:kfrbcbINX-athn6CZWMlWQ",
            "updated": 1560200770
        },
        "id": 179320778192,
        "post_url": "https://thronesdragons.tumblr.com/post/179320778192/more-well-he-is-wrong",
        "slug": "more-well-he-is-wrong",
        "date": "2018-10-22 18:38:37 GMT",
        "timestamp": 1540233517,
        "state": "published",
        "format": "html",
        "reblog_key": "5r1hBJ1b",
        "tags": [
            "Game of Thrones",
            "Got",
            "Jon Snow",
            "Targaryen",
            "Stark",
            "Westeros",
            "Dragons"
        ],
        "short_url": "https://tmblr.co/Zj9jIc2d0MUtG",
        "summary": "[[MORE]] Well he is wrong 😐\n.\n.\n.\n #gameofthrones #got #hbo #housestark #stark #winteriscoming",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 32,
        "caption": "<p><!-- more --> Well he is wrong 😐<br/>\n.<br/>\n.<br/>\n.<br/>\n #gameofthrones #got #hbo #housestark #stark #winteriscoming</p>",
        "caption_abstract": "<p></p>",
        "reblog": {
            "comment": "<p>[[MORE]] Well he is wrong 😐<br>\n.<br>\n.<br>\n.<br>\n #gameofthrones #got #hbo #housestark #stark #winteriscoming</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thronesdragons",
                    "active": true,
                    "theme": {
                        "header_full_width": 1063,
                        "header_full_height": 354,
                        "header_focus_width": 621,
                        "header_focus_height": 349,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c.jpg",
                        "header_image_focused": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/CZ2oyee5j/tumblr_static_tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179320778192"
                },
                "content_raw": "<p>[[MORE]] Well he is wrong 😐<br>\n.<br>\n.<br>\n.<br>\n #gameofthrones #got #hbo #housestark #stark #winteriscoming</p>",
                "content": "<p> Well he is wrong &#128528;<br />\n.<br />\n.<br />\n.<br />\n #gameofthrones #got #hbo #housestark #stark #winteriscoming</p>",
                "content_abstract": "",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://thronesdragons.tumblr.com/image/179320778192",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_540.jpg",
                    "width": 532,
                    "height": 532
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_540.jpg",
                        "width": 532,
                        "height": 532
                    },
                    {
                        "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]