[
    {
        "type": "photo",
        "blog_name": "polkaduck",
        "blog": {
            "name": "polkaduck",
            "title": "Polkaduck",
            "description": "",
            "url": "https://polkaduck.tumblr.com/",
            "uuid": "t:gND-UvGsyIGIahzRrVE40g",
            "updated": 1561674948
        },
        "id": 179324244707,
        "post_url": "https://polkaduck.tumblr.com/post/179324244707/the-next-generation-of-got-part-3-lyanna",
        "slug": "the-next-generation-of-got-part-3-lyanna",
        "date": "2018-10-22 20:41:46 GMT",
        "timestamp": 1540240906,
        "state": "published",
        "format": "html",
        "reblog_key": "fqqAW3Un",
        "tags": [
            "game of thrones",
            "got",
            "game of thrones fan fic",
            "jon snow",
            "daenerys targaryen",
            "jonerys",
            "jonerys baby",
            "jonerys babies",
            "targlings",
            "targaryen restoration",
            "game of thrones season 8",
            "kit harington",
            "emilia clarke",
            "arya stark",
            "gendry waters",
            "maisie williams",
            "joe dempsie",
            "jack o'connell",
            "lyanna stark",
            "lyanna targaryen",
            "ned targaryen",
            "aemon targaryen",
            "sorry this one was really sad"
        ],
        "short_url": "https://tmblr.co/Zo7ZGw2d0ZjBZ",
        "summary": "The Next Generation of GOT Part 3:  Lyanna (Youngest child and only daughter of King Jon and Queen Daenerys) Robb (Eldest child...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 5,
        "source_url": "http://polkaduck.tumblr.com",
        "source_title": "polkaduck",
        "caption": "<p><b>The Next Generation of GOT</b></p><p><b>Part 3: </b></p><p>Lyanna (Youngest child and only daughter of King Jon and Queen Daenerys)<br/>Robb (Eldest child of Arya Stark and Gendry Baratheon)</p><p><b><br/></b></p><p><b>Lyanna Targaryen and Robb Baratheon</b></p><p><br/></p><p>The youngest child and only daughter of King Jon and Queen Daenerys, Lyanna had the look of her mother and the colouring of her father. Known affectionately as the Southern Wolf, it was said that she was every bit a Stark as she was a Targaryen. Her stubborn nature was softened by her charm and quick wit, and it was said that those who met her couldn&rsquo;t help but love her. </p><p>Her mother had endured a difficult labour with her, and during the worst of it, Maester Samwell had feared that both Daenerys and her child would not make it through. They did make it of course, both mother and child. Daenerys had said that she and Lyanna were too stubborn to let death take them so soon. Jon had been the first to hold her. She had been so small, born nearly two moons early, and half of her tiny body had fit into the palm of his hand. Jon had cried as he held her, and thanked the Gods that his wife and daughter had both survived such an ordeal.</p><p>King Jon loved all of his children equally, but all knew that Lyanna held a special place in Jon’s heart. So much like his sister Arya, and a tether to the mother who had died bringing him into the world, Lyanna was truly the light of her fathers life. </p><p>Betrothed to Robb Baratheon since her birth, Robb was five years her senior; born the same year as Lyanna’s eldest brother, Ned. From the time that Lyanna was in her fifteenth year, she travelled to Storms End to spend several months at a time with her Uncle and Aunt, Lord and Lady Baratheon. <br/></p><p>Lyanna and Robb’s relationship developed slowly, beginning first as a friendship. Robb had been hesitant at first, insisting that the crown princess was too young. And he had been right. Though Lyanna’s fiery nature and independence matured her in many ways, she was in truth still a child when she and Robb began their courtship. During the earlier years she spent at Storms End, Lyanna and Robb became fast friends, their similar senses of humour and proclivity for combat provided them with a steadfast foundation for a strong and lasting friendship. During her fourth visit to Storms End, shortly after Lyanna’s eighteenth name day, Robb was taken aback by how much Lyanna had changed since her last visit. As she stepped down from her horse that day in the courtyard of his family’s ancestral home, the sun casting shades of copper and caramel in her dark hair, he felt an unexpected wave of nervousness wash over him. He had to remind himself that the woman standing in front of him was the same girl he had known all his life, and that he had no cause to be so anxious. </p><p>They spent the first few weeks of Lyanna’s visit partaking in their usual pastimes, though Robb was much quieter than he usually was around Lyanna. He gave himself a pep talk before seeing her each day, and cursed himself for being so quiet afterwards. Lyanna hadn&rsquo;t seemed to notice the change in his demeanour however, and if she had she made no mention of it. During one of their walks through the woods surrounding Storms End, Lyanna had taken Robb&rsquo;s hand unexpectedly. His heart had begun to beat faster at her touch, and Lyanna had flashed him a wide smile that had both calmed and enlivened him. </p><p>One night after they had supped, Robb had walked Lyanna to her room. The hallway was empty and dark, save for a smattering of candles. “My lady.” Robb had said, bidding her goodnight, but he had lingered, his eyes catching hers, and for what felt like a very long moment, neither of them spoke. Lyanna looked at Robb, and let her eyes trail across his face. He was so handsome, she had thought. Tall and fierce, his black hair and dark eyes suited perfectly to his strong face. She moved towards him slowly then, and ever so gently pressed her lips to his. When she moved to part from him, Robb had a look of bewilderment etched across his face, his cheeks slightly pinker than they had been a moment before. Lyanna laughed gently. Seeing such a brave man reduced to an embarrassed boy at her touch thrilled her. <br/></p><p>“Relax Baratheon.” She had jested. “It was only a kiss.” Robb had watched her, his eyes never leaving her face, and a small smile played at the corner of Lyanna’s lips. She turned towards her room and closed the door behind her. Lyanna had teased Robb for his embarrassment, but as she stood alone in her room, her back pressed against her closed door, her heart pounding in her chest, she too felt the flush of heat that had spread to her cheeks. <br/></p><p>Their friendship blossomed into a passionate romance that year, and the two of them snuck off into the woods to be alone more than once. Although their union had been arranged, Lyanna had never felt that it had been forced upon her. She had thanked the Gods that she and Robb had been betrothed to one another, and thought that maybe they would have found each other no matter the circumstances. </p><p>Lyanna was already pregnant with their first child the day that she wed Robb, though no one but the two of them knew. Their love for one another had grown from passion as much as it had from friendship. Their first child was a girl, born only seven moons after they had wed. They had named her Daenerys, though her hair and eyes were much darker than that of the woman she was named for. Queen Daenerys had given her daughter a knowing look, a mixture of amusement and understanding, after the birth of Lyanna’s first child. Lyanna knew that her mother had also been pregnant on her wedding day.</p><p>Lyanna gave birth to another daughter a year later. They named her Arya, and she favoured her namesake in both looks and temperament. A son was born to her and Robb the following year. Brandon, they had called him. He had dark hair like his sisters, but unlike his siblings he had bright blue eyes instead of brown. </p><p>Lyanna fell pregnant once again, five years after she had given birth to her first child, and much like her mother’s labour with her, Lyanna endured a difficult birth with her last child. It stretched on for days, and the Maester feared the worst for both mother and child. The baby was a girl, a tiny wisp of a thing, with dark hair like her mother. And though her child had survived the arduous labour, Lyanna did not. The Maester was unable to stop her bleeding, and Lyanna had died in Robb&rsquo;s arms. It was said that the whole of the Seven Kingdoms wept when they heard of their Princess’s death. The Southern Wolf had perished, and with her went the joy that she had brought to those who had known her. Robb named their youngest daughter Lyanna. </p><p>King Jon had wept when he heard the news. His only daughter, the tiny girl he had held in his hands only moments after she had entered the world, had left it. Daenerys did not speak to anyone for many weeks following Lyanna’s death, and she remained sequestered in her chambers for even longer. Her Lyanna, her sweet fierce girl, was gone, and with her had gone Daenerys’ joy. The Queen was never the same after that. Many said the fire that had coursed through the Queens veins before her daughters death had left her once Lyanna had passed. </p><p>Ned had beaten his hands bloody against a wall when he had heard of his sisters death. When he closed his eyes, he did not see her as the woman she had grown into, but as the small girl who had clutched his hand as they walked through the hallways of the Red Keep. His whole life he had protected Lyanna, though she rarely ever needed it. But this time, he had failed her. He said as much to his wife. Catelyn had taken Ned’s face in her hands then, his cheeks wet and hot with tears, and she told him that there was nothing that he could have done to stop this from happening. That even a King could not stop the Gods. Catelyn felt her eyes burn as the words had left her mouth, and she could not stop the flood of tears that fell from her eyes as she thought of Lyanna. </p><p>Aemon had cried when he was told of Lyanna’s death. He did not believe it at first. It seemed almost impossible that his ferocious and headstrong sister could be taken from this world when she had so much life left to live. Litse had wept into Aemon’s chest when he told her of Lyanna’s passing. Lyanna had been a sister to Litse in every way but blood, and it filled her with the greatest sorrow to picture a world without Lyanna in it. </p><p>Aemon and Ned rode to Storms End with their father to retrieve Lyanna’s body. When they arrived, Arya and Gendry welcomed them in the courtyard, but Robb was nowhere to be found. Ned found him later, alone in his chambers, the curtains drawn and the candles unlit. Robb was as much Ned&rsquo;s friend as he was his brother by law, and the sorrow he felt for Robb ran as deep as his own. Ned had no words of comfort to offer, his own grief clouding his ability to console his friend, and so the two men sat in silence. It had been Aemon who had finally coaxed Robb from his chambers, his gentle heart and empathetic nature allowing him to reach Robb in a way that no one else had been able to. </p><p>In the end, Lyanna’s body was brought back to Kings Landing. Her final resting place a stones throw away from where she had been born. Robb and Lyanna’s youngest child was like her mother in every way. Not only did she have her mothers name, but her beauty and character as well. </p><p>Lord Robb was never the same after his wife’s death. It was said that the light had gone from his life when Lyanna had passed, and his only true joy came from raising the children they had made together. </p><p>Robb never married again. </p>",
        "reblog": {
            "comment": "<p><b>The Next Generation of GOT</b></p><p><b>Part 3: </b></p><p>Lyanna (Youngest child and only daughter of King Jon and Queen Daenerys)<br>Robb (Eldest child of Arya Stark and Gendry Baratheon)</p><p><b><br></b></p><p><b>Lyanna Targaryen and Robb Baratheon</b></p><p><br></p><p>The youngest child and only daughter of King Jon and Queen Daenerys, Lyanna had the look of her mother and the colouring of her father. Known affectionately as the Southern Wolf, it was said that she was every bit a Stark as she was a Targaryen. Her stubborn nature was softened by her charm and quick wit, and it was said that those who met her couldn’t help but love her. </p><p>Her mother had endured a difficult labour with her, and during the worst of it, Maester Samwell had feared that both Daenerys and her child would not make it through. They did make it of course, both mother and child. Daenerys had said that she and Lyanna were too stubborn to let death take them so soon. Jon had been the first to hold her. She had been so small, born nearly two moons early, and half of her tiny body had fit into the palm of his hand. Jon had cried as he held her, and thanked the Gods that his wife and daughter had both survived such an ordeal.</p><p>King Jon loved all of his children equally, but all knew that Lyanna held a special place in Jon’s heart. So much like his sister Arya, and a tether to the mother who had died bringing him into the world, Lyanna was truly the light of her fathers life. </p><p>Betrothed to Robb Baratheon since her birth, Robb was five years her senior; born the same year as Lyanna’s eldest brother, Ned. From the time that Lyanna was in her fifteenth year, she travelled to Storms End to spend several months at a time with her Uncle and Aunt, Lord and Lady Baratheon. <br></p><p>Lyanna and Robb’s relationship developed slowly, beginning first as a friendship. Robb had been hesitant at first, insisting that the crown princess was too young. And he had been right. Though Lyanna’s fiery nature and independence matured her in many ways, she was in truth still a child when she and Robb began their courtship. During the earlier years she spent at Storms End, Lyanna and Robb became fast friends, their similar senses of humour and proclivity for combat provided them with a steadfast foundation for a strong and lasting friendship. During her fourth visit to Storms End, shortly after Lyanna’s eighteenth name day, Robb was taken aback by how much Lyanna had changed since her last visit. As she stepped down from her horse that day in the courtyard of his family’s ancestral home, the sun casting shades of copper and caramel in her dark hair, he felt an unexpected wave of nervousness wash over him. He had to remind himself that the woman standing in front of him was the same girl he had known all his life, and that he had no cause to be so anxious. </p><p>They spent the first few weeks of Lyanna’s visit partaking in their usual pastimes, though Robb was much quieter than he usually was around Lyanna. He gave himself a pep talk before seeing her each day, and cursed himself for being so quiet afterwards. Lyanna hadn’t seemed to notice the change in his demeanour however, and if she had she made no mention of it. During one of their walks through the woods surrounding Storms End, Lyanna had taken Robb’s hand unexpectedly. His heart had begun to beat faster at her touch, and Lyanna had flashed him a wide smile that had both calmed and enlivened him. </p><p>One night after they had supped, Robb had walked Lyanna to her room. The hallway was empty and dark, save for a smattering of candles. “My lady.” Robb had said, bidding her goodnight, but he had lingered, his eyes catching hers, and for what felt like a very long moment, neither of them spoke. Lyanna looked at Robb, and let her eyes trail across his face. He was so handsome, she had thought. Tall and fierce, his black hair and dark eyes suited perfectly to his strong face. She moved towards him slowly then, and ever so gently pressed her lips to his. When she moved to part from him, Robb had a look of bewilderment etched across his face, his cheeks slightly pinker than they had been a moment before. Lyanna laughed gently. Seeing such a brave man reduced to an embarrassed boy at her touch thrilled her. <br></p><p>“Relax Baratheon.” She had jested. “It was only a kiss.” Robb had watched her, his eyes never leaving her face, and a small smile played at the corner of Lyanna’s lips. She turned towards her room and closed the door behind her. Lyanna had teased Robb for his embarrassment, but as she stood alone in her room, her back pressed against her closed door, her heart pounding in her chest, she too felt the flush of heat that had spread to her cheeks. <br></p><p>Their friendship blossomed into a passionate romance that year, and the two of them snuck off into the woods to be alone more than once. Although their union had been arranged, Lyanna had never felt that it had been forced upon her. She had thanked the Gods that she and Robb had been betrothed to one another, and thought that maybe they would have found each other no matter the circumstances. </p><p>Lyanna was already pregnant with their first child the day that she wed Robb, though no one but the two of them knew. Their love for one another had grown from passion as much as it had from friendship. Their first child was a girl, born only seven moons after they had wed. They had named her Daenerys, though her hair and eyes were much darker than that of the woman she was named for. Queen Daenerys had given her daughter a knowing look, a mixture of amusement and understanding, after the birth of Lyanna’s first child. Lyanna knew that her mother had also been pregnant on her wedding day.</p><p>Lyanna gave birth to another daughter a year later. They named her Arya, and she favoured her namesake in both looks and temperament. A son was born to her and Robb the following year. Brandon, they had called him. He had dark hair like his sisters, but unlike his siblings he had bright blue eyes instead of brown. </p><p>Lyanna fell pregnant once again, five years after she had given birth to her first child, and much like her mother’s labour with her, Lyanna endured a difficult birth with her last child. It stretched on for days, and the Maester feared the worst for both mother and child. The baby was a girl, a tiny wisp of a thing, with dark hair like her mother. And though her child had survived the arduous labour, Lyanna did not. The Maester was unable to stop her bleeding, and Lyanna had died in Robb’s arms. It was said that the whole of the Seven Kingdoms wept when they heard of their Princess’s death. The Southern Wolf had perished, and with her went the joy that she had brought to those who had known her. Robb named their youngest daughter Lyanna. </p><p>King Jon had wept when he heard the news. His only daughter, the tiny girl he had held in his hands only moments after she had entered the world, had left it. Daenerys did not speak to anyone for many weeks following Lyanna’s death, and she remained sequestered in her chambers for even longer. Her Lyanna, her sweet fierce girl, was gone, and with her had gone Daenerys’ joy. The Queen was never the same after that. Many said the fire that had coursed through the Queens veins before her daughters death had left her once Lyanna had passed. </p><p>Ned had beaten his hands bloody against a wall when he had heard of his sisters death. When he closed his eyes, he did not see her as the woman she had grown into, but as the small girl who had clutched his hand as they walked through the hallways of the Red Keep. His whole life he had protected Lyanna, though she rarely ever needed it. But this time, he had failed her. He said as much to his wife. Catelyn had taken Ned’s face in her hands then, his cheeks wet and hot with tears, and she told him that there was nothing that he could have done to stop this from happening. That even a King could not stop the Gods. Catelyn felt her eyes burn as the words had left her mouth, and she could not stop the flood of tears that fell from her eyes as she thought of Lyanna. </p><p>Aemon had cried when he was told of Lyanna’s death. He did not believe it at first. It seemed almost impossible that his ferocious and headstrong sister could be taken from this world when she had so much life left to live. Litse had wept into Aemon’s chest when he told her of Lyanna’s passing. Lyanna had been a sister to Litse in every way but blood, and it filled her with the greatest sorrow to picture a world without Lyanna in it. </p><p>Aemon and Ned rode to Storms End with their father to retrieve Lyanna’s body. When they arrived, Arya and Gendry welcomed them in the courtyard, but Robb was nowhere to be found. Ned found him later, alone in his chambers, the curtains drawn and the candles unlit. Robb was as much Ned’s friend as he was his brother by law, and the sorrow he felt for Robb ran as deep as his own. Ned had no words of comfort to offer, his own grief clouding his ability to console his friend, and so the two men sat in silence. It had been Aemon who had finally coaxed Robb from his chambers, his gentle heart and empathetic nature allowing him to reach Robb in a way that no one else had been able to. </p><p>In the end, Lyanna’s body was brought back to Kings Landing. Her final resting place a stones throw away from where she had been born. Robb and Lyanna’s youngest child was like her mother in every way. Not only did she have her mothers name, but her beauty and character as well. </p><p>Lord Robb was never the same after his wife’s death. It was said that the light had gone from his life when Lyanna had passed, and his only true joy came from raising the children they had made together. </p><p>Robb never married again. </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "polkaduck",
                    "active": true,
                    "theme": {
                        "header_full_width": 540,
                        "header_full_height": 350,
                        "header_focus_width": 540,
                        "header_focus_height": 303,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "23,540,326,0",
                        "header_image": "https://static.tumblr.com/d90d9892784f0e9d77f8ba329726bf41/zobqc3q/lY6ppposv/tumblr_static_1ni2tk5nj0w0w0oscogscggsc.gif",
                        "header_image_focused": "https://static.tumblr.com/d90d9892784f0e9d77f8ba329726bf41/zobqc3q/GtWppposy/tumblr_static_tumblr_static_1ni2tk5nj0w0w0oscogscggsc_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/d90d9892784f0e9d77f8ba329726bf41/zobqc3q/lY6ppposv/tumblr_static_1ni2tk5nj0w0w0oscogscggsc_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179324244707"
                },
                "content_raw": "<p><b>The Next Generation of GOT</b></p><p><b>Part 3: </b></p><p>Lyanna (Youngest child and only daughter of King Jon and Queen Daenerys)<br>Robb (Eldest child of Arya Stark and Gendry Baratheon)</p><p><b><br></b></p><p><b>Lyanna Targaryen and Robb Baratheon</b></p><p><br></p><p>The youngest child and only daughter of King Jon and Queen Daenerys, Lyanna had the look of her mother and the colouring of her father. Known affectionately as the Southern Wolf, it was said that she was every bit a Stark as she was a Targaryen. Her stubborn nature was softened by her charm and quick wit, and it was said that those who met her couldn’t help but love her. </p><p>Her mother had endured a difficult labour with her, and during the worst of it, Maester Samwell had feared that both Daenerys and her child would not make it through. They did make it of course, both mother and child. Daenerys had said that she and Lyanna were too stubborn to let death take them so soon. Jon had been the first to hold her. She had been so small, born nearly two moons early, and half of her tiny body had fit into the palm of his hand. Jon had cried as he held her, and thanked the Gods that his wife and daughter had both survived such an ordeal.</p><p>King Jon loved all of his children equally, but all knew that Lyanna held a special place in Jon’s heart. So much like his sister Arya, and a tether to the mother who had died bringing him into the world, Lyanna was truly the light of her fathers life. </p><p>Betrothed to Robb Baratheon since her birth, Robb was five years her senior; born the same year as Lyanna’s eldest brother, Ned. From the time that Lyanna was in her fifteenth year, she travelled to Storms End to spend several months at a time with her Uncle and Aunt, Lord and Lady Baratheon. <br></p><p>Lyanna and Robb’s relationship developed slowly, beginning first as a friendship. Robb had been hesitant at first, insisting that the crown princess was too young. And he had been right. Though Lyanna’s fiery nature and independence matured her in many ways, she was in truth still a child when she and Robb began their courtship. During the earlier years she spent at Storms End, Lyanna and Robb became fast friends, their similar senses of humour and proclivity for combat provided them with a steadfast foundation for a strong and lasting friendship. During her fourth visit to Storms End, shortly after Lyanna’s eighteenth name day, Robb was taken aback by how much Lyanna had changed since her last visit. As she stepped down from her horse that day in the courtyard of his family’s ancestral home, the sun casting shades of copper and caramel in her dark hair, he felt an unexpected wave of nervousness wash over him. He had to remind himself that the woman standing in front of him was the same girl he had known all his life, and that he had no cause to be so anxious. </p><p>They spent the first few weeks of Lyanna’s visit partaking in their usual pastimes, though Robb was much quieter than he usually was around Lyanna. He gave himself a pep talk before seeing her each day, and cursed himself for being so quiet afterwards. Lyanna hadn’t seemed to notice the change in his demeanour however, and if she had she made no mention of it. During one of their walks through the woods surrounding Storms End, Lyanna had taken Robb’s hand unexpectedly. His heart had begun to beat faster at her touch, and Lyanna had flashed him a wide smile that had both calmed and enlivened him. </p><p>One night after they had supped, Robb had walked Lyanna to her room. The hallway was empty and dark, save for a smattering of candles. “My lady.” Robb had said, bidding her goodnight, but he had lingered, his eyes catching hers, and for what felt like a very long moment, neither of them spoke. Lyanna looked at Robb, and let her eyes trail across his face. He was so handsome, she had thought. Tall and fierce, his black hair and dark eyes suited perfectly to his strong face. She moved towards him slowly then, and ever so gently pressed her lips to his. When she moved to part from him, Robb had a look of bewilderment etched across his face, his cheeks slightly pinker than they had been a moment before. Lyanna laughed gently. Seeing such a brave man reduced to an embarrassed boy at her touch thrilled her. <br></p><p>“Relax Baratheon.” She had jested. “It was only a kiss.” Robb had watched her, his eyes never leaving her face, and a small smile played at the corner of Lyanna’s lips. She turned towards her room and closed the door behind her. Lyanna had teased Robb for his embarrassment, but as she stood alone in her room, her back pressed against her closed door, her heart pounding in her chest, she too felt the flush of heat that had spread to her cheeks. <br></p><p>Their friendship blossomed into a passionate romance that year, and the two of them snuck off into the woods to be alone more than once. Although their union had been arranged, Lyanna had never felt that it had been forced upon her. She had thanked the Gods that she and Robb had been betrothed to one another, and thought that maybe they would have found each other no matter the circumstances. </p><p>Lyanna was already pregnant with their first child the day that she wed Robb, though no one but the two of them knew. Their love for one another had grown from passion as much as it had from friendship. Their first child was a girl, born only seven moons after they had wed. They had named her Daenerys, though her hair and eyes were much darker than that of the woman she was named for. Queen Daenerys had given her daughter a knowing look, a mixture of amusement and understanding, after the birth of Lyanna’s first child. Lyanna knew that her mother had also been pregnant on her wedding day.</p><p>Lyanna gave birth to another daughter a year later. They named her Arya, and she favoured her namesake in both looks and temperament. A son was born to her and Robb the following year. Brandon, they had called him. He had dark hair like his sisters, but unlike his siblings he had bright blue eyes instead of brown. </p><p>Lyanna fell pregnant once again, five years after she had given birth to her first child, and much like her mother’s labour with her, Lyanna endured a difficult birth with her last child. It stretched on for days, and the Maester feared the worst for both mother and child. The baby was a girl, a tiny wisp of a thing, with dark hair like her mother. And though her child had survived the arduous labour, Lyanna did not. The Maester was unable to stop her bleeding, and Lyanna had died in Robb’s arms. It was said that the whole of the Seven Kingdoms wept when they heard of their Princess’s death. The Southern Wolf had perished, and with her went the joy that she had brought to those who had known her. Robb named their youngest daughter Lyanna. </p><p>King Jon had wept when he heard the news. His only daughter, the tiny girl he had held in his hands only moments after she had entered the world, had left it. Daenerys did not speak to anyone for many weeks following Lyanna’s death, and she remained sequestered in her chambers for even longer. Her Lyanna, her sweet fierce girl, was gone, and with her had gone Daenerys’ joy. The Queen was never the same after that. Many said the fire that had coursed through the Queens veins before her daughters death had left her once Lyanna had passed. </p><p>Ned had beaten his hands bloody against a wall when he had heard of his sisters death. When he closed his eyes, he did not see her as the woman she had grown into, but as the small girl who had clutched his hand as they walked through the hallways of the Red Keep. His whole life he had protected Lyanna, though she rarely ever needed it. But this time, he had failed her. He said as much to his wife. Catelyn had taken Ned’s face in her hands then, his cheeks wet and hot with tears, and she told him that there was nothing that he could have done to stop this from happening. That even a King could not stop the Gods. Catelyn felt her eyes burn as the words had left her mouth, and she could not stop the flood of tears that fell from her eyes as she thought of Lyanna. </p><p>Aemon had cried when he was told of Lyanna’s death. He did not believe it at first. It seemed almost impossible that his ferocious and headstrong sister could be taken from this world when she had so much life left to live. Litse had wept into Aemon’s chest when he told her of Lyanna’s passing. Lyanna had been a sister to Litse in every way but blood, and it filled her with the greatest sorrow to picture a world without Lyanna in it. </p><p>Aemon and Ned rode to Storms End with their father to retrieve Lyanna’s body. When they arrived, Arya and Gendry welcomed them in the courtyard, but Robb was nowhere to be found. Ned found him later, alone in his chambers, the curtains drawn and the candles unlit. Robb was as much Ned’s friend as he was his brother by law, and the sorrow he felt for Robb ran as deep as his own. Ned had no words of comfort to offer, his own grief clouding his ability to console his friend, and so the two men sat in silence. It had been Aemon who had finally coaxed Robb from his chambers, his gentle heart and empathetic nature allowing him to reach Robb in a way that no one else had been able to. </p><p>In the end, Lyanna’s body was brought back to Kings Landing. Her final resting place a stones throw away from where she had been born. Robb and Lyanna’s youngest child was like her mother in every way. Not only did she have her mothers name, but her beauty and character as well. </p><p>Lord Robb was never the same after his wife’s death. It was said that the light had gone from his life when Lyanna had passed, and his only true joy came from raising the children they had made together. </p><p>Robb never married again. </p>",
                "content": "<p><b>The Next Generation of GOT</b></p><p><b>Part 3: </b></p><p>Lyanna (Youngest child and only daughter of King Jon and Queen Daenerys)<br />Robb (Eldest child of Arya Stark and Gendry Baratheon)</p><p><b><br /></b></p><p><b>Lyanna Targaryen and Robb Baratheon</b></p><p><br /></p><p>The youngest child and only daughter of King Jon and Queen Daenerys, Lyanna had the look of her mother and the colouring of her father. Known affectionately as the Southern Wolf, it was said that she was every bit a Stark as she was a Targaryen. Her stubborn nature was softened by her charm and quick wit, and it was said that those who met her couldn&rsquo;t help but love her. </p><p>Her mother had endured a difficult labour with her, and during the worst of it, Maester Samwell had feared that both Daenerys and her child would not make it through. They did make it of course, both mother and child. Daenerys had said that she and Lyanna were too stubborn to let death take them so soon. Jon had been the first to hold her. She had been so small, born nearly two moons early, and half of her tiny body had fit into the palm of his hand. Jon had cried as he held her, and thanked the Gods that his wife and daughter had both survived such an ordeal.</p><p>King Jon loved all of his children equally, but all knew that Lyanna held a special place in Jon&rsquo;s heart. So much like his sister Arya, and a tether to the mother who had died bringing him into the world, Lyanna was truly the light of her fathers life. </p><p>Betrothed to Robb Baratheon since her birth, Robb was five years her senior; born the same year as Lyanna&rsquo;s eldest brother, Ned. From the time that Lyanna was in her fifteenth year, she travelled to Storms End to spend several months at a time with her Uncle and Aunt, Lord and Lady Baratheon. <br /></p><p>Lyanna and Robb&rsquo;s relationship developed slowly, beginning first as a friendship. Robb had been hesitant at first, insisting that the crown princess was too young. And he had been right. Though Lyanna&rsquo;s fiery nature and independence matured her in many ways, she was in truth still a child when she and Robb began their courtship. During the earlier years she spent at Storms End, Lyanna and Robb became fast friends, their similar senses of humour and proclivity for combat provided them with a steadfast foundation for a strong and lasting friendship. During her fourth visit to Storms End, shortly after Lyanna&rsquo;s eighteenth name day, Robb was taken aback by how much Lyanna had changed since her last visit. As she stepped down from her horse that day in the courtyard of his family&rsquo;s ancestral home, the sun casting shades of copper and caramel in her dark hair, he felt an unexpected wave of nervousness wash over him. He had to remind himself that the woman standing in front of him was the same girl he had known all his life, and that he had no cause to be so anxious. </p><p>They spent the first few weeks of Lyanna&rsquo;s visit partaking in their usual pastimes, though Robb was much quieter than he usually was around Lyanna. He gave himself a pep talk before seeing her each day, and cursed himself for being so quiet afterwards. Lyanna hadn&rsquo;t seemed to notice the change in his demeanour however, and if she had she made no mention of it. During one of their walks through the woods surrounding Storms End, Lyanna had taken Robb&rsquo;s hand unexpectedly. His heart had begun to beat faster at her touch, and Lyanna had flashed him a wide smile that had both calmed and enlivened him. </p><p>One night after they had supped, Robb had walked Lyanna to her room. The hallway was empty and dark, save for a smattering of candles. &ldquo;My lady.&rdquo; Robb had said, bidding her goodnight, but he had lingered, his eyes catching hers, and for what felt like a very long moment, neither of them spoke. Lyanna looked at Robb, and let her eyes trail across his face. He was so handsome, she had thought. Tall and fierce, his black hair and dark eyes suited perfectly to his strong face. She moved towards him slowly then, and ever so gently pressed her lips to his. When she moved to part from him, Robb had a look of bewilderment etched across his face, his cheeks slightly pinker than they had been a moment before. Lyanna laughed gently. Seeing such a brave man reduced to an embarrassed boy at her touch thrilled her. <br /></p><p>&ldquo;Relax Baratheon.&rdquo; She had jested. &ldquo;It was only a kiss.&rdquo; Robb had watched her, his eyes never leaving her face, and a small smile played at the corner of Lyanna&rsquo;s lips. She turned towards her room and closed the door behind her. Lyanna had teased Robb for his embarrassment, but as she stood alone in her room, her back pressed against her closed door, her heart pounding in her chest, she too felt the flush of heat that had spread to her cheeks. <br /></p><p>Their friendship blossomed into a passionate romance that year, and the two of them snuck off into the woods to be alone more than once. Although their union had been arranged, Lyanna had never felt that it had been forced upon her. She had thanked the Gods that she and Robb had been betrothed to one another, and thought that maybe they would have found each other no matter the circumstances. </p><p>Lyanna was already pregnant with their first child the day that she wed Robb, though no one but the two of them knew. Their love for one another had grown from passion as much as it had from friendship. Their first child was a girl, born only seven moons after they had wed. They had named her Daenerys, though her hair and eyes were much darker than that of the woman she was named for. Queen Daenerys had given her daughter a knowing look, a mixture of amusement and understanding, after the birth of Lyanna&rsquo;s first child. Lyanna knew that her mother had also been pregnant on her wedding day.</p><p>Lyanna gave birth to another daughter a year later. They named her Arya, and she favoured her namesake in both looks and temperament. A son was born to her and Robb the following year. Brandon, they had called him. He had dark hair like his sisters, but unlike his siblings he had bright blue eyes instead of brown. </p><p>Lyanna fell pregnant once again, five years after she had given birth to her first child, and much like her mother&rsquo;s labour with her, Lyanna endured a difficult birth with her last child. It stretched on for days, and the Maester feared the worst for both mother and child. The baby was a girl, a tiny wisp of a thing, with dark hair like her mother. And though her child had survived the arduous labour, Lyanna did not. The Maester was unable to stop her bleeding, and Lyanna had died in Robb&rsquo;s arms. It was said that the whole of the Seven Kingdoms wept when they heard of their Princess&rsquo;s death. The Southern Wolf had perished, and with her went the joy that she had brought to those who had known her. Robb named their youngest daughter Lyanna. </p><p>King Jon had wept when he heard the news. His only daughter, the tiny girl he had held in his hands only moments after she had entered the world, had left it. Daenerys did not speak to anyone for many weeks following Lyanna&rsquo;s death, and she remained sequestered in her chambers for even longer. Her Lyanna, her sweet fierce girl, was gone, and with her had gone Daenerys&rsquo; joy. The Queen was never the same after that. Many said the fire that had coursed through the Queens veins before her daughters death had left her once Lyanna had passed. </p><p>Ned had beaten his hands bloody against a wall when he had heard of his sisters death. When he closed his eyes, he did not see her as the woman she had grown into, but as the small girl who had clutched his hand as they walked through the hallways of the Red Keep. His whole life he had protected Lyanna, though she rarely ever needed it. But this time, he had failed her. He said as much to his wife. Catelyn had taken Ned&rsquo;s face in her hands then, his cheeks wet and hot with tears, and she told him that there was nothing that he could have done to stop this from happening. That even a King could not stop the Gods. Catelyn felt her eyes burn as the words had left her mouth, and she could not stop the flood of tears that fell from her eyes as she thought of Lyanna. </p><p>Aemon had cried when he was told of Lyanna&rsquo;s death. He did not believe it at first. It seemed almost impossible that his ferocious and headstrong sister could be taken from this world when she had so much life left to live. Litse had wept into Aemon&rsquo;s chest when he told her of Lyanna&rsquo;s passing. Lyanna had been a sister to Litse in every way but blood, and it filled her with the greatest sorrow to picture a world without Lyanna in it.&nbsp;</p><p>Aemon and Ned rode to Storms End with their father to retrieve Lyanna&rsquo;s body. When they arrived, Arya and Gendry welcomed them in the courtyard, but Robb was nowhere to be found. Ned found him later, alone in his chambers, the curtains drawn and the candles unlit. Robb was as much Ned&rsquo;s friend as he was his brother by law, and the sorrow he felt for Robb ran as deep as his own. Ned had no words of comfort to offer, his own grief clouding his ability to console his friend, and so the two men sat in silence. It had been Aemon who had finally coaxed Robb from his chambers, his gentle heart and empathetic nature allowing him to reach Robb in a way that no one else had been able to. </p><p>In the end, Lyanna&rsquo;s body was brought back to Kings Landing. Her final resting place a stones throw away from where she had been born. Robb and Lyanna&rsquo;s youngest child was like her mother in every way. Not only did she have her mothers name, but her beauty and character as well. </p><p>Lord Robb was never the same after his wife&rsquo;s death. It was said that the light had gone from his life when Lyanna had passed, and his only true joy came from raising the children they had made together. </p><p>Robb never married again. </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "2222",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/772dafa6266baedd5883aa9ea27e1087/tumblr_ph0phm5K7k1r9sf5zo1_250.jpg",
                    "width": 240,
                    "height": 251
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/772dafa6266baedd5883aa9ea27e1087/tumblr_ph0phm5K7k1r9sf5zo1_250.jpg",
                        "width": 240,
                        "height": 251
                    },
                    {
                        "url": "https://66.media.tumblr.com/772dafa6266baedd5883aa9ea27e1087/tumblr_ph0phm5K7k1r9sf5zo1_100.jpg",
                        "width": 100,
                        "height": 105
                    },
                    {
                        "url": "https://66.media.tumblr.com/772dafa6266baedd5883aa9ea27e1087/tumblr_ph0phm5K7k1r9sf5zo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/3172c7bec765fea7a8b61ff6d94abc5b/tumblr_ph0phm5K7k1r9sf5zo2_250.gif",
                    "width": 245,
                    "height": 255
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/3172c7bec765fea7a8b61ff6d94abc5b/tumblr_ph0phm5K7k1r9sf5zo2_250.gif",
                        "width": 245,
                        "height": 255
                    },
                    {
                        "url": "https://66.media.tumblr.com/3172c7bec765fea7a8b61ff6d94abc5b/tumblr_ph0phm5K7k1r9sf5zo2_100.gif",
                        "width": 100,
                        "height": 104
                    },
                    {
                        "url": "https://66.media.tumblr.com/3172c7bec765fea7a8b61ff6d94abc5b/tumblr_ph0phm5K7k1r9sf5zo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/faa46d97dbfd22694ce3a0236dc13917/tumblr_ph0phm5K7k1r9sf5zo3_250.gif",
                    "width": 245,
                    "height": 275
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/faa46d97dbfd22694ce3a0236dc13917/tumblr_ph0phm5K7k1r9sf5zo3_250.gif",
                        "width": 245,
                        "height": 275
                    },
                    {
                        "url": "https://66.media.tumblr.com/faa46d97dbfd22694ce3a0236dc13917/tumblr_ph0phm5K7k1r9sf5zo3_100.gif",
                        "width": 100,
                        "height": 112
                    },
                    {
                        "url": "https://66.media.tumblr.com/faa46d97dbfd22694ce3a0236dc13917/tumblr_ph0phm5K7k1r9sf5zo3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/52b226ffdedb10190c807c19fc1587a6/tumblr_ph0phm5K7k1r9sf5zo4_500.gif",
                    "width": 476,
                    "height": 266
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/52b226ffdedb10190c807c19fc1587a6/tumblr_ph0phm5K7k1r9sf5zo4_500.gif",
                        "width": 476,
                        "height": 266
                    },
                    {
                        "url": "https://66.media.tumblr.com/52b226ffdedb10190c807c19fc1587a6/tumblr_ph0phm5K7k1r9sf5zo4_400.gif",
                        "width": 400,
                        "height": 224
                    },
                    {
                        "url": "https://66.media.tumblr.com/52b226ffdedb10190c807c19fc1587a6/tumblr_ph0phm5K7k1r9sf5zo4_250.gif",
                        "width": 250,
                        "height": 140
                    },
                    {
                        "url": "https://66.media.tumblr.com/52b226ffdedb10190c807c19fc1587a6/tumblr_ph0phm5K7k1r9sf5zo4_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/52b226ffdedb10190c807c19fc1587a6/tumblr_ph0phm5K7k1r9sf5zo4_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_1280.gif",
                    "width": 1010,
                    "height": 420
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_1280.gif",
                        "width": 1010,
                        "height": 420
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_640.gif",
                        "width": 640,
                        "height": 266
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_540.gif",
                        "width": 540,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_500.gif",
                        "width": 500,
                        "height": 208
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_400.gif",
                        "width": 400,
                        "height": 166
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_250.gif",
                        "width": 250,
                        "height": 104
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_100.gif",
                        "width": 100,
                        "height": 42
                    },
                    {
                        "url": "https://66.media.tumblr.com/dc218a295f64234391f79707d53fd209/tumblr_ph0phm5K7k1r9sf5zo5_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_540.gif",
                    "width": 540,
                    "height": 220
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_540.gif",
                        "width": 540,
                        "height": 220
                    },
                    {
                        "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_500.gif",
                        "width": 500,
                        "height": 204
                    },
                    {
                        "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_400.gif",
                        "width": 400,
                        "height": 163
                    },
                    {
                        "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_250.gif",
                        "width": 250,
                        "height": 102
                    },
                    {
                        "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_100.gif",
                        "width": 100,
                        "height": 41
                    },
                    {
                        "url": "https://66.media.tumblr.com/80bd18f3a8761db34a396dec9303b7b6/tumblr_ph0phm5K7k1r9sf5zo6_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_1280.jpg",
                    "width": 1080,
                    "height": 1350
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_1280.jpg",
                        "width": 1080,
                        "height": 1350
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_640.jpg",
                        "width": 640,
                        "height": 800
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_540.jpg",
                        "width": 540,
                        "height": 675
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_500.jpg",
                        "width": 500,
                        "height": 625
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_400.jpg",
                        "width": 400,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_250.jpg",
                        "width": 250,
                        "height": 313
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_100.jpg",
                        "width": 100,
                        "height": 125
                    },
                    {
                        "url": "https://66.media.tumblr.com/1059be1cc3ebe381735cf1af9ef39b63/tumblr_ph0phm5K7k1r9sf5zo7_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/41f631b9f29f4db1eb5f5fd3797db1f4/tumblr_ph0phm5K7k1r9sf5zo8_400.jpg",
                    "width": 400,
                    "height": 548
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/41f631b9f29f4db1eb5f5fd3797db1f4/tumblr_ph0phm5K7k1r9sf5zo8_400.jpg",
                        "width": 400,
                        "height": 548
                    },
                    {
                        "url": "https://66.media.tumblr.com/41f631b9f29f4db1eb5f5fd3797db1f4/tumblr_ph0phm5K7k1r9sf5zo8_250.jpg",
                        "width": 250,
                        "height": 343
                    },
                    {
                        "url": "https://66.media.tumblr.com/41f631b9f29f4db1eb5f5fd3797db1f4/tumblr_ph0phm5K7k1r9sf5zo8_100.jpg",
                        "width": 100,
                        "height": 137
                    },
                    {
                        "url": "https://66.media.tumblr.com/41f631b9f29f4db1eb5f5fd3797db1f4/tumblr_ph0phm5K7k1r9sf5zo8_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "link",
        "blog_name": "ao3feed-jonrya",
        "blog": {
            "name": "ao3feed-jonrya",
            "title": "AO3feed-Jonrya",
            "description": "  An automated feed for Jon x Arya fics posted on AO3.",
            "url": "https://ao3feed-jonrya.tumblr.com/",
            "uuid": "t:vwJRJGkZFFBKOLkwu-cxuA",
            "updated": 1561275029
        },
        "id": 179323121245,
        "post_url": "https://ao3feed-jonrya.tumblr.com/post/179323121245/starks-will-come-again",
        "slug": "starks-will-come-again",
        "date": "2018-10-22 20:02:07 GMT",
        "timestamp": 1540238527,
        "state": "published",
        "format": "html",
        "reblog_key": "U3AxEUlN",
        "tags": [
            "arya stark",
            "jon snow",
            "jon x arya",
            "needleheart",
            "jonrya",
            "ao3feed",
            "fanfic",
            "IFTTT"
        ],
        "short_url": "https://tmblr.co/ZmpZRZ2d0VQvT",
        "summary": "Starks Will Come Again",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 2,
        "title": "Starks Will Come Again",
        "url": "http://archiveofourown.org/works/16375820",
        "link_author": null,
        "excerpt": null,
        "publisher": "archiveofourown.org",
        "description": "<p>by <a rel=\"author\" href=\"/users/Aryas_aria/pseuds/Aryas_aria\">Aryas_aria</a></p><p>Jon Snow awakes on the Wall, changed but still very much committed to freeing &ldquo;Arya&rdquo; from the Boltons.  Catching wind of Jon&rsquo;s resurrection, Littlefinger plots to use him to secure Sansa&rsquo;s seat in Winterfell, but he isn&rsquo;t the only one with eyes on the North. Back in the Riverlands, a fugitive Brynden Tully finds a mysterious grey- eyed girl at the Twins as Bran Stark returns from Beyond the Wall. Meanwhile, Cersei Lannister rules from King&rsquo;s Landing as three Dragons circle the island of Dragonstone. The seven kingdoms are at war and the Night King is coming. Will they be able to band together and defeat the Night king for good? Or will the iron Throne be the death of them all?</p><p>Words: 919, Chapters: 1/?, Language: English</p><ul><li>Fandoms: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)/works\">Game of Thrones (TV)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20-%20George%20R*d*%20R*d*%20Martin/works\">A Song of Ice and Fire - George R. R. Martin</a>\n</li>\n<li>Rating: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a>\n</li>\n<li>Warnings: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\">Graphic Depictions Of Violence</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Major%20Character%20Death/works\">Major Character Death</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Underage/works\">Underage</a>\n</li>\n<li>Categories: <a class=\"tag\" href=\"http://archiveofourown.org/tags/F*s*M/works\">F/M</a>\n</li>\n<li>Characters: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow/works\">Jon Snow</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20Stark/works\">Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sansa%20Stark/works\">Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Bran%20Stark/works\">Bran Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rickon%20Stark/works\">Rickon Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Robb%20Stark%20(mentioned)%20-%20Character/works\">Robb Stark (mentioned) - Character</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Stark%20(%20mentioned)/works\">Ned Stark ( mentioned)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Catelyn%20Tully%20Stark/works\">Catelyn Tully Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Lady%20Stoneheart/works\">Lady Stoneheart</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Edmure%20Tully/works\">Edmure Tully</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Blackfish/works\">The Blackfish</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brynden%20Tully/works\">Brynden Tully</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyrion%20Lannister/works\">Tyrion Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jamie%20Lannister/works\">Jamie Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20Lannister/works\">Cersei Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Olenna%20Tyrell/works\">Olenna Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Willas%20Tyrell/works\">Willas Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Margaery%20Tyrell/works\">Margaery Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Dayne/works\">Ned Dayne</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arianne%20Martell/works\">Arianne Martell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyene%20Sand/works\">Tyene Sand</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Beric%20Dondarrion%20(mentioned)/works\">Beric Dondarrion (mentioned)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Thoros%20of%20Myr/works\">Thoros of Myr</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brotherhood%20Without%20Banners/works\">Brotherhood Without Banners</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brother(s)%20of%20the%20Night's%20Watch/works\">Brother(s) of the Night&rsquo;s Watch</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Samwell%20Tarley/works\">Samwell Tarley</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20%22The%20Greatjon%22%20Umber/works\">Jon &ldquo;The Greatjon&rdquo; Umber</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sandor%20Clegane/works\">Sandor Clegane</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20%22The%20Smalljon%22%20Umber/works\">Jon &ldquo;The Smalljon&rdquo; Umber</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Robert%20%22Sweetrobin%22%20Arryn/works\">Robert &ldquo;Sweetrobin&rdquo; Arryn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Petyr%20Baelish/works\">Petyr Baelish</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Shireen%20Baratheon/works\">Shireen Baratheon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gendry%20Waters/works\">Gendry Waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Selyse%20Baratheon/works\">Selyse Baratheon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Melisandre%20of%20Asshai/works\">Melisandre of Asshai</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Daenerys%20Targaryen/works\">Daenerys Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen/works\">Aegon VI Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Theon%20Greyjoy/works\">Theon Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Asha%20Greyjoy/works\">Asha Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jaqen%20H'ghar/works\">Jaqen H'ghar</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Faceless%20Man/works\">The Faceless Man</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gregor%20Clegane/works\">Gregor Clegane</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brienne%20of%20Tarth/works\">Brienne of Tarth</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Poderick%20Payne/works\">Poderick Payne</a>\n</li>\n<li>Relationships: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Arya%20Stark/works\">Jon Snow/Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Daenerys%20Targaryen%20(somewhat)/works\">Jon Snow/Daenerys Targaryen (somewhat)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyrion%20Lannister*s*Sansa%20Stark/works\">Tyrion Lannister/Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen*s*Daenerys%20Targaryen/works\">Aegon VI Targaryen/Daenerys Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Shireen%20Baratheon*s*%20Gendry%20waters/works\">Shireen Baratheon/ Gendry waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20Lannister*s*%20Jaime%20Lannister/works\">Cersei Lannister/ Jaime Lannister</a>\n</li>\n<li>Additional Tags: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20a%20Targaryen/works\">Jon Snow is a Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Slow%20Burn/works\">Slow Burn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20not%20called%20Aegon/works\">Jon Snow is not called Aegon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/aegon%20is%20a%20pretender/works\">aegon is a pretender</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sansa%20is%20redeemable/works\">Sansa is redeemable</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20stark%20is%20more%20than%20a%20weapon/works\">Arya stark is more than a weapon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya-centric/works\">Arya-centric</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Faceless%20Arya/works\">Faceless Arya</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/bran%20is%20more%20than%20just%20a%20three%20eyed%20raven/works\">bran is more than just a three eyed raven</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Bran%20has%20EMOTIONS%20*a*%20feelings/works\">Bran has EMOTIONS &amp; feelings</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Hound%20has%20been%20redeemed/works\">The Hound has been redeemed</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20is%20evil%20but%20we%20love%20her%20for%20it/works\">Cersei is evil but we love her for it</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rickon%20stark%20is%20a%20live%20and%20an%20important%20member%20of%20house%20stark/works\">Rickon stark is a live and an important member of house stark</a>\n</li>\n</ul>",
        "reblog": {
            "comment": "<p><p>by <a rel=\"author\" href=\"/users/Aryas_aria/pseuds/Aryas_aria\">Aryas_aria</a></p><p>Jon Snow awakes on the Wall, changed but still very much committed to freeing “Arya” from the Boltons.  Catching wind of Jon’s resurrection, Littlefinger plots to use him to secure Sansa’s seat in Winterfell, but he isn’t the only one with eyes on the North. Back in the Riverlands, a fugitive Brynden Tully finds a mysterious grey- eyed girl at the Twins as Bran Stark returns from Beyond the Wall. Meanwhile, Cersei Lannister rules from King’s Landing as three Dragons circle the island of Dragonstone. The seven kingdoms are at war and the Night King is coming. Will they be able to band together and defeat the Night king for good? Or will the iron Throne be the death of them all?</p><p>Words: 919, Chapters: 1/?, Language: English</p><ul><li>Fandoms: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)/works\">Game of Thrones (TV)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20-%20George%20R*d*%20R*d*%20Martin/works\">A Song of Ice and Fire - George R. R. Martin</a>\n</li>\n<li>Rating: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a>\n</li>\n<li>Warnings: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\">Graphic Depictions Of Violence</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Major%20Character%20Death/works\">Major Character Death</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Underage/works\">Underage</a>\n</li>\n<li>Categories: <a class=\"tag\" href=\"http://archiveofourown.org/tags/F*s*M/works\">F/M</a>\n</li>\n<li>Characters: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow/works\">Jon Snow</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20Stark/works\">Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sansa%20Stark/works\">Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Bran%20Stark/works\">Bran Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rickon%20Stark/works\">Rickon Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Robb%20Stark%20(mentioned)%20-%20Character/works\">Robb Stark (mentioned) - Character</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Stark%20(%20mentioned)/works\">Ned Stark ( mentioned)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Catelyn%20Tully%20Stark/works\">Catelyn Tully Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Lady%20Stoneheart/works\">Lady Stoneheart</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Edmure%20Tully/works\">Edmure Tully</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Blackfish/works\">The Blackfish</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brynden%20Tully/works\">Brynden Tully</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyrion%20Lannister/works\">Tyrion Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jamie%20Lannister/works\">Jamie Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20Lannister/works\">Cersei Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Olenna%20Tyrell/works\">Olenna Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Willas%20Tyrell/works\">Willas Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Margaery%20Tyrell/works\">Margaery Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Dayne/works\">Ned Dayne</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arianne%20Martell/works\">Arianne Martell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyene%20Sand/works\">Tyene Sand</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Beric%20Dondarrion%20(mentioned)/works\">Beric Dondarrion (mentioned)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Thoros%20of%20Myr/works\">Thoros of Myr</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brotherhood%20Without%20Banners/works\">Brotherhood Without Banners</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brother(s)%20of%20the%20Night's%20Watch/works\">Brother(s) of the Night’s Watch</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Samwell%20Tarley/works\">Samwell Tarley</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20%22The%20Greatjon%22%20Umber/works\">Jon “The Greatjon” Umber</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sandor%20Clegane/works\">Sandor Clegane</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20%22The%20Smalljon%22%20Umber/works\">Jon “The Smalljon” Umber</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Robert%20%22Sweetrobin%22%20Arryn/works\">Robert “Sweetrobin” Arryn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Petyr%20Baelish/works\">Petyr Baelish</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Shireen%20Baratheon/works\">Shireen Baratheon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gendry%20Waters/works\">Gendry Waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Selyse%20Baratheon/works\">Selyse Baratheon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Melisandre%20of%20Asshai/works\">Melisandre of Asshai</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Daenerys%20Targaryen/works\">Daenerys Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen/works\">Aegon VI Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Theon%20Greyjoy/works\">Theon Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Asha%20Greyjoy/works\">Asha Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jaqen%20H'ghar/works\">Jaqen H'ghar</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Faceless%20Man/works\">The Faceless Man</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gregor%20Clegane/works\">Gregor Clegane</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brienne%20of%20Tarth/works\">Brienne of Tarth</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Poderick%20Payne/works\">Poderick Payne</a>\n</li>\n<li>Relationships: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Arya%20Stark/works\">Jon Snow/Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Daenerys%20Targaryen%20(somewhat)/works\">Jon Snow/Daenerys Targaryen (somewhat)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyrion%20Lannister*s*Sansa%20Stark/works\">Tyrion Lannister/Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen*s*Daenerys%20Targaryen/works\">Aegon VI Targaryen/Daenerys Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Shireen%20Baratheon*s*%20Gendry%20waters/works\">Shireen Baratheon/ Gendry waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20Lannister*s*%20Jaime%20Lannister/works\">Cersei Lannister/ Jaime Lannister</a>\n</li>\n<li>Additional Tags: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20a%20Targaryen/works\">Jon Snow is a Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Slow%20Burn/works\">Slow Burn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20not%20called%20Aegon/works\">Jon Snow is not called Aegon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/aegon%20is%20a%20pretender/works\">aegon is a pretender</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sansa%20is%20redeemable/works\">Sansa is redeemable</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20stark%20is%20more%20than%20a%20weapon/works\">Arya stark is more than a weapon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya-centric/works\">Arya-centric</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Faceless%20Arya/works\">Faceless Arya</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/bran%20is%20more%20than%20just%20a%20three%20eyed%20raven/works\">bran is more than just a three eyed raven</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Bran%20has%20EMOTIONS%20*a*%20feelings/works\">Bran has EMOTIONS &amp; feelings</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Hound%20has%20been%20redeemed/works\">The Hound has been redeemed</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20is%20evil%20but%20we%20love%20her%20for%20it/works\">Cersei is evil but we love her for it</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rickon%20stark%20is%20a%20live%20and%20an%20important%20member%20of%20house%20stark/works\">Rickon stark is a live and an important member of house stark</a>\n</li>\n</ul></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ao3feed-jonrya",
                    "active": true,
                    "theme": {
                        "header_full_width": 3000,
                        "header_full_height": 1055,
                        "header_focus_width": 1068,
                        "header_focus_height": 601,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "111,2041,712,973",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_05.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_image_focused": "https://static.tumblr.com/7032fac7091015e342cc53dc7f060a57/mailbkd/MTmpfkldy/tumblr_static_optica_pattern_05_focused_v3.png",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_05_focused_v3.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179323121245"
                },
                "content_raw": "<p><p>by <a rel=\"author\" href=\"/users/Aryas_aria/pseuds/Aryas_aria\">Aryas_aria</a></p><p>Jon Snow awakes on the Wall, changed but still very much committed to freeing “Arya” from the Boltons.  Catching wind of Jon’s resurrection, Littlefinger plots to use him to secure Sansa’s seat in Winterfell, but he isn’t the only one with eyes on the North. Back in the Riverlands, a fugitive Brynden Tully finds a mysterious grey- eyed girl at the Twins as Bran Stark returns from Beyond the Wall. Meanwhile, Cersei Lannister rules from King’s Landing as three Dragons circle the island of Dragonstone. The seven kingdoms are at war and the Night King is coming. Will they be able to band together and defeat the Night king for good? Or will the iron Throne be the death of them all?</p><p>Words: 919, Chapters: 1/?, Language: English</p><ul><li>Fandoms: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)/works\">Game of Thrones (TV)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20-%20George%20R*d*%20R*d*%20Martin/works\">A Song of Ice and Fire - George R. R. Martin</a>\n</li>\n<li>Rating: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a>\n</li>\n<li>Warnings: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\">Graphic Depictions Of Violence</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Major%20Character%20Death/works\">Major Character Death</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Underage/works\">Underage</a>\n</li>\n<li>Categories: <a class=\"tag\" href=\"http://archiveofourown.org/tags/F*s*M/works\">F/M</a>\n</li>\n<li>Characters: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow/works\">Jon Snow</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20Stark/works\">Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sansa%20Stark/works\">Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Bran%20Stark/works\">Bran Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rickon%20Stark/works\">Rickon Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Robb%20Stark%20(mentioned)%20-%20Character/works\">Robb Stark (mentioned) - Character</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Stark%20(%20mentioned)/works\">Ned Stark ( mentioned)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Catelyn%20Tully%20Stark/works\">Catelyn Tully Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Lady%20Stoneheart/works\">Lady Stoneheart</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Edmure%20Tully/works\">Edmure Tully</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Blackfish/works\">The Blackfish</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brynden%20Tully/works\">Brynden Tully</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyrion%20Lannister/works\">Tyrion Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jamie%20Lannister/works\">Jamie Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20Lannister/works\">Cersei Lannister</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Olenna%20Tyrell/works\">Olenna Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Willas%20Tyrell/works\">Willas Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Margaery%20Tyrell/works\">Margaery Tyrell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Dayne/works\">Ned Dayne</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arianne%20Martell/works\">Arianne Martell</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyene%20Sand/works\">Tyene Sand</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Beric%20Dondarrion%20(mentioned)/works\">Beric Dondarrion (mentioned)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Thoros%20of%20Myr/works\">Thoros of Myr</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brotherhood%20Without%20Banners/works\">Brotherhood Without Banners</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brother(s)%20of%20the%20Night's%20Watch/works\">Brother(s) of the Night’s Watch</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Samwell%20Tarley/works\">Samwell Tarley</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20%22The%20Greatjon%22%20Umber/works\">Jon “The Greatjon” Umber</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sandor%20Clegane/works\">Sandor Clegane</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20%22The%20Smalljon%22%20Umber/works\">Jon “The Smalljon” Umber</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Robert%20%22Sweetrobin%22%20Arryn/works\">Robert “Sweetrobin” Arryn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Petyr%20Baelish/works\">Petyr Baelish</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Shireen%20Baratheon/works\">Shireen Baratheon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gendry%20Waters/works\">Gendry Waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Selyse%20Baratheon/works\">Selyse Baratheon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Melisandre%20of%20Asshai/works\">Melisandre of Asshai</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Daenerys%20Targaryen/works\">Daenerys Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen/works\">Aegon VI Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Theon%20Greyjoy/works\">Theon Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Asha%20Greyjoy/works\">Asha Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jaqen%20H'ghar/works\">Jaqen H'ghar</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Faceless%20Man/works\">The Faceless Man</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gregor%20Clegane/works\">Gregor Clegane</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Brienne%20of%20Tarth/works\">Brienne of Tarth</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Poderick%20Payne/works\">Poderick Payne</a>\n</li>\n<li>Relationships: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Arya%20Stark/works\">Jon Snow/Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Daenerys%20Targaryen%20(somewhat)/works\">Jon Snow/Daenerys Targaryen (somewhat)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Tyrion%20Lannister*s*Sansa%20Stark/works\">Tyrion Lannister/Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen*s*Daenerys%20Targaryen/works\">Aegon VI Targaryen/Daenerys Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Shireen%20Baratheon*s*%20Gendry%20waters/works\">Shireen Baratheon/ Gendry waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20Lannister*s*%20Jaime%20Lannister/works\">Cersei Lannister/ Jaime Lannister</a>\n</li>\n<li>Additional Tags: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20a%20Targaryen/works\">Jon Snow is a Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Slow%20Burn/works\">Slow Burn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20not%20called%20Aegon/works\">Jon Snow is not called Aegon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/aegon%20is%20a%20pretender/works\">aegon is a pretender</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Sansa%20is%20redeemable/works\">Sansa is redeemable</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20stark%20is%20more%20than%20a%20weapon/works\">Arya stark is more than a weapon</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya-centric/works\">Arya-centric</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Faceless%20Arya/works\">Faceless Arya</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/bran%20is%20more%20than%20just%20a%20three%20eyed%20raven/works\">bran is more than just a three eyed raven</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Bran%20has%20EMOTIONS%20*a*%20feelings/works\">Bran has EMOTIONS &amp; feelings</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Hound%20has%20been%20redeemed/works\">The Hound has been redeemed</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Cersei%20is%20evil%20but%20we%20love%20her%20for%20it/works\">Cersei is evil but we love her for it</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rickon%20stark%20is%20a%20live%20and%20an%20important%20member%20of%20house%20stark/works\">Rickon stark is a live and an important member of house stark</a>\n</li>\n</ul></p>",
                "content": "<p><p>by <a href=\"/users/Aryas_aria/pseuds/Aryas_aria\">Aryas_aria</a></p><p>Jon Snow awakes on the Wall, changed but still very much committed to freeing &ldquo;Arya&rdquo; from the Boltons.  Catching wind of Jon&rsquo;s resurrection, Littlefinger plots to use him to secure Sansa&rsquo;s seat in Winterfell, but he isn&rsquo;t the only one with eyes on the North. Back in the Riverlands, a fugitive Brynden Tully finds a mysterious grey- eyed girl at the Twins as Bran Stark returns from Beyond the Wall. Meanwhile, Cersei Lannister rules from King&rsquo;s Landing as three Dragons circle the island of Dragonstone. The seven kingdoms are at war and the Night King is coming. Will they be able to band together and defeat the Night king for good? Or will the iron Throne be the death of them all?</p><p>Words: 919, Chapters: 1/?, Language: English</p><ul><li>Fandoms: <a href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)/works\">Game of Thrones (TV)</a>, <a href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20-%20George%20R*d*%20R*d*%20Martin/works\">A Song of Ice and Fire - George R. R. Martin</a>\n</li>\n<li>Rating: <a href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a>\n</li>\n<li>Warnings: <a href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\">Graphic Depictions Of Violence</a>, <a href=\"http://archiveofourown.org/tags/Major%20Character%20Death/works\">Major Character Death</a>, <a href=\"http://archiveofourown.org/tags/Underage/works\">Underage</a>\n</li>\n<li>Categories: <a href=\"http://archiveofourown.org/tags/F*s*M/works\">F/M</a>\n</li>\n<li>Characters: <a href=\"http://archiveofourown.org/tags/Jon%20Snow/works\">Jon Snow</a>, <a href=\"http://archiveofourown.org/tags/Arya%20Stark/works\">Arya Stark</a>, <a href=\"http://archiveofourown.org/tags/Sansa%20Stark/works\">Sansa Stark</a>, <a href=\"http://archiveofourown.org/tags/Bran%20Stark/works\">Bran Stark</a>, <a href=\"http://archiveofourown.org/tags/Rickon%20Stark/works\">Rickon Stark</a>, <a href=\"http://archiveofourown.org/tags/Robb%20Stark%20(mentioned)%20-%20Character/works\">Robb Stark (mentioned) - Character</a>, <a href=\"http://archiveofourown.org/tags/Ned%20Stark%20(%20mentioned)/works\">Ned Stark ( mentioned)</a>, <a href=\"http://archiveofourown.org/tags/Catelyn%20Tully%20Stark/works\">Catelyn Tully Stark</a>, <a href=\"http://archiveofourown.org/tags/Lady%20Stoneheart/works\">Lady Stoneheart</a>, <a href=\"http://archiveofourown.org/tags/Edmure%20Tully/works\">Edmure Tully</a>, <a href=\"http://archiveofourown.org/tags/The%20Blackfish/works\">The Blackfish</a>, <a href=\"http://archiveofourown.org/tags/Brynden%20Tully/works\">Brynden Tully</a>, <a href=\"http://archiveofourown.org/tags/Tyrion%20Lannister/works\">Tyrion Lannister</a>, <a href=\"http://archiveofourown.org/tags/Jamie%20Lannister/works\">Jamie Lannister</a>, <a href=\"http://archiveofourown.org/tags/Cersei%20Lannister/works\">Cersei Lannister</a>, <a href=\"http://archiveofourown.org/tags/Olenna%20Tyrell/works\">Olenna Tyrell</a>, <a href=\"http://archiveofourown.org/tags/Willas%20Tyrell/works\">Willas Tyrell</a>, <a href=\"http://archiveofourown.org/tags/Margaery%20Tyrell/works\">Margaery Tyrell</a>, <a href=\"http://archiveofourown.org/tags/Ned%20Dayne/works\">Ned Dayne</a>, <a href=\"http://archiveofourown.org/tags/Arianne%20Martell/works\">Arianne Martell</a>, <a href=\"http://archiveofourown.org/tags/Tyene%20Sand/works\">Tyene Sand</a>, <a href=\"http://archiveofourown.org/tags/Beric%20Dondarrion%20(mentioned)/works\">Beric Dondarrion (mentioned)</a>, <a href=\"http://archiveofourown.org/tags/Thoros%20of%20Myr/works\">Thoros of Myr</a>, <a href=\"http://archiveofourown.org/tags/Brotherhood%20Without%20Banners/works\">Brotherhood Without Banners</a>, <a href=\"http://archiveofourown.org/tags/Brother(s)%20of%20the%20Night's%20Watch/works\">Brother(s) of the Night&rsquo;s Watch</a>, <a href=\"http://archiveofourown.org/tags/Samwell%20Tarley/works\">Samwell Tarley</a>, <a href=\"http://archiveofourown.org/tags/Jon%20%22The%20Greatjon%22%20Umber/works\">Jon &ldquo;The Greatjon&rdquo; Umber</a>, <a href=\"http://archiveofourown.org/tags/Sandor%20Clegane/works\">Sandor Clegane</a>, <a href=\"http://archiveofourown.org/tags/Jon%20%22The%20Smalljon%22%20Umber/works\">Jon &ldquo;The Smalljon&rdquo; Umber</a>, <a href=\"http://archiveofourown.org/tags/Robert%20%22Sweetrobin%22%20Arryn/works\">Robert &ldquo;Sweetrobin&rdquo; Arryn</a>, <a href=\"http://archiveofourown.org/tags/Petyr%20Baelish/works\">Petyr Baelish</a>, <a href=\"http://archiveofourown.org/tags/Shireen%20Baratheon/works\">Shireen Baratheon</a>, <a href=\"http://archiveofourown.org/tags/Gendry%20Waters/works\">Gendry Waters</a>, <a href=\"http://archiveofourown.org/tags/Selyse%20Baratheon/works\">Selyse Baratheon</a>, <a href=\"http://archiveofourown.org/tags/Melisandre%20of%20Asshai/works\">Melisandre of Asshai</a>, <a href=\"http://archiveofourown.org/tags/Daenerys%20Targaryen/works\">Daenerys Targaryen</a>, <a href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen/works\">Aegon VI Targaryen</a>, <a href=\"http://archiveofourown.org/tags/Theon%20Greyjoy/works\">Theon Greyjoy</a>, <a href=\"http://archiveofourown.org/tags/Asha%20Greyjoy/works\">Asha Greyjoy</a>, <a href=\"http://archiveofourown.org/tags/Jaqen%20H'ghar/works\">Jaqen H'ghar</a>, <a href=\"http://archiveofourown.org/tags/The%20Faceless%20Man/works\">The Faceless Man</a>, <a href=\"http://archiveofourown.org/tags/Gregor%20Clegane/works\">Gregor Clegane</a>, <a href=\"http://archiveofourown.org/tags/Brienne%20of%20Tarth/works\">Brienne of Tarth</a>, <a href=\"http://archiveofourown.org/tags/Poderick%20Payne/works\">Poderick Payne</a>\n</li>\n<li>Relationships: <a href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Arya%20Stark/works\">Jon Snow/Arya Stark</a>, <a href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Daenerys%20Targaryen%20(somewhat)/works\">Jon Snow/Daenerys Targaryen (somewhat)</a>, <a href=\"http://archiveofourown.org/tags/Tyrion%20Lannister*s*Sansa%20Stark/works\">Tyrion Lannister/Sansa Stark</a>, <a href=\"http://archiveofourown.org/tags/Aegon%20VI%20Targaryen*s*Daenerys%20Targaryen/works\">Aegon VI Targaryen/Daenerys Targaryen</a>, <a href=\"http://archiveofourown.org/tags/Shireen%20Baratheon*s*%20Gendry%20waters/works\">Shireen Baratheon/ Gendry waters</a>, <a href=\"http://archiveofourown.org/tags/Cersei%20Lannister*s*%20Jaime%20Lannister/works\">Cersei Lannister/ Jaime Lannister</a>\n</li>\n<li>Additional Tags: <a href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20a%20Targaryen/works\">Jon Snow is a Targaryen</a>, <a href=\"http://archiveofourown.org/tags/Slow%20Burn/works\">Slow Burn</a>, <a href=\"http://archiveofourown.org/tags/Jon%20Snow%20is%20not%20called%20Aegon/works\">Jon Snow is not called Aegon</a>, <a href=\"http://archiveofourown.org/tags/aegon%20is%20a%20pretender/works\">aegon is a pretender</a>, <a href=\"http://archiveofourown.org/tags/Sansa%20is%20redeemable/works\">Sansa is redeemable</a>, <a href=\"http://archiveofourown.org/tags/Arya%20stark%20is%20more%20than%20a%20weapon/works\">Arya stark is more than a weapon</a>, <a href=\"http://archiveofourown.org/tags/Arya-centric/works\">Arya-centric</a>, <a href=\"http://archiveofourown.org/tags/Faceless%20Arya/works\">Faceless Arya</a>, <a href=\"http://archiveofourown.org/tags/bran%20is%20more%20than%20just%20a%20three%20eyed%20raven/works\">bran is more than just a three eyed raven</a>, <a href=\"http://archiveofourown.org/tags/Bran%20has%20EMOTIONS%20*a*%20feelings/works\">Bran has EMOTIONS &amp; feelings</a>, <a href=\"http://archiveofourown.org/tags/The%20Hound%20has%20been%20redeemed/works\">The Hound has been redeemed</a>, <a href=\"http://archiveofourown.org/tags/Cersei%20is%20evil%20but%20we%20love%20her%20for%20it/works\">Cersei is evil but we love her for it</a>, <a href=\"http://archiveofourown.org/tags/Rickon%20stark%20is%20a%20live%20and%20an%20important%20member%20of%20house%20stark/works\">Rickon stark is a live and an important member of house stark</a>\n</li>\n</ul></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "quote",
        "blog_name": "gameofavatars",
        "blog": {
            "name": "gameofavatars",
            "title": "Game of Avatars",
            "description": "An incorrect quote blog for Game of Thrones/A Song of Ice and Fire and Avatar: The Last Airbender/The Legend of Korra.",
            "url": "https://gameofavatars.tumblr.com/",
            "uuid": "t:Zco9oibFkR7p5wFQcV7irw",
            "updated": 1549395042
        },
        "id": 179322488496,
        "post_url": "https://gameofavatars.tumblr.com/post/179322488496/i-abandoned-no-one",
        "slug": "i-abandoned-no-one",
        "date": "2018-10-22 19:40:24 GMT",
        "timestamp": 1540237224,
        "state": "published",
        "format": "html",
        "reblog_key": "xKFeZ0PQ",
        "tags": [
            "uko",
            "jon snow",
            "atla",
            "asoiaf",
            "a storm of swords",
            "atla book 3"
        ],
        "short_url": "https://tmblr.co/Z2Z64h2d0T0Qm",
        "summary": "I abandoned no one.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1,
        "text": "I abandoned no one.",
        "source": "Zuko, Book 3",
        "reblog": {
            "comment": "<p>Zuko, Book 3</p>",
            "tree_html": ""
        },
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "acourtofhopeanddreams",
        "blog": {
            "name": "acourtofhopeanddreams",
            "title": "Enjoy the little things!",
            "description": "Open your heart\nTo the love of the world\nIt only needs one person\nTouching it with \nA word\nA look\nA smile\nA kiss",
            "url": "https://acourtofhopeanddreams.tumblr.com/",
            "uuid": "t:BS7jn3JbIcnDmWP5dKvmaA",
            "updated": 1561404390
        },
        "id": 179322001805,
        "post_url": "https://acourtofhopeanddreams.tumblr.com/post/179322001805/first-kiss",
        "slug": "first-kiss",
        "date": "2018-10-22 19:23:05 GMT",
        "timestamp": 1540236185,
        "state": "published",
        "format": "html",
        "reblog_key": "4Yh4DL6m",
        "tags": [
            "jonsa",
            "jon snow",
            "Sansa Stark",
            "jonsansaweek",
            "jonsansasource",
            "jonsa fanfiction",
            "jon snow fanfiction",
            "sansa stark fanfiction",
            "day 1: Sansa's POV or Jon's POV",
            "make that and"
        ],
        "short_url": "https://tmblr.co/Z8dw4y2d0R9cD",
        "summary": "FIRST KISS",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 24,
        "title": "FIRST KISS",
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"280\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/a10726c10dd8bfad659d664dab13f412/tumblr_inline_ph0lcgy6y51qdb55z_1280.gif\" data-orig-height=\"280\" data-orig-width=\"500\"/></figure><blockquote><p><b><small>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>&rsquo;s JonSansaWeek Day 1: Sansa&rsquo;s POV or Jon&rsquo;S POV<br/></small></b></p><p><b><small><i>This little snippet has no setting and no certain universe. It&rsquo;s just their very first kiss, first described through Sansa&rsquo;s eyes and then through Jon&rsquo;s.<br/></i></small></b></p></blockquote><p><b><i>Sansa&rsquo;s POV</i></b></p><p>Sansa had read a thousand books about this moment, but somehow she was not sure if any of those books had really managed to capture how it truly felt. She felt a certain kind of pleasant nervousness in her stomach. Her skin tingled wherever his hands and body touched her and her heart was beating rapidly in her chest with longing excitement.</p><p>“Are you sure you want this?” Jon spoke softly and Sansa let out a deep breath, cursing because he dared to make her wait even one more moment, one more second. </p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. “I&rsquo;ve never been this sure about anything, Jon.” </p><p>In literally every book Sansa had ever read, the girl had been standing on the tips of her toes right now, but Sansa didn’t need to do so. She was glad that she was wearing her flats tonight instead of the high heels Margaery had tried to make her wear.</p><p>“You look beautiful tonight.” Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest, if that was even possible. </p><p>“Jon!” Sansa raised her voice while she closed her eyes. “Can you stop talking, please?” She licked her dry lips and pressed her forehead to his. “We’ve talked more than enough during the last few weeks. I want this. And I want this now.”</p><p>Jon curled his lips up into a smile and then his nose brushed hers. </p><!-- more --><p>She was not sure if he did it on purpose, if he knew how badly she wanted this, how deeply she was longing for this. For weeks she had wondered if Jon really felt the same for her as she felt for him and tonight she had not been capable of stopping herself anymore. </p><p>She had just asked him. She had just asked him if he thought about her day and night, just like she always seemed to be thinking about him these days. She had just asked him if he dreamed about her, just like all her dreams now seemed to be about him. She had just asked him if he sometimes wondered how it would be to kiss her, to touch her, to make love under a blanket of stars. </p><p>And he had said yes. His cheeks had reddened and pearls of sweat had covered his forehead. Sansa had not really understood why. She had been the one taking a risk. She had been the one taking the first step. </p><p>And now she was waiting for him to take the next one. And the longer it took, the more frustrated and excited she got.</p><p>When she felt his breath warming her waiting lips she closed her eyes and her arms circled around his neck. After what seemed to be another eternity his lips finally found hers.</p><p>They were surprisingly soft and tender and his kiss was slow and a little reluctantly.</p><p>But Sansa wanted more. Sansa needed more. And while her hands went through his dark curls, her lips parted to invite his tongue in.</p><p><b><i><br/></i></b></p><p><b><i>Jon&rsquo;s POV</i></b></p><p>Jon had kissed girls before. Most of the kisses hadn’t really meant much, apart from that one time he thought he had been in love. He was not sure what he and Ygritte had really felt for each other, but every time he looked at Sansa now he was certain it had not been love. This was love. What he felt now was love. And he was terrified that somehow he would break it.<br/></p><p>“Are you sure you want this?” He spoke softly, dreading the moment. Somehow he was still afraid that at some point she’d discover that she could get someone much better and much smarter than him.</p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. “I&rsquo;ve never been this sure about anything, Jon.”</p><p>He wasn’t sure why he couldn’t really believe her. He wasn&rsquo;t sure why there was always a voice in the back of his mind telling him that this was just a dream, that this was temporary, that somehow he’d find a way to ruin it, to break it. That somehow he wouldn’t get the girl.</p><p>“You look beautiful tonight.” Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest because he was afraid she would slip through his fingers if he wouldn’t.</p><p>“Jon!” Sansa raised her voice while she closed her eyes. “Can you stop talking, please?” She licked her lips and pressed her warm forehead to his. “We’ve talked more than enough during the last few weeks. I want this. And I want this now.”</p><p>A strange, but pleasant warmth spread through his body. He curled his lips up into a smile and he let his nose brush hers. He didn’t know why he was so terrified of just kissing her. He didn’t know why he was hesitating. He didn’t know why he couldn’t just lean in and do it.</p><p>He had never been someone’s first choice. He had never been someone’s everything and someone’s world. And he had never dared to make someone else his first choice, his everything, his world. He knew all too well how things could change all of a sudden. </p><p>Friends could become foes within an instant. Those closest to you could eventually betray you. Trusting someone too much, could eventually lead to misery and pain.</p><p>Somehow he didn’t dare to fully believe Sansa when she had told him that she thought about him all day, that she dreamed about him at night, that she had fantasized about kissing him and loving him. He knew he didn’t have a reason to doubt her, but it was still hard to believe that someone as amazing and beautiful as her, would fall for someone like him.</p><p>Maybe he would somehow start believing it when he did kiss her and when she would kiss him back. </p><p>He leaned in and waited a few more seconds before he pressed his lips to hers. Her arms circled around his neck, but in the back of his mind Jon could still hear a voice telling him that if he’d go any further, the dream would explode and he’d wake up. </p><p>But Sansa’s hands went through his hair and the moment she parted her lips to invite his tongue in he finally realized that she meant it.</p><p>She really meant it.</p><p>And eagerly, giving into his own hunger and desire eventually, he accepted her invitation.</p>",
        "body_abstract": "\n<figure class=\"tmblr-full\" data-orig-height=\"280\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/a10726c10dd8bfad659d664dab13f412/tumblr_inline_ph0lcgy6y51qdb55z_1280.gif\" data-orig-height=\"280\" data-orig-width=\"500\"></figure><blockquote>\n<p><b><small>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>&rsquo;s JonSansaWeek Day 1: Sansa&rsquo;s POV or Jon&rsquo;S POV<br></small></b></p>\n<p><b><small><i>This little snippet has no setting and no certain universe. It&rsquo;s just their very first kiss, first described through Sansa&rsquo;s eyes and then through Jon&rsquo;s.<br></i></small></b></p>\n</blockquote>\n<p><b><i>Sansa&rsquo;s POV</i></b></p>\n<p>Sansa had read a thousand books about this moment, but somehow she was not sure if any of those books had really managed to capture how it truly felt. She felt a certain kind of pleasant nervousness in her stomach. Her skin tingled wherever his hands and body touched her and her heart was beating rapidly in her chest with longing excitement.</p>\n<p>&ldquo;Are you sure you want this?&rdquo; Jon spoke softly and Sansa let out a deep breath, cursing because he dared to make her wait even one more moment, one more second. </p>\n<p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. &ldquo;I&rsquo;ve never been this sure about anything, Jon.&rdquo; </p>\n<p>In literally every book Sansa had ever read, the girl had been standing on the tips of her toes right now, but Sansa didn&rsquo;t need to do so. She was glad that she was wearing her flats tonight instead of the high heels Margaery had tried to make her wear.</p>\n<p>&ldquo;You look beautiful tonight.&rdquo; Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest, if that was even possible. </p>\n<p>&ldquo;Jon!&rdquo; Sansa raised her voice while she closed her eyes. &ldquo;Can you stop talking, please?&rdquo; She licked her dry lips and pressed her forehead to his. &ldquo;We&rsquo;ve talked more than enough during the last few weeks. I want this. And I want this now.&rdquo;</p>\n<p>Jon curled his lips up into a smile and then his nose brushed hers. </p>\n",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"280\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/a10726c10dd8bfad659d664dab13f412/tumblr_inline_ph0lcgy6y51qdb55z_1280.gif\" data-orig-height=\"280\" data-orig-width=\"500\"></figure><blockquote><p><b><small>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>’s JonSansaWeek Day 1: Sansa’s POV or Jon’S POV<br></small></b></p><p><b><small><i>This little snippet has no setting and no certain universe. It’s just their very first kiss, first described through Sansa’s eyes and then through Jon’s.<br></i></small></b></p></blockquote><p><b><i>Sansa’s POV</i></b></p><p>Sansa had read a thousand books about this moment, but somehow she was not sure if any of those books had really managed to capture how it truly felt. She felt a certain kind of pleasant nervousness in her stomach. Her skin tingled wherever his hands and body touched her and her heart was beating rapidly in her chest with longing excitement.</p><p>“Are you sure you want this?” Jon spoke softly and Sansa let out a deep breath, cursing because he dared to make her wait even one more moment, one more second. </p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. “I’ve never been this sure about anything, Jon.” </p><p>In literally every book Sansa had ever read, the girl had been standing on the tips of her toes right now, but Sansa didn’t need to do so. She was glad that she was wearing her flats tonight instead of the high heels Margaery had tried to make her wear.</p><p>“You look beautiful tonight.” Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest, if that was even possible. </p><p>“Jon!” Sansa raised her voice while she closed her eyes. “Can you stop talking, please?” She licked her dry lips and pressed her forehead to his. “We’ve talked more than enough during the last few weeks. I want this. And I want this now.”</p><p>Jon curled his lips up into a smile and then his nose brushed hers. </p>[[MORE]]<p>She was not sure if he did it on purpose, if he knew how badly she wanted this, how deeply she was longing for this. For weeks she had wondered if Jon really felt the same for her as she felt for him and tonight she had not been capable of stopping herself anymore. </p><p>She had just asked him. She had just asked him if he thought about her day and night, just like she always seemed to be thinking about him these days. She had just asked him if he dreamed about her, just like all her dreams now seemed to be about him. She had just asked him if he sometimes wondered how it would be to kiss her, to touch her, to make love under a blanket of stars. </p><p>And he had said yes. His cheeks had reddened and pearls of sweat had covered his forehead. Sansa had not really understood why. She had been the one taking a risk. She had been the one taking the first step. </p><p>And now she was waiting for him to take the next one. And the longer it took, the more frustrated and excited she got.</p><p>When she felt his breath warming her waiting lips she closed her eyes and her arms circled around his neck. After what seemed to be another eternity his lips finally found hers.</p><p>They were surprisingly soft and tender and his kiss was slow and a little reluctantly.</p><p>But Sansa wanted more. Sansa needed more. And while her hands went through his dark curls, her lips parted to invite his tongue in.</p><p><b><i><br></i></b></p><p><b><i>Jon’s POV</i></b></p><p>Jon had kissed girls before. Most of the kisses hadn’t really meant much, apart from that one time he thought he had been in love. He was not sure what he and Ygritte had really felt for each other, but every time he looked at Sansa now he was certain it had not been love. This was love. What he felt now was love. And he was terrified that somehow he would break it.<br></p><p>“Are you sure you want this?” He spoke softly, dreading the moment. Somehow he was still afraid that at some point she’d discover that she could get someone much better and much smarter than him.</p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. “I’ve never been this sure about anything, Jon.”</p><p>He wasn’t sure why he couldn’t really believe her. He wasn’t sure why there was always a voice in the back of his mind telling him that this was just a dream, that this was temporary, that somehow he’d find a way to ruin it, to break it. That somehow he wouldn’t get the girl.</p><p>“You look beautiful tonight.” Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest because he was afraid she would slip through his fingers if he wouldn’t.</p><p>“Jon!” Sansa raised her voice while she closed her eyes. “Can you stop talking, please?” She licked her lips and pressed her warm forehead to his. “We’ve talked more than enough during the last few weeks. I want this. And I want this now.”</p><p>A strange, but pleasant warmth spread through his body. He curled his lips up into a smile and he let his nose brush hers. He didn’t know why he was so terrified of just kissing her. He didn’t know why he was hesitating. He didn’t know why he couldn’t just lean in and do it.</p><p>He had never been someone’s first choice. He had never been someone’s everything and someone’s world. And he had never dared to make someone else his first choice, his everything, his world. He knew all too well how things could change all of a sudden. </p><p>Friends could become foes within an instant. Those closest to you could eventually betray you. Trusting someone too much, could eventually lead to misery and pain.</p><p>Somehow he didn’t dare to fully believe Sansa when she had told him that she thought about him all day, that she dreamed about him at night, that she had fantasized about kissing him and loving him. He knew he didn’t have a reason to doubt her, but it was still hard to believe that someone as amazing and beautiful as her, would fall for someone like him.</p><p>Maybe he would somehow start believing it when he did kiss her and when she would kiss him back. </p><p>He leaned in and waited a few more seconds before he pressed his lips to hers. Her arms circled around his neck, but in the back of his mind Jon could still hear a voice telling him that if he’d go any further, the dream would explode and he’d wake up. </p><p>But Sansa’s hands went through his hair and the moment she parted her lips to invite his tongue in he finally realized that she meant it.</p><p>She really meant it.</p><p>And eagerly, giving into his own hunger and desire eventually, he accepted her invitation.</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "acourtofhopeanddreams",
                    "active": true,
                    "theme": {
                        "header_full_width": 600,
                        "header_full_height": 300,
                        "header_focus_width": 533,
                        "header_focus_height": 300,
                        "avatar_shape": "square",
                        "background_color": "#d11d1d",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,566,300,33",
                        "header_image": "https://static.tumblr.com/7782d7a0e4100830708f02baf3f0e357/myrfjlp/iFbpqvvuo/tumblr_static_cq37wlgbuqgcs0w00o4s800o0.gif",
                        "header_image_focused": "https://static.tumblr.com/7782d7a0e4100830708f02baf3f0e357/myrfjlp/i68pqvvus/tumblr_static_tumblr_static_cq37wlgbuqgcs0w00o4s800o0_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/7782d7a0e4100830708f02baf3f0e357/myrfjlp/iFbpqvvuo/tumblr_static_cq37wlgbuqgcs0w00o4s800o0_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#fcb68f",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#fcb68f",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179322001805"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"280\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/a10726c10dd8bfad659d664dab13f412/tumblr_inline_ph0lcgy6y51qdb55z_1280.gif\" data-orig-height=\"280\" data-orig-width=\"500\"></figure><blockquote><p><b><small>Written for <a class=\"tumblelog\" href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>’s JonSansaWeek Day 1: Sansa’s POV or Jon’S POV<br></small></b></p><p><b><small><i>This little snippet has no setting and no certain universe. It’s just their very first kiss, first described through Sansa’s eyes and then through Jon’s.<br></i></small></b></p></blockquote><p><b><i>Sansa’s POV</i></b></p><p>Sansa had read a thousand books about this moment, but somehow she was not sure if any of those books had really managed to capture how it truly felt. She felt a certain kind of pleasant nervousness in her stomach. Her skin tingled wherever his hands and body touched her and her heart was beating rapidly in her chest with longing excitement.</p><p>“Are you sure you want this?” Jon spoke softly and Sansa let out a deep breath, cursing because he dared to make her wait even one more moment, one more second. </p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. “I’ve never been this sure about anything, Jon.” </p><p>In literally every book Sansa had ever read, the girl had been standing on the tips of her toes right now, but Sansa didn’t need to do so. She was glad that she was wearing her flats tonight instead of the high heels Margaery had tried to make her wear.</p><p>“You look beautiful tonight.” Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest, if that was even possible. </p><p>“Jon!” Sansa raised her voice while she closed her eyes. “Can you stop talking, please?” She licked her dry lips and pressed her forehead to his. “We’ve talked more than enough during the last few weeks. I want this. And I want this now.”</p><p>Jon curled his lips up into a smile and then his nose brushed hers. </p>[[MORE]]<p>She was not sure if he did it on purpose, if he knew how badly she wanted this, how deeply she was longing for this. For weeks she had wondered if Jon really felt the same for her as she felt for him and tonight she had not been capable of stopping herself anymore. </p><p>She had just asked him. She had just asked him if he thought about her day and night, just like she always seemed to be thinking about him these days. She had just asked him if he dreamed about her, just like all her dreams now seemed to be about him. She had just asked him if he sometimes wondered how it would be to kiss her, to touch her, to make love under a blanket of stars. </p><p>And he had said yes. His cheeks had reddened and pearls of sweat had covered his forehead. Sansa had not really understood why. She had been the one taking a risk. She had been the one taking the first step. </p><p>And now she was waiting for him to take the next one. And the longer it took, the more frustrated and excited she got.</p><p>When she felt his breath warming her waiting lips she closed her eyes and her arms circled around his neck. After what seemed to be another eternity his lips finally found hers.</p><p>They were surprisingly soft and tender and his kiss was slow and a little reluctantly.</p><p>But Sansa wanted more. Sansa needed more. And while her hands went through his dark curls, her lips parted to invite his tongue in.</p><p><b><i><br></i></b></p><p><b><i>Jon’s POV</i></b></p><p>Jon had kissed girls before. Most of the kisses hadn’t really meant much, apart from that one time he thought he had been in love. He was not sure what he and Ygritte had really felt for each other, but every time he looked at Sansa now he was certain it had not been love. This was love. What he felt now was love. And he was terrified that somehow he would break it.<br></p><p>“Are you sure you want this?” He spoke softly, dreading the moment. Somehow he was still afraid that at some point she’d discover that she could get someone much better and much smarter than him.</p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. “I’ve never been this sure about anything, Jon.”</p><p>He wasn’t sure why he couldn’t really believe her. He wasn’t sure why there was always a voice in the back of his mind telling him that this was just a dream, that this was temporary, that somehow he’d find a way to ruin it, to break it. That somehow he wouldn’t get the girl.</p><p>“You look beautiful tonight.” Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest because he was afraid she would slip through his fingers if he wouldn’t.</p><p>“Jon!” Sansa raised her voice while she closed her eyes. “Can you stop talking, please?” She licked her lips and pressed her warm forehead to his. “We’ve talked more than enough during the last few weeks. I want this. And I want this now.”</p><p>A strange, but pleasant warmth spread through his body. He curled his lips up into a smile and he let his nose brush hers. He didn’t know why he was so terrified of just kissing her. He didn’t know why he was hesitating. He didn’t know why he couldn’t just lean in and do it.</p><p>He had never been someone’s first choice. He had never been someone’s everything and someone’s world. And he had never dared to make someone else his first choice, his everything, his world. He knew all too well how things could change all of a sudden. </p><p>Friends could become foes within an instant. Those closest to you could eventually betray you. Trusting someone too much, could eventually lead to misery and pain.</p><p>Somehow he didn’t dare to fully believe Sansa when she had told him that she thought about him all day, that she dreamed about him at night, that she had fantasized about kissing him and loving him. He knew he didn’t have a reason to doubt her, but it was still hard to believe that someone as amazing and beautiful as her, would fall for someone like him.</p><p>Maybe he would somehow start believing it when he did kiss her and when she would kiss him back. </p><p>He leaned in and waited a few more seconds before he pressed his lips to hers. Her arms circled around his neck, but in the back of his mind Jon could still hear a voice telling him that if he’d go any further, the dream would explode and he’d wake up. </p><p>But Sansa’s hands went through his hair and the moment she parted her lips to invite his tongue in he finally realized that she meant it.</p><p>She really meant it.</p><p>And eagerly, giving into his own hunger and desire eventually, he accepted her invitation.</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/a10726c10dd8bfad659d664dab13f412/tumblr_inline_ph0lcgy6y51qdb55z_1280.gif\" class=\"\"/></figure><blockquote><p><b><small>Written for <a href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>&rsquo;s JonSansaWeek Day 1: Sansa&rsquo;s POV or Jon&rsquo;S POV<br /></small></b></p><p><b><small><i>This little snippet has no setting and no certain universe. It&rsquo;s just their very first kiss, first described through Sansa&rsquo;s eyes and then through Jon&rsquo;s.<br /></i></small></b></p></blockquote><p><b><i>Sansa&rsquo;s POV</i></b></p><p>Sansa had read a thousand books about this moment, but somehow she was not sure if any of those books had really managed to capture how it truly felt. She felt a certain kind of pleasant nervousness in her stomach. Her skin tingled wherever his hands and body touched her and her heart was beating rapidly in her chest with longing excitement.</p><p>&ldquo;Are you sure you want this?&rdquo; Jon spoke softly and Sansa let out a deep breath, cursing because he dared to make her wait even one more moment, one more second. </p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. &ldquo;I&rsquo;ve never been this sure about anything, Jon.&rdquo; </p><p>In literally every book Sansa had ever read, the girl had been standing on the tips of her toes right now, but Sansa didn&rsquo;t need to do so. She was glad that she was wearing her flats tonight instead of the high heels Margaery had tried to make her wear.</p><p>&ldquo;You look beautiful tonight.&rdquo; Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest, if that was even possible. </p><p>&ldquo;Jon!&rdquo; Sansa raised her voice while she closed her eyes. &ldquo;Can you stop talking, please?&rdquo; She licked her dry lips and pressed her forehead to his. &ldquo;We&rsquo;ve talked more than enough during the last few weeks. I want this. And I want this now.&rdquo;</p><p>Jon curled his lips up into a smile and then his nose brushed hers. </p><p>She was not sure if he did it on purpose, if he knew how badly she wanted this, how deeply she was longing for this. For weeks she had wondered if Jon really felt the same for her as she felt for him and tonight she had not been capable of stopping herself anymore. </p><p>She had just asked him. She had just asked him if he thought about her day and night, just like she always seemed to be thinking about him these days. She had just asked him if he dreamed about her, just like all her dreams now seemed to be about him. She had just asked him if he sometimes wondered how it would be to kiss her, to touch her, to make love under a blanket of stars. </p><p>And he had said yes. His cheeks had reddened and pearls of sweat had covered his forehead. Sansa had not really understood why. She had been the one taking a risk. She had been the one taking the first step. </p><p>And now she was waiting for him to take the next one. And the longer it took, the more frustrated and excited she got.</p><p>When she felt his breath warming her waiting lips she closed her eyes and her arms circled around his neck. After what seemed to be another eternity his lips finally found hers.</p><p>They were surprisingly soft and tender and his kiss was slow and a little reluctantly.</p><p>But Sansa wanted more. Sansa needed more. And while her hands went through his dark curls, her lips parted to invite his tongue in.</p><p><b><i><br /></i></b></p><p><b><i>Jon&rsquo;s POV</i></b></p><p>Jon had kissed girls before. Most of the kisses hadn&rsquo;t really meant much, apart from that one time he thought he had been in love. He was not sure what he and Ygritte had really felt for each other, but every time he looked at Sansa now he was certain it had not been love. This was love. What he felt now was love. And he was terrified that somehow he would break it.<br /></p><p>&ldquo;Are you sure you want this?&rdquo; He spoke softly, dreading the moment. Somehow he was still afraid that at some point she&rsquo;d discover that she could get someone much better and much smarter than him.</p><p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. &ldquo;I&rsquo;ve never been this sure about anything, Jon.&rdquo;</p><p>He wasn&rsquo;t sure why he couldn&rsquo;t really believe her. He wasn&rsquo;t sure why there was always a voice in the back of his mind telling him that this was just a dream, that this was temporary, that somehow he&rsquo;d find a way to ruin it, to break it. That somehow he wouldn&rsquo;t get the girl.</p><p>&ldquo;You look beautiful tonight.&rdquo; Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest because he was afraid she would slip through his fingers if he wouldn&rsquo;t.</p><p>&ldquo;Jon!&rdquo; Sansa raised her voice while she closed her eyes. &ldquo;Can you stop talking, please?&rdquo; She licked her lips and pressed her warm forehead to his. &ldquo;We&rsquo;ve talked more than enough during the last few weeks. I want this. And I want this now.&rdquo;</p><p>A strange, but pleasant warmth spread through his body. He curled his lips up into a smile and he let his nose brush hers. He didn&rsquo;t know why he was so terrified of just kissing her. He didn&rsquo;t know why he was hesitating. He didn&rsquo;t know why he couldn&rsquo;t just lean in and do it.</p><p>He had never been someone&rsquo;s first choice. He had never been someone&rsquo;s everything and someone&rsquo;s world. And he had never dared to make someone else his first choice, his everything, his world. He knew all too well how things could change all of a sudden. </p><p>Friends could become foes within an instant. Those closest to you could eventually betray you. Trusting someone too much, could eventually lead to misery and pain.</p><p>Somehow he didn&rsquo;t dare to fully believe Sansa when she had told him that she thought about him all day, that she dreamed about him at night, that she had fantasized about kissing him and loving him. He knew he didn&rsquo;t have a reason to doubt her, but it was still hard to believe that someone as amazing and beautiful as her, would fall for someone like him.</p><p>Maybe he would somehow start believing it when he did kiss her and when she would kiss him back. </p><p>He leaned in and waited a few more seconds before he pressed his lips to hers. Her arms circled around his neck, but in the back of his mind Jon could still hear a voice telling him that if he&rsquo;d go any further, the dream would explode and he&rsquo;d wake up. </p><p>But Sansa&rsquo;s hands went through his hair and the moment she parted her lips to invite his tongue in he finally realized that she meant it.</p><p>She really meant it.</p><p>And eagerly, giving into his own hunger and desire eventually, he accepted her invitation.</p></p>",
                "content_abstract": "<p>\n<figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/a10726c10dd8bfad659d664dab13f412/tumblr_inline_ph0lcgy6y51qdb55z_1280.gif\" class=\"\"/></figure>\n<blockquote>\n<p><b><small>Written for <a href=\"https://tmblr.co/m-ZmDYQwYV4geqYzioot4aw\">@jonsansasource</a>&rsquo;s JonSansaWeek Day 1: Sansa&rsquo;s POV or Jon&rsquo;S POV<br /></small></b></p>\n<p><b><small><i>This little snippet has no setting and no certain universe. It&rsquo;s just their very first kiss, first described through Sansa&rsquo;s eyes and then through Jon&rsquo;s.<br /></i></small></b></p>\n</blockquote>\n<p><b><i>Sansa&rsquo;s POV</i></b></p>\n<p>Sansa had read a thousand books about this moment, but somehow she was not sure if any of those books had really managed to capture how it truly felt. She felt a certain kind of pleasant nervousness in her stomach. Her skin tingled wherever his hands and body touched her and her heart was beating rapidly in her chest with longing excitement.</p>\n<p>&ldquo;Are you sure you want this?&rdquo; Jon spoke softly and Sansa let out a deep breath, cursing because he dared to make her wait even one more moment, one more second. </p>\n<p>She pressed the palm of her hand to his stubbled cheek and nodded firmly. &ldquo;I&rsquo;ve never been this sure about anything, Jon.&rdquo; </p>\n<p>In literally every book Sansa had ever read, the girl had been standing on the tips of her toes right now, but Sansa didn&rsquo;t need to do so. She was glad that she was wearing her flats tonight instead of the high heels Margaery had tried to make her wear.</p>\n<p>&ldquo;You look beautiful tonight.&rdquo; Jon tucked a strand of strawberry blond hair behind her ear and he pressed her tighter to his chest, if that was even possible. </p>\n<p>&ldquo;Jon!&rdquo; Sansa raised her voice while she closed her eyes. &ldquo;Can you stop talking, please?&rdquo; She licked her dry lips and pressed her forehead to his. &ldquo;We&rsquo;ve talked more than enough during the last few weeks. I want this. And I want this now.&rdquo;</p>\n<p>Jon curled his lips up into a smile and then his nose brushed hers. </p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "thronesdragons",
        "blog": {
            "name": "thronesdragons",
            "title": "Game of Thrones",
            "description": "<p><span style=\"color: #00; font-family: Helvetica, Arial, sans-serif; font-size: 12px;\"><a href=\"https://thronesdragons.tumblr.com/\">Game of Thrones (GOT)</a> Fans : Pictures, Art, Memes and More!</span></p>",
            "url": "https://thronesdragons.tumblr.com/",
            "uuid": "t:kfrbcbINX-athn6CZWMlWQ",
            "updated": 1560200770
        },
        "id": 179320778192,
        "post_url": "https://thronesdragons.tumblr.com/post/179320778192/more-well-he-is-wrong",
        "slug": "more-well-he-is-wrong",
        "date": "2018-10-22 18:38:37 GMT",
        "timestamp": 1540233517,
        "state": "published",
        "format": "html",
        "reblog_key": "5r1hBJ1b",
        "tags": [
            "Game of Thrones",
            "Got",
            "Jon Snow",
            "Targaryen",
            "Stark",
            "Westeros",
            "Dragons"
        ],
        "short_url": "https://tmblr.co/Zj9jIc2d0MUtG",
        "summary": "[[MORE]] Well he is wrong 😐\n.\n.\n.\n #gameofthrones #got #hbo #housestark #stark #winteriscoming",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 32,
        "caption": "<p><!-- more --> Well he is wrong 😐<br/>\n.<br/>\n.<br/>\n.<br/>\n #gameofthrones #got #hbo #housestark #stark #winteriscoming</p>",
        "caption_abstract": "<p></p>",
        "reblog": {
            "comment": "<p>[[MORE]] Well he is wrong 😐<br>\n.<br>\n.<br>\n.<br>\n #gameofthrones #got #hbo #housestark #stark #winteriscoming</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thronesdragons",
                    "active": true,
                    "theme": {
                        "header_full_width": 1063,
                        "header_full_height": 354,
                        "header_focus_width": 621,
                        "header_focus_height": 349,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c.jpg",
                        "header_image_focused": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/CZ2oyee5j/tumblr_static_tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179320778192"
                },
                "content_raw": "<p>[[MORE]] Well he is wrong 😐<br>\n.<br>\n.<br>\n.<br>\n #gameofthrones #got #hbo #housestark #stark #winteriscoming</p>",
                "content": "<p> Well he is wrong &#128528;<br />\n.<br />\n.<br />\n.<br />\n #gameofthrones #got #hbo #housestark #stark #winteriscoming</p>",
                "content_abstract": "",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://thronesdragons.tumblr.com/image/179320778192",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_540.jpg",
                    "width": 532,
                    "height": 532
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_540.jpg",
                        "width": 532,
                        "height": 532
                    },
                    {
                        "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/b187c88b0425d6879b8200aaef3a5991/tumblr_ph0jsd2GFi1wfiwxso1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "textsfrommyfandoms",
        "blog": {
            "name": "textsfrommyfandoms",
            "title": "Texts From My Fandoms",
            "description": "Texts From Last Night combined with different shows/movies.\nSee the \"Message\" Tab for more info",
            "url": "https://textsfrommyfandoms.tumblr.com/",
            "uuid": "t:H4CY7TKyvueCnK0ae31AoA",
            "updated": 1540576837
        },
        "id": 179319765849,
        "post_url": "https://textsfrommyfandoms.tumblr.com/post/179319765849",
        "slug": "",
        "date": "2018-10-22 18:00:32 GMT",
        "timestamp": 1540231232,
        "state": "published",
        "format": "html",
        "reblog_key": "j2oXyrCr",
        "tags": [
            "texts from the iron throne",
            "game of thrones",
            "daenerys targaryen",
            "jon snow",
            "937",
            "just the texts",
            "sara"
        ],
        "short_url": "https://tmblr.co/ZN2lBn2d0IdjP",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 18,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "photoset_layout": "11",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/28d66cb56f1259a454fe10b927714fe8/tumblr_pgx3u3uESF1tf36ngo2_1280.jpg",
                    "width": 1280,
                    "height": 720
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/28d66cb56f1259a454fe10b927714fe8/tumblr_pgx3u3uESF1tf36ngo2_1280.jpg",
                        "width": 1280,
                        "height": 720
                    },
                    {
                        "url": "https://66.media.tumblr.com/28d66cb56f1259a454fe10b927714fe8/tumblr_pgx3u3uESF1tf36ngo2_640.jpg",
                        "width": 640,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/28d66cb56f1259a454fe10b927714fe8/tumblr_pgx3u3uESF1tf36ngo2_540.jpg",
                        "width": 540,
                        "height": 304
                    },
                    {
                        "url": "https://66.media.tumblr.com/28d66cb56f1259a454fe10b927714fe8/tumblr_pgx3u3uESF1tf36ngo2_500.jpg",
                        "width": 500,
                        "height": 281
                    },
                    {
                        "url": "https://66.media.tumblr.com/28d66cb56f1259a454fe10b927714fe8/tumblr_pgx3u3uESF1tf36ngo2_400.jpg",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/28d66cb56f1259a454fe10b927714fe8/tumblr_pgx3u3uESF1tf36ngo2_250.jpg",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/28d66cb56f1259a454fe10b927714fe8/tumblr_pgx3u3uESF1tf36ngo2_100.jpg",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/28d66cb56f1259a454fe10b927714fe8/tumblr_pgx3u3uESF1tf36ngo2_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/937d865fc181510ed7276c36f21dde84/tumblr_pgx3u3uESF1tf36ngo1_1280.jpg",
                    "width": 850,
                    "height": 559
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/937d865fc181510ed7276c36f21dde84/tumblr_pgx3u3uESF1tf36ngo1_1280.jpg",
                        "width": 850,
                        "height": 559
                    },
                    {
                        "url": "https://66.media.tumblr.com/937d865fc181510ed7276c36f21dde84/tumblr_pgx3u3uESF1tf36ngo1_640.jpg",
                        "width": 640,
                        "height": 421
                    },
                    {
                        "url": "https://66.media.tumblr.com/937d865fc181510ed7276c36f21dde84/tumblr_pgx3u3uESF1tf36ngo1_540.jpg",
                        "width": 540,
                        "height": 355
                    },
                    {
                        "url": "https://66.media.tumblr.com/937d865fc181510ed7276c36f21dde84/tumblr_pgx3u3uESF1tf36ngo1_500.jpg",
                        "width": 500,
                        "height": 329
                    },
                    {
                        "url": "https://66.media.tumblr.com/937d865fc181510ed7276c36f21dde84/tumblr_pgx3u3uESF1tf36ngo1_400.jpg",
                        "width": 400,
                        "height": 263
                    },
                    {
                        "url": "https://66.media.tumblr.com/937d865fc181510ed7276c36f21dde84/tumblr_pgx3u3uESF1tf36ngo1_250.jpg",
                        "width": 250,
                        "height": 164
                    },
                    {
                        "url": "https://66.media.tumblr.com/937d865fc181510ed7276c36f21dde84/tumblr_pgx3u3uESF1tf36ngo1_100.jpg",
                        "width": 100,
                        "height": 66
                    },
                    {
                        "url": "https://66.media.tumblr.com/937d865fc181510ed7276c36f21dde84/tumblr_pgx3u3uESF1tf36ngo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "reddragon1995",
        "blog": {
            "name": "reddragon1995",
            "title": "Jonerys Snowstorm Of House Stargaryen",
            "description": "<p>HE LOVED HER AND SHE LOVED HIM</p>",
            "url": "https://reddragon1995.tumblr.com/",
            "uuid": "t:cWe92pMaP_5C3iTUtFsy9Q",
            "updated": 1561747850
        },
        "id": 179319733745,
        "post_url": "https://reddragon1995.tumblr.com/post/179319733745/prince-rhaegar-is-a-snack-and-a-half",
        "slug": "prince-rhaegar-is-a-snack-and-a-half",
        "date": "2018-10-22 17:59:36 GMT",
        "timestamp": 1540231176,
        "state": "published",
        "format": "html",
        "reblog_key": "cLHNDE07",
        "tags": [
            "game of thrones",
            "jon snow",
            "rhaegar targaryen",
            "wilf scolding",
            "is really hot",
            "i would dip him in honey",
            "whoa baby"
        ],
        "short_url": "https://tmblr.co/ZK_YuY2d0IVtn",
        "summary": "Prince Rhaegar is a Snack and a Half",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 7,
        "title": null,
        "body": "<p class=\"npf_quote\" data-npf='{\"subtype\":\"quote\"}'>Prince Rhaegar is a Snack and a Half</p><h2>If you need proof, if you had any doubt, and you have Hulu, stream “Bees Make Honey.” I had no idea what was going on because I couldn’t stop looking at him. He’s delicious. Stay for the end credits. You’ll see from where Jon gets his abs.</h2>",
        "reblog": {
            "comment": "<p><p class=\"npf_quote\" data-npf='{\"subtype\":\"quote\"}'>Prince Rhaegar is a Snack and a Half</p><h2>If you need proof, if you had any doubt, and you have Hulu, stream “Bees Make Honey.” I had no idea what was going on because I couldn’t stop looking at him. He’s delicious. Stay for the end credits. You’ll see from where Jon gets his abs.</h2></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "reddragon1995",
                    "active": true,
                    "theme": {
                        "header_full_width": 1106,
                        "header_full_height": 1186,
                        "header_focus_width": 947,
                        "header_focus_height": 532,
                        "avatar_shape": "circle",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "161,1015,693,68",
                        "header_image": "https://static.tumblr.com/5b3bea97cfe377b6746125ae3523fe5b/wzjbbhs/phZpek311/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/5b3bea97cfe377b6746125ae3523fe5b/wzjbbhs/Kqupek313/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/5b3bea97cfe377b6746125ae3523fe5b/wzjbbhs/phZpek311/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FF1515",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#A20000",
                        "title_font": "Quadrat",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179319733745"
                },
                "content_raw": "<p><p class=\"npf_quote\" data-npf='{\"subtype\":\"quote\"}'>Prince Rhaegar is a Snack and a Half</p><h2>If you need proof, if you had any doubt, and you have Hulu, stream “Bees Make Honey.” I had no idea what was going on because I couldn’t stop looking at him. He’s delicious. Stay for the end credits. You’ll see from where Jon gets his abs.</h2></p>",
                "content": "<p><p class=\"npf_quote\" data-npf=\"{&quot;subtype&quot;:&quot;quote&quot;}\">Prince Rhaegar is a Snack and a Half</p><h2>If you need proof, if you had any doubt, and you have Hulu, stream &ldquo;Bees Make Honey.&rdquo; I had no idea what was going on because I couldn&rsquo;t stop looking at him. He&rsquo;s delicious. Stay for the end credits. You&rsquo;ll see from where Jon gets his abs.</h2></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "arin-arryn",
        "blog": {
            "name": "arin-arryn",
            "title": "",
            "description": "Game of Thrones | <a href=\"https://arin-arryn.tumblr.com/tagged/jonsa\">JONSA</a> | <a href=\"https://arin-arryn.tumblr.com/tagged/dark!dany\">Dark Dany</a> | <a href=\"https://arin-arryn.tumblr.com/tagged/cat\">Cat</a> | <a href=\"https://arin-arryn.tumblr.com/tagged/marvel\">Marvel</a>/<a href=\"https://arin-arryn.tumblr.com/tagged/mcu\">MCU</a> | Random TV show/movie | <a href=\"https://arin-arryn.tumblr.com/tagged/originalpost\">Sub-par Content Creator</a> | <a href=\"https://arin-arryn.tumblr.com/tagged/the-sims-2\">The Sims 2</a> | ESL",
            "url": "https://arin-arryn.tumblr.com/",
            "uuid": "t:OeBD9VJhpcbA2Y90u7vJhA",
            "updated": 1561732785
        },
        "id": 179316886956,
        "post_url": "https://arin-arryn.tumblr.com/post/179316886956/he-was-a-warrior-with-a-fighters-mind-and-she-was",
        "slug": "he-was-a-warrior-with-a-fighters-mind-and-she-was",
        "date": "2018-10-22 16:11:39 GMT",
        "timestamp": 1540224699,
        "state": "published",
        "format": "html",
        "reblog_key": "7SpEncIX",
        "tags": [
            "jonsa",
            "jon x sansa",
            "jon snow",
            "sansa stark",
            "actually jonsa",
            "gotjonsnow",
            "gotsansastark",
            "gotedit",
            "originalpost"
        ],
        "short_url": "https://tmblr.co/Zg7lFb2d07esi",
        "summary": "He was a warrior with a fighter’s mind and she was a battle he lost every time. source",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 276,
        "caption": "<blockquote><p><i><b>He was a warrior</b> with a fighter’s mind <b>and she was a battle</b> he lost every time.</i></p></blockquote><p><i><a href=\"http://songbin.tumblr.com/post/164188247193/he-was-a-warrior-with-a-fighters-mind-and-she-was\" target=\"_blank\">source</a></i></p>",
        "reblog": {
            "comment": "<p><blockquote><p><i><b>He was a warrior</b> with a fighter’s mind <b>and she was a battle</b> he lost every time.</i></p></blockquote><p><i><a href=\"http://songbin.tumblr.com/post/164188247193/he-was-a-warrior-with-a-fighters-mind-and-she-was\" target=\"_blank\">source</a></i></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "arin-arryn",
                    "active": true,
                    "theme": {
                        "header_full_width": 1440,
                        "header_full_height": 810,
                        "header_focus_width": 1440,
                        "header_focus_height": 809,
                        "avatar_shape": "square",
                        "background_color": "#0D0D0E",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1440,809,0",
                        "header_image": "https://static.tumblr.com/6645f4c958a3367709457964b20067ef/rkcuurd/CAvppq763/tumblr_static_1108456710-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/1d5221414707c57c6636d8aa3f6b15ad/rkcuurd/6l0ppq8as/tumblr_static_tumblr_static_1108456710-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/6645f4c958a3367709457964b20067ef/rkcuurd/CAvppq763/tumblr_static_1108456710-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#4545B2",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#F7F7F7",
                        "title_font": "Sans Serif",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179316886956"
                },
                "content_raw": "<p><blockquote><p><i><b>He was a warrior</b> with a fighter’s mind <b>and she was a battle</b> he lost every time.</i></p></blockquote><p><i><a href=\"http://songbin.tumblr.com/post/164188247193/he-was-a-warrior-with-a-fighters-mind-and-she-was\" target=\"_blank\">source</a></i></p></p>",
                "content": "<p><blockquote><p><i><b>He was a warrior</b> with a fighter&rsquo;s mind <b>and she was a battle</b> he lost every time.</i></p></blockquote><p><i><a href=\"http://songbin.tumblr.com/post/164188247193/he-was-a-warrior-with-a-fighters-mind-and-she-was\" target=\"_blank\">source</a></i></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "2222",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/8c24eadbb816bfb6d248b5e9504bac88/tumblr_ph0cmnVB6t1x3ogwzo1_400.gif",
                    "width": 350,
                    "height": 200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/8c24eadbb816bfb6d248b5e9504bac88/tumblr_ph0cmnVB6t1x3ogwzo1_400.gif",
                        "width": 350,
                        "height": 200
                    },
                    {
                        "url": "https://66.media.tumblr.com/8c24eadbb816bfb6d248b5e9504bac88/tumblr_ph0cmnVB6t1x3ogwzo1_250.gif",
                        "width": 250,
                        "height": 143
                    },
                    {
                        "url": "https://66.media.tumblr.com/8c24eadbb816bfb6d248b5e9504bac88/tumblr_ph0cmnVB6t1x3ogwzo1_100.gif",
                        "width": 100,
                        "height": 57
                    },
                    {
                        "url": "https://66.media.tumblr.com/8c24eadbb816bfb6d248b5e9504bac88/tumblr_ph0cmnVB6t1x3ogwzo1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/ec3d1a78a6a63c73127ad523fe4d9227/tumblr_ph0cmnVB6t1x3ogwzo2_400.gif",
                    "width": 350,
                    "height": 200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/ec3d1a78a6a63c73127ad523fe4d9227/tumblr_ph0cmnVB6t1x3ogwzo2_400.gif",
                        "width": 350,
                        "height": 200
                    },
                    {
                        "url": "https://66.media.tumblr.com/ec3d1a78a6a63c73127ad523fe4d9227/tumblr_ph0cmnVB6t1x3ogwzo2_250.gif",
                        "width": 250,
                        "height": 143
                    },
                    {
                        "url": "https://66.media.tumblr.com/ec3d1a78a6a63c73127ad523fe4d9227/tumblr_ph0cmnVB6t1x3ogwzo2_100.gif",
                        "width": 100,
                        "height": 57
                    },
                    {
                        "url": "https://66.media.tumblr.com/ec3d1a78a6a63c73127ad523fe4d9227/tumblr_ph0cmnVB6t1x3ogwzo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/1efda5cd12152e0e9ae33b14e8ea8a14/tumblr_ph0cmnVB6t1x3ogwzo3_400.gif",
                    "width": 350,
                    "height": 200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/1efda5cd12152e0e9ae33b14e8ea8a14/tumblr_ph0cmnVB6t1x3ogwzo3_400.gif",
                        "width": 350,
                        "height": 200
                    },
                    {
                        "url": "https://66.media.tumblr.com/1efda5cd12152e0e9ae33b14e8ea8a14/tumblr_ph0cmnVB6t1x3ogwzo3_250.gif",
                        "width": 250,
                        "height": 143
                    },
                    {
                        "url": "https://66.media.tumblr.com/1efda5cd12152e0e9ae33b14e8ea8a14/tumblr_ph0cmnVB6t1x3ogwzo3_100.gif",
                        "width": 100,
                        "height": 57
                    },
                    {
                        "url": "https://66.media.tumblr.com/1efda5cd12152e0e9ae33b14e8ea8a14/tumblr_ph0cmnVB6t1x3ogwzo3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/37edd1d0996f9893a5a876f51600e143/tumblr_ph0cmnVB6t1x3ogwzo4_400.gif",
                    "width": 350,
                    "height": 200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/37edd1d0996f9893a5a876f51600e143/tumblr_ph0cmnVB6t1x3ogwzo4_400.gif",
                        "width": 350,
                        "height": 200
                    },
                    {
                        "url": "https://66.media.tumblr.com/37edd1d0996f9893a5a876f51600e143/tumblr_ph0cmnVB6t1x3ogwzo4_250.gif",
                        "width": 250,
                        "height": 143
                    },
                    {
                        "url": "https://66.media.tumblr.com/37edd1d0996f9893a5a876f51600e143/tumblr_ph0cmnVB6t1x3ogwzo4_100.gif",
                        "width": 100,
                        "height": 57
                    },
                    {
                        "url": "https://66.media.tumblr.com/37edd1d0996f9893a5a876f51600e143/tumblr_ph0cmnVB6t1x3ogwzo4_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/f4acdbd3833d067f93ffa11df36c140a/tumblr_ph0cmnVB6t1x3ogwzo5_400.gif",
                    "width": 350,
                    "height": 200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/f4acdbd3833d067f93ffa11df36c140a/tumblr_ph0cmnVB6t1x3ogwzo5_400.gif",
                        "width": 350,
                        "height": 200
                    },
                    {
                        "url": "https://66.media.tumblr.com/f4acdbd3833d067f93ffa11df36c140a/tumblr_ph0cmnVB6t1x3ogwzo5_250.gif",
                        "width": 250,
                        "height": 143
                    },
                    {
                        "url": "https://66.media.tumblr.com/f4acdbd3833d067f93ffa11df36c140a/tumblr_ph0cmnVB6t1x3ogwzo5_100.gif",
                        "width": 100,
                        "height": 57
                    },
                    {
                        "url": "https://66.media.tumblr.com/f4acdbd3833d067f93ffa11df36c140a/tumblr_ph0cmnVB6t1x3ogwzo5_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/00474b30ff927e91fcbb383d7ef87101/tumblr_ph0cmnVB6t1x3ogwzo6_400.gif",
                    "width": 350,
                    "height": 200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/00474b30ff927e91fcbb383d7ef87101/tumblr_ph0cmnVB6t1x3ogwzo6_400.gif",
                        "width": 350,
                        "height": 200
                    },
                    {
                        "url": "https://66.media.tumblr.com/00474b30ff927e91fcbb383d7ef87101/tumblr_ph0cmnVB6t1x3ogwzo6_250.gif",
                        "width": 250,
                        "height": 143
                    },
                    {
                        "url": "https://66.media.tumblr.com/00474b30ff927e91fcbb383d7ef87101/tumblr_ph0cmnVB6t1x3ogwzo6_100.gif",
                        "width": 100,
                        "height": 57
                    },
                    {
                        "url": "https://66.media.tumblr.com/00474b30ff927e91fcbb383d7ef87101/tumblr_ph0cmnVB6t1x3ogwzo6_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/ebb1ec325b367f31e7ce92fc508ee22e/tumblr_ph0cmnVB6t1x3ogwzo7_400.gif",
                    "width": 350,
                    "height": 200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/ebb1ec325b367f31e7ce92fc508ee22e/tumblr_ph0cmnVB6t1x3ogwzo7_400.gif",
                        "width": 350,
                        "height": 200
                    },
                    {
                        "url": "https://66.media.tumblr.com/ebb1ec325b367f31e7ce92fc508ee22e/tumblr_ph0cmnVB6t1x3ogwzo7_250.gif",
                        "width": 250,
                        "height": 143
                    },
                    {
                        "url": "https://66.media.tumblr.com/ebb1ec325b367f31e7ce92fc508ee22e/tumblr_ph0cmnVB6t1x3ogwzo7_100.gif",
                        "width": 100,
                        "height": 57
                    },
                    {
                        "url": "https://66.media.tumblr.com/ebb1ec325b367f31e7ce92fc508ee22e/tumblr_ph0cmnVB6t1x3ogwzo7_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/d725fc1cf194b3af7ebc381caa7d022c/tumblr_ph0cmnVB6t1x3ogwzo8_400.gif",
                    "width": 350,
                    "height": 200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/d725fc1cf194b3af7ebc381caa7d022c/tumblr_ph0cmnVB6t1x3ogwzo8_400.gif",
                        "width": 350,
                        "height": 200
                    },
                    {
                        "url": "https://66.media.tumblr.com/d725fc1cf194b3af7ebc381caa7d022c/tumblr_ph0cmnVB6t1x3ogwzo8_250.gif",
                        "width": 250,
                        "height": 143
                    },
                    {
                        "url": "https://66.media.tumblr.com/d725fc1cf194b3af7ebc381caa7d022c/tumblr_ph0cmnVB6t1x3ogwzo8_100.gif",
                        "width": 100,
                        "height": 57
                    },
                    {
                        "url": "https://66.media.tumblr.com/d725fc1cf194b3af7ebc381caa7d022c/tumblr_ph0cmnVB6t1x3ogwzo8_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "incorrectstarkfamily",
        "blog": {
            "name": "incorrectstarkfamily",
            "title": "written by grrm himself, probably",
            "description": "Ned, Catelyn, Robb, Talisa, Theon, Jon, Sansa, Bran, Arya, and Rickon, with guest appearances.",
            "url": "https://incorrectstarkfamily.tumblr.com/",
            "uuid": "t:cNRjSDUdcbVxbc-Fklw_HA",
            "updated": 1559232073
        },
        "id": 179316642611,
        "post_url": "https://incorrectstarkfamily.tumblr.com/post/179316642611/beric-okay-so-heres-the-plan-jon-you-die-for",
        "slug": "beric-okay-so-heres-the-plan-jon-you-die-for",
        "date": "2018-10-22 16:01:45 GMT",
        "timestamp": 1540224105,
        "state": "published",
        "format": "html",
        "reblog_key": "xns4PVcq",
        "tags": [
            "game of thrones",
            "incorrect game of thrones",
            "incorrect got",
            "incorrect quotes",
            "jon snow",
            "jon",
            "source: cherboynl",
            "beric dondarrion",
            "beric"
        ],
        "short_url": "https://tmblr.co/ZA5TzY2d06jCp",
        "summary": "Beric: Okay, so, here's the plan. Jon, you die for three minutes, talk to the ghosts, and come back.\n\nJon: No??? I don't want...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 131,
        "title": null,
        "body": "<p class=\"npf_chat\"><b>Beric:</b> Okay, so, here&rsquo;s the plan. Jon, you die for three minutes, talk to the ghosts, and come back.</p>\n\n<p class=\"npf_chat\"><b>Jon:</b> No??? I don&rsquo;t want to?</p>\n\n<p class=\"npf_chat\"><b>Beric:</b> Well fuck me then plan cancelled goodnight everyone.</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\"><b>Beric:</b> Okay, so, here’s the plan. Jon, you die for three minutes, talk to the ghosts, and come back.</p>\n\n<p class=\"npf_chat\"><b>Jon:</b> No??? I don’t want to?</p>\n\n<p class=\"npf_chat\"><b>Beric:</b> Well fuck me then plan cancelled goodnight everyone.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "incorrectstarkfamily",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_13.png?_v=2f4063be1dd2ee91e4eca54332e25191",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_13.png?_v=2f4063be1dd2ee91e4eca54332e25191",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_13.png?_v=2f4063be1dd2ee91e4eca54332e25191",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179316642611"
                },
                "content_raw": "<p class=\"npf_chat\"><b>Beric:</b> Okay, so, here’s the plan. Jon, you die for three minutes, talk to the ghosts, and come back.</p>\n\n<p class=\"npf_chat\"><b>Jon:</b> No??? I don’t want to?</p>\n\n<p class=\"npf_chat\"><b>Beric:</b> Well fuck me then plan cancelled goodnight everyone.</p>",
                "content": "<p class=\"npf_chat\"><b>Beric:</b> Okay, so, here&rsquo;s the plan. Jon, you die for three minutes, talk to the ghosts, and come back.</p>\n\n<p class=\"npf_chat\"><b>Jon:</b> No??? I don&rsquo;t want to?</p>\n\n<p class=\"npf_chat\"><b>Beric:</b> Well fuck me then plan cancelled goodnight everyone.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "archmaestergilly",
        "blog": {
            "name": "archmaestergilly",
            "title": "never give up",
            "description": "tia | 20s | -nfp | you must look within yourself to save yourself from your other self, only then your true self will reveal itself",
            "url": "https://archmaestergilly.tumblr.com/",
            "uuid": "t:IB6fvC_SiM-2UEalaIEhkQ",
            "updated": 1561650271
        },
        "id": 179316299079,
        "post_url": "https://archmaestergilly.tumblr.com/post/179316299079/robb-whats-the-worse-decision-you-made-while",
        "slug": "robb-whats-the-worse-decision-you-made-while",
        "date": "2018-10-22 15:48:56 GMT",
        "timestamp": 1540223336,
        "state": "published",
        "format": "html",
        "reblog_key": "kmx0obIV",
        "tags": [
            "jonsa",
            "jon x sansa",
            "jon snow",
            "sansa stark",
            "robb stark",
            "incorrectgotquotes"
        ],
        "short_url": "https://tmblr.co/ZW_JTd2d05PL7",
        "summary": "Robb: what's the worse decision you made while you're drunk?\nJon: I don't mean to brag, but I don't-\nSansa: -need alcohol to...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 122,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Robb:</b> what&rsquo;s the worse decision you made while you&rsquo;re drunk?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> I don&rsquo;t mean to brag, but I don&rsquo;t-</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> -need alcohol to make really bad decisions? Yeah, we know. </p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Robb:</b> what’s the worse decision you made while you’re drunk?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> I don’t mean to brag, but I don’t-</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> -need alcohol to make really bad decisions? Yeah, we know. </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "archmaestergilly",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content.gif",
                        "header_image_focused": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#f5f2f2",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#D8709C",
                        "title_font": "Clarendon Text Pro",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179316299079"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Robb:</b> what’s the worse decision you made while you’re drunk?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> I don’t mean to brag, but I don’t-</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> -need alcohol to make really bad decisions? Yeah, we know. </p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Robb:</b> what&rsquo;s the worse decision you made while you&rsquo;re drunk?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Jon:</b> I don&rsquo;t mean to brag, but I don&rsquo;t-</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Sansa:</b> -need alcohol to make really bad decisions? Yeah, we know. </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "archmaestergilly",
        "blog": {
            "name": "archmaestergilly",
            "title": "never give up",
            "description": "tia | 20s | -nfp | you must look within yourself to save yourself from your other self, only then your true self will reveal itself",
            "url": "https://archmaestergilly.tumblr.com/",
            "uuid": "t:IB6fvC_SiM-2UEalaIEhkQ",
            "updated": 1561650271
        },
        "id": 179315456629,
        "post_url": "https://archmaestergilly.tumblr.com/post/179315456629/jon-sansa-gave-me-a-get-better-card-sam-awww",
        "slug": "jon-sansa-gave-me-a-get-better-card-sam-awww",
        "date": "2018-10-22 15:15:22 GMT",
        "timestamp": 1540221322,
        "state": "published",
        "format": "html",
        "reblog_key": "GtIJWth4",
        "tags": [
            "jonsa",
            "jon x sansa",
            "jon snow",
            "sansa stark",
            "incorrectgotquotes",
            "sam tarly",
            "got crack"
        ],
        "short_url": "https://tmblr.co/ZW_JTd2d02Bfr",
        "summary": "Jon: sansa gave me a get better card. \nSam: awww, that's sweet!\nJon: i wasn't sick, she just thought i should do better.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 54,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> sansa gave me a get better card. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sam:</b> awww, that&rsquo;s sweet!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> i wasn&rsquo;t sick, she just thought i should do better.</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> sansa gave me a get better card. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sam:</b> awww, that’s sweet!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> i wasn’t sick, she just thought i should do better.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "archmaestergilly",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content.gif",
                        "header_image_focused": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#f5f2f2",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#D8709C",
                        "title_font": "Clarendon Text Pro",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179315456629"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> sansa gave me a get better card. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sam:</b> awww, that’s sweet!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> i wasn’t sick, she just thought i should do better.</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Jon:</b> sansa gave me a get better card. </p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Sam:</b> awww, that&rsquo;s sweet!</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Jon:</b> i wasn&rsquo;t sick, she just thought i should do better.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "jonsnownoshow",
        "blog": {
            "name": "jonsnownoshow",
            "title": "Jon Snow Show",
            "description": "",
            "url": "https://jonsnownoshow.tumblr.com/",
            "uuid": "t:ZLZNMk1JM9mMVdPY_RPhWw",
            "updated": 1561518825
        },
        "id": 179315252430,
        "post_url": "https://jonsnownoshow.tumblr.com/post/179315252430/jon-snow-by-hitokirisan",
        "slug": "jon-snow-by-hitokirisan",
        "date": "2018-10-22 15:07:10 GMT",
        "timestamp": 1540220830,
        "state": "published",
        "format": "html",
        "reblog_key": "lXZ93DeC",
        "tags": [
            "jon snow",
            "wight",
            "game of thrones",
            "A Song of Ice and Fire",
            "asoiaf art"
        ],
        "short_url": "https://tmblr.co/ZJ4Gsj2d01PpE",
        "summary": "Jon Snow by Hitokirisan",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 106,
        "caption": "<p>Jon Snow by Hitokirisan</p>",
        "reblog": {
            "comment": "<p>Jon Snow by Hitokirisan</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jonsnownoshow",
                    "active": true,
                    "theme": {
                        "header_full_width": 600,
                        "header_full_height": 373,
                        "header_focus_width": 600,
                        "header_focus_height": 337,
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "32,600,369,0",
                        "header_image": "https://static.tumblr.com/1508866162d278687493c1c520da380e/jzz31xf/HvQo6wnum/tumblr_static_9nrmpzn337cwgksskwks088cs.jpg",
                        "header_image_focused": "https://static.tumblr.com/1508866162d278687493c1c520da380e/jzz31xf/dfqo6wnun/tumblr_static_tumblr_static_9nrmpzn337cwgksskwks088cs_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/1508866162d278687493c1c520da380e/jzz31xf/HvQo6wnum/tumblr_static_9nrmpzn337cwgksskwks088cs_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179315252430"
                },
                "content_raw": "<p>Jon Snow by Hitokirisan</p>",
                "content": "<p>Jon Snow by Hitokirisan</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://jonsnownoshow.tumblr.com/image/179315252430",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/12e109bfd9df27b26afbe6dd6fd32693/tumblr_ph09zyP8eF1ucrb15o1_1280.jpg",
                    "width": 761,
                    "height": 1049
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/12e109bfd9df27b26afbe6dd6fd32693/tumblr_ph09zyP8eF1ucrb15o1_1280.jpg",
                        "width": 761,
                        "height": 1049
                    },
                    {
                        "url": "https://66.media.tumblr.com/12e109bfd9df27b26afbe6dd6fd32693/tumblr_ph09zyP8eF1ucrb15o1_640.jpg",
                        "width": 640,
                        "height": 882
                    },
                    {
                        "url": "https://66.media.tumblr.com/12e109bfd9df27b26afbe6dd6fd32693/tumblr_ph09zyP8eF1ucrb15o1_540.jpg",
                        "width": 540,
                        "height": 744
                    },
                    {
                        "url": "https://66.media.tumblr.com/12e109bfd9df27b26afbe6dd6fd32693/tumblr_ph09zyP8eF1ucrb15o1_500.jpg",
                        "width": 500,
                        "height": 689
                    },
                    {
                        "url": "https://66.media.tumblr.com/12e109bfd9df27b26afbe6dd6fd32693/tumblr_ph09zyP8eF1ucrb15o1_400.jpg",
                        "width": 400,
                        "height": 551
                    },
                    {
                        "url": "https://66.media.tumblr.com/12e109bfd9df27b26afbe6dd6fd32693/tumblr_ph09zyP8eF1ucrb15o1_250.jpg",
                        "width": 250,
                        "height": 345
                    },
                    {
                        "url": "https://66.media.tumblr.com/12e109bfd9df27b26afbe6dd6fd32693/tumblr_ph09zyP8eF1ucrb15o1_100.jpg",
                        "width": 100,
                        "height": 138
                    },
                    {
                        "url": "https://66.media.tumblr.com/12e109bfd9df27b26afbe6dd6fd32693/tumblr_ph09zyP8eF1ucrb15o1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "archmaestergilly",
        "blog": {
            "name": "archmaestergilly",
            "title": "never give up",
            "description": "tia | 20s | -nfp | you must look within yourself to save yourself from your other self, only then your true self will reveal itself",
            "url": "https://archmaestergilly.tumblr.com/",
            "uuid": "t:IB6fvC_SiM-2UEalaIEhkQ",
            "updated": 1561650271
        },
        "id": 179315121424,
        "post_url": "https://archmaestergilly.tumblr.com/post/179315121424/sansa-i-hope-youre-not-doing-anything",
        "slug": "sansa-i-hope-youre-not-doing-anything",
        "date": "2018-10-22 15:01:45 GMT",
        "timestamp": 1540220505,
        "state": "published",
        "format": "html",
        "reblog_key": "VXiENqwg",
        "tags": [
            "jonsa",
            "actuallyjonsa",
            "jon snow",
            "sansa stark",
            "incorrectgotquotes",
            "jon x sansa",
            "house stark"
        ],
        "short_url": "https://tmblr.co/ZW_JTd2d00vqG",
        "summary": "Sansa: i hope you're not doing anything stupid\nJon: i hope you're not hoping too hard",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 69,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> i hope you&rsquo;re not doing anything stupid</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> i hope you&rsquo;re not hoping too hard</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> i hope you’re not doing anything stupid</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> i hope you’re not hoping too hard</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "archmaestergilly",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content.gif",
                        "header_image_focused": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/3a149adb4917d15f2bb3d5d20d536115/5sy82r9/xlxpssemm/tumblr_static_-518322146-content_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#f5f2f2",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#D8709C",
                        "title_font": "Clarendon Text Pro",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179315121424"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> i hope you’re not doing anything stupid</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> i hope you’re not hoping too hard</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Sansa:</b> i hope you&rsquo;re not doing anything stupid</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Jon:</b> i hope you&rsquo;re not hoping too hard</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "high-souled",
        "blog": {
            "name": "high-souled",
            "title": "Would that be so terrible?",
            "description": "<i>I'm a slow learner, it's true. <b>But I learn.</b></i>",
            "url": "https://high-souled.tumblr.com/",
            "uuid": "t:9kQB-vKIA2z7l6GenaHk9Q",
            "updated": 1558622007
        },
        "id": 179312509432,
        "post_url": "https://high-souled.tumblr.com/post/179312509432/i-love-slow-burn-jonsa-fics-i-dont-care-if-it",
        "slug": "i-love-slow-burn-jonsa-fics-i-dont-care-if-it",
        "date": "2018-10-22 13:09:23 GMT",
        "timestamp": 1540213763,
        "state": "published",
        "format": "html",
        "reblog_key": "UoqVQ6Yt",
        "tags": [
            "jonsa",
            "jon x sansa",
            "jonsa fanfics",
            "jon snow",
            "sansa stark"
        ],
        "short_url": "https://tmblr.co/ZlOO0f2c-sy7u",
        "summary": "I love slow burn JonSa fics. \nI don’t care if it might take 917273 chapters before they acknowledge there love for each other....",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 84,
        "title": null,
        "body": "<p>I love slow burn JonSa fics. </p><p>I don’t care if it might take 917273 chapters before they acknowledge there love for each other. </p><p>The JonSa angst is really what gets me lol</p>",
        "reblog": {
            "comment": "<p>I love slow burn JonSa fics. </p><p>I don’t care if it might take 917273 chapters before they acknowledge there love for each other. </p><p>The JonSa angst is really what gets me lol</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "high-souled",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 360,
                        "header_focus_width": 402,
                        "header_focus_height": 226,
                        "avatar_shape": "circle",
                        "background_color": "#ede5f3",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "9,519,235,117",
                        "header_image": "https://static.tumblr.com/ec331c97f8f25223e377396280a5fce8/kcbldhq/fiPphes03/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/ec331c97f8f25223e377396280a5fce8/kcbldhq/PVzphes0m/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/ec331c97f8f25223e377396280a5fce8/kcbldhq/fiPphes03/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#cab1da",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179312509432"
                },
                "content_raw": "<p>I love slow burn JonSa fics. </p><p>I don’t care if it might take 917273 chapters before they acknowledge there love for each other. </p><p>The JonSa angst is really what gets me lol</p>",
                "content": "<p>I love slow burn JonSa fics. </p><p>I don&rsquo;t care if it might take 917273 chapters before they acknowledge there love for each other. </p><p>The JonSa angst is really what gets me lol</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "winterfellchild",
        "blog": {
            "name": "winterfellchild",
            "title": "The pack survives",
            "description": "\"She (Daenerys) has the power to destroy, she can wipe out entire cities, and we\ncertainly see that in ‘Fire and Blood.’ We see the dragons wiping out \nentire armies, wiping out towns and cities, destroying them, but that \ndoesn’t necessarily enable you to rule — it just enables you to destroy.\" GRRM  ",
            "url": "https://winterfellchild.tumblr.com/",
            "uuid": "t:CvuxN1BAUH71KZvgGVhB5A",
            "updated": 1559298529
        },
        "id": 179312357046,
        "post_url": "https://winterfellchild.tumblr.com/post/179312357046/queen-alysanne-and-her-cousin-king-jaehaerys",
        "slug": "queen-alysanne-and-her-cousin-king-jaehaerys",
        "date": "2018-10-22 13:02:23 GMT",
        "timestamp": 1540213343,
        "state": "published",
        "format": "html",
        "reblog_key": "q7YB1OuP",
        "tags": [
            "jonsa",
            "jon x sansa",
            "sansa stark",
            "jon snow",
            "queen alysanne",
            "king jaehaerys"
        ],
        "short_url": "https://tmblr.co/Z6-w-d2c-sMws",
        "summary": "Queen Alysanne and her cousin King Jaehaerys",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 92,
        "title": "Queen Alysanne and her cousin King Jaehaerys",
        "body": "<p>According to westeros.org</p><blockquote><p>\nIn one of the earlier drafts of the Targaryen family tree, dating circa \n1998, <i>Alysanne was displayed as the daughter of King Maegor I Targaryen</i>. <br/></p><p>Not much later, however, George R. R. Martin changed the family tree \nand Alysanne became the daughter of King Aenys I Targaryen, Maegor&rsquo;s \nolder brother, instead. <i><br/></i></p><p><i>As a result of this change, Alysanne&rsquo;s husband, Jaehaerys I Targaryen, became her brother </i><b><i>instead of her cousin</i>.</b>\n\n<br/></p></blockquote><p>I tried to find out more about this and it seems the source of this information is Elio Garcia (<a href=\"https://youtu.be/1jtLHMFBUGw?t=2268\" target=\"_blank\">x</a>) but he didn’t remember it very well and since he said his old emails are a bit of a mess he wasn’t 100% sure.</p><p>Anyway considering how much Sansa has in common with Alysanne and Jon with Jaehaerys making them also cousins seems very interesting but maybe too straightforward <g class=\"gr_ gr_11 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling ins-del multiReplace\" id=\"11\" data-gr-id=\"11\">imho</g>. <br/></p><p>Maybe this is the reason why he changed this detail or maybe it’s not so important anyway this info should be taken with a grain of salt.<br/></p>",
        "reblog": {
            "comment": "<p>According to westeros.org</p><blockquote><p>\nIn one of the earlier drafts of the Targaryen family tree, dating circa \n1998, <i>Alysanne was displayed as the daughter of King Maegor I Targaryen</i>. <br></p><p>Not much later, however, George R. R. Martin changed the family tree \nand Alysanne became the daughter of King Aenys I Targaryen, Maegor’s \nolder brother, instead. <i><br></i></p><p><i>As a result of this change, Alysanne’s husband, Jaehaerys I Targaryen, became her brother </i><b><i>instead of her cousin</i>.</b>\n\n<br></p></blockquote><p>I tried to find out more about this and it seems the source of this information is Elio Garcia (<a href=\"https://youtu.be/1jtLHMFBUGw?t=2268\" target=\"_blank\">x</a>) but he didn’t remember it very well and since he said his old emails are a bit of a mess he wasn’t 100% sure.</p><p>Anyway considering how much Sansa has in common with Alysanne and Jon with Jaehaerys making them also cousins seems very interesting but maybe too straightforward <g class=\"gr_ gr_11 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling ins-del multiReplace\" id=\"11\" data-gr-id=\"11\">imho</g>. <br></p><p>Maybe this is the reason why he changed this detail or maybe it’s not so important anyway this info should be taken with a grain of salt.<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "winterfellchild",
                    "active": true,
                    "theme": {
                        "header_full_width": 1080,
                        "header_full_height": 1013,
                        "header_focus_width": 1080,
                        "header_focus_height": 607,
                        "avatar_shape": "circle",
                        "background_color": "#f9f1f6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "72,1080,679,0",
                        "header_image": "https://static.tumblr.com/7ac24a468579f1c576166022c047eda3/tpwxdyb/Zk8ps7wqr/tumblr_static_-516347295-content.png",
                        "header_image_focused": "https://static.tumblr.com/3fe41c6c5146e14ee827e9b025bcf7ad/tpwxdyb/Ccyps7wqu/tumblr_static_tumblr_static_-516347295-content_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/7ac24a468579f1c576166022c047eda3/tpwxdyb/Zk8ps7wqr/tumblr_static_-516347295-content_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#dce7f8",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#43324e",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179312357046"
                },
                "content_raw": "<p>According to westeros.org</p><blockquote><p>\nIn one of the earlier drafts of the Targaryen family tree, dating circa \n1998, <i>Alysanne was displayed as the daughter of King Maegor I Targaryen</i>. <br></p><p>Not much later, however, George R. R. Martin changed the family tree \nand Alysanne became the daughter of King Aenys I Targaryen, Maegor’s \nolder brother, instead. <i><br></i></p><p><i>As a result of this change, Alysanne’s husband, Jaehaerys I Targaryen, became her brother </i><b><i>instead of her cousin</i>.</b>\n\n<br></p></blockquote><p>I tried to find out more about this and it seems the source of this information is Elio Garcia (<a href=\"https://youtu.be/1jtLHMFBUGw?t=2268\" target=\"_blank\">x</a>) but he didn’t remember it very well and since he said his old emails are a bit of a mess he wasn’t 100% sure.</p><p>Anyway considering how much Sansa has in common with Alysanne and Jon with Jaehaerys making them also cousins seems very interesting but maybe too straightforward <g class=\"gr_ gr_11 gr-alert gr_spell gr_inline_cards gr_run_anim ContextualSpelling ins-del multiReplace\" id=\"11\" data-gr-id=\"11\">imho</g>. <br></p><p>Maybe this is the reason why he changed this detail or maybe it’s not so important anyway this info should be taken with a grain of salt.<br></p>",
                "content": "<p>According to&nbsp;westeros.org</p><blockquote><p>\nIn one of the earlier drafts of the Targaryen family tree, dating circa \n1998, <i>Alysanne was displayed as the daughter of King Maegor I Targaryen</i>. <br /></p><p>Not much later, however, George R. R. Martin changed the family tree \nand Alysanne became the daughter of King Aenys I Targaryen, Maegor&rsquo;s \nolder brother, instead. <i><br /></i></p><p><i>As a result of this change, Alysanne&rsquo;s husband, Jaehaerys I Targaryen, became her brother </i><b><i>instead of her cousin</i>.</b>\n\n<br /></p></blockquote><p>I tried to find out more about this and it seems the source of this information is Elio Garcia (<a href=\"https://youtu.be/1jtLHMFBUGw?t=2268\" target=\"_blank\">x</a>) but he didn&rsquo;t remember it very well and since he said his old emails are a bit of a mess he wasn&rsquo;t 100% sure.</p><p>Anyway considering how much Sansa has in common with Alysanne and Jon with Jaehaerys making them also cousins seems very interesting but maybe too straightforward imho. <br /></p><p>Maybe this is the reason why he changed this detail or maybe it&rsquo;s not so important anyway this info should be taken with a grain of salt.<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "snowsource",
        "blog": {
            "name": "snowsource",
            "title": "SnowSource",
            "description": "the place for all things Jon Snow. tracking the tag <a href=\"https://www.tumblr.com/tagged/snowsource\">#snowsource </a>",
            "url": "https://snowsource.tumblr.com/",
            "uuid": "t:slfbP793A0DmSFRa3yOrCQ",
            "updated": 1559754951
        },
        "id": 179312332430,
        "post_url": "https://snowsource.tumblr.com/post/179312332430",
        "slug": "",
        "date": "2018-10-22 13:01:03 GMT",
        "timestamp": 1540213263,
        "state": "published",
        "format": "html",
        "reblog_key": "zPK4nOIw",
        "tags": [
            "jon snow",
            "game of thrones",
            "melisandre",
            "jonsnow",
            "gotjonsnowedit",
            "gotjonsnow",
            "gotedit",
            "got edit",
            "azor ahai",
            "jonsnowedit",
            "iheartgot",
            "gotgifs",
            "menofgot",
            "gameofthronesdaily",
            "gameofthronesedit",
            "thegotdaily",
            "book quotes",
            "gifs",
            "ours",
            "bethnoel"
        ],
        "short_url": "https://tmblr.co/ZRfqQY2c-sGwE",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 476,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "photoset_layout": "22",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/c9424e862966ce46eb1448e00cf1b8b7/tumblr_pginhmSd021xixo8uo1_400.gif",
                    "width": 270,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/c9424e862966ce46eb1448e00cf1b8b7/tumblr_pginhmSd021xixo8uo1_400.gif",
                        "width": 270,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/c9424e862966ce46eb1448e00cf1b8b7/tumblr_pginhmSd021xixo8uo1_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/c9424e862966ce46eb1448e00cf1b8b7/tumblr_pginhmSd021xixo8uo1_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/c9424e862966ce46eb1448e00cf1b8b7/tumblr_pginhmSd021xixo8uo1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/167feb8591e98c61a0e26dbd65386d8c/tumblr_pginhmSd021xixo8uo2_400.gif",
                    "width": 270,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/167feb8591e98c61a0e26dbd65386d8c/tumblr_pginhmSd021xixo8uo2_400.gif",
                        "width": 270,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/167feb8591e98c61a0e26dbd65386d8c/tumblr_pginhmSd021xixo8uo2_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/167feb8591e98c61a0e26dbd65386d8c/tumblr_pginhmSd021xixo8uo2_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/167feb8591e98c61a0e26dbd65386d8c/tumblr_pginhmSd021xixo8uo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/5443016cdad76e7461b0d1354cb3d829/tumblr_pginhmSd021xixo8uo3_400.gif",
                    "width": 270,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/5443016cdad76e7461b0d1354cb3d829/tumblr_pginhmSd021xixo8uo3_400.gif",
                        "width": 270,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/5443016cdad76e7461b0d1354cb3d829/tumblr_pginhmSd021xixo8uo3_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/5443016cdad76e7461b0d1354cb3d829/tumblr_pginhmSd021xixo8uo3_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/5443016cdad76e7461b0d1354cb3d829/tumblr_pginhmSd021xixo8uo3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/56a498c038c00c1a1dd7986e0c7a8719/tumblr_pginhmSd021xixo8uo4_400.gif",
                    "width": 270,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/56a498c038c00c1a1dd7986e0c7a8719/tumblr_pginhmSd021xixo8uo4_400.gif",
                        "width": 270,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/56a498c038c00c1a1dd7986e0c7a8719/tumblr_pginhmSd021xixo8uo4_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/56a498c038c00c1a1dd7986e0c7a8719/tumblr_pginhmSd021xixo8uo4_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/56a498c038c00c1a1dd7986e0c7a8719/tumblr_pginhmSd021xixo8uo4_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "catbeast",
        "blog": {
            "name": "catbeast",
            "title": "catbeast",
            "description": "look at all the shit i say",
            "url": "https://catbeast.tumblr.com/",
            "uuid": "t:JdorBbpgUhoGkg9upFZrzw",
            "updated": 1560095709
        },
        "id": 179308090657,
        "post_url": "https://catbeast.tumblr.com/post/179308090657/new-trending-gif-tagged-game-of-thrones-jon-snow",
        "slug": "new-trending-gif-tagged-game-of-thrones-jon-snow",
        "date": "2018-10-22 09:10:32 GMT",
        "timestamp": 1540199432,
        "state": "published",
        "format": "html",
        "reblog_key": "G3B1x8UT",
        "tags": [
            "IFTTT",
            "Giphy",
            "game of thrones",
            "jon snow",
            "kit harington",
            "winter is coming"
        ],
        "short_url": "https://tmblr.co/ZhAVLy2c-c5KX",
        "summary": "New trending GIF tagged game of thrones, jon snow, kit harington, winter is coming via Giphy https://ift.tt/2pJbKYs",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "caption": "<p>New trending GIF tagged game of thrones, jon snow, kit harington, winter is coming via Giphy <a href=\"https://ift.tt/2pJbKYs\" target=\"_blank\">https://ift.tt/2pJbKYs</a></p>",
        "reblog": {
            "comment": "<p>New trending GIF tagged game of thrones, jon snow, kit harington, winter is coming via Giphy <a href=\"https://ift.tt/2pJbKYs\" target=\"_blank\">https://ift.tt/2pJbKYs</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "catbeast",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/37ffe30dba28e7c99b8443e452f01924/gelmmh8/nYIodcyw8/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/37ffe30dba28e7c99b8443e452f01924/gelmmh8/nYIodcyw8/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/37ffe30dba28e7c99b8443e452f01924/gelmmh8/nYIodcyw8/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": false,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179308090657"
                },
                "content_raw": "<p>New trending GIF tagged game of thrones, jon snow, kit harington, winter is coming via Giphy <a href=\"https://ift.tt/2pJbKYs\" target=\"_blank\">https://ift.tt/2pJbKYs</a></p>",
                "content": "<p>New trending GIF tagged game of thrones, jon snow, kit harington, winter is coming via Giphy <a href=\"https://ift.tt/2pJbKYs\" target=\"_blank\">https://ift.tt/2pJbKYs</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://catbeast.tumblr.com/image/179308090657",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzthk9YaT1qbbhw5o1_500.gif",
                    "width": 500,
                    "height": 300
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzthk9YaT1qbbhw5o1_500.gif",
                        "width": 500,
                        "height": 300
                    },
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzthk9YaT1qbbhw5o1_400.gif",
                        "width": 400,
                        "height": 240
                    },
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzthk9YaT1qbbhw5o1_250.gif",
                        "width": 250,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzthk9YaT1qbbhw5o1_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzthk9YaT1qbbhw5o1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "giffinggif",
        "blog": {
            "name": "giffinggif",
            "title": "GIFFING GIFS ON TUMBLR",
            "description": "<b>||GIFFING GIFS ON TUMBLR ||View More at Our <a href=\"http://giffinggif.tumblr.com\" target=\"_blank\" rel=\"noopener\">Blog</a>||</b>",
            "url": "https://giffinggif.tumblr.com/",
            "uuid": "t:_pCCE_UH5fxBsonZy_vElA",
            "updated": 1561759447
        },
        "id": 179306998042,
        "post_url": "https://giffinggif.tumblr.com/post/179306998042",
        "slug": "",
        "date": "2018-10-22 08:03:10 GMT",
        "timestamp": 1540195390,
        "state": "published",
        "format": "html",
        "reblog_key": "SYxmqFId",
        "tags": [
            "game of thrones",
            "jon snow",
            "kit harington",
            "winter is coming"
        ],
        "short_url": "https://tmblr.co/ZBXWUd2c-XwaQ",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "image_permalink": "https://giffinggif.tumblr.com/image/179306998042",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzqda9FdF1wu1zhco1_500.gif",
                    "width": 500,
                    "height": 300
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzqda9FdF1wu1zhco1_500.gif",
                        "width": 500,
                        "height": 300
                    },
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzqda9FdF1wu1zhco1_400.gif",
                        "width": 400,
                        "height": 240
                    },
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzqda9FdF1wu1zhco1_250.gif",
                        "width": 250,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzqda9FdF1wu1zhco1_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzqda9FdF1wu1zhco1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "jonsnownoshow",
        "blog": {
            "name": "jonsnownoshow",
            "title": "Jon Snow Show",
            "description": "",
            "url": "https://jonsnownoshow.tumblr.com/",
            "uuid": "t:ZLZNMk1JM9mMVdPY_RPhWw",
            "updated": 1561518825
        },
        "id": 179306327260,
        "post_url": "https://jonsnownoshow.tumblr.com/post/179306327260/jon-and-arya-by-skephers",
        "slug": "jon-and-arya-by-skephers",
        "date": "2018-10-22 07:23:06 GMT",
        "timestamp": 1540192986,
        "state": "published",
        "format": "html",
        "reblog_key": "xV8IpRA5",
        "tags": [
            "jon snow",
            "Arya Stark",
            "game of thrones",
            "A Song of Ice and Fire",
            "asoiaf art"
        ],
        "short_url": "https://tmblr.co/ZJ4Gsj2c-VMpS",
        "summary": "Jon and Arya by skephers",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 221,
        "caption": "<p>Jon and Arya by skephers</p>",
        "reblog": {
            "comment": "<p>Jon and Arya by skephers</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jonsnownoshow",
                    "active": true,
                    "theme": {
                        "header_full_width": 600,
                        "header_full_height": 373,
                        "header_focus_width": 600,
                        "header_focus_height": 337,
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "32,600,369,0",
                        "header_image": "https://static.tumblr.com/1508866162d278687493c1c520da380e/jzz31xf/HvQo6wnum/tumblr_static_9nrmpzn337cwgksskwks088cs.jpg",
                        "header_image_focused": "https://static.tumblr.com/1508866162d278687493c1c520da380e/jzz31xf/dfqo6wnun/tumblr_static_tumblr_static_9nrmpzn337cwgksskwks088cs_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/1508866162d278687493c1c520da380e/jzz31xf/HvQo6wnum/tumblr_static_9nrmpzn337cwgksskwks088cs_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179306327260"
                },
                "content_raw": "<p>Jon and Arya by skephers</p>",
                "content": "<p>Jon and Arya by skephers</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://jonsnownoshow.tumblr.com/image/179306327260",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/546da1777b2ba3745942432608b62647/tumblr_pgzoii9TYp1ucrb15o1_1280.jpg",
                    "width": 896,
                    "height": 891
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/546da1777b2ba3745942432608b62647/tumblr_pgzoii9TYp1ucrb15o1_1280.jpg",
                        "width": 896,
                        "height": 891
                    },
                    {
                        "url": "https://66.media.tumblr.com/546da1777b2ba3745942432608b62647/tumblr_pgzoii9TYp1ucrb15o1_640.jpg",
                        "width": 640,
                        "height": 636
                    },
                    {
                        "url": "https://66.media.tumblr.com/546da1777b2ba3745942432608b62647/tumblr_pgzoii9TYp1ucrb15o1_540.jpg",
                        "width": 540,
                        "height": 537
                    },
                    {
                        "url": "https://66.media.tumblr.com/546da1777b2ba3745942432608b62647/tumblr_pgzoii9TYp1ucrb15o1_500.jpg",
                        "width": 500,
                        "height": 497
                    },
                    {
                        "url": "https://66.media.tumblr.com/546da1777b2ba3745942432608b62647/tumblr_pgzoii9TYp1ucrb15o1_400.jpg",
                        "width": 400,
                        "height": 398
                    },
                    {
                        "url": "https://66.media.tumblr.com/546da1777b2ba3745942432608b62647/tumblr_pgzoii9TYp1ucrb15o1_250.jpg",
                        "width": 250,
                        "height": 249
                    },
                    {
                        "url": "https://66.media.tumblr.com/546da1777b2ba3745942432608b62647/tumblr_pgzoii9TYp1ucrb15o1_100.jpg",
                        "width": 100,
                        "height": 99
                    },
                    {
                        "url": "https://66.media.tumblr.com/546da1777b2ba3745942432608b62647/tumblr_pgzoii9TYp1ucrb15o1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "chepe1928",
        "blog": {
            "name": "chepe1928",
            "title": "Cositas Varias",
            "description": "Cuidate de Quien Esconde sus Ojos",
            "url": "https://chepe1928.tumblr.com/",
            "uuid": "t:VEjvzXA70PqqYxQ09osU4w",
            "updated": 1561756880
        },
        "id": 179302162663,
        "post_url": "https://chepe1928.tumblr.com/post/179302162663/new-trending-gif-tagged-game-of-thrones-jon-snow",
        "slug": "new-trending-gif-tagged-game-of-thrones-jon-snow",
        "date": "2018-10-22 04:21:33 GMT",
        "timestamp": 1540182093,
        "state": "published",
        "format": "html",
        "reblog_key": "gAXId0gy",
        "tags": [
            "IFTTT",
            "Giphy",
            "game of thrones",
            "jon snow",
            "kit harington",
            "winter is coming"
        ],
        "short_url": "https://tmblr.co/Z-bQLq2c-FU3d",
        "summary": "New trending GIF tagged game of thrones, jon snow, kit harington, winter is coming via Giphy https://ift.tt/2pJbKYs",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "caption": "<p>New trending GIF tagged game of thrones, jon snow, kit harington, winter is coming via Giphy <a href=\"https://ift.tt/2pJbKYs\">https://ift.tt/2pJbKYs</a></p>",
        "reblog": {
            "comment": "<p>New trending GIF tagged game of thrones, jon snow, kit harington, winter is coming via Giphy <a href=\"https://ift.tt/2pJbKYs\">https://ift.tt/2pJbKYs</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "chepe1928",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#D64F4F",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/2adc69efdaed0479beb234764d767a10/pjgjbgv/BBanvly1y/tumblr_static_55l84h9botk4o0400ko4sgs0w.jpg",
                        "header_image_focused": "https://static.tumblr.com/2adc69efdaed0479beb234764d767a10/pjgjbgv/BBanvly1y/tumblr_static_55l84h9botk4o0400ko4sgs0w_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/2adc69efdaed0479beb234764d767a10/pjgjbgv/BBanvly1y/tumblr_static_55l84h9botk4o0400ko4sgs0w_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#6D4785",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#56BC8A",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "179302162663"
                },
                "content_raw": "<p>New trending GIF tagged game of thrones, jon snow, kit harington, winter is coming via Giphy <a href=\"https://ift.tt/2pJbKYs\">https://ift.tt/2pJbKYs</a></p>",
                "content": "<p>New trending GIF tagged game of thrones, jon snow, kit harington, winter is coming via Giphy <a href=\"https://ift.tt/2pJbKYs\">https://ift.tt/2pJbKYs</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://chepe1928.tumblr.com/image/179302162663",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzg3xzno21sjz01co1_500.gif",
                    "width": 500,
                    "height": 300
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzg3xzno21sjz01co1_500.gif",
                        "width": 500,
                        "height": 300
                    },
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzg3xzno21sjz01co1_400.gif",
                        "width": 400,
                        "height": 240
                    },
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzg3xzno21sjz01co1_250.gif",
                        "width": 250,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzg3xzno21sjz01co1_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/b49fae530aabe81144afdcecd1a10607/tumblr_pgzg3xzno21sjz01co1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]