[
    {
        "type": "text",
        "blog_name": "lullikiish",
        "blog": {
            "name": "lullikiish",
            "title": "kiish.",
            "description": "Personal, Game of Thrones/Jonsa/Braime mostly lately.",
            "url": "https://lullikiish.tumblr.com/",
            "uuid": "t:JDpbAh_0fVTyAJ2MkaeJMw",
            "updated": 1561769334
        },
        "id": 181722109598,
        "post_url": "https://lullikiish.tumblr.com/post/181722109598/the-silent-agreement",
        "slug": "the-silent-agreement",
        "date": "2019-01-04 23:45:51 GMT",
        "timestamp": 1546645551,
        "state": "published",
        "format": "html",
        "reblog_key": "W8hFbDeM",
        "tags": [
            "Jonsa fic",
            "Jonsa",
            "My first try",
            "Sansa Stark",
            "Jon Snow",
            "Game of Thrones",
            "asoiaf",
            "Jonsa fanfiction",
            "Jonsa fanfic",
            "sansa x jon",
            "Jon x Sansa",
            "Jonsa fic: Non-AU"
        ],
        "short_url": "https://tmblr.co/Z-ps2w2fFUrQU",
        "summary": "The silent agreement",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 65,
        "title": "The silent agreement",
        "body": "<figure data-orig-width=\"1264\" data-orig-height=\"702\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4fad6d7bc4194edfda7fb932c455399c/tumblr_inline_pktyxyXTqQ1r6dcww_540.jpg\" alt=\"image\" data-orig-width=\"1264\" data-orig-height=\"702\"/></figure><p><i>(disclaimer: first fic, i do not own anyone)</i></p><p><br/>It was snowing lightly and the pools of water on the dark stone roads were covered by a thin layer of ice, but in the main chambers of Winterfell, it&rsquo;s always warm. They were mother and father&rsquo;s chambers, Sansa thought, never supposed to be hers. But life doesn&rsquo;t always go how it is supposed to.</p><!-- more --><p>One time she might have wished to get away from Winterfell, marry, be the Queen. Today looking out the small window she felt closer to being a Queen than she ever did in Kings Landing when she was betrothed to Joffrey. She felt that this castle was hers, the North was hers, hers to protect and lead against everything that lays to the South and to the North. It was her place, her people needed help to rebuild the damage, Jon needed her and she could actually do something of importance, not to be just a face in the court, not to play games with power-hungry two-faced southerners. She also liked the quiet, finally having a home again. The feeling of agency she had, after a long time being without any, was also a thing she began to appreciate.</p><p>Just a fortnight ago Jon was proclaimed King in the North, he&rsquo;d never wanted to be a king, but Sansa thought that he did truly look kingly that evening. Jon had accepted his new role reluctantly but graciously.</p><p>If Jon is the King what did it make her? Sister of the King was usually a princess, but she wasn&rsquo;t born one, it didn&rsquo;t sound right to her. Lady of Winterfell sounded better, especially from Jon&rsquo;s lips. At the table everybody cheered for them, they cheered for the white wolf and for the fair lady. But there was no King and Queen, and she knew a King always needs a Queen. If not to love, then to make babes, to have an heir and everything that had sounded so wonderful to her when she was a little girl. Today she isn&rsquo;t little girl anymore.</p><p>The sudden thought of Jon marrying some girl, making her his queen felt so strange and so wrong. A stranger would be standing where she stood. She would be the Lady of Winterfell, sure, maybe even have her seat at the table but it was her place next to Jon she would lose. At that thought, she felt tension and queasiness run over her. She had to shake herself and rub her face to think of something else, she was not supposed to feel like that. She took a deep breath and looked out of the window, snow was falling.</p><p>Then from afar steps approach, then a quick knock on the door. She opened the door, looking at her King, it was still Jon but this time she felt her chest flutter more than usual, was she anxious? Sansa gathered herself like a lady should and said quietly &ldquo;Your Grace&rdquo;. Jon looked away and mumbled, &ldquo;you don&rsquo;t have to do that&rdquo;. Sansa was amused how easy it was to make him look all bothered, this time teasingly she said: &ldquo;Sorry, your highness, how would wish me to address you&rdquo;. &ldquo;Jon should be fine,&rdquo; he said, looking away, adding &ldquo;my Lady&rdquo; with a crooked smile when their eyes met again.</p><p>Father often called mother by her title, at least in public mostly so. That&rsquo;s how adults were addressed, she was an adult too she realized, when had that happened? She certainly was not a child anymore. As children, they were not very close with Jon, at least not all the time and mother had made sure it stayed that way. Still, Jon was just Jon, and she was just Sansa, it had been the same when they met back at The Wall as no time had passed, but a lot had happened. Sansa knew Jon was only teasing, but it also brought her mind back to her previous thoughts.</p><p>When Jon entered the room and they seated themselves next to the fireplace like they had so many nights before in their tents and at the Wall, it almost felt the same. It had been only a few moons since they were reunited, but they had spent so many nights next to fire talking that it felt like the most natural thing in the world.</p><p>&ldquo;Odd to sit here,&rdquo; Jon said. He had never really been welcome here. Lady Catelyn never had any love for him as a child, and it only got worse as he grew older.</p><p>&ldquo;Yes, I&rsquo;d never imagined..&rdquo; Sansa said, &ldquo;Not the same of course, but I mean, still, never imagined&hellip;&rdquo;</p><p>&ldquo;Yeah&rdquo;</p><p>Jon poured them some wine he had brought and talked how he&rsquo;d been going around Winterfell and discussing repairs that needed to be done with builders. The Boltons had restored the castle somewhat, but much was still in ruins and unusable. Even through castle and lands around it were way more empty than it used to be when they were little, there were many people needed to be hosted, their men, free folk, Knights of the Vale and people daring to return to Winterfell again.</p><p>&ldquo;They can&rsquo;t stay in tents for long&rdquo; Jon said, &ldquo;Right now it might be fine like they say, but soon it will get really cold, then no fires will keep them warm there&rdquo;. &ldquo;The resources are scarce but Lord Royce offered generous help with everything, I can&rsquo;t help but feel like a beggar,&rdquo; he said and chuckled sadly. &ldquo;We&rsquo;ll pay them back, we can trust Lord Yohn Royce, he&rsquo;s an honest man, that&rsquo;s what we need right now,&rdquo; Sansa said, &ldquo;Better them than someone else&rdquo; Jon agreed and Sansa nodded.</p><p>&ldquo;They are so generous that they even insist on setting a date for the repayment, other houses have offered their help too,&rdquo; Jon said, &ldquo;Lord Grafton offered to send his son accompanied by his youngest daughter to discuss the terms and said that he expects no repayment&rdquo;.</p><p>&ldquo;Oh,&rdquo; Sansa said, getting the idea what Lord Grafton had meant. &ldquo;Very generous of him&rdquo; she managed to add. Sansa took a sip of wine, then another. The situation felt so uncomfortable and the couldn&rsquo;t think of a way to change the subject.</p><p>&ldquo;It seems he&rsquo;s proposing a marriage,&rdquo; Jon said and didn&rsquo;t look at Sansa, took a breath and decided to fix his gaze at the ceiling. The moments seemed to go on forever for Sansa as her heartbeat became faster and she tried to think of what to say next, she was about to comment on how the wine tasted.</p><p>Before she could say anything Jon said &ldquo;I declined, I have no plan for marriage and no need for it&rdquo; and stared at Sansa&rsquo;s eyes. He looked deep into her eyes and for a moment Sansa felt a connection, ease coming over her and she knew he thought the same thoughts as her, they were on the same page and whatever happened she&rsquo;d never lose Jon really. He was looking straight through her and she didn&rsquo;t even try to put up a face. She smiled and so did he and everything was simple again.</p>",
        "body_abstract": "\n<figure data-orig-width=\"1264\" data-orig-height=\"702\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4fad6d7bc4194edfda7fb932c455399c/tumblr_inline_pktyxyXTqQ1r6dcww_540.jpg\" alt=\"image\" data-orig-width=\"1264\" data-orig-height=\"702\"></figure><p><i>(disclaimer: first fic, i do not own anyone)</i></p>\n<p><br>It was snowing lightly and the pools of water on the dark stone roads were covered by a thin layer of ice, but in the main chambers of Winterfell, it&rsquo;s always warm. They were mother and father&rsquo;s chambers, Sansa thought, never supposed to be hers. But life doesn&rsquo;t always go how it is supposed to.</p>\n",
        "reblog": {
            "comment": "<p><figure data-orig-width=\"1264\" data-orig-height=\"702\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4fad6d7bc4194edfda7fb932c455399c/tumblr_inline_pktyxyXTqQ1r6dcww_540.jpg\" alt=\"image\" data-orig-width=\"1264\" data-orig-height=\"702\"></figure><p><i>(disclaimer: first fic, i do not own anyone)</i></p><p><br>It was snowing lightly and the pools of water on the dark stone roads were covered by a thin layer of ice, but in the main chambers of Winterfell, it’s always warm. They were mother and father’s chambers, Sansa thought, never supposed to be hers. But life doesn’t always go how it is supposed to.</p>[[MORE]]<p>One time she might have wished to get away from Winterfell, marry, be the Queen. Today looking out the small window she felt closer to being a Queen than she ever did in Kings Landing when she was betrothed to Joffrey. She felt that this castle was hers, the North was hers, hers to protect and lead against everything that lays to the South and to the North. It was her place, her people needed help to rebuild the damage, Jon needed her and she could actually do something of importance, not to be just a face in the court, not to play games with power-hungry two-faced southerners. She also liked the quiet, finally having a home again. The feeling of agency she had, after a long time being without any, was also a thing she began to appreciate.</p><p>Just a fortnight ago Jon was proclaimed King in the North, he’d never wanted to be a king, but Sansa thought that he did truly look kingly that evening. Jon had accepted his new role reluctantly but graciously.</p><p>If Jon is the King what did it make her? Sister of the King was usually a princess, but she wasn’t born one, it didn’t sound right to her. Lady of Winterfell sounded better, especially from Jon’s lips. At the table everybody cheered for them, they cheered for the white wolf and for the fair lady. But there was no King and Queen, and she knew a King always needs a Queen. If not to love, then to make babes, to have an heir and everything that had sounded so wonderful to her when she was a little girl. Today she isn’t little girl anymore.</p><p>The sudden thought of Jon marrying some girl, making her his queen felt so strange and so wrong. A stranger would be standing where she stood. She would be the Lady of Winterfell, sure, maybe even have her seat at the table but it was her place next to Jon she would lose. At that thought, she felt tension and queasiness run over her. She had to shake herself and rub her face to think of something else, she was not supposed to feel like that. She took a deep breath and looked out of the window, snow was falling.</p><p>Then from afar steps approach, then a quick knock on the door. She opened the door, looking at her King, it was still Jon but this time she felt her chest flutter more than usual, was she anxious? Sansa gathered herself like a lady should and said quietly “Your Grace”. Jon looked away and mumbled, “you don’t have to do that”. Sansa was amused how easy it was to make him look all bothered, this time teasingly she said: “Sorry, your highness, how would wish me to address you”. “Jon should be fine,” he said, looking away, adding “my Lady” with a crooked smile when their eyes met again.</p><p>Father often called mother by her title, at least in public mostly so. That’s how adults were addressed, she was an adult too she realized, when had that happened? She certainly was not a child anymore. As children, they were not very close with Jon, at least not all the time and mother had made sure it stayed that way. Still, Jon was just Jon, and she was just Sansa, it had been the same when they met back at The Wall as no time had passed, but a lot had happened. Sansa knew Jon was only teasing, but it also brought her mind back to her previous thoughts.</p><p>When Jon entered the room and they seated themselves next to the fireplace like they had so many nights before in their tents and at the Wall, it almost felt the same. It had been only a few moons since they were reunited, but they had spent so many nights next to fire talking that it felt like the most natural thing in the world.</p><p>“Odd to sit here,” Jon said. He had never really been welcome here. Lady Catelyn never had any love for him as a child, and it only got worse as he grew older.</p><p>“Yes, I’d never imagined..” Sansa said, “Not the same of course, but I mean, still, never imagined…”</p><p>“Yeah”</p><p>Jon poured them some wine he had brought and talked how he’d been going around Winterfell and discussing repairs that needed to be done with builders. The Boltons had restored the castle somewhat, but much was still in ruins and unusable. Even through castle and lands around it were way more empty than it used to be when they were little, there were many people needed to be hosted, their men, free folk, Knights of the Vale and people daring to return to Winterfell again.</p><p>“They can’t stay in tents for long” Jon said, “Right now it might be fine like they say, but soon it will get really cold, then no fires will keep them warm there”. “The resources are scarce but Lord Royce offered generous help with everything, I can’t help but feel like a beggar,” he said and chuckled sadly. “We’ll pay them back, we can trust Lord Yohn Royce, he’s an honest man, that’s what we need right now,” Sansa said, “Better them than someone else” Jon agreed and Sansa nodded.</p><p>“They are so generous that they even insist on setting a date for the repayment, other houses have offered their help too,” Jon said, “Lord Grafton offered to send his son accompanied by his youngest daughter to discuss the terms and said that he expects no repayment”.</p><p>“Oh,” Sansa said, getting the idea what Lord Grafton had meant. “Very generous of him” she managed to add. Sansa took a sip of wine, then another. The situation felt so uncomfortable and the couldn’t think of a way to change the subject.</p><p>“It seems he’s proposing a marriage,” Jon said and didn’t look at Sansa, took a breath and decided to fix his gaze at the ceiling. The moments seemed to go on forever for Sansa as her heartbeat became faster and she tried to think of what to say next, she was about to comment on how the wine tasted.</p><p>Before she could say anything Jon said “I declined, I have no plan for marriage and no need for it” and stared at Sansa’s eyes. He looked deep into her eyes and for a moment Sansa felt a connection, ease coming over her and she knew he thought the same thoughts as her, they were on the same page and whatever happened she’d never lose Jon really. He was looking straight through her and she didn’t even try to put up a face. She smiled and so did he and everything was simple again.</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "lullikiish",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/4dab8f2aeab2595f70cf6fe612ce15d8/qxlmpua/pI6pg2uwa/tumblr_static_-2094930890-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/4dab8f2aeab2595f70cf6fe612ce15d8/qxlmpua/pI6pg2uwa/tumblr_static_-2094930890-content.jpg",
                        "header_image_scaled": "https://static.tumblr.com/4dab8f2aeab2595f70cf6fe612ce15d8/qxlmpua/pI6pg2uwa/tumblr_static_-2094930890-content.jpg",
                        "header_stretch": true,
                        "link_color": "#616161",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181722109598"
                },
                "content_raw": "<p><figure data-orig-width=\"1264\" data-orig-height=\"702\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4fad6d7bc4194edfda7fb932c455399c/tumblr_inline_pktyxyXTqQ1r6dcww_540.jpg\" alt=\"image\" data-orig-width=\"1264\" data-orig-height=\"702\"></figure><p><i>(disclaimer: first fic, i do not own anyone)</i></p><p><br>It was snowing lightly and the pools of water on the dark stone roads were covered by a thin layer of ice, but in the main chambers of Winterfell, it’s always warm. They were mother and father’s chambers, Sansa thought, never supposed to be hers. But life doesn’t always go how it is supposed to.</p>[[MORE]]<p>One time she might have wished to get away from Winterfell, marry, be the Queen. Today looking out the small window she felt closer to being a Queen than she ever did in Kings Landing when she was betrothed to Joffrey. She felt that this castle was hers, the North was hers, hers to protect and lead against everything that lays to the South and to the North. It was her place, her people needed help to rebuild the damage, Jon needed her and she could actually do something of importance, not to be just a face in the court, not to play games with power-hungry two-faced southerners. She also liked the quiet, finally having a home again. The feeling of agency she had, after a long time being without any, was also a thing she began to appreciate.</p><p>Just a fortnight ago Jon was proclaimed King in the North, he’d never wanted to be a king, but Sansa thought that he did truly look kingly that evening. Jon had accepted his new role reluctantly but graciously.</p><p>If Jon is the King what did it make her? Sister of the King was usually a princess, but she wasn’t born one, it didn’t sound right to her. Lady of Winterfell sounded better, especially from Jon’s lips. At the table everybody cheered for them, they cheered for the white wolf and for the fair lady. But there was no King and Queen, and she knew a King always needs a Queen. If not to love, then to make babes, to have an heir and everything that had sounded so wonderful to her when she was a little girl. Today she isn’t little girl anymore.</p><p>The sudden thought of Jon marrying some girl, making her his queen felt so strange and so wrong. A stranger would be standing where she stood. She would be the Lady of Winterfell, sure, maybe even have her seat at the table but it was her place next to Jon she would lose. At that thought, she felt tension and queasiness run over her. She had to shake herself and rub her face to think of something else, she was not supposed to feel like that. She took a deep breath and looked out of the window, snow was falling.</p><p>Then from afar steps approach, then a quick knock on the door. She opened the door, looking at her King, it was still Jon but this time she felt her chest flutter more than usual, was she anxious? Sansa gathered herself like a lady should and said quietly “Your Grace”. Jon looked away and mumbled, “you don’t have to do that”. Sansa was amused how easy it was to make him look all bothered, this time teasingly she said: “Sorry, your highness, how would wish me to address you”. “Jon should be fine,” he said, looking away, adding “my Lady” with a crooked smile when their eyes met again.</p><p>Father often called mother by her title, at least in public mostly so. That’s how adults were addressed, she was an adult too she realized, when had that happened? She certainly was not a child anymore. As children, they were not very close with Jon, at least not all the time and mother had made sure it stayed that way. Still, Jon was just Jon, and she was just Sansa, it had been the same when they met back at The Wall as no time had passed, but a lot had happened. Sansa knew Jon was only teasing, but it also brought her mind back to her previous thoughts.</p><p>When Jon entered the room and they seated themselves next to the fireplace like they had so many nights before in their tents and at the Wall, it almost felt the same. It had been only a few moons since they were reunited, but they had spent so many nights next to fire talking that it felt like the most natural thing in the world.</p><p>“Odd to sit here,” Jon said. He had never really been welcome here. Lady Catelyn never had any love for him as a child, and it only got worse as he grew older.</p><p>“Yes, I’d never imagined..” Sansa said, “Not the same of course, but I mean, still, never imagined…”</p><p>“Yeah”</p><p>Jon poured them some wine he had brought and talked how he’d been going around Winterfell and discussing repairs that needed to be done with builders. The Boltons had restored the castle somewhat, but much was still in ruins and unusable. Even through castle and lands around it were way more empty than it used to be when they were little, there were many people needed to be hosted, their men, free folk, Knights of the Vale and people daring to return to Winterfell again.</p><p>“They can’t stay in tents for long” Jon said, “Right now it might be fine like they say, but soon it will get really cold, then no fires will keep them warm there”. “The resources are scarce but Lord Royce offered generous help with everything, I can’t help but feel like a beggar,” he said and chuckled sadly. “We’ll pay them back, we can trust Lord Yohn Royce, he’s an honest man, that’s what we need right now,” Sansa said, “Better them than someone else” Jon agreed and Sansa nodded.</p><p>“They are so generous that they even insist on setting a date for the repayment, other houses have offered their help too,” Jon said, “Lord Grafton offered to send his son accompanied by his youngest daughter to discuss the terms and said that he expects no repayment”.</p><p>“Oh,” Sansa said, getting the idea what Lord Grafton had meant. “Very generous of him” she managed to add. Sansa took a sip of wine, then another. The situation felt so uncomfortable and the couldn’t think of a way to change the subject.</p><p>“It seems he’s proposing a marriage,” Jon said and didn’t look at Sansa, took a breath and decided to fix his gaze at the ceiling. The moments seemed to go on forever for Sansa as her heartbeat became faster and she tried to think of what to say next, she was about to comment on how the wine tasted.</p><p>Before she could say anything Jon said “I declined, I have no plan for marriage and no need for it” and stared at Sansa’s eyes. He looked deep into her eyes and for a moment Sansa felt a connection, ease coming over her and she knew he thought the same thoughts as her, they were on the same page and whatever happened she’d never lose Jon really. He was looking straight through her and she didn’t even try to put up a face. She smiled and so did he and everything was simple again.</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4fad6d7bc4194edfda7fb932c455399c/tumblr_inline_pktyxyXTqQ1r6dcww_540.jpg\" class=\"\"/></figure><p><i>(disclaimer: first fic, i do not own anyone)</i></p><p><br />It was snowing lightly and the pools of water on the dark stone roads were covered by a thin layer of ice, but in the main chambers of Winterfell, it&rsquo;s always warm. They were mother and father&rsquo;s chambers, Sansa thought, never supposed to be hers. But life doesn&rsquo;t always go how it is supposed to.</p><p>One time she might have wished to get away from Winterfell, marry, be the Queen. Today looking out the small window she felt closer to being a Queen than she ever did in Kings Landing when she was betrothed to Joffrey. She felt that this castle was hers, the North was hers, hers to protect and lead against everything that lays to the South and to the North. It was her place, her people needed help to rebuild the damage, Jon needed her and she could actually do something of importance, not to be just a face in the court, not to play games with power-hungry two-faced southerners. She also liked the quiet, finally having a home again. The feeling of agency she had, after a long time being without any, was also a thing she began to&nbsp;appreciate.</p><p>Just a fortnight ago Jon was proclaimed King in the North, he&rsquo;d never wanted to be a king, but Sansa thought that he did truly look kingly that evening. Jon had accepted his new role reluctantly but graciously.</p><p>If Jon is the King what did it make her? Sister of the King was usually a princess, but she wasn&rsquo;t born one, it didn&rsquo;t sound right to her. Lady of Winterfell sounded better, especially from Jon&rsquo;s lips. At the table everybody cheered for them, they cheered for the white wolf and for the fair lady. But there was no King and Queen, and she knew a King always needs a Queen. If not to love, then to make babes, to have an heir and everything that had sounded so wonderful to her when she was a little girl. Today she isn&rsquo;t little girl anymore.</p><p>The sudden thought of Jon marrying some girl, making her his queen felt so strange and so wrong. A stranger would be standing where she stood. She would be the Lady of Winterfell, sure, maybe even have her seat at the table but it was her place next to Jon she would lose. At that thought, she felt tension and queasiness run over her. She had to shake herself and rub her face to think of something else, she was not supposed to feel like that. She took a deep breath and looked out of the window, snow was falling.</p><p>Then from afar steps approach, then a quick knock on the door. She opened the door, looking at her King, it was still Jon but this time she felt her chest flutter more than usual, was she anxious? Sansa gathered herself like a lady should and said quietly &ldquo;Your Grace&rdquo;. Jon looked away and mumbled, &ldquo;you don&rsquo;t have to do that&rdquo;. Sansa was amused how easy it was to make him look all bothered, this time teasingly she said: &ldquo;Sorry, your highness, how would wish me to address you&rdquo;. &ldquo;Jon should be fine,&rdquo; he said, looking away, adding &ldquo;my Lady&rdquo; with a crooked smile when their eyes met again.</p><p>Father often called mother by her title, at least in public mostly so. That&rsquo;s how adults were addressed, she was an adult too she realized, when had that happened? She certainly was not a child anymore. As children, they were not very close with Jon, at least not all the time and mother had made sure it stayed that way. Still, Jon was just Jon, and she was just Sansa, it had been the same when they met back at The Wall as no time had passed, but a lot had happened. Sansa knew Jon was only teasing, but it also brought her mind back to her previous thoughts.</p><p>When Jon entered the room and they seated themselves next to the fireplace like they had so many nights before in their tents and at the Wall, it almost felt the same. It had been only a few moons since they were reunited, but they had spent so many nights next to fire talking that it felt like the most natural thing in the world.</p><p>&ldquo;Odd to sit here,&rdquo; Jon said. He had never really been welcome here. Lady Catelyn never had any love for him as a child, and it only got worse as he grew older.</p><p>&ldquo;Yes, I&rsquo;d never imagined..&rdquo; Sansa said, &ldquo;Not the same of course, but I mean, still, never imagined&hellip;&rdquo;</p><p>&ldquo;Yeah&rdquo;</p><p>Jon poured them some wine he had brought and talked how he&rsquo;d been going around Winterfell and discussing repairs that needed to be done with builders. The Boltons had restored the castle somewhat, but much was still in ruins and unusable. Even through castle and lands around it were way more empty than it used to be when they were little, there were many people needed to be hosted, their men, free folk, Knights of the Vale and people daring to return to Winterfell again.</p><p>&ldquo;They can&rsquo;t stay in tents for long&rdquo; Jon said, &ldquo;Right now it might be fine like they say, but soon it will get really cold, then no fires will keep them warm there&rdquo;. &ldquo;The resources are scarce but Lord Royce offered generous help with everything, I can&rsquo;t help but feel like a beggar,&rdquo; he said and chuckled sadly. &ldquo;We&rsquo;ll pay them back, we can trust Lord Yohn Royce, he&rsquo;s an honest man, that&rsquo;s what we need right now,&rdquo; Sansa said, &ldquo;Better them than someone else&rdquo; Jon agreed and Sansa nodded.</p><p>&ldquo;They are so generous that they even insist on setting a date for the repayment, other houses have offered their help too,&rdquo; Jon said, &ldquo;Lord Grafton offered to send his son accompanied by his youngest daughter to discuss the terms and said that he expects no repayment&rdquo;.</p><p>&ldquo;Oh,&rdquo; Sansa said, getting the idea what Lord Grafton had meant. &ldquo;Very generous of him&rdquo; she managed to add. Sansa took a sip of wine, then another. The situation felt so uncomfortable and the couldn&rsquo;t think of a way to change the subject.</p><p>&ldquo;It seems he&rsquo;s proposing a marriage,&rdquo; Jon said and didn&rsquo;t look at Sansa, took a breath and decided to fix his gaze at the ceiling. The moments seemed to go on forever for Sansa as her heartbeat became faster and she tried to think of what to say next, she was about to comment on how the wine tasted.</p><p>Before she could say anything Jon said &ldquo;I declined, I have no plan for marriage and no need for it&rdquo; and stared at Sansa&rsquo;s eyes. He looked deep into her eyes and for a moment Sansa felt a connection, ease coming over her and she knew he thought the same thoughts as her, they were on the same page and whatever happened she&rsquo;d never lose Jon really. He was looking straight through her and she didn&rsquo;t even try to put up a face. She smiled and so did he and everything was simple again.</p></p>",
                "content_abstract": "<p>\n<figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4fad6d7bc4194edfda7fb932c455399c/tumblr_inline_pktyxyXTqQ1r6dcww_540.jpg\" class=\"\"/></figure>\n<p><i>(disclaimer: first fic, i do not own anyone)</i></p>\n<p><br />It was snowing lightly and the pools of water on the dark stone roads were covered by a thin layer of ice, but in the main chambers of Winterfell, it&rsquo;s always warm. They were mother and father&rsquo;s chambers, Sansa thought, never supposed to be hers. But life doesn&rsquo;t always go how it is supposed to.</p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "maxbetta",
        "blog": {
            "name": "maxbetta",
            "title": "Sansan & Fanfiction",
            "description": "<p>I ❤️Sansan</p><p>Proud member of the Hound’s Harem</p><p>Maxbetta on AO3</p><p>Bookworm - Aspiring knitter - Hygge enthusiast Caffeine addict - Pub trivia nerd - Mug collector</p><p>Sometimes I make inappropriate jokes</p>",
            "url": "https://maxbetta.tumblr.com/",
            "uuid": "t:iOfncdTDDO_1JQNuBBiX0A",
            "updated": 1561392785
        },
        "id": 181721411080,
        "post_url": "https://maxbetta.tumblr.com/post/181721411080/persephone-also-called-the-maiden-known-for",
        "slug": "persephone-also-called-the-maiden-known-for",
        "date": "2019-01-04 23:18:10 GMT",
        "timestamp": 1546643890,
        "state": "published",
        "format": "html",
        "reblog_key": "638VYhCa",
        "tags": [
            "greek mythology",
            "sansan",
            "sansa x sandor",
            "sandor clegane",
            "sansa stark",
            "asoiaf",
            "game of thrones",
            "persephone",
            "hades",
            "hades and persephone",
            "maybe it's just me"
        ],
        "short_url": "https://tmblr.co/Z5vS1g2fFSAu8",
        "summary": "Persephone- Also called, “The maiden.” Known for being beautiful. Wife of Hades, ruler of the underworld. Didn’t like Hades at...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 49,
        "title": null,
        "body": "<h1>Anyone else notice similarities between Sansa/Sandor and Persephone/Hades or is it just me?</h1><p><b><span class=\"npf_color_joey\">Persephone</span></b>- Also called, “The maiden.” Known for being beautiful. Wife of Hades, ruler of the underworld. Didn’t like Hades at first because of his cold-natured personality, but grew to love him. Described as having long red hair and blue eyes.</p><p><b><span class=\"npf_color_joey\">Hades</span></b>- Ruler of the underworld, AKA, the place that is on fire. Often pictured with Cerberus, the “Hound of Hades.” Cerberus was a 3-headed black dog. (Clegane sigil is 3 black dogs) Hades’ weakness was his passion for Persephone. Described as being gloomy, features include a beard and long dark hair.</p><p>Oh, and one more thing. Persephone &amp; Hades being together is associated with the coming of winter.</p><h2>The Visual Presentation:</h2><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"833\"><img src=\"https://66.media.tumblr.com/802f6a87288509282073809bb3d127e3/tumblr_inline_pktx0uW0oV1uuoxzq_1280.jpg\" data-orig-height=\"960\" data-orig-width=\"833\"/></figure><p>Persephone <a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fmfelsman.edublogs.org%2Ffiles%2F2016%2F03%2Ftmp654741209742311426-1402n01.jpg&amp;t=ODZkYjA0MzRjMjVhZTEyYTczMGU5NDA0MTI4NmJjNjUwNGJlZjM3NCxmMWZjNmZlNWMzMzhhOWJlMTcyYzcyNTI1YmFjOTgxYTZhODliM2E4\">(source)</a> Notice the birds (”Little bird” “Little dove”)</p><figure class=\"tmblr-full\" data-orig-height=\"1550\" data-orig-width=\"960\"><img src=\"https://66.media.tumblr.com/93b953910bd7dfcc788524034672316a/tumblr_inline_pktx2sf8jv1uuoxzq_1280.jpg\" data-orig-height=\"1550\" data-orig-width=\"960\"/></figure><p>Persephone (<a href=\"https://t.umblr.com/redirect?z=http%3A%2F%2Fi0.wp.com%2Fwww.trungcaoart.com%2Fwp-content%2Fuploads%2F2012%2F11%2Fpersephone-in-the-underworld.jpg%3Fresize%3D960%252C1550&amp;t=YTEyODRmMGRhZmJjNzEzZDc1MGQ4NGJlZGM4ZmFjOWZmOTlmNWM3YixiMWMwYjhlNzA0MjM2MWQwYzYyYjgzYzA5NzA4NGJkYTJlZTk3MjVh\">source</a>) Pomegranates are often shown in images of Persephone. She was offered pomegranate and refused. (In the books, Petyr Baelish offers Sansa pomegranate, and she refuses.)</p><figure class=\"tmblr-full\" data-orig-height=\"168\" data-orig-width=\"300\"><img src=\"https://66.media.tumblr.com/b7047d6546b7592b0116db8d44d3889f/tumblr_inline_pktxf3ZH8u1uuoxzq_400.jpg\" data-orig-height=\"168\" data-orig-width=\"300\"/></figure><p>Hades (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fencrypted-tbn0.gstatic.com%2Fimages%3Fq%3Dtbn%3AANd9GcQr7dJUgL66Ab2XSyKWgs6KyxGGUdw-DbBd2ZUfqFoRP6aN6uCL&amp;t=N2ViOTAxZmEyMWNjYWY1OTU2MzQyZDhlY2RkY2E4Njc3ODE2M2NjOSxlMmNkYjJmZjViNThkOTU2MDg2NzlmZTRmMGIxNzlmNTM1ODFjZGM5\">source)</a></p><figure class=\"tmblr-full\" data-orig-height=\"409\" data-orig-width=\"486\"><img src=\"https://66.media.tumblr.com/085bb108baf1ffd02d3f5ea1dd01b0f5/tumblr_inline_pktxj6CA2t1uuoxzq_500.jpg\" data-orig-height=\"409\" data-orig-width=\"486\"/></figure><p>Hades (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.thinglink.com%2Fscene%2F509804173668122625&amp;t=YzA4YjNlNDFjMDhkZWVlY2VkMjdlODUwMzQwNzZkOGRmMWQzY2ViMiw4YTUwN2I0ZjQ0NGNkODhiOWY3MmQ2MjhiYjg3OTA2YWVhN2M1MjFl\">source</a>)</p><figure class=\"tmblr-full\" data-orig-height=\"458\" data-orig-width=\"640\"><img src=\"https://66.media.tumblr.com/35ed73488274bda3b09dfdeb972e20d0/tumblr_inline_pktxoc4BCY1uuoxzq_640.jpg\" data-orig-height=\"458\" data-orig-width=\"640\"/></figure><p>Hades and Persephone (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.thinglink.com%2Fscene%2F509804173668122625&amp;t=YzA4YjNlNDFjMDhkZWVlY2VkMjdlODUwMzQwNzZkOGRmMWQzY2ViMiw4YTUwN2I0ZjQ0NGNkODhiOWY3MmQ2MjhiYjg3OTA2YWVhN2M1MjFl\">source</a>)</p><figure class=\"tmblr-full\" data-orig-height=\"267\" data-orig-width=\"189\"><img src=\"https://66.media.tumblr.com/7ed21d663b8858a14f0d65ce6f163be5/tumblr_inline_pktxpviW6u1uuoxzq_250.jpg\" data-orig-height=\"267\" data-orig-width=\"189\"/></figure><p>Hades and Persephone <a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fencrypted-tbn0.gstatic.com%2Fimages%3Fq%3Dtbn%3AANd9GcSc5edcivkD9kXTlSip-uIvHXT9_egIsOezU7bf45BlKOQyV6ew&amp;t=ODJhY2NiOWRlZjYyZDA4ZjNmNjAyZGMwOWMwZDQxYWE4YTRhYzY5MSw2YjU5ZDNlYTUyMjZhYTdiMTI1ODAzZTUzY2I3N2RmMDE4NTczM2E5\">(source</a>) EDIT: I’ve been informed that this actually IS Sandor and Sansa, but modeled after Hades and Persephone. Cool!</p><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"300\"><img src=\"https://66.media.tumblr.com/d98ca12a47bf420b1aef916a2cace03b/tumblr_inline_pktxryRXyC1uuoxzq_400.jpg\" data-orig-height=\"250\" data-orig-width=\"300\"/></figure><p>Hades and Persephone (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fdata.whicdn.com%2Fimages%2F242400421%2Fsuperthumb.jpg%3Ft%3D1464717359&amp;t=MmVjMjQzOTFhMDczZTM1Zjg4ZGU3MGVhMmJmNDgxZTg4YTYwOTg2OSw5Njc5MjE3ODBiODE2YzdjNWFiNTY5YzAxY2ZkZDkxYmRlZDc1MTFi\">source</a>)</p><h2>If the two of them don’t look like Sandor and Sansa, I don’t know who does. Maybe I’m reaching, but it sure is fun to think about.</h2>",
        "reblog": {
            "comment": "<p><h1>Anyone else notice similarities between Sansa/Sandor and Persephone/Hades or is it just me?</h1><p><b><span class=\"npf_color_joey\">Persephone</span></b>- Also called, “The maiden.” Known for being beautiful. Wife of Hades, ruler of the underworld. Didn’t like Hades at first because of his cold-natured personality, but grew to love him. Described as having long red hair and blue eyes.</p><p><b><span class=\"npf_color_joey\">Hades</span></b>- Ruler of the underworld, AKA, the place that is on fire. Often pictured with Cerberus, the “Hound of Hades.” Cerberus was a 3-headed black dog. (Clegane sigil is 3 black dogs) Hades’ weakness was his passion for Persephone. Described as being gloomy, features include a beard and long dark hair.</p><p>Oh, and one more thing. Persephone &amp; Hades being together is associated with the coming of winter.</p><h2>The Visual Presentation:</h2><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"833\"><img src=\"https://66.media.tumblr.com/802f6a87288509282073809bb3d127e3/tumblr_inline_pktx0uW0oV1uuoxzq_1280.jpg\" data-orig-height=\"960\" data-orig-width=\"833\"></figure><p>Persephone <a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fmfelsman.edublogs.org%2Ffiles%2F2016%2F03%2Ftmp654741209742311426-1402n01.jpg&amp;t=ODZkYjA0MzRjMjVhZTEyYTczMGU5NDA0MTI4NmJjNjUwNGJlZjM3NCxmMWZjNmZlNWMzMzhhOWJlMTcyYzcyNTI1YmFjOTgxYTZhODliM2E4\">(source)</a> Notice the birds (”Little bird” “Little dove”)</p><figure class=\"tmblr-full\" data-orig-height=\"1550\" data-orig-width=\"960\"><img src=\"https://66.media.tumblr.com/93b953910bd7dfcc788524034672316a/tumblr_inline_pktx2sf8jv1uuoxzq_1280.jpg\" data-orig-height=\"1550\" data-orig-width=\"960\"></figure><p>Persephone (<a href=\"https://t.umblr.com/redirect?z=http%3A%2F%2Fi0.wp.com%2Fwww.trungcaoart.com%2Fwp-content%2Fuploads%2F2012%2F11%2Fpersephone-in-the-underworld.jpg%3Fresize%3D960%252C1550&amp;t=YTEyODRmMGRhZmJjNzEzZDc1MGQ4NGJlZGM4ZmFjOWZmOTlmNWM3YixiMWMwYjhlNzA0MjM2MWQwYzYyYjgzYzA5NzA4NGJkYTJlZTk3MjVh\">source</a>) Pomegranates are often shown in images of Persephone. She was offered pomegranate and refused. (In the books, Petyr Baelish offers Sansa pomegranate, and she refuses.)</p><figure class=\"tmblr-full\" data-orig-height=\"168\" data-orig-width=\"300\"><img src=\"https://66.media.tumblr.com/b7047d6546b7592b0116db8d44d3889f/tumblr_inline_pktxf3ZH8u1uuoxzq_400.jpg\" data-orig-height=\"168\" data-orig-width=\"300\"></figure><p>Hades (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fencrypted-tbn0.gstatic.com%2Fimages%3Fq%3Dtbn%3AANd9GcQr7dJUgL66Ab2XSyKWgs6KyxGGUdw-DbBd2ZUfqFoRP6aN6uCL&amp;t=N2ViOTAxZmEyMWNjYWY1OTU2MzQyZDhlY2RkY2E4Njc3ODE2M2NjOSxlMmNkYjJmZjViNThkOTU2MDg2NzlmZTRmMGIxNzlmNTM1ODFjZGM5\">source)</a></p><figure class=\"tmblr-full\" data-orig-height=\"409\" data-orig-width=\"486\"><img src=\"https://66.media.tumblr.com/085bb108baf1ffd02d3f5ea1dd01b0f5/tumblr_inline_pktxj6CA2t1uuoxzq_500.jpg\" data-orig-height=\"409\" data-orig-width=\"486\"></figure><p>Hades (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.thinglink.com%2Fscene%2F509804173668122625&amp;t=YzA4YjNlNDFjMDhkZWVlY2VkMjdlODUwMzQwNzZkOGRmMWQzY2ViMiw4YTUwN2I0ZjQ0NGNkODhiOWY3MmQ2MjhiYjg3OTA2YWVhN2M1MjFl\">source</a>)</p><figure class=\"tmblr-full\" data-orig-height=\"458\" data-orig-width=\"640\"><img src=\"https://66.media.tumblr.com/35ed73488274bda3b09dfdeb972e20d0/tumblr_inline_pktxoc4BCY1uuoxzq_640.jpg\" data-orig-height=\"458\" data-orig-width=\"640\"></figure><p>Hades and Persephone (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.thinglink.com%2Fscene%2F509804173668122625&amp;t=YzA4YjNlNDFjMDhkZWVlY2VkMjdlODUwMzQwNzZkOGRmMWQzY2ViMiw4YTUwN2I0ZjQ0NGNkODhiOWY3MmQ2MjhiYjg3OTA2YWVhN2M1MjFl\">source</a>)</p><figure class=\"tmblr-full\" data-orig-height=\"267\" data-orig-width=\"189\"><img src=\"https://66.media.tumblr.com/7ed21d663b8858a14f0d65ce6f163be5/tumblr_inline_pktxpviW6u1uuoxzq_250.jpg\" data-orig-height=\"267\" data-orig-width=\"189\"></figure><p>Hades and Persephone <a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fencrypted-tbn0.gstatic.com%2Fimages%3Fq%3Dtbn%3AANd9GcSc5edcivkD9kXTlSip-uIvHXT9_egIsOezU7bf45BlKOQyV6ew&amp;t=ODJhY2NiOWRlZjYyZDA4ZjNmNjAyZGMwOWMwZDQxYWE4YTRhYzY5MSw2YjU5ZDNlYTUyMjZhYTdiMTI1ODAzZTUzY2I3N2RmMDE4NTczM2E5\">(source</a>) EDIT: I’ve been informed that this actually IS Sandor and Sansa, but modeled after Hades and Persephone. Cool!</p><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"300\"><img src=\"https://66.media.tumblr.com/d98ca12a47bf420b1aef916a2cace03b/tumblr_inline_pktxryRXyC1uuoxzq_400.jpg\" data-orig-height=\"250\" data-orig-width=\"300\"></figure><p>Hades and Persephone (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fdata.whicdn.com%2Fimages%2F242400421%2Fsuperthumb.jpg%3Ft%3D1464717359&amp;t=MmVjMjQzOTFhMDczZTM1Zjg4ZGU3MGVhMmJmNDgxZTg4YTYwOTg2OSw5Njc5MjE3ODBiODE2YzdjNWFiNTY5YzAxY2ZkZDkxYmRlZDc1MTFi\">source</a>)</p><h2>If the two of them don’t look like Sandor and Sansa, I don’t know who does. Maybe I’m reaching, but it sure is fun to think about.</h2></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "maxbetta",
                    "active": true,
                    "theme": {
                        "header_full_width": 722,
                        "header_full_height": 1280,
                        "header_focus_width": 722,
                        "header_focus_height": 406,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,722,406,0",
                        "header_image": "https://static.tumblr.com/072f74bdaddcc6a2f63b1a4d5ef11ea0/ccw4jxy/725pfbrle/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/072f74bdaddcc6a2f63b1a4d5ef11ea0/ccw4jxy/4Ybpfbrlf/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/072f74bdaddcc6a2f63b1a4d5ef11ea0/ccw4jxy/725pfbrle/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#D95E40",
                        "title_font": "1785 GLC Baskerville",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181721411080"
                },
                "content_raw": "<p><h1>Anyone else notice similarities between Sansa/Sandor and Persephone/Hades or is it just me?</h1><p><b><span class=\"npf_color_joey\">Persephone</span></b>- Also called, “The maiden.” Known for being beautiful. Wife of Hades, ruler of the underworld. Didn’t like Hades at first because of his cold-natured personality, but grew to love him. Described as having long red hair and blue eyes.</p><p><b><span class=\"npf_color_joey\">Hades</span></b>- Ruler of the underworld, AKA, the place that is on fire. Often pictured with Cerberus, the “Hound of Hades.” Cerberus was a 3-headed black dog. (Clegane sigil is 3 black dogs) Hades’ weakness was his passion for Persephone. Described as being gloomy, features include a beard and long dark hair.</p><p>Oh, and one more thing. Persephone &amp; Hades being together is associated with the coming of winter.</p><h2>The Visual Presentation:</h2><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"833\"><img src=\"https://66.media.tumblr.com/802f6a87288509282073809bb3d127e3/tumblr_inline_pktx0uW0oV1uuoxzq_1280.jpg\" data-orig-height=\"960\" data-orig-width=\"833\"></figure><p>Persephone <a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fmfelsman.edublogs.org%2Ffiles%2F2016%2F03%2Ftmp654741209742311426-1402n01.jpg&amp;t=ODZkYjA0MzRjMjVhZTEyYTczMGU5NDA0MTI4NmJjNjUwNGJlZjM3NCxmMWZjNmZlNWMzMzhhOWJlMTcyYzcyNTI1YmFjOTgxYTZhODliM2E4\">(source)</a> Notice the birds (”Little bird” “Little dove”)</p><figure class=\"tmblr-full\" data-orig-height=\"1550\" data-orig-width=\"960\"><img src=\"https://66.media.tumblr.com/93b953910bd7dfcc788524034672316a/tumblr_inline_pktx2sf8jv1uuoxzq_1280.jpg\" data-orig-height=\"1550\" data-orig-width=\"960\"></figure><p>Persephone (<a href=\"https://t.umblr.com/redirect?z=http%3A%2F%2Fi0.wp.com%2Fwww.trungcaoart.com%2Fwp-content%2Fuploads%2F2012%2F11%2Fpersephone-in-the-underworld.jpg%3Fresize%3D960%252C1550&amp;t=YTEyODRmMGRhZmJjNzEzZDc1MGQ4NGJlZGM4ZmFjOWZmOTlmNWM3YixiMWMwYjhlNzA0MjM2MWQwYzYyYjgzYzA5NzA4NGJkYTJlZTk3MjVh\">source</a>) Pomegranates are often shown in images of Persephone. She was offered pomegranate and refused. (In the books, Petyr Baelish offers Sansa pomegranate, and she refuses.)</p><figure class=\"tmblr-full\" data-orig-height=\"168\" data-orig-width=\"300\"><img src=\"https://66.media.tumblr.com/b7047d6546b7592b0116db8d44d3889f/tumblr_inline_pktxf3ZH8u1uuoxzq_400.jpg\" data-orig-height=\"168\" data-orig-width=\"300\"></figure><p>Hades (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fencrypted-tbn0.gstatic.com%2Fimages%3Fq%3Dtbn%3AANd9GcQr7dJUgL66Ab2XSyKWgs6KyxGGUdw-DbBd2ZUfqFoRP6aN6uCL&amp;t=N2ViOTAxZmEyMWNjYWY1OTU2MzQyZDhlY2RkY2E4Njc3ODE2M2NjOSxlMmNkYjJmZjViNThkOTU2MDg2NzlmZTRmMGIxNzlmNTM1ODFjZGM5\">source)</a></p><figure class=\"tmblr-full\" data-orig-height=\"409\" data-orig-width=\"486\"><img src=\"https://66.media.tumblr.com/085bb108baf1ffd02d3f5ea1dd01b0f5/tumblr_inline_pktxj6CA2t1uuoxzq_500.jpg\" data-orig-height=\"409\" data-orig-width=\"486\"></figure><p>Hades (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.thinglink.com%2Fscene%2F509804173668122625&amp;t=YzA4YjNlNDFjMDhkZWVlY2VkMjdlODUwMzQwNzZkOGRmMWQzY2ViMiw4YTUwN2I0ZjQ0NGNkODhiOWY3MmQ2MjhiYjg3OTA2YWVhN2M1MjFl\">source</a>)</p><figure class=\"tmblr-full\" data-orig-height=\"458\" data-orig-width=\"640\"><img src=\"https://66.media.tumblr.com/35ed73488274bda3b09dfdeb972e20d0/tumblr_inline_pktxoc4BCY1uuoxzq_640.jpg\" data-orig-height=\"458\" data-orig-width=\"640\"></figure><p>Hades and Persephone (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.thinglink.com%2Fscene%2F509804173668122625&amp;t=YzA4YjNlNDFjMDhkZWVlY2VkMjdlODUwMzQwNzZkOGRmMWQzY2ViMiw4YTUwN2I0ZjQ0NGNkODhiOWY3MmQ2MjhiYjg3OTA2YWVhN2M1MjFl\">source</a>)</p><figure class=\"tmblr-full\" data-orig-height=\"267\" data-orig-width=\"189\"><img src=\"https://66.media.tumblr.com/7ed21d663b8858a14f0d65ce6f163be5/tumblr_inline_pktxpviW6u1uuoxzq_250.jpg\" data-orig-height=\"267\" data-orig-width=\"189\"></figure><p>Hades and Persephone <a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fencrypted-tbn0.gstatic.com%2Fimages%3Fq%3Dtbn%3AANd9GcSc5edcivkD9kXTlSip-uIvHXT9_egIsOezU7bf45BlKOQyV6ew&amp;t=ODJhY2NiOWRlZjYyZDA4ZjNmNjAyZGMwOWMwZDQxYWE4YTRhYzY5MSw2YjU5ZDNlYTUyMjZhYTdiMTI1ODAzZTUzY2I3N2RmMDE4NTczM2E5\">(source</a>) EDIT: I’ve been informed that this actually IS Sandor and Sansa, but modeled after Hades and Persephone. Cool!</p><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"300\"><img src=\"https://66.media.tumblr.com/d98ca12a47bf420b1aef916a2cace03b/tumblr_inline_pktxryRXyC1uuoxzq_400.jpg\" data-orig-height=\"250\" data-orig-width=\"300\"></figure><p>Hades and Persephone (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fdata.whicdn.com%2Fimages%2F242400421%2Fsuperthumb.jpg%3Ft%3D1464717359&amp;t=MmVjMjQzOTFhMDczZTM1Zjg4ZGU3MGVhMmJmNDgxZTg4YTYwOTg2OSw5Njc5MjE3ODBiODE2YzdjNWFiNTY5YzAxY2ZkZDkxYmRlZDc1MTFi\">source</a>)</p><h2>If the two of them don’t look like Sandor and Sansa, I don’t know who does. Maybe I’m reaching, but it sure is fun to think about.</h2></p>",
                "content": "<p><h1>Anyone else notice similarities between Sansa/Sandor and Persephone/Hades or is it just me?</h1><p><b><span class=\"npf_color_joey\">Persephone</span></b>- Also called,&nbsp;&ldquo;The maiden.&rdquo; Known for being beautiful. Wife of Hades, ruler of the underworld. Didn&rsquo;t like Hades at first because of his cold-natured personality, but grew to love him. Described as having long red hair and blue eyes.</p><p><b><span class=\"npf_color_joey\">Hades</span></b>- Ruler of the underworld, AKA, the place that is on fire. Often pictured with Cerberus, the&nbsp;&ldquo;Hound of Hades.&rdquo; Cerberus was a 3-headed black dog. (Clegane sigil is 3 black dogs) Hades&rsquo; weakness was his passion for Persephone. Described as being gloomy, features include a beard and long dark hair.</p><p>Oh, and one more thing. Persephone &amp; Hades being together is associated with the coming of winter.</p><h2>The Visual Presentation:</h2><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/802f6a87288509282073809bb3d127e3/tumblr_inline_pktx0uW0oV1uuoxzq_1280.jpg\" class=\"\"/></figure><p>Persephone <a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fmfelsman.edublogs.org%2Ffiles%2F2016%2F03%2Ftmp654741209742311426-1402n01.jpg&amp;t=ODZkYjA0MzRjMjVhZTEyYTczMGU5NDA0MTI4NmJjNjUwNGJlZjM3NCxmMWZjNmZlNWMzMzhhOWJlMTcyYzcyNTI1YmFjOTgxYTZhODliM2E4\">(source)</a>&nbsp;Notice the birds (&rdquo;Little bird&rdquo;&nbsp;&ldquo;Little dove&rdquo;)</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/93b953910bd7dfcc788524034672316a/tumblr_inline_pktx2sf8jv1uuoxzq_1280.jpg\" class=\"\"/></figure><p>Persephone (<a href=\"https://t.umblr.com/redirect?z=http%3A%2F%2Fi0.wp.com%2Fwww.trungcaoart.com%2Fwp-content%2Fuploads%2F2012%2F11%2Fpersephone-in-the-underworld.jpg%3Fresize%3D960%252C1550&amp;t=YTEyODRmMGRhZmJjNzEzZDc1MGQ4NGJlZGM4ZmFjOWZmOTlmNWM3YixiMWMwYjhlNzA0MjM2MWQwYzYyYjgzYzA5NzA4NGJkYTJlZTk3MjVh\">source</a>) Pomegranates are often shown in images of Persephone. She was offered pomegranate and refused. (In the books, Petyr Baelish offers Sansa pomegranate, and she refuses.)</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/b7047d6546b7592b0116db8d44d3889f/tumblr_inline_pktxf3ZH8u1uuoxzq_400.jpg\" class=\"\"/></figure><p>Hades (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fencrypted-tbn0.gstatic.com%2Fimages%3Fq%3Dtbn%3AANd9GcQr7dJUgL66Ab2XSyKWgs6KyxGGUdw-DbBd2ZUfqFoRP6aN6uCL&amp;t=N2ViOTAxZmEyMWNjYWY1OTU2MzQyZDhlY2RkY2E4Njc3ODE2M2NjOSxlMmNkYjJmZjViNThkOTU2MDg2NzlmZTRmMGIxNzlmNTM1ODFjZGM5\">source)</a></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/085bb108baf1ffd02d3f5ea1dd01b0f5/tumblr_inline_pktxj6CA2t1uuoxzq_500.jpg\" class=\"\"/></figure><p>Hades (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.thinglink.com%2Fscene%2F509804173668122625&amp;t=YzA4YjNlNDFjMDhkZWVlY2VkMjdlODUwMzQwNzZkOGRmMWQzY2ViMiw4YTUwN2I0ZjQ0NGNkODhiOWY3MmQ2MjhiYjg3OTA2YWVhN2M1MjFl\">source</a>)</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/35ed73488274bda3b09dfdeb972e20d0/tumblr_inline_pktxoc4BCY1uuoxzq_640.jpg\" class=\"\"/></figure><p>Hades and Persephone (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.thinglink.com%2Fscene%2F509804173668122625&amp;t=YzA4YjNlNDFjMDhkZWVlY2VkMjdlODUwMzQwNzZkOGRmMWQzY2ViMiw4YTUwN2I0ZjQ0NGNkODhiOWY3MmQ2MjhiYjg3OTA2YWVhN2M1MjFl\">source</a>)</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/7ed21d663b8858a14f0d65ce6f163be5/tumblr_inline_pktxpviW6u1uuoxzq_250.jpg\" class=\"\"/></figure><p>Hades and Persephone <a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fencrypted-tbn0.gstatic.com%2Fimages%3Fq%3Dtbn%3AANd9GcSc5edcivkD9kXTlSip-uIvHXT9_egIsOezU7bf45BlKOQyV6ew&amp;t=ODJhY2NiOWRlZjYyZDA4ZjNmNjAyZGMwOWMwZDQxYWE4YTRhYzY5MSw2YjU5ZDNlYTUyMjZhYTdiMTI1ODAzZTUzY2I3N2RmMDE4NTczM2E5\">(source</a>) EDIT: I&rsquo;ve been informed that this actually IS Sandor and Sansa, but modeled after Hades and Persephone. Cool!</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d98ca12a47bf420b1aef916a2cace03b/tumblr_inline_pktxryRXyC1uuoxzq_400.jpg\" class=\"\"/></figure><p>Hades and Persephone (<a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fdata.whicdn.com%2Fimages%2F242400421%2Fsuperthumb.jpg%3Ft%3D1464717359&amp;t=MmVjMjQzOTFhMDczZTM1Zjg4ZGU3MGVhMmJmNDgxZTg4YTYwOTg2OSw5Njc5MjE3ODBiODE2YzdjNWFiNTY5YzAxY2ZkZDkxYmRlZDc1MTFi\">source</a>)</p><h2>If the two of them don&rsquo;t look like Sandor and Sansa, I don&rsquo;t know who does. Maybe I&rsquo;m reaching, but it sure is fun to think about.</h2></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "kylandara",
        "blog": {
            "name": "kylandara",
            "title": "Kyland",
            "description": "<p>Cats and Studing and Fashion!</p>",
            "url": "https://kylandara.tumblr.com/",
            "uuid": "t:CbqPZNNC7Fu1cJWzSTiSJA",
            "updated": 1560222799
        },
        "id": 181721020975,
        "post_url": "https://kylandara.tumblr.com/post/181721020975/next-instagram-post-ive-left-in-the-insta",
        "slug": "next-instagram-post-ive-left-in-the-insta",
        "date": "2019-01-04 23:03:25 GMT",
        "timestamp": 1546643005,
        "state": "published",
        "format": "html",
        "reblog_key": "CByIwrnz",
        "tags": [
            "anti got",
            "sansa stark"
        ],
        "short_url": "https://tmblr.co/Zec9wa2fFQhel",
        "summary": "Next Instagram post. I've left in the insta account! 😂😂😂😂😂😂, I've left in the tags as I think they seriously butchered Sansa's...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 4,
        "title": null,
        "body": "<p>Next Instagram post. I&rsquo;ve left in the insta account! 😂😂😂😂😂😂, I&rsquo;ve left in the tags as I think they seriously butchered Sansa&rsquo;s character hence why the tag is relevant to the picture above</p><figure class=\"tmblr-full\" data-orig-height=\"769\" data-orig-width=\"971\"><img src=\"https://66.media.tumblr.com/dce71179df20bfdec8a2dad554019490/tumblr_pktxdonBpW1vbhpxz_540.png\" data-orig-height=\"769\" data-orig-width=\"971\"/></figure>",
        "reblog": {
            "comment": "<p><p>Next Instagram post. I’ve left in the insta account! 😂😂😂😂😂😂, I’ve left in the tags as I think they seriously butchered Sansa’s character hence why the tag is relevant to the picture above</p><figure class=\"tmblr-full\" data-orig-height=\"769\" data-orig-width=\"971\"><img src=\"https://66.media.tumblr.com/dce71179df20bfdec8a2dad554019490/tumblr_pktxdonBpW1vbhpxz_540.png\" data-orig-height=\"769\" data-orig-width=\"971\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "kylandara",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/b3238cb056e173c6bef8eb3fb048e966/6xxqqgv/WnBp73sso/tumblr_static_cx5sux58v808w8g0wkgocgwso.jpg",
                        "header_image_focused": "https://static.tumblr.com/b3238cb056e173c6bef8eb3fb048e966/6xxqqgv/WnBp73sso/tumblr_static_cx5sux58v808w8g0wkgocgwso_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/b3238cb056e173c6bef8eb3fb048e966/6xxqqgv/WnBp73sso/tumblr_static_cx5sux58v808w8g0wkgocgwso_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#222222",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ff0008",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181721020975"
                },
                "content_raw": "<p><p>Next Instagram post. I’ve left in the insta account! 😂😂😂😂😂😂, I’ve left in the tags as I think they seriously butchered Sansa’s character hence why the tag is relevant to the picture above</p><figure class=\"tmblr-full\" data-orig-height=\"769\" data-orig-width=\"971\"><img src=\"https://66.media.tumblr.com/dce71179df20bfdec8a2dad554019490/tumblr_pktxdonBpW1vbhpxz_540.png\" data-orig-height=\"769\" data-orig-width=\"971\"></figure></p>",
                "content": "<p><p>Next Instagram post. I&rsquo;ve left in the insta account! &#128514;&#128514;&#128514;&#128514;&#128514;&#128514;, I&rsquo;ve left in the tags as I think they seriously butchered Sansa&rsquo;s character hence why the tag is relevant to the picture above</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/dce71179df20bfdec8a2dad554019490/tumblr_pktxdonBpW1vbhpxz_540.png\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "sayruq",
        "blog": {
            "name": "sayruq",
            "title": "404 url not found",
            "description": "",
            "url": "https://sayruq.tumblr.com/",
            "uuid": "t:DNbYwNQ6H6NUTgpN8-AKbw",
            "updated": 1561768268
        },
        "id": 181719440092,
        "post_url": "https://sayruq.tumblr.com/post/181719440092/this-is-how-antis-look-like-whenever-they-theorise",
        "slug": "this-is-how-antis-look-like-whenever-they-theorise",
        "date": "2019-01-04 22:03:15 GMT",
        "timestamp": 1546639395,
        "state": "published",
        "format": "html",
        "reblog_key": "AtyOViBD",
        "tags": [
            "Sansa Stark",
            "game of thrones",
            "song of ice and fire",
            "it aint happening"
        ],
        "short_url": "https://tmblr.co/ZcPeYo2fFKfhS",
        "summary": "this is how antis look like whenever they theorise sansa’s death:",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 6,
        "title": null,
        "body": "<p>this is how antis look like whenever they theorise sansa’s death:</p><figure class=\"tmblr-full\" data-orig-height=\"371\" data-orig-width=\"371\" data-tumblr-attribution=\"javrt:uv21QRNE9XxBYLfiDn1UOA:ZNCQhu2Jt5BIg\"><img src=\"https://66.media.tumblr.com/de82944b8f4cb4c1397eab121966f65a/tumblr_onav6piz8y1rc81g1o1_400.gif\" data-orig-height=\"371\" data-orig-width=\"371\"/></figure>",
        "reblog": {
            "comment": "<p><p>this is how antis look like whenever they theorise sansa’s death:</p><figure class=\"tmblr-full\" data-orig-height=\"371\" data-orig-width=\"371\" data-tumblr-attribution=\"javrt:uv21QRNE9XxBYLfiDn1UOA:ZNCQhu2Jt5BIg\"><img src=\"https://66.media.tumblr.com/de82944b8f4cb4c1397eab121966f65a/tumblr_onav6piz8y1rc81g1o1_400.gif\" data-orig-height=\"371\" data-orig-width=\"371\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "sayruq",
                    "active": true,
                    "theme": {
                        "header_full_width": 540,
                        "header_full_height": 304,
                        "header_focus_width": 540,
                        "header_focus_height": 303,
                        "avatar_shape": "circle",
                        "background_color": "#bbe4d0",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,540,303,0",
                        "header_image": "https://static.tumblr.com/49a939b5fb4ebc08fffc2c6d0a16d4c6/el9ks9m/zxcps6dgb/tumblr_static_8qpqneumfmkgw0cgsc0wwog8k.gif",
                        "header_image_focused": "https://static.tumblr.com/49a939b5fb4ebc08fffc2c6d0a16d4c6/el9ks9m/aN1ps6dgf/tumblr_static_tumblr_static_8qpqneumfmkgw0cgsc0wwog8k_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/49a939b5fb4ebc08fffc2c6d0a16d4c6/el9ks9m/zxcps6dgb/tumblr_static_8qpqneumfmkgw0cgsc0wwog8k_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#45966e",
                        "show_avatar": true,
                        "show_description": false,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Georgia",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181719440092"
                },
                "content_raw": "<p><p>this is how antis look like whenever they theorise sansa’s death:</p><figure class=\"tmblr-full\" data-orig-height=\"371\" data-orig-width=\"371\" data-tumblr-attribution=\"javrt:uv21QRNE9XxBYLfiDn1UOA:ZNCQhu2Jt5BIg\"><img src=\"https://66.media.tumblr.com/de82944b8f4cb4c1397eab121966f65a/tumblr_onav6piz8y1rc81g1o1_400.gif\" data-orig-height=\"371\" data-orig-width=\"371\"></figure></p>",
                "content": "<p><p>this is how antis look like whenever they theorise sansa&rsquo;s death:</p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "westerosiladies",
        "blog": {
            "name": "westerosiladies",
            "title": "GoT Ladies",
            "description": "A blog dedicated to the badass ladies of Westeros (There will probably be some stuff on the guys too, but mostly ladies)",
            "url": "https://westerosiladies.tumblr.com/",
            "uuid": "t:9t2J_JgNbdt9G56VoYrx9A",
            "updated": 1561762839
        },
        "id": 181719369471,
        "post_url": "https://westerosiladies.tumblr.com/post/181719369471",
        "slug": "",
        "date": "2019-01-04 22:00:30 GMT",
        "timestamp": 1546639230,
        "state": "published",
        "format": "html",
        "reblog_key": "tqcYFSZU",
        "tags": [
            "game of thrones",
            "king's landing",
            "tyrion lannister",
            "sansa stark",
            "petyr baelish",
            "aemon targaryen",
            "alliser thorne"
        ],
        "short_url": "https://tmblr.co/ZmNTnc2fFKOR-",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 390,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "photoset_layout": "111",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/d08877cb64942f13acdb580f6f88f069/tumblr_pkrnf6UD9r1wb2e0fo1_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/d08877cb64942f13acdb580f6f88f069/tumblr_pkrnf6UD9r1wb2e0fo1_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/d08877cb64942f13acdb580f6f88f069/tumblr_pkrnf6UD9r1wb2e0fo1_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/d08877cb64942f13acdb580f6f88f069/tumblr_pkrnf6UD9r1wb2e0fo1_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/d08877cb64942f13acdb580f6f88f069/tumblr_pkrnf6UD9r1wb2e0fo1_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/d08877cb64942f13acdb580f6f88f069/tumblr_pkrnf6UD9r1wb2e0fo1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/a179d867cd298801b5e06dc9db763c44/tumblr_pkrnf6UD9r1wb2e0fo2_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/a179d867cd298801b5e06dc9db763c44/tumblr_pkrnf6UD9r1wb2e0fo2_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/a179d867cd298801b5e06dc9db763c44/tumblr_pkrnf6UD9r1wb2e0fo2_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/a179d867cd298801b5e06dc9db763c44/tumblr_pkrnf6UD9r1wb2e0fo2_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/a179d867cd298801b5e06dc9db763c44/tumblr_pkrnf6UD9r1wb2e0fo2_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/a179d867cd298801b5e06dc9db763c44/tumblr_pkrnf6UD9r1wb2e0fo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/2823e88b98f0b78c80d51deab07d1829/tumblr_pkrnf6UD9r1wb2e0fo3_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/2823e88b98f0b78c80d51deab07d1829/tumblr_pkrnf6UD9r1wb2e0fo3_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/2823e88b98f0b78c80d51deab07d1829/tumblr_pkrnf6UD9r1wb2e0fo3_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/2823e88b98f0b78c80d51deab07d1829/tumblr_pkrnf6UD9r1wb2e0fo3_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/2823e88b98f0b78c80d51deab07d1829/tumblr_pkrnf6UD9r1wb2e0fo3_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/2823e88b98f0b78c80d51deab07d1829/tumblr_pkrnf6UD9r1wb2e0fo3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "amaati",
        "blog": {
            "name": "amaati",
            "title": "Amaati's Art",
            "description": "A place where I can put my art :). Requests and commissions are CLOSED.",
            "url": "https://amaati.tumblr.com/",
            "uuid": "t:eykkMp-Ykqya59Z9zKjA6g",
            "updated": 1561752670
        },
        "id": 181718233715,
        "post_url": "https://amaati.tumblr.com/post/181718233715/house-stark-finally-found-the-time-to-do-this",
        "slug": "house-stark-finally-found-the-time-to-do-this",
        "date": "2019-01-04 21:17:05 GMT",
        "timestamp": 1546636625,
        "state": "published",
        "format": "html",
        "reblog_key": "DD49ghsi",
        "tags": [
            "sansa stark",
            "arya stark",
            "jon snow",
            "robb stark",
            "ned stark",
            "catelyn stark",
            "bran stark",
            "rickon stark",
            "house stark",
            "a song of ice and fire",
            "asoiaf",
            "my art"
        ],
        "short_url": "https://tmblr.co/Zr6sHh2fFG39p",
        "summary": "House Stark (Finally found the time to do this, and gosh did it take forever! I would love to draw other Asoiaf houses, but I...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1433,
        "caption": "<p><i>House Stark</i></p><p>(Finally found the time to do this, and gosh did it take forever! I would love to draw other Asoiaf houses, but I don’t know when i’ll have the time to&hellip;)</p>",
        "reblog": {
            "comment": "<p><i>House Stark</i></p><p>(Finally found the time to do this, and gosh did it take forever! I would love to draw other Asoiaf houses, but I don’t know when i’ll have the time to…)</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "amaati",
                    "active": true,
                    "theme": {
                        "header_full_width": 4200,
                        "header_full_height": 2491,
                        "header_focus_width": 2048,
                        "header_focus_height": 1152,
                        "avatar_shape": "circle",
                        "background_color": "#CCB6DB",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "157,3723,1955,527",
                        "header_image": "https://static.tumblr.com/f07d98f01b4e663c272ad5b09c0392f2/f48xv2i/9yLp2qhhp/tumblr_static_8zexzfcpr1gkk4kwkokkwwccs.jpg",
                        "header_image_focused": "https://static.tumblr.com/f07d98f01b4e663c272ad5b09c0392f2/f48xv2i/W9Ep2qhhw/tumblr_static_tumblr_static_8zexzfcpr1gkk4kwkokkwwccs_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f07d98f01b4e663c272ad5b09c0392f2/f48xv2i/9yLp2qhhp/tumblr_static_8zexzfcpr1gkk4kwkokkwwccs_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#ECE1CC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#F0E8D8",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181718233715"
                },
                "content_raw": "<p><i>House Stark</i></p><p>(Finally found the time to do this, and gosh did it take forever! I would love to draw other Asoiaf houses, but I don’t know when i’ll have the time to…)</p>",
                "content": "<p><i>House Stark</i></p><p>(Finally found the time to do this, and gosh did it take forever! I would love to draw other Asoiaf houses, but I don&rsquo;t know when i&rsquo;ll have the time to&hellip;)</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://amaati.tumblr.com/image/181718233715",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/228fdfc71d98bf539ad7919c4d4501f1/tumblr_pktsghLstI1vs2rzso1_1280.jpg",
                    "width": 1280,
                    "height": 1280
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/228fdfc71d98bf539ad7919c4d4501f1/tumblr_pktsghLstI1vs2rzso1_1280.jpg",
                        "width": 1280,
                        "height": 1280
                    },
                    {
                        "url": "https://66.media.tumblr.com/228fdfc71d98bf539ad7919c4d4501f1/tumblr_pktsghLstI1vs2rzso1_640.jpg",
                        "width": 640,
                        "height": 640
                    },
                    {
                        "url": "https://66.media.tumblr.com/228fdfc71d98bf539ad7919c4d4501f1/tumblr_pktsghLstI1vs2rzso1_540.jpg",
                        "width": 540,
                        "height": 540
                    },
                    {
                        "url": "https://66.media.tumblr.com/228fdfc71d98bf539ad7919c4d4501f1/tumblr_pktsghLstI1vs2rzso1_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/228fdfc71d98bf539ad7919c4d4501f1/tumblr_pktsghLstI1vs2rzso1_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/228fdfc71d98bf539ad7919c4d4501f1/tumblr_pktsghLstI1vs2rzso1_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/228fdfc71d98bf539ad7919c4d4501f1/tumblr_pktsghLstI1vs2rzso1_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/228fdfc71d98bf539ad7919c4d4501f1/tumblr_pktsghLstI1vs2rzso1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "rosetylecr",
        "blog": {
            "name": "rosetylecr",
            "title": "ᴅᴏᴏᴍ ᴅᴀʏꜱ",
            "description": "emi, 24, italy · night will fall and drown the sun",
            "url": "https://rosetylecr.tumblr.com/",
            "uuid": "t:2QhkMmRx6xI6YIPsZ9eQ8Q",
            "updated": 1561759910
        },
        "id": 181718003247,
        "post_url": "https://rosetylecr.tumblr.com/post/181718003247/i-am-sansa-stark-of-winterfell-this-is-my-home",
        "slug": "i-am-sansa-stark-of-winterfell-this-is-my-home",
        "date": "2019-01-04 21:07:09 GMT",
        "timestamp": 1546636029,
        "state": "published",
        "format": "html",
        "reblog_key": "cdQGU7Dd",
        "tags": [
            "sansa stark",
            "gotsansastark",
            "sansastarkedit",
            "gotedit",
            "gotsources",
            "got",
            "*gif",
            "mine",
            "i think this is the first time i gif sansa???"
        ],
        "short_url": "https://tmblr.co/Ze_gXx2fFFAul",
        "summary": "I am Sansa Stark of Winterfell. This is my home. And you can’t frighten me.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 833,
        "caption": "<p><small>I am Sansa Stark of Winterfell. This is my home. And you can’t frighten me.</small></p>",
        "reblog": {
            "comment": "<p><small>I am Sansa Stark of Winterfell. This is my home. And you can’t frighten me.</small></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "rosetylecr",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 500,
                        "header_focus_width": 500,
                        "header_focus_height": 281,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "46,500,327,0",
                        "header_image": "https://static.tumblr.com/fa8c19d685ed01ace3234fc21546f331/pkiyval/NfIpq2hyr/tumblr_static_7h7ma6nhfj4088kg8ck8csko8.jpg",
                        "header_image_focused": "https://static.tumblr.com/e5161778e5826552aa4f0733ce238101/pkiyval/Gncpq2hys/tumblr_static_tumblr_static_7h7ma6nhfj4088kg8ck8csko8_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/fa8c19d685ed01ace3234fc21546f331/pkiyval/NfIpq2hyr/tumblr_static_7h7ma6nhfj4088kg8ck8csko8_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#ffffff",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#222222",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181718003247"
                },
                "content_raw": "<p><small>I am Sansa Stark of Winterfell. This is my home. And you can’t frighten me.</small></p>",
                "content": "<p><small>I am Sansa Stark of Winterfell. This is my home. And you can&rsquo;t frighten me.</small></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "22222",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/694edf0db9e1ac55e158eeccc05483f0/tumblr_pkt8f9BAr31qjemobo2_250.gif",
                    "width": 245,
                    "height": 120
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/694edf0db9e1ac55e158eeccc05483f0/tumblr_pkt8f9BAr31qjemobo2_250.gif",
                        "width": 245,
                        "height": 120
                    },
                    {
                        "url": "https://66.media.tumblr.com/694edf0db9e1ac55e158eeccc05483f0/tumblr_pkt8f9BAr31qjemobo2_100.gif",
                        "width": 100,
                        "height": 49
                    },
                    {
                        "url": "https://66.media.tumblr.com/694edf0db9e1ac55e158eeccc05483f0/tumblr_pkt8f9BAr31qjemobo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/cd737ca6dce469b066bc60c3e4b84fc5/tumblr_pkt8f9BAr31qjemobo9_r1_250.gif",
                    "width": 245,
                    "height": 120
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/cd737ca6dce469b066bc60c3e4b84fc5/tumblr_pkt8f9BAr31qjemobo9_r1_250.gif",
                        "width": 245,
                        "height": 120
                    },
                    {
                        "url": "https://66.media.tumblr.com/cd737ca6dce469b066bc60c3e4b84fc5/tumblr_pkt8f9BAr31qjemobo9_r1_100.gif",
                        "width": 100,
                        "height": 49
                    },
                    {
                        "url": "https://66.media.tumblr.com/cd737ca6dce469b066bc60c3e4b84fc5/tumblr_pkt8f9BAr31qjemobo9_r1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/c58f6f7add3c2b6c64c78702ef473a6d/tumblr_pkt8f9BAr31qjemobo5_r1_250.gif",
                    "width": 245,
                    "height": 120
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/c58f6f7add3c2b6c64c78702ef473a6d/tumblr_pkt8f9BAr31qjemobo5_r1_250.gif",
                        "width": 245,
                        "height": 120
                    },
                    {
                        "url": "https://66.media.tumblr.com/c58f6f7add3c2b6c64c78702ef473a6d/tumblr_pkt8f9BAr31qjemobo5_r1_100.gif",
                        "width": 100,
                        "height": 49
                    },
                    {
                        "url": "https://66.media.tumblr.com/c58f6f7add3c2b6c64c78702ef473a6d/tumblr_pkt8f9BAr31qjemobo5_r1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/1dec3a11cb5164ec6ef7af7d0025f855/tumblr_pkt8f9BAr31qjemobo3_r1_250.gif",
                    "width": 245,
                    "height": 120
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/1dec3a11cb5164ec6ef7af7d0025f855/tumblr_pkt8f9BAr31qjemobo3_r1_250.gif",
                        "width": 245,
                        "height": 120
                    },
                    {
                        "url": "https://66.media.tumblr.com/1dec3a11cb5164ec6ef7af7d0025f855/tumblr_pkt8f9BAr31qjemobo3_r1_100.gif",
                        "width": 100,
                        "height": 49
                    },
                    {
                        "url": "https://66.media.tumblr.com/1dec3a11cb5164ec6ef7af7d0025f855/tumblr_pkt8f9BAr31qjemobo3_r1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/247cd24b467738bb7ac6633bbdf1d7aa/tumblr_pkt8f9BAr31qjemobo6_r1_250.gif",
                    "width": 245,
                    "height": 120
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/247cd24b467738bb7ac6633bbdf1d7aa/tumblr_pkt8f9BAr31qjemobo6_r1_250.gif",
                        "width": 245,
                        "height": 120
                    },
                    {
                        "url": "https://66.media.tumblr.com/247cd24b467738bb7ac6633bbdf1d7aa/tumblr_pkt8f9BAr31qjemobo6_r1_100.gif",
                        "width": 100,
                        "height": 49
                    },
                    {
                        "url": "https://66.media.tumblr.com/247cd24b467738bb7ac6633bbdf1d7aa/tumblr_pkt8f9BAr31qjemobo6_r1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/57ac0311a4341477dcc65222f616a60c/tumblr_pkt8f9BAr31qjemobo1_r2_250.gif",
                    "width": 245,
                    "height": 120
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/57ac0311a4341477dcc65222f616a60c/tumblr_pkt8f9BAr31qjemobo1_r2_250.gif",
                        "width": 245,
                        "height": 120
                    },
                    {
                        "url": "https://66.media.tumblr.com/57ac0311a4341477dcc65222f616a60c/tumblr_pkt8f9BAr31qjemobo1_r2_100.gif",
                        "width": 100,
                        "height": 49
                    },
                    {
                        "url": "https://66.media.tumblr.com/57ac0311a4341477dcc65222f616a60c/tumblr_pkt8f9BAr31qjemobo1_r2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/b0eb13dbbdbff9a774dcee846e55a676/tumblr_pkt8f9BAr31qjemobo7_r1_250.gif",
                    "width": 245,
                    "height": 120
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/b0eb13dbbdbff9a774dcee846e55a676/tumblr_pkt8f9BAr31qjemobo7_r1_250.gif",
                        "width": 245,
                        "height": 120
                    },
                    {
                        "url": "https://66.media.tumblr.com/b0eb13dbbdbff9a774dcee846e55a676/tumblr_pkt8f9BAr31qjemobo7_r1_100.gif",
                        "width": 100,
                        "height": 49
                    },
                    {
                        "url": "https://66.media.tumblr.com/b0eb13dbbdbff9a774dcee846e55a676/tumblr_pkt8f9BAr31qjemobo7_r1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/579fa3a603af6808b0e41ddd2b27bfe4/tumblr_pkt8f9BAr31qjemobo8_r1_250.gif",
                    "width": 245,
                    "height": 120
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/579fa3a603af6808b0e41ddd2b27bfe4/tumblr_pkt8f9BAr31qjemobo8_r1_250.gif",
                        "width": 245,
                        "height": 120
                    },
                    {
                        "url": "https://66.media.tumblr.com/579fa3a603af6808b0e41ddd2b27bfe4/tumblr_pkt8f9BAr31qjemobo8_r1_100.gif",
                        "width": 100,
                        "height": 49
                    },
                    {
                        "url": "https://66.media.tumblr.com/579fa3a603af6808b0e41ddd2b27bfe4/tumblr_pkt8f9BAr31qjemobo8_r1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/54b83d538fe4bc8c1afa4c16f2c90e35/tumblr_pkt8f9BAr31qjemobo4_r1_250.gif",
                    "width": 245,
                    "height": 120
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/54b83d538fe4bc8c1afa4c16f2c90e35/tumblr_pkt8f9BAr31qjemobo4_r1_250.gif",
                        "width": 245,
                        "height": 120
                    },
                    {
                        "url": "https://66.media.tumblr.com/54b83d538fe4bc8c1afa4c16f2c90e35/tumblr_pkt8f9BAr31qjemobo4_r1_100.gif",
                        "width": 100,
                        "height": 49
                    },
                    {
                        "url": "https://66.media.tumblr.com/54b83d538fe4bc8c1afa4c16f2c90e35/tumblr_pkt8f9BAr31qjemobo4_r1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/7e9d05fcefc2056312f5cda165f90039/tumblr_pkt8f9BAr31qjemobo10_r3_250.gif",
                    "width": 245,
                    "height": 120
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/7e9d05fcefc2056312f5cda165f90039/tumblr_pkt8f9BAr31qjemobo10_r3_250.gif",
                        "width": 245,
                        "height": 120
                    },
                    {
                        "url": "https://66.media.tumblr.com/7e9d05fcefc2056312f5cda165f90039/tumblr_pkt8f9BAr31qjemobo10_r3_100.gif",
                        "width": 100,
                        "height": 49
                    },
                    {
                        "url": "https://66.media.tumblr.com/7e9d05fcefc2056312f5cda165f90039/tumblr_pkt8f9BAr31qjemobo10_r3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "thefeatherofhope",
        "blog": {
            "name": "thefeatherofhope",
            "title": "Littlefeather",
            "description": "It's about what you believe. \nAnd I believe in love 💗",
            "url": "https://thefeatherofhope.tumblr.com/",
            "uuid": "t:GG8hkxSWJzjutoxYRVRJvA",
            "updated": 1561766769
        },
        "id": 181717244535,
        "post_url": "https://thefeatherofhope.tumblr.com/post/181717244535/the-northern-mail-order-bride-update-read-chapter",
        "slug": "the-northern-mail-order-bride-update-read-chapter",
        "date": "2019-01-04 20:33:56 GMT",
        "timestamp": 1546634036,
        "state": "published",
        "format": "html",
        "reblog_key": "r0k7LXPS",
        "tags": [
            "sansan",
            "sansa x sandor",
            "sandor clegane",
            "sansa stark",
            "sansan fanfiction"
        ],
        "short_url": "https://tmblr.co/ZjalAv2fFCHft",
        "summary": "The Northern Mail Order Bride Update Read Chapter 2 Reluctantly Sandor filled out the endless questionnaires and submitted to...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 39,
        "caption": "<p>The Northern Mail Order Bride Update</p><p>Read <a href=\"https://archiveofourown.org/works/16664644/chapters/40695503\" target=\"_blank\">Chapter 2</a></p><p>Reluctantly Sandor filled out the endless questionnaires and submitted to personality tests, all the while doubting any woman, no matter how poor, would overlook his scarred face. Missandei had assured him that northern women weren’t as shallow as those in the south and that scars held a cultural significance for many there. It all sounded like a load of horse shit to him but after much needling from his friends, he posted his profile.</p><p>Sansa Stark was the first profile Missandei showed him, the young woman coming with high praises that were unusual from the marriage broker.  He couldn’t take his eyes off of her and hadn’t wanted to look any further even though Missandei had insisted that he browse the site.</p><p>Indeed, no matter how many profiles Sandor looked at, time and again his mind wandered back to her. Sansa was breathtakingly beautiful, but it was her eyes that kept him returning to her profile – as sad and blue as they were lovely, the dark emotions contained within them belied the happy smile she gave the camera. The need to protect oneself behind a mask was something Sandor was deeply familiar with, and he wanted to discover what else lay hidden beneath her poised veneer.</p>",
        "reblog": {
            "comment": "<p>The Northern Mail Order Bride Update</p><p>Read <a href=\"https://archiveofourown.org/works/16664644/chapters/40695503\" target=\"_blank\">Chapter 2</a></p><p>Reluctantly Sandor filled out the endless questionnaires and submitted to personality tests, all the while doubting any woman, no matter how poor, would overlook his scarred face. Missandei had assured him that northern women weren’t as shallow as those in the south and that scars held a cultural significance for many there. It all sounded like a load of horse shit to him but after much needling from his friends, he posted his profile.</p><p>Sansa Stark was the first profile Missandei showed him, the young woman coming with high praises that were unusual from the marriage broker.  He couldn’t take his eyes off of her and hadn’t wanted to look any further even though Missandei had insisted that he browse the site.</p><p>Indeed, no matter how many profiles Sandor looked at, time and again his mind wandered back to her. Sansa was breathtakingly beautiful, but it was her eyes that kept him returning to her profile – as sad and blue as they were lovely, the dark emotions contained within them belied the happy smile she gave the camera. The need to protect oneself behind a mask was something Sandor was deeply familiar with, and he wanted to discover what else lay hidden beneath her poised veneer.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thefeatherofhope",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#F7F7F7",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/0c071743bb8cd36464afcbce4120f339/pn73mng/L8mptdqh2/tumblr_static_-2094928011-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/0c071743bb8cd36464afcbce4120f339/pn73mng/L8mptdqh2/tumblr_static_-2094928011-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/0c071743bb8cd36464afcbce4120f339/pn73mng/L8mptdqh2/tumblr_static_-2094928011-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#5C2E53",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#CB5479",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181717244535"
                },
                "content_raw": "<p>The Northern Mail Order Bride Update</p><p>Read <a href=\"https://archiveofourown.org/works/16664644/chapters/40695503\" target=\"_blank\">Chapter 2</a></p><p>Reluctantly Sandor filled out the endless questionnaires and submitted to personality tests, all the while doubting any woman, no matter how poor, would overlook his scarred face. Missandei had assured him that northern women weren’t as shallow as those in the south and that scars held a cultural significance for many there. It all sounded like a load of horse shit to him but after much needling from his friends, he posted his profile.</p><p>Sansa Stark was the first profile Missandei showed him, the young woman coming with high praises that were unusual from the marriage broker.  He couldn’t take his eyes off of her and hadn’t wanted to look any further even though Missandei had insisted that he browse the site.</p><p>Indeed, no matter how many profiles Sandor looked at, time and again his mind wandered back to her. Sansa was breathtakingly beautiful, but it was her eyes that kept him returning to her profile – as sad and blue as they were lovely, the dark emotions contained within them belied the happy smile she gave the camera. The need to protect oneself behind a mask was something Sandor was deeply familiar with, and he wanted to discover what else lay hidden beneath her poised veneer.</p>",
                "content": "<p>The Northern Mail Order Bride Update</p><p>Read&nbsp;<a href=\"https://archiveofourown.org/works/16664644/chapters/40695503\" target=\"_blank\">Chapter 2</a></p><p>Reluctantly Sandor filled out the endless questionnaires and submitted to personality tests, all the while doubting any woman, no matter how poor, would overlook his scarred face. Missandei had assured him that northern women weren&rsquo;t as shallow as those in the south and that scars held a cultural significance for many there. It all sounded like a load of horse shit to him but after much needling from his friends, he posted his profile.</p><p>Sansa Stark was the first profile Missandei showed him, the young woman coming with high praises that were unusual from the marriage broker.&nbsp; He couldn&rsquo;t take his eyes off of her and hadn&rsquo;t wanted to look any further even though Missandei had insisted that he browse the site.</p><p>Indeed, no matter how many profiles Sandor looked at, time and again his mind wandered back to her. Sansa was breathtakingly beautiful, but it was her eyes that kept him returning to her profile &ndash; as sad and blue as they were lovely, the dark emotions contained within them belied the happy smile she gave the camera. The need to protect oneself behind a mask was something Sandor was deeply familiar with, and he wanted to discover what else lay hidden beneath her poised veneer.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://thefeatherofhope.tumblr.com/image/181717244535",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/7cb8c56213d390cec060f8597a175767/tumblr_pktqgk4zsu1rxomgoo1_1280.jpg",
                    "width": 1280,
                    "height": 1280
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/7cb8c56213d390cec060f8597a175767/tumblr_pktqgk4zsu1rxomgoo1_1280.jpg",
                        "width": 1280,
                        "height": 1280
                    },
                    {
                        "url": "https://66.media.tumblr.com/7cb8c56213d390cec060f8597a175767/tumblr_pktqgk4zsu1rxomgoo1_640.jpg",
                        "width": 640,
                        "height": 640
                    },
                    {
                        "url": "https://66.media.tumblr.com/7cb8c56213d390cec060f8597a175767/tumblr_pktqgk4zsu1rxomgoo1_540.jpg",
                        "width": 540,
                        "height": 540
                    },
                    {
                        "url": "https://66.media.tumblr.com/7cb8c56213d390cec060f8597a175767/tumblr_pktqgk4zsu1rxomgoo1_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/7cb8c56213d390cec060f8597a175767/tumblr_pktqgk4zsu1rxomgoo1_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/7cb8c56213d390cec060f8597a175767/tumblr_pktqgk4zsu1rxomgoo1_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/7cb8c56213d390cec060f8597a175767/tumblr_pktqgk4zsu1rxomgoo1_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/7cb8c56213d390cec060f8597a175767/tumblr_pktqgk4zsu1rxomgoo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "maxbetta",
        "blog": {
            "name": "maxbetta",
            "title": "Sansan & Fanfiction",
            "description": "<p>I ❤️Sansan</p><p>Proud member of the Hound’s Harem</p><p>Maxbetta on AO3</p><p>Bookworm - Aspiring knitter - Hygge enthusiast Caffeine addict - Pub trivia nerd - Mug collector</p><p>Sometimes I make inappropriate jokes</p>",
            "url": "https://maxbetta.tumblr.com/",
            "uuid": "t:iOfncdTDDO_1JQNuBBiX0A",
            "updated": 1561392785
        },
        "id": 181717205840,
        "post_url": "https://maxbetta.tumblr.com/post/181717205840/saw-this-in-an-asoiaf-group-im-in-and-felt-it-was",
        "slug": "saw-this-in-an-asoiaf-group-im-in-and-felt-it-was",
        "date": "2019-01-04 20:32:15 GMT",
        "timestamp": 1546633935,
        "state": "published",
        "format": "html",
        "reblog_key": "9hReCWcj",
        "tags": [
            "sansan",
            "sandor clegane",
            "sansa stark",
            "sandor x sansa",
            "asoiaf",
            "game of thrones",
            "rhaegar targaryen",
            "lyanna stark"
        ],
        "short_url": "https://tmblr.co/Z5vS1g2fFC8DG",
        "summary": "Saw this in an ASOIAF group I’m in and felt it was worth sharing. \nHypocrisy at its finest.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 33,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"827\" data-orig-width=\"1242\"><img src=\"https://66.media.tumblr.com/5a2bd78dec5f94187f5f420273aafeee/tumblr_pktqdridHq1uuoxzq_540.jpg\" data-orig-height=\"827\" data-orig-width=\"1242\"/></figure><p>Saw this in an ASOIAF group I’m in and felt it was worth sharing. </p><p><br/></p><p>Hypocrisy at its finest.</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"827\" data-orig-width=\"1242\"><img src=\"https://66.media.tumblr.com/5a2bd78dec5f94187f5f420273aafeee/tumblr_pktqdridHq1uuoxzq_540.jpg\" data-orig-height=\"827\" data-orig-width=\"1242\"></figure><p>Saw this in an ASOIAF group I’m in and felt it was worth sharing. </p><p><br></p><p>Hypocrisy at its finest.</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "maxbetta",
                    "active": true,
                    "theme": {
                        "header_full_width": 722,
                        "header_full_height": 1280,
                        "header_focus_width": 722,
                        "header_focus_height": 406,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,722,406,0",
                        "header_image": "https://static.tumblr.com/072f74bdaddcc6a2f63b1a4d5ef11ea0/ccw4jxy/725pfbrle/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/072f74bdaddcc6a2f63b1a4d5ef11ea0/ccw4jxy/4Ybpfbrlf/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/072f74bdaddcc6a2f63b1a4d5ef11ea0/ccw4jxy/725pfbrle/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#D95E40",
                        "title_font": "1785 GLC Baskerville",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181717205840"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"827\" data-orig-width=\"1242\"><img src=\"https://66.media.tumblr.com/5a2bd78dec5f94187f5f420273aafeee/tumblr_pktqdridHq1uuoxzq_540.jpg\" data-orig-height=\"827\" data-orig-width=\"1242\"></figure><p>Saw this in an ASOIAF group I’m in and felt it was worth sharing. </p><p><br></p><p>Hypocrisy at its finest.</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/5a2bd78dec5f94187f5f420273aafeee/tumblr_pktqdridHq1uuoxzq_540.jpg\" class=\"\"/></figure><p>Saw this in an ASOIAF group I&rsquo;m in and felt it was worth sharing. </p><p><br /></p><p>Hypocrisy at its finest.</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "of-2wo-minds",
        "blog": {
            "name": "of-2wo-minds",
            "title": "Of_Two_Minds",
            "description": "I make some youtube videos.\n Reblog some stuff.\nThe net is vast",
            "url": "https://of-2wo-minds.tumblr.com/",
            "uuid": "t:xsw4Gv7yAh_xN4Blq5rPsw",
            "updated": 1561739046
        },
        "id": 181715699202,
        "post_url": "https://of-2wo-minds.tumblr.com/post/181715699202/the-jon-parentage-reveal",
        "slug": "the-jon-parentage-reveal",
        "date": "2019-01-04 19:25:41 GMT",
        "timestamp": 1546629941,
        "state": "published",
        "format": "html",
        "reblog_key": "D2c29It7",
        "tags": [
            "game of thrones",
            "sansa stark",
            "jon snow",
            "daenerys targaryen",
            "got8",
            "cersei lannister",
            "jaime lannister",
            "tyrion lannister"
        ],
        "short_url": "https://tmblr.co/ZXNgGY2fF6OO2",
        "summary": "The Jon parentage reveal",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 2,
        "title": null,
        "body": "<h1>The Jon parentage reveal</h1><p>Kit keeps saying Jon cannot tell a lie. So I do believe Jon wont keep the reveal a secret from Dany. I think it will shake Jon to his core. After all these years wondering to find out he was never a bastard and to also find out you are rheagar son Ned hid&hellip; well is alot. </p><p>People keep saying dany will be threatened. I think initially yes. But it wont last long. I think she will look forward to ruling Westeros with another targaryen. She would want to rule together with him by her side. </p><p>Here is where I think many fans are overlooking. What does Jon want. Jon&rsquo;s top priority is the Night king and his army. I do not think he want to rule Westeros or live in kings landing. It&rsquo;s crazy how people are already talking about their baby as if its fact. As if that would lock in their union. </p><p>The reveal will be a blow to their relationship I think. History has a way of repeating itself in game of thrones.  And I dont see the ruling of targaryens over Westeros as the ending to game of thrones. After all the Gods flip a coin is quoted too much for it to be thrown away with two great targaryen rulers to bring in the spring with two giant dragons of mass destruction.</p><p>This is not a commentary on shipping btw. I do not care about that. Dany and jon are in love I know.</p><p>But realistically how do you really see game of thrones ending. I think jon and dany are going to be the most important pieces in the final season but not for reasons many seem to believe.</p>",
        "reblog": {
            "comment": "<p><h1>The Jon parentage reveal</h1><p>Kit keeps saying Jon cannot tell a lie. So I do believe Jon wont keep the reveal a secret from Dany. I think it will shake Jon to his core. After all these years wondering to find out he was never a bastard and to also find out you are rheagar son Ned hid… well is alot. </p><p>People keep saying dany will be threatened. I think initially yes. But it wont last long. I think she will look forward to ruling Westeros with another targaryen. She would want to rule together with him by her side. </p><p>Here is where I think many fans are overlooking. What does Jon want. Jon’s top priority is the Night king and his army. I do not think he want to rule Westeros or live in kings landing. It’s crazy how people are already talking about their baby as if its fact. As if that would lock in their union. </p><p>The reveal will be a blow to their relationship I think. History has a way of repeating itself in game of thrones.  And I dont see the ruling of targaryens over Westeros as the ending to game of thrones. After all the Gods flip a coin is quoted too much for it to be thrown away with two great targaryen rulers to bring in the spring with two giant dragons of mass destruction.</p><p>This is not a commentary on shipping btw. I do not care about that. Dany and jon are in love I know.</p><p>But realistically how do you really see game of thrones ending. I think jon and dany are going to be the most important pieces in the final season but not for reasons many seem to believe.</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "of-2wo-minds",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/e1ab29b57a7074f067b2445aa4d6934a/1rdyobo/a2apgtt45/tumblr_static_5hmkql984m4gkoccgg48w4wcg.png",
                        "header_image_focused": "https://static.tumblr.com/e1ab29b57a7074f067b2445aa4d6934a/1rdyobo/a2apgtt45/tumblr_static_5hmkql984m4gkoccgg48w4wcg_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/e1ab29b57a7074f067b2445aa4d6934a/1rdyobo/a2apgtt45/tumblr_static_5hmkql984m4gkoccgg48w4wcg_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181715699202"
                },
                "content_raw": "<p><h1>The Jon parentage reveal</h1><p>Kit keeps saying Jon cannot tell a lie. So I do believe Jon wont keep the reveal a secret from Dany. I think it will shake Jon to his core. After all these years wondering to find out he was never a bastard and to also find out you are rheagar son Ned hid… well is alot. </p><p>People keep saying dany will be threatened. I think initially yes. But it wont last long. I think she will look forward to ruling Westeros with another targaryen. She would want to rule together with him by her side. </p><p>Here is where I think many fans are overlooking. What does Jon want. Jon’s top priority is the Night king and his army. I do not think he want to rule Westeros or live in kings landing. It’s crazy how people are already talking about their baby as if its fact. As if that would lock in their union. </p><p>The reveal will be a blow to their relationship I think. History has a way of repeating itself in game of thrones.  And I dont see the ruling of targaryens over Westeros as the ending to game of thrones. After all the Gods flip a coin is quoted too much for it to be thrown away with two great targaryen rulers to bring in the spring with two giant dragons of mass destruction.</p><p>This is not a commentary on shipping btw. I do not care about that. Dany and jon are in love I know.</p><p>But realistically how do you really see game of thrones ending. I think jon and dany are going to be the most important pieces in the final season but not for reasons many seem to believe.</p></p>",
                "content": "<p><h1>The Jon parentage reveal</h1><p>Kit keeps saying Jon cannot tell a lie. So I do believe Jon wont keep the reveal a secret from Dany. I think it will shake Jon to his core. After all these years wondering to find out he was never a bastard and to also find out you are rheagar son Ned hid&hellip; well is alot. </p><p>People keep saying dany will be threatened. I think initially yes. But it wont last long. I think she will look forward to ruling Westeros with another targaryen. She would want to rule together with him by her side. </p><p>Here is where I think many fans are overlooking. What does Jon want. Jon&rsquo;s top priority is the Night king and his army. I do not think he want to rule Westeros or live in kings landing. It&rsquo;s crazy how people are already talking about their baby as if its fact. As if that would lock in their union. </p><p>The reveal will be a blow to their relationship I think. History has a way of repeating itself in game of thrones.  And I dont see the ruling of targaryens over Westeros as the ending to game of thrones. After all the Gods flip a coin is quoted too much for it to be thrown away with two great targaryen rulers to bring in the spring with two giant dragons of mass destruction.</p><p>This is not a commentary on shipping btw. I do not care about that. Dany and jon are in love I know.</p><p>But realistically how do you really see game of thrones ending. I think jon and dany are going to be the most important pieces in the final season but not for reasons many seem to believe.</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "fedonciadale",
        "blog": {
            "name": "fedonciadale",
            "title": "FedonCiadale",
            "description": "Fantasy aficionado since I read Tolkien in my teenage years. I still love Tolkien but I am also into other works. I love ASOIAF (books) and GoT (Show). I also like Brandon Sanderson, Lois McMaster Bujold, in short in my free time it's fantasy...Header by courtesy of ragekitn! ",
            "url": "https://fedonciadale.tumblr.com/",
            "uuid": "t:ldA0C9REPIshq10W6HNMSA",
            "updated": 1561752192
        },
        "id": 181714903440,
        "post_url": "https://fedonciadale.tumblr.com/post/181714903440/to-go-south-chapter-35-planning-in-council",
        "slug": "to-go-south-chapter-35-planning-in-council",
        "date": "2019-01-04 18:50:42 GMT",
        "timestamp": 1546627842,
        "state": "published",
        "format": "html",
        "reblog_key": "M10u8RPH",
        "tags": [
            "Jonsa",
            "JonxSansa",
            "Jonsaff",
            "Jonxsansaff",
            "Sansa Stark",
            "Jon Snow",
            "Arya Stark",
            "Bran Stark",
            "To go south",
            "chapter 35",
            "Planning in council",
            "Jonsansaff"
        ],
        "short_url": "https://tmblr.co/ZP5HTf2fF3M6G",
        "summary": "To go south - chapter 35 - Planning in council",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 6,
        "title": "To go south - chapter 35 - Planning in council",
        "body": "<p>Here is another chapter of my slowburn. Finally, Jon and Sansa are reunited, but politics get in the way and they have to discuss what to do about Jon’s claim to the throne. Also on <a href=\"https://archiveofourown.org/works/8470255/chapters/40692992\">AO3</a>.</p><p>Jon was so\ntired, he thought he would fall asleep on his feet. Now that he had arrived,\nand they had somehow managed to beat the White Walkers at least for the moment,\nhis immediate fear was gone, but he felt dread creeping at his heart. Somehow,\nhe had managed to come in time to save Winterfell, but he did not want to meet\nSansa as a married woman, or rather he did not want to meet her husband. He\nthought of Arya’s letter of Lord Royce’s letter, of Sansa’s letter.</p><!-- more --><p><i>I have no wish but to set eyes again on you\nbefore I die.</i> He\nwould see Sansa’s face again, but would she be Littlefinger’s wife? Or\nSweetrobin’s? He had seen many knights of the Vale amongst the fighting and he feared\nwhat this might mean.</p><p>Arya began\nto push Bran’s chair determinedly and they made their way to the castle.</p><p>Sansa met\nthem half-way and began to run, when she saw Jon. Seeing her lifted Jon’s heart\nand his tiredness fell from him. <i>It does\nnot matter, she is alive, I can see her. I can love her, even if she is married\nto another, I don’t have to feel guilt over my love. At least we have that.</i></p><p>He wanted\nto hug her forever, to breathe in her smell, but the many eyes watching them\nmade him cautious. Sansa had had a tough time, he could see. Somebody had\ninjured her at her throat and Jon wanted to kill the person who had dared to\nmar her skin. She looked tired as well. </p><p>Sansa\nlaughed. “You’re alive! You’ve come back to us!” Her laughter was infectious,\nand Jon found himself laughing as well.</p><p>“I\nunderstand you know Olyvar?”, Jon asked. “He has been a great help.”</p><p>Olyvar had\nbeen with him, carrying that bloody banner all the time. The cloth hang limp now.</p><p>“I see,\nyour path has brought you back to Winterfell! Welcome back!” Sansa said.\n“Hoster will be very happy to see you.”</p><p>Olyvar\nbowed. He looked as if he would fall on his back any moment, but he clutched\nthe staff of the banner. </p><p>“What is on\nthat banner?” Arya asked curiously. Olyvar eyed her warily, but Jon had to\nlaugh. </p><p>“I haven’t\ndecided yet. If you ask Jaime Lannister it should be green dragon with grey\nwolf in his mouth or vice versa. I can’t remember. He kept giving me\nsuggestions on our way north.”</p><p>“Jaime\nLannister?”, Sansa asked. “So, you did have a meeting with him?”</p><p>“This is a\nlong story. I don’t even know, where to start. I’ll tell you later in detail. Jaime\nLannister and the troops from the Riverlands are on their way to help us.”</p><p>“So, the\nparley was a success?”</p><p>Jon\ngrimaced. “It depends, what you would define as success.”</p><p>Arya\nshrugged. “You brought a dragon and saved us, and another army is on its way.\nI’d call this a success.”</p><p>“How long\nuntil they arrive here?”, Sansa asked.</p><p>“It will be\nseveral weeks. Brienne promised they would march as fast as they can, but such\na large army will take some time to get here in the mid of winter.”</p><p>“They will\nlikely be on time”, Bran said. “Brienne will drive them relentlessly.”</p><p>Jon looked\nat Bran, curious. His cousin had grown, he looked like a young man, far too\nserious for his age though.</p><p>“We have to\ninform the council on everything and we have to plan. We do have another\nproblem after all.” Bran insisted. He looked at Jon. “You did after all claim\nthe Iron Throne.”</p><p>Jon’s good\nmood left him. </p><p>“Can’t we get some sleep first? I’m glad to see\nyou all, but I don’t feel up to spar words with Littlefinger.”</p><p>“Littlefinger?” Arya asked.</p><p>“Yes, Littlefinger, I was informed by Lord\nRoyce that I might have to welcome him into the family, or is he already your\nhusband?”. The anguish Jon had felt over Royce’s letter got hold of him again.\nA cold hand clutched at his heart.</p><p>“Littlefinger is dead,” Sansa said. “Arya and I\nunmasked his treachery, he got a trial and was sentenced to death.” She touched\nher throat.</p><p><i>He! He hurt her! Dead?\nHe is dead?</i></p><p>It took Jon a moment to understand this. He\nturned to Sansa. “You’re not married to him?”</p><p>“No, whatever made you think Sansa would marry\na douche like Littlefinger?” That was Arya.</p><p>Jon was confused. “You did. You wrote about\nmarriage plans and Lord Royce also wrote to me about marriage plans. Are you\ntelling me there was no marriage? Not to Littlefinger? Not to Sweetrobin?”</p><p>“Oh, you got that letter? I am so sorry, I\nmisunderstood everything.” Arya became as red as a beet root. She grimaced. “I\nalmost didn’t realise that Littlefinger was playing a game.”</p><p>“So, there was no marriage?” Jon’s voice\nsounded strange in his ears.</p><p>“You thought, I was married?”, Sansa asked. Her\ncheeks were red. Jon thought about Sansa whispering into Ghost’s ears and felt\nthe blood rush to his own face. He nodded silently while looking into Sansa’s\neyes. <i>I have no wish but to set eyes on\nyou again before I die.</i> He could hardly believe, that he had managed to\narrive in time. His heart beat fast.</p><p>“We should convene and get everyone informed.”\nBran interrupted them.</p><p>Jon spent the next hour in a daze. He could\nhardly believe anything his cousins told him. Bran a seer, and strong in magic,\nas he himself had witnessed, and his little sister, <i>no cousin</i>, a spy, decoding Littlefinger’s secret diary with Sansa. Littlefinger\nas the instigator to Robert’s rebellion. </p><p>There was something else Arya kept silent\nabout. He could see it it, not in her eyes that gave nothing away, but in Sansa’s.\nSansa knew but obviously did not think this was for the whole council to know. He\nwatched Sansa while she told how they had tricked Littlefinger and how she had\nalmost been killed if it had not been for Ghost. He felt like his eyes were glued\nto her lips and he barely registered, when it was his time to tell what had\nhappened to him. He told almost everything, only leaving out his one night\ntryst with queen Daenerys. He felt that in light of his newfound parentage it\nwould not do any good. Also, he felt embarrassed about his desperation when he\nhad learned about a marriage alliance that didn’t even happen. </p><p>It made explaining how exactly Daenerys had managed\nto read the letters meant for him a difficult task, but fortunately Arya was\nself-conscious about her letter as was Lord Royce who kept apologizing for his\nmistake, until Sansa told him, that he could not possibly have known, that she\nand Arya were hard on Littlefinger’s trail.</p><p>“Daenerys insisted that I bend the knee and let\nher decide on every Stark marriage. And she wanted me to deliver Brienne of\nTarth to her as a dragonslayer. I could not do that and was already inclined to\nclaim the throne, albeit reluctantly, when I got the news that Winterfell was\nunder siege.”</p><p>He looked at Sansa. <i>I have no wish but to set eyes again on you before I die.</i> </p><p>“I claimed the dragon, with help from Bran,” he\nlooked at his cousin questioningly, and Bran nodded. “I flew to the Riverlands\nand dropped off Ser Jaime, Brienne and Davos with the army there. I publically\nmade a bid for the Iron Throne and took the name Aegon that was given to me at\nmy birth. The Riverlands army will come to Winterfell as will the wildfire Ser\nDavos smuggled from King’s Landing. The wildfire is on its way here as well. I\nentrusted it to the hands of Samwell Tarly, a brother of the Night’s watch, and\nGendry, a natural son of Robert Baratheon.”</p><p>“Gendry!”, Arya jumped up. “You saw Gendry.”</p><p>Jon couldn’t help himself. He grinned. “He\nremembered you as well.”</p><p>“He better does!” Arya exclaimed. “I was so\nworried he died at the hand of that witch.”</p><p>“He’ll be happy to see you safe and sound as\nwell, if I understood him correctly.” Jon raised his hand. “That can be talked\nabout later. For now, I felt that I needed to explain myself to you all. I am\nvery sorry, that I could not take any council but that of Ser Davos, when I had\nto decide what to do with the knowledge about my parents. I decided to not trust\nDaenerys further when she turned on the promise she had given. And I decided to\nuse my claim. But that has set me against her, I fear. She will not like that I\nstole Rhaegal nor will she easily let go of her own claim.” <i>My dear aunt.</i> A part of him regretted\nthat circumstances had set them up on opposite sides, but he had seen no other\nsolution and still did not see any.</p><p>Jon sighed deeply. “I am nothing but a guest\nhere at Winterfell. I have no claim to the allegiance of the North, which is an\nindependent kingdom, but I will fight for the North, if you will have me.”</p><p>“We can hardly complain, when you came here on\ntime on a dragon to save us.” Lord Royce said. “We fought bravely, but we would\nhave been overwhelmed by now. And you brought armies, dragonglass and wildfire.”</p><p>“Bran should be King in the North,” Jon said.</p><p>But Bran shook his head. “I am the Three-eyed\nRaven. I have power enough.”</p><p>“Then Sansa should be Queen.” </p><p>Jon looked at her. She would make a marvellous queen.\nSuddenly he wondered if he could try to woo her, woo her for real. He had been\nso relieved that she was not married to Littlefinger. But his mind only made\nthe connection now. He was not only free to love her, he was free to woo her.</p><p>But would a marriage alliance with a self-proclaimed\nking be to her advantage at all? Would it make sense for him as a pretender to\nally himself with her? The prospect to marry Sansa had him so excited that he\ndid not know if it would make political sense. It was as if his mind was so set\non marrying Sansa that he did not know, if it would be a good idea in the current\ncircumstance. He was pondering whether he should even bring this up. Or would\nthey all laugh in his face? Laugh that a Targaryen pretender would be so arrogant\nas to dare reach for a daughter of house Stark? Or be afraid that Rhaegar’s son\nwould steal Lyanna’s niece?</p><p>His mind was reeling at the possibilities and\nat first, he did not realise that Lord Royce was talking again.</p><p>“…. considering the last time, I proposed a\nmarriage, I hardly dare to speak again, but I think there is a solution for\nthis tricky question.”</p><p><i>He can’t mean what I\nthink he means. </i>Jon\nstole another look at Sansa. Her cheeks were red. <i>Does she think the same?</i></p><p>“Lady Sansa should not marry her cousin Sweetrobin,\nbut her other cousin, Aegon. We would position ourselves firmly at his side,\nbut considering that he chose to stake his claim only to come to our aid, that\nseems only fair. The North would have a strong standing in the seven kingdoms,\nstronger than ever before and if the King and the Queen have children, the\nThrone and Winterfell could go to different children, thus securing the independence\nof the North.”</p><p>“You want Sansa to marry Jon?” Arya exclaimed.\nShe had jumped up again.</p><p>“It is what makes the most sense. He could\nprove to everybody, that he values the North. They could rule together, and Stark\nand Targaryen can stand against the threat from the North. And the Riverlands.\nAnd the Vale would stand with Lady Sansa as we stood in the Battle of the\nBastards.”</p><p>Jon saw that Sansa’s cheeks were still dark\nwith colour, but she stayed silent and looked in her lap. She had opened her\nmouth just a tiny bit, and Jon felt as if he could see her breath smoothing the\ndelicate flesh of her slightly parted lips. </p><p>Arya snorted. “That is a crackbrained idea.” Her\neyes searched the table, but the Northern Lords were nodding in approval to\nLord Royce. Bran also nodded shortly.</p><p>Arya looked at Sansa, her head bent to the\nside. She sat again. “Well, Jon would certainly treat you well, there’s that.”</p><p>Sansa still didn’t say anything. To Jon she\nlooked afraid, flustered. And then he understood. <i>She doesn’t know I love her. She feels this is just about her claim,\njust like the other times.</i></p><p>He stood up. <i>Oh Gods, let me do this right!</i></p><p>“My lords, I might not be your king any longer,\nbut while I was king, it was decided by this council that women in the North\nshould decide themselves on their marriages. I am sure, Lady Sansa is grateful\nfor your council, but she is the one who has to decide.”</p><p>Sansa raised her gaze to his eyes, a flicker of\nhope in her eyes.</p><p>“Lady Sansa, would you do me the honour of lending\nme your ears for a private and urgent conversation?”</p><p>He stretched out his hand. Sansa stood as well,\nher eyes still locked to his and took his hand.</p><p>“My lords,” she said. “It seems Aegon Targaryen\nwants to discuss a matter of state. I ask for your leave and want to adjourn this\ncouncil until I will have decided in this matter.”</p>",
        "body_abstract": "\n<p>Here is another chapter of my slowburn. Finally, Jon and Sansa are reunited, but politics get in the way and they have to discuss what to do about Jon&rsquo;s claim to the throne. Also on <a href=\"https://archiveofourown.org/works/8470255/chapters/40692992\">AO3</a>.</p>\n<p>Jon was so\ntired, he thought he would fall asleep on his feet. Now that he had arrived,\nand they had somehow managed to beat the White Walkers at least for the moment,\nhis immediate fear was gone, but he felt dread creeping at his heart. Somehow,\nhe had managed to come in time to save Winterfell, but he did not want to meet\nSansa as a married woman, or rather he did not want to meet her husband. He\nthought of Arya&rsquo;s letter of Lord Royce&rsquo;s letter, of Sansa&rsquo;s letter.</p>\n",
        "reblog": {
            "comment": "<p>Here is another chapter of my slowburn. Finally, Jon and Sansa are reunited, but politics get in the way and they have to discuss what to do about Jon’s claim to the throne. Also on <a href=\"https://archiveofourown.org/works/8470255/chapters/40692992\">AO3</a>.</p><p>Jon was so\ntired, he thought he would fall asleep on his feet. Now that he had arrived,\nand they had somehow managed to beat the White Walkers at least for the moment,\nhis immediate fear was gone, but he felt dread creeping at his heart. Somehow,\nhe had managed to come in time to save Winterfell, but he did not want to meet\nSansa as a married woman, or rather he did not want to meet her husband. He\nthought of Arya’s letter of Lord Royce’s letter, of Sansa’s letter.</p>[[MORE]]<p><i>I have no wish but to set eyes again on you\nbefore I die.</i> He\nwould see Sansa’s face again, but would she be Littlefinger’s wife? Or\nSweetrobin’s? He had seen many knights of the Vale amongst the fighting and he feared\nwhat this might mean.</p><p>Arya began\nto push Bran’s chair determinedly and they made their way to the castle.</p><p>Sansa met\nthem half-way and began to run, when she saw Jon. Seeing her lifted Jon’s heart\nand his tiredness fell from him. <i>It does\nnot matter, she is alive, I can see her. I can love her, even if she is married\nto another, I don’t have to feel guilt over my love. At least we have that.</i></p><p>He wanted\nto hug her forever, to breathe in her smell, but the many eyes watching them\nmade him cautious. Sansa had had a tough time, he could see. Somebody had\ninjured her at her throat and Jon wanted to kill the person who had dared to\nmar her skin. She looked tired as well. </p><p>Sansa\nlaughed. “You’re alive! You’ve come back to us!” Her laughter was infectious,\nand Jon found himself laughing as well.</p><p>“I\nunderstand you know Olyvar?”, Jon asked. “He has been a great help.”</p><p>Olyvar had\nbeen with him, carrying that bloody banner all the time. The cloth hang limp now.</p><p>“I see,\nyour path has brought you back to Winterfell! Welcome back!” Sansa said.\n“Hoster will be very happy to see you.”</p><p>Olyvar\nbowed. He looked as if he would fall on his back any moment, but he clutched\nthe staff of the banner. </p><p>“What is on\nthat banner?” Arya asked curiously. Olyvar eyed her warily, but Jon had to\nlaugh. </p><p>“I haven’t\ndecided yet. If you ask Jaime Lannister it should be green dragon with grey\nwolf in his mouth or vice versa. I can’t remember. He kept giving me\nsuggestions on our way north.”</p><p>“Jaime\nLannister?”, Sansa asked. “So, you did have a meeting with him?”</p><p>“This is a\nlong story. I don’t even know, where to start. I’ll tell you later in detail. Jaime\nLannister and the troops from the Riverlands are on their way to help us.”</p><p>“So, the\nparley was a success?”</p><p>Jon\ngrimaced. “It depends, what you would define as success.”</p><p>Arya\nshrugged. “You brought a dragon and saved us, and another army is on its way.\nI’d call this a success.”</p><p>“How long\nuntil they arrive here?”, Sansa asked.</p><p>“It will be\nseveral weeks. Brienne promised they would march as fast as they can, but such\na large army will take some time to get here in the mid of winter.”</p><p>“They will\nlikely be on time”, Bran said. “Brienne will drive them relentlessly.”</p><p>Jon looked\nat Bran, curious. His cousin had grown, he looked like a young man, far too\nserious for his age though.</p><p>“We have to\ninform the council on everything and we have to plan. We do have another\nproblem after all.” Bran insisted. He looked at Jon. “You did after all claim\nthe Iron Throne.”</p><p>Jon’s good\nmood left him. </p><p>“Can’t we get some sleep first? I’m glad to see\nyou all, but I don’t feel up to spar words with Littlefinger.”</p><p>“Littlefinger?” Arya asked.</p><p>“Yes, Littlefinger, I was informed by Lord\nRoyce that I might have to welcome him into the family, or is he already your\nhusband?”. The anguish Jon had felt over Royce’s letter got hold of him again.\nA cold hand clutched at his heart.</p><p>“Littlefinger is dead,” Sansa said. “Arya and I\nunmasked his treachery, he got a trial and was sentenced to death.” She touched\nher throat.</p><p><i>He! He hurt her! Dead?\nHe is dead?</i></p><p>It took Jon a moment to understand this. He\nturned to Sansa. “You’re not married to him?”</p><p>“No, whatever made you think Sansa would marry\na douche like Littlefinger?” That was Arya.</p><p>Jon was confused. “You did. You wrote about\nmarriage plans and Lord Royce also wrote to me about marriage plans. Are you\ntelling me there was no marriage? Not to Littlefinger? Not to Sweetrobin?”</p><p>“Oh, you got that letter? I am so sorry, I\nmisunderstood everything.” Arya became as red as a beet root. She grimaced. “I\nalmost didn’t realise that Littlefinger was playing a game.”</p><p>“So, there was no marriage?” Jon’s voice\nsounded strange in his ears.</p><p>“You thought, I was married?”, Sansa asked. Her\ncheeks were red. Jon thought about Sansa whispering into Ghost’s ears and felt\nthe blood rush to his own face. He nodded silently while looking into Sansa’s\neyes. <i>I have no wish but to set eyes on\nyou again before I die.</i> He could hardly believe, that he had managed to\narrive in time. His heart beat fast.</p><p>“We should convene and get everyone informed.”\nBran interrupted them.</p><p>Jon spent the next hour in a daze. He could\nhardly believe anything his cousins told him. Bran a seer, and strong in magic,\nas he himself had witnessed, and his little sister, <i>no cousin</i>, a spy, decoding Littlefinger’s secret diary with Sansa. Littlefinger\nas the instigator to Robert’s rebellion. </p><p>There was something else Arya kept silent\nabout. He could see it it, not in her eyes that gave nothing away, but in Sansa’s.\nSansa knew but obviously did not think this was for the whole council to know. He\nwatched Sansa while she told how they had tricked Littlefinger and how she had\nalmost been killed if it had not been for Ghost. He felt like his eyes were glued\nto her lips and he barely registered, when it was his time to tell what had\nhappened to him. He told almost everything, only leaving out his one night\ntryst with queen Daenerys. He felt that in light of his newfound parentage it\nwould not do any good. Also, he felt embarrassed about his desperation when he\nhad learned about a marriage alliance that didn’t even happen. </p><p>It made explaining how exactly Daenerys had managed\nto read the letters meant for him a difficult task, but fortunately Arya was\nself-conscious about her letter as was Lord Royce who kept apologizing for his\nmistake, until Sansa told him, that he could not possibly have known, that she\nand Arya were hard on Littlefinger’s trail.</p><p>“Daenerys insisted that I bend the knee and let\nher decide on every Stark marriage. And she wanted me to deliver Brienne of\nTarth to her as a dragonslayer. I could not do that and was already inclined to\nclaim the throne, albeit reluctantly, when I got the news that Winterfell was\nunder siege.”</p><p>He looked at Sansa. <i>I have no wish but to set eyes again on you before I die.</i> </p><p>“I claimed the dragon, with help from Bran,” he\nlooked at his cousin questioningly, and Bran nodded. “I flew to the Riverlands\nand dropped off Ser Jaime, Brienne and Davos with the army there. I publically\nmade a bid for the Iron Throne and took the name Aegon that was given to me at\nmy birth. The Riverlands army will come to Winterfell as will the wildfire Ser\nDavos smuggled from King’s Landing. The wildfire is on its way here as well. I\nentrusted it to the hands of Samwell Tarly, a brother of the Night’s watch, and\nGendry, a natural son of Robert Baratheon.”</p><p>“Gendry!”, Arya jumped up. “You saw Gendry.”</p><p>Jon couldn’t help himself. He grinned. “He\nremembered you as well.”</p><p>“He better does!” Arya exclaimed. “I was so\nworried he died at the hand of that witch.”</p><p>“He’ll be happy to see you safe and sound as\nwell, if I understood him correctly.” Jon raised his hand. “That can be talked\nabout later. For now, I felt that I needed to explain myself to you all. I am\nvery sorry, that I could not take any council but that of Ser Davos, when I had\nto decide what to do with the knowledge about my parents. I decided to not trust\nDaenerys further when she turned on the promise she had given. And I decided to\nuse my claim. But that has set me against her, I fear. She will not like that I\nstole Rhaegal nor will she easily let go of her own claim.” <i>My dear aunt.</i> A part of him regretted\nthat circumstances had set them up on opposite sides, but he had seen no other\nsolution and still did not see any.</p><p>Jon sighed deeply. “I am nothing but a guest\nhere at Winterfell. I have no claim to the allegiance of the North, which is an\nindependent kingdom, but I will fight for the North, if you will have me.”</p><p>“We can hardly complain, when you came here on\ntime on a dragon to save us.” Lord Royce said. “We fought bravely, but we would\nhave been overwhelmed by now. And you brought armies, dragonglass and wildfire.”</p><p>“Bran should be King in the North,” Jon said.</p><p>But Bran shook his head. “I am the Three-eyed\nRaven. I have power enough.”</p><p>“Then Sansa should be Queen.” </p><p>Jon looked at her. She would make a marvellous queen.\nSuddenly he wondered if he could try to woo her, woo her for real. He had been\nso relieved that she was not married to Littlefinger. But his mind only made\nthe connection now. He was not only free to love her, he was free to woo her.</p><p>But would a marriage alliance with a self-proclaimed\nking be to her advantage at all? Would it make sense for him as a pretender to\nally himself with her? The prospect to marry Sansa had him so excited that he\ndid not know if it would make political sense. It was as if his mind was so set\non marrying Sansa that he did not know, if it would be a good idea in the current\ncircumstance. He was pondering whether he should even bring this up. Or would\nthey all laugh in his face? Laugh that a Targaryen pretender would be so arrogant\nas to dare reach for a daughter of house Stark? Or be afraid that Rhaegar’s son\nwould steal Lyanna’s niece?</p><p>His mind was reeling at the possibilities and\nat first, he did not realise that Lord Royce was talking again.</p><p>“…. considering the last time, I proposed a\nmarriage, I hardly dare to speak again, but I think there is a solution for\nthis tricky question.”</p><p><i>He can’t mean what I\nthink he means. </i>Jon\nstole another look at Sansa. Her cheeks were red. <i>Does she think the same?</i></p><p>“Lady Sansa should not marry her cousin Sweetrobin,\nbut her other cousin, Aegon. We would position ourselves firmly at his side,\nbut considering that he chose to stake his claim only to come to our aid, that\nseems only fair. The North would have a strong standing in the seven kingdoms,\nstronger than ever before and if the King and the Queen have children, the\nThrone and Winterfell could go to different children, thus securing the independence\nof the North.”</p><p>“You want Sansa to marry Jon?” Arya exclaimed.\nShe had jumped up again.</p><p>“It is what makes the most sense. He could\nprove to everybody, that he values the North. They could rule together, and Stark\nand Targaryen can stand against the threat from the North. And the Riverlands.\nAnd the Vale would stand with Lady Sansa as we stood in the Battle of the\nBastards.”</p><p>Jon saw that Sansa’s cheeks were still dark\nwith colour, but she stayed silent and looked in her lap. She had opened her\nmouth just a tiny bit, and Jon felt as if he could see her breath smoothing the\ndelicate flesh of her slightly parted lips. </p><p>Arya snorted. “That is a crackbrained idea.” Her\neyes searched the table, but the Northern Lords were nodding in approval to\nLord Royce. Bran also nodded shortly.</p><p>Arya looked at Sansa, her head bent to the\nside. She sat again. “Well, Jon would certainly treat you well, there’s that.”</p><p>Sansa still didn’t say anything. To Jon she\nlooked afraid, flustered. And then he understood. <i>She doesn’t know I love her. She feels this is just about her claim,\njust like the other times.</i></p><p>He stood up. <i>Oh Gods, let me do this right!</i></p><p>“My lords, I might not be your king any longer,\nbut while I was king, it was decided by this council that women in the North\nshould decide themselves on their marriages. I am sure, Lady Sansa is grateful\nfor your council, but she is the one who has to decide.”</p><p>Sansa raised her gaze to his eyes, a flicker of\nhope in her eyes.</p><p>“Lady Sansa, would you do me the honour of lending\nme your ears for a private and urgent conversation?”</p><p>He stretched out his hand. Sansa stood as well,\nher eyes still locked to his and took his hand.</p><p>“My lords,” she said. “It seems Aegon Targaryen\nwants to discuss a matter of state. I ask for your leave and want to adjourn this\ncouncil until I will have decided in this matter.”</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fedonciadale",
                    "active": true,
                    "theme": {
                        "header_full_width": 1000,
                        "header_full_height": 563,
                        "header_focus_width": 1000,
                        "header_focus_height": 562,
                        "avatar_shape": "square",
                        "background_color": "#6664d0",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1000,562,0",
                        "header_image": "https://static.tumblr.com/fb6a967e6258f1781113443ef2ec1a52/aiid9l2/B4Vpkxaei/tumblr_static_cewv75jmjfccwc4g884osg8sc.png",
                        "header_image_focused": "https://static.tumblr.com/63122a95881a026daab8aa31088abcd3/aiid9l2/DBWpkxael/tumblr_static_tumblr_static_cewv75jmjfccwc4g884osg8sc_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/fb6a967e6258f1781113443ef2ec1a52/aiid9l2/B4Vpkxaei/tumblr_static_cewv75jmjfccwc4g884osg8sc_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#52c0cc",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181714903440"
                },
                "content_raw": "<p>Here is another chapter of my slowburn. Finally, Jon and Sansa are reunited, but politics get in the way and they have to discuss what to do about Jon’s claim to the throne. Also on <a href=\"https://archiveofourown.org/works/8470255/chapters/40692992\">AO3</a>.</p><p>Jon was so\ntired, he thought he would fall asleep on his feet. Now that he had arrived,\nand they had somehow managed to beat the White Walkers at least for the moment,\nhis immediate fear was gone, but he felt dread creeping at his heart. Somehow,\nhe had managed to come in time to save Winterfell, but he did not want to meet\nSansa as a married woman, or rather he did not want to meet her husband. He\nthought of Arya’s letter of Lord Royce’s letter, of Sansa’s letter.</p>[[MORE]]<p><i>I have no wish but to set eyes again on you\nbefore I die.</i> He\nwould see Sansa’s face again, but would she be Littlefinger’s wife? Or\nSweetrobin’s? He had seen many knights of the Vale amongst the fighting and he feared\nwhat this might mean.</p><p>Arya began\nto push Bran’s chair determinedly and they made their way to the castle.</p><p>Sansa met\nthem half-way and began to run, when she saw Jon. Seeing her lifted Jon’s heart\nand his tiredness fell from him. <i>It does\nnot matter, she is alive, I can see her. I can love her, even if she is married\nto another, I don’t have to feel guilt over my love. At least we have that.</i></p><p>He wanted\nto hug her forever, to breathe in her smell, but the many eyes watching them\nmade him cautious. Sansa had had a tough time, he could see. Somebody had\ninjured her at her throat and Jon wanted to kill the person who had dared to\nmar her skin. She looked tired as well. </p><p>Sansa\nlaughed. “You’re alive! You’ve come back to us!” Her laughter was infectious,\nand Jon found himself laughing as well.</p><p>“I\nunderstand you know Olyvar?”, Jon asked. “He has been a great help.”</p><p>Olyvar had\nbeen with him, carrying that bloody banner all the time. The cloth hang limp now.</p><p>“I see,\nyour path has brought you back to Winterfell! Welcome back!” Sansa said.\n“Hoster will be very happy to see you.”</p><p>Olyvar\nbowed. He looked as if he would fall on his back any moment, but he clutched\nthe staff of the banner. </p><p>“What is on\nthat banner?” Arya asked curiously. Olyvar eyed her warily, but Jon had to\nlaugh. </p><p>“I haven’t\ndecided yet. If you ask Jaime Lannister it should be green dragon with grey\nwolf in his mouth or vice versa. I can’t remember. He kept giving me\nsuggestions on our way north.”</p><p>“Jaime\nLannister?”, Sansa asked. “So, you did have a meeting with him?”</p><p>“This is a\nlong story. I don’t even know, where to start. I’ll tell you later in detail. Jaime\nLannister and the troops from the Riverlands are on their way to help us.”</p><p>“So, the\nparley was a success?”</p><p>Jon\ngrimaced. “It depends, what you would define as success.”</p><p>Arya\nshrugged. “You brought a dragon and saved us, and another army is on its way.\nI’d call this a success.”</p><p>“How long\nuntil they arrive here?”, Sansa asked.</p><p>“It will be\nseveral weeks. Brienne promised they would march as fast as they can, but such\na large army will take some time to get here in the mid of winter.”</p><p>“They will\nlikely be on time”, Bran said. “Brienne will drive them relentlessly.”</p><p>Jon looked\nat Bran, curious. His cousin had grown, he looked like a young man, far too\nserious for his age though.</p><p>“We have to\ninform the council on everything and we have to plan. We do have another\nproblem after all.” Bran insisted. He looked at Jon. “You did after all claim\nthe Iron Throne.”</p><p>Jon’s good\nmood left him. </p><p>“Can’t we get some sleep first? I’m glad to see\nyou all, but I don’t feel up to spar words with Littlefinger.”</p><p>“Littlefinger?” Arya asked.</p><p>“Yes, Littlefinger, I was informed by Lord\nRoyce that I might have to welcome him into the family, or is he already your\nhusband?”. The anguish Jon had felt over Royce’s letter got hold of him again.\nA cold hand clutched at his heart.</p><p>“Littlefinger is dead,” Sansa said. “Arya and I\nunmasked his treachery, he got a trial and was sentenced to death.” She touched\nher throat.</p><p><i>He! He hurt her! Dead?\nHe is dead?</i></p><p>It took Jon a moment to understand this. He\nturned to Sansa. “You’re not married to him?”</p><p>“No, whatever made you think Sansa would marry\na douche like Littlefinger?” That was Arya.</p><p>Jon was confused. “You did. You wrote about\nmarriage plans and Lord Royce also wrote to me about marriage plans. Are you\ntelling me there was no marriage? Not to Littlefinger? Not to Sweetrobin?”</p><p>“Oh, you got that letter? I am so sorry, I\nmisunderstood everything.” Arya became as red as a beet root. She grimaced. “I\nalmost didn’t realise that Littlefinger was playing a game.”</p><p>“So, there was no marriage?” Jon’s voice\nsounded strange in his ears.</p><p>“You thought, I was married?”, Sansa asked. Her\ncheeks were red. Jon thought about Sansa whispering into Ghost’s ears and felt\nthe blood rush to his own face. He nodded silently while looking into Sansa’s\neyes. <i>I have no wish but to set eyes on\nyou again before I die.</i> He could hardly believe, that he had managed to\narrive in time. His heart beat fast.</p><p>“We should convene and get everyone informed.”\nBran interrupted them.</p><p>Jon spent the next hour in a daze. He could\nhardly believe anything his cousins told him. Bran a seer, and strong in magic,\nas he himself had witnessed, and his little sister, <i>no cousin</i>, a spy, decoding Littlefinger’s secret diary with Sansa. Littlefinger\nas the instigator to Robert’s rebellion. </p><p>There was something else Arya kept silent\nabout. He could see it it, not in her eyes that gave nothing away, but in Sansa’s.\nSansa knew but obviously did not think this was for the whole council to know. He\nwatched Sansa while she told how they had tricked Littlefinger and how she had\nalmost been killed if it had not been for Ghost. He felt like his eyes were glued\nto her lips and he barely registered, when it was his time to tell what had\nhappened to him. He told almost everything, only leaving out his one night\ntryst with queen Daenerys. He felt that in light of his newfound parentage it\nwould not do any good. Also, he felt embarrassed about his desperation when he\nhad learned about a marriage alliance that didn’t even happen. </p><p>It made explaining how exactly Daenerys had managed\nto read the letters meant for him a difficult task, but fortunately Arya was\nself-conscious about her letter as was Lord Royce who kept apologizing for his\nmistake, until Sansa told him, that he could not possibly have known, that she\nand Arya were hard on Littlefinger’s trail.</p><p>“Daenerys insisted that I bend the knee and let\nher decide on every Stark marriage. And she wanted me to deliver Brienne of\nTarth to her as a dragonslayer. I could not do that and was already inclined to\nclaim the throne, albeit reluctantly, when I got the news that Winterfell was\nunder siege.”</p><p>He looked at Sansa. <i>I have no wish but to set eyes again on you before I die.</i> </p><p>“I claimed the dragon, with help from Bran,” he\nlooked at his cousin questioningly, and Bran nodded. “I flew to the Riverlands\nand dropped off Ser Jaime, Brienne and Davos with the army there. I publically\nmade a bid for the Iron Throne and took the name Aegon that was given to me at\nmy birth. The Riverlands army will come to Winterfell as will the wildfire Ser\nDavos smuggled from King’s Landing. The wildfire is on its way here as well. I\nentrusted it to the hands of Samwell Tarly, a brother of the Night’s watch, and\nGendry, a natural son of Robert Baratheon.”</p><p>“Gendry!”, Arya jumped up. “You saw Gendry.”</p><p>Jon couldn’t help himself. He grinned. “He\nremembered you as well.”</p><p>“He better does!” Arya exclaimed. “I was so\nworried he died at the hand of that witch.”</p><p>“He’ll be happy to see you safe and sound as\nwell, if I understood him correctly.” Jon raised his hand. “That can be talked\nabout later. For now, I felt that I needed to explain myself to you all. I am\nvery sorry, that I could not take any council but that of Ser Davos, when I had\nto decide what to do with the knowledge about my parents. I decided to not trust\nDaenerys further when she turned on the promise she had given. And I decided to\nuse my claim. But that has set me against her, I fear. She will not like that I\nstole Rhaegal nor will she easily let go of her own claim.” <i>My dear aunt.</i> A part of him regretted\nthat circumstances had set them up on opposite sides, but he had seen no other\nsolution and still did not see any.</p><p>Jon sighed deeply. “I am nothing but a guest\nhere at Winterfell. I have no claim to the allegiance of the North, which is an\nindependent kingdom, but I will fight for the North, if you will have me.”</p><p>“We can hardly complain, when you came here on\ntime on a dragon to save us.” Lord Royce said. “We fought bravely, but we would\nhave been overwhelmed by now. And you brought armies, dragonglass and wildfire.”</p><p>“Bran should be King in the North,” Jon said.</p><p>But Bran shook his head. “I am the Three-eyed\nRaven. I have power enough.”</p><p>“Then Sansa should be Queen.” </p><p>Jon looked at her. She would make a marvellous queen.\nSuddenly he wondered if he could try to woo her, woo her for real. He had been\nso relieved that she was not married to Littlefinger. But his mind only made\nthe connection now. He was not only free to love her, he was free to woo her.</p><p>But would a marriage alliance with a self-proclaimed\nking be to her advantage at all? Would it make sense for him as a pretender to\nally himself with her? The prospect to marry Sansa had him so excited that he\ndid not know if it would make political sense. It was as if his mind was so set\non marrying Sansa that he did not know, if it would be a good idea in the current\ncircumstance. He was pondering whether he should even bring this up. Or would\nthey all laugh in his face? Laugh that a Targaryen pretender would be so arrogant\nas to dare reach for a daughter of house Stark? Or be afraid that Rhaegar’s son\nwould steal Lyanna’s niece?</p><p>His mind was reeling at the possibilities and\nat first, he did not realise that Lord Royce was talking again.</p><p>“…. considering the last time, I proposed a\nmarriage, I hardly dare to speak again, but I think there is a solution for\nthis tricky question.”</p><p><i>He can’t mean what I\nthink he means. </i>Jon\nstole another look at Sansa. Her cheeks were red. <i>Does she think the same?</i></p><p>“Lady Sansa should not marry her cousin Sweetrobin,\nbut her other cousin, Aegon. We would position ourselves firmly at his side,\nbut considering that he chose to stake his claim only to come to our aid, that\nseems only fair. The North would have a strong standing in the seven kingdoms,\nstronger than ever before and if the King and the Queen have children, the\nThrone and Winterfell could go to different children, thus securing the independence\nof the North.”</p><p>“You want Sansa to marry Jon?” Arya exclaimed.\nShe had jumped up again.</p><p>“It is what makes the most sense. He could\nprove to everybody, that he values the North. They could rule together, and Stark\nand Targaryen can stand against the threat from the North. And the Riverlands.\nAnd the Vale would stand with Lady Sansa as we stood in the Battle of the\nBastards.”</p><p>Jon saw that Sansa’s cheeks were still dark\nwith colour, but she stayed silent and looked in her lap. She had opened her\nmouth just a tiny bit, and Jon felt as if he could see her breath smoothing the\ndelicate flesh of her slightly parted lips. </p><p>Arya snorted. “That is a crackbrained idea.” Her\neyes searched the table, but the Northern Lords were nodding in approval to\nLord Royce. Bran also nodded shortly.</p><p>Arya looked at Sansa, her head bent to the\nside. She sat again. “Well, Jon would certainly treat you well, there’s that.”</p><p>Sansa still didn’t say anything. To Jon she\nlooked afraid, flustered. And then he understood. <i>She doesn’t know I love her. She feels this is just about her claim,\njust like the other times.</i></p><p>He stood up. <i>Oh Gods, let me do this right!</i></p><p>“My lords, I might not be your king any longer,\nbut while I was king, it was decided by this council that women in the North\nshould decide themselves on their marriages. I am sure, Lady Sansa is grateful\nfor your council, but she is the one who has to decide.”</p><p>Sansa raised her gaze to his eyes, a flicker of\nhope in her eyes.</p><p>“Lady Sansa, would you do me the honour of lending\nme your ears for a private and urgent conversation?”</p><p>He stretched out his hand. Sansa stood as well,\nher eyes still locked to his and took his hand.</p><p>“My lords,” she said. “It seems Aegon Targaryen\nwants to discuss a matter of state. I ask for your leave and want to adjourn this\ncouncil until I will have decided in this matter.”</p>",
                "content": "<p>Here is another chapter of my slowburn. Finally, Jon and Sansa are reunited, but politics get in the way and they have to discuss what to do about Jon&rsquo;s claim to the throne. Also on <a href=\"https://archiveofourown.org/works/8470255/chapters/40692992\">AO3</a>.</p><p>Jon was so\ntired, he thought he would fall asleep on his feet. Now that he had arrived,\nand they had somehow managed to beat the White Walkers at least for the moment,\nhis immediate fear was gone, but he felt dread creeping at his heart. Somehow,\nhe had managed to come in time to save Winterfell, but he did not want to meet\nSansa as a married woman, or rather he did not want to meet her husband. He\nthought of Arya&rsquo;s letter of Lord Royce&rsquo;s letter, of Sansa&rsquo;s letter.</p><p><i>I have no wish but to set eyes again on you\nbefore I die.</i> He\nwould see Sansa&rsquo;s face again, but would she be Littlefinger&rsquo;s wife? Or\nSweetrobin&rsquo;s? He had seen many knights of the Vale amongst the fighting and he feared\nwhat this might mean.</p><p>Arya began\nto push Bran&rsquo;s chair determinedly and they made their way to the castle.</p><p>Sansa met\nthem half-way and began to run, when she saw Jon. Seeing her lifted Jon&rsquo;s heart\nand his tiredness fell from him. <i>It does\nnot matter, she is alive, I can see her. I can love her, even if she is married\nto another, I don&rsquo;t have to feel guilt over my love. At least we have that.</i></p><p>He wanted\nto hug her forever, to breathe in her smell, but the many eyes watching them\nmade him cautious. Sansa had had a tough time, he could see. Somebody had\ninjured her at her throat and Jon wanted to kill the person who had dared to\nmar her skin. She looked tired as well. </p><p>Sansa\nlaughed. &ldquo;You&rsquo;re alive! You&rsquo;ve come back to us!&rdquo; Her laughter was infectious,\nand Jon found himself laughing as well.</p><p>&ldquo;I\nunderstand you know Olyvar?&rdquo;, Jon asked. &ldquo;He has been a great help.&rdquo;</p><p>Olyvar had\nbeen with him, carrying that bloody banner all the time. The cloth hang limp now.</p><p>&ldquo;I see,\nyour path has brought you back to Winterfell! Welcome back!&rdquo; Sansa said.\n&ldquo;Hoster will be very happy to see you.&rdquo;</p><p>Olyvar\nbowed. He looked as if he would fall on his back any moment, but he clutched\nthe staff of the banner. </p><p>&ldquo;What is on\nthat banner?&rdquo; Arya asked curiously. Olyvar eyed her warily, but Jon had to\nlaugh. </p><p>&ldquo;I haven&rsquo;t\ndecided yet. If you ask Jaime Lannister it should be green dragon with grey\nwolf in his mouth or vice versa. I can&rsquo;t remember. He kept giving me\nsuggestions on our way north.&rdquo;</p><p>&ldquo;Jaime\nLannister?&rdquo;, Sansa asked. &ldquo;So, you did have a meeting with him?&rdquo;</p><p>&ldquo;This is a\nlong story. I don&rsquo;t even know, where to start. I&rsquo;ll tell you later in detail. Jaime\nLannister and the troops from the Riverlands are on their way to help us.&rdquo;</p><p>&ldquo;So, the\nparley was a success?&rdquo;</p><p>Jon\ngrimaced. &ldquo;It depends, what you would define as success.&rdquo;</p><p>Arya\nshrugged. &ldquo;You brought a dragon and saved us, and another army is on its way.\nI&rsquo;d call this a success.&rdquo;</p><p>&ldquo;How long\nuntil they arrive here?&rdquo;, Sansa asked.</p><p>&ldquo;It will be\nseveral weeks. Brienne promised they would march as fast as they can, but such\na large army will take some time to get here in the mid of winter.&rdquo;</p><p>&ldquo;They will\nlikely be on time&rdquo;, Bran said. &ldquo;Brienne will drive them relentlessly.&rdquo;</p><p>Jon looked\nat Bran, curious. His cousin had grown, he looked like a young man, far too\nserious for his age though.</p><p>&ldquo;We have to\ninform the council on everything and we have to plan. We do have another\nproblem after all.&rdquo; Bran insisted. He looked at Jon. &ldquo;You did after all claim\nthe Iron Throne.&rdquo;</p><p>Jon&rsquo;s good\nmood left him. </p><p>&ldquo;Can&rsquo;t we get some sleep first? I&rsquo;m glad to see\nyou all, but I don&rsquo;t feel up to spar words with Littlefinger.&rdquo;</p><p>&ldquo;Littlefinger?&rdquo; Arya asked.</p><p>&ldquo;Yes, Littlefinger, I was informed by Lord\nRoyce that I might have to welcome him into the family, or is he already your\nhusband?&rdquo;. The anguish Jon had felt over Royce&rsquo;s letter got hold of him again.\nA cold hand clutched at his heart.</p><p>&ldquo;Littlefinger is dead,&rdquo; Sansa said. &ldquo;Arya and I\nunmasked his treachery, he got a trial and was sentenced to death.&rdquo; She touched\nher throat.</p><p><i>He! He hurt her! Dead?\nHe is dead?</i></p><p>It took Jon a moment to understand this. He\nturned to Sansa. &ldquo;You&rsquo;re not married to him?&rdquo;</p><p>&ldquo;No, whatever made you think Sansa would marry\na douche like Littlefinger?&rdquo; That was Arya.</p><p>Jon was confused. &ldquo;You did. You wrote about\nmarriage plans and Lord Royce also wrote to me about marriage plans. Are you\ntelling me there was no marriage? Not to Littlefinger? Not to Sweetrobin?&rdquo;</p><p>&ldquo;Oh, you got that letter? I am so sorry, I\nmisunderstood everything.&rdquo; Arya became as red as a beet root. She grimaced. &ldquo;I\nalmost didn&rsquo;t realise that Littlefinger was playing a game.&rdquo;</p><p>&ldquo;So, there was no marriage?&rdquo; Jon&rsquo;s voice\nsounded strange in his ears.</p><p>&ldquo;You thought, I was married?&rdquo;, Sansa asked. Her\ncheeks were red. Jon thought about Sansa whispering into Ghost&rsquo;s ears and felt\nthe blood rush to his own face. He nodded silently while looking into Sansa&rsquo;s\neyes. <i>I have no wish but to set eyes on\nyou again before I die.</i> He could hardly believe, that he had managed to\narrive in time. His heart beat fast.</p><p>&ldquo;We should convene and get everyone informed.&rdquo;\nBran interrupted them.</p><p>Jon spent the next hour in a daze. He could\nhardly believe anything his cousins told him. Bran a seer, and strong in magic,\nas he himself had witnessed, and his little sister, <i>no cousin</i>, a spy, decoding Littlefinger&rsquo;s secret diary with Sansa. Littlefinger\nas the instigator to Robert&rsquo;s rebellion. </p><p>There was something else Arya kept silent\nabout. He could see it it, not in her eyes that gave nothing away, but in Sansa&rsquo;s.\nSansa knew but obviously did not think this was for the whole council to know. He\nwatched Sansa while she told how they had tricked Littlefinger and how she had\nalmost been killed if it had not been for Ghost. He felt like his eyes were glued\nto her lips and he barely registered, when it was his time to tell what had\nhappened to him. He told almost everything, only leaving out his one night\ntryst with queen Daenerys. He felt that in light of his newfound parentage it\nwould not do any good. Also, he felt embarrassed about his desperation when he\nhad learned about a marriage alliance that didn&rsquo;t even happen. </p><p>It made explaining how exactly Daenerys had managed\nto read the letters meant for him a difficult task, but fortunately Arya was\nself-conscious about her letter as was Lord Royce who kept apologizing for his\nmistake, until Sansa told him, that he could not possibly have known, that she\nand Arya were hard on Littlefinger&rsquo;s trail.</p><p>&ldquo;Daenerys insisted that I bend the knee and let\nher decide on every Stark marriage. And she wanted me to deliver Brienne of\nTarth to her as a dragonslayer. I could not do that and was already inclined to\nclaim the throne, albeit reluctantly, when I got the news that Winterfell was\nunder siege.&rdquo;</p><p>He looked at Sansa. <i>I have no wish but to set eyes again on you before I die.</i> </p><p>&ldquo;I claimed the dragon, with help from Bran,&rdquo; he\nlooked at his cousin questioningly, and Bran nodded. &ldquo;I flew to the Riverlands\nand dropped off Ser Jaime, Brienne and Davos with the army there. I publically\nmade a bid for the Iron Throne and took the name Aegon that was given to me at\nmy birth. The Riverlands army will come to Winterfell as will the wildfire Ser\nDavos smuggled from King&rsquo;s Landing. The wildfire is on its way here as well. I\nentrusted it to the hands of Samwell Tarly, a brother of the Night&rsquo;s watch, and\nGendry, a natural son of Robert Baratheon.&rdquo;</p><p>&ldquo;Gendry!&rdquo;, Arya jumped up. &ldquo;You saw Gendry.&rdquo;</p><p>Jon couldn&rsquo;t help himself. He grinned. &ldquo;He\nremembered you as well.&rdquo;</p><p>&ldquo;He better does!&rdquo; Arya exclaimed. &ldquo;I was so\nworried he died at the hand of that witch.&rdquo;</p><p>&ldquo;He&rsquo;ll be happy to see you safe and sound as\nwell, if I understood him correctly.&rdquo; Jon raised his hand. &ldquo;That can be talked\nabout later. For now, I felt that I needed to explain myself to you all. I am\nvery sorry, that I could not take any council but that of Ser Davos, when I had\nto decide what to do with the knowledge about my parents. I decided to not trust\nDaenerys further when she turned on the promise she had given. And I decided to\nuse my claim. But that has set me against her, I fear. She will not like that I\nstole Rhaegal nor will she easily let go of her own claim.&rdquo; <i>My dear aunt.</i> A part of him regretted\nthat circumstances had set them up on opposite sides, but he had seen no other\nsolution and still did not see any.</p><p>Jon sighed deeply. &ldquo;I am nothing but a guest\nhere at Winterfell. I have no claim to the allegiance of the North, which is an\nindependent kingdom, but I will fight for the North, if you will have me.&rdquo;</p><p>&ldquo;We can hardly complain, when you came here on\ntime on a dragon to save us.&rdquo; Lord Royce said. &ldquo;We fought bravely, but we would\nhave been overwhelmed by now. And you brought armies, dragonglass and wildfire.&rdquo;</p><p>&ldquo;Bran should be King in the North,&rdquo; Jon said.</p><p>But Bran shook his head. &ldquo;I am the Three-eyed\nRaven. I have power enough.&rdquo;</p><p>&ldquo;Then Sansa should be Queen.&rdquo; </p><p>Jon looked at her. She would make a marvellous queen.\nSuddenly he wondered if he could try to woo her, woo her for real. He had been\nso relieved that she was not married to Littlefinger. But his mind only made\nthe connection now. He was not only free to love her, he was free to woo her.</p><p>But would a marriage alliance with a self-proclaimed\nking be to her advantage at all? Would it make sense for him as a pretender to\nally himself with her? The prospect to marry Sansa had him so excited that he\ndid not know if it would make political sense. It was as if his mind was so set\non marrying Sansa that he did not know, if it would be a good idea in the current\ncircumstance. He was pondering whether he should even bring this up. Or would\nthey all laugh in his face? Laugh that a Targaryen pretender would be so arrogant\nas to dare reach for a daughter of house Stark? Or be afraid that Rhaegar&rsquo;s son\nwould steal Lyanna&rsquo;s niece?</p><p>His mind was reeling at the possibilities and\nat first, he did not realise that Lord Royce was talking again.</p><p>&ldquo;&hellip;. considering the last time, I proposed a\nmarriage, I hardly dare to speak again, but I think there is a solution for\nthis tricky question.&rdquo;</p><p><i>He can&rsquo;t mean what I\nthink he means. </i>Jon\nstole another look at Sansa. Her cheeks were red. <i>Does she think the same?</i></p><p>&ldquo;Lady Sansa should not marry her cousin Sweetrobin,\nbut her other cousin, Aegon. We would position ourselves firmly at his side,\nbut considering that he chose to stake his claim only to come to our aid, that\nseems only fair. The North would have a strong standing in the seven kingdoms,\nstronger than ever before and if the King and the Queen have children, the\nThrone and Winterfell could go to different children, thus securing the independence\nof the North.&rdquo;</p><p>&ldquo;You want Sansa to marry Jon?&rdquo; Arya exclaimed.\nShe had jumped up again.</p><p>&ldquo;It is what makes the most sense. He could\nprove to everybody, that he values the North. They could rule together, and Stark\nand Targaryen can stand against the threat from the North. And the Riverlands.\nAnd the Vale would stand with Lady Sansa as we stood in the Battle of the\nBastards.&rdquo;</p><p>Jon saw that Sansa&rsquo;s cheeks were still dark\nwith colour, but she stayed silent and looked in her lap. She had opened her\nmouth just a tiny bit, and Jon felt as if he could see her breath smoothing the\ndelicate flesh of her slightly parted lips. </p><p>Arya snorted. &ldquo;That is a crackbrained idea.&rdquo; Her\neyes searched the table, but the Northern Lords were nodding in approval to\nLord Royce. Bran also nodded shortly.</p><p>Arya looked at Sansa, her head bent to the\nside. She sat again. &ldquo;Well, Jon would certainly treat you well, there&rsquo;s that.&rdquo;</p><p>Sansa still didn&rsquo;t say anything. To Jon she\nlooked afraid, flustered. And then he understood. <i>She doesn&rsquo;t know I love her. She feels this is just about her claim,\njust like the other times.</i></p><p>He stood up. <i>Oh Gods, let me do this right!</i></p><p>&ldquo;My lords, I might not be your king any longer,\nbut while I was king, it was decided by this council that women in the North\nshould decide themselves on their marriages. I am sure, Lady Sansa is grateful\nfor your council, but she is the one who has to decide.&rdquo;</p><p>Sansa raised her gaze to his eyes, a flicker of\nhope in her eyes.</p><p>&ldquo;Lady Sansa, would you do me the honour of lending\nme your ears for a private and urgent conversation?&rdquo;</p><p>He stretched out his hand. Sansa stood as well,\nher eyes still locked to his and took his hand.</p><p>&ldquo;My lords,&rdquo; she said. &ldquo;It seems Aegon Targaryen\nwants to discuss a matter of state. I ask for your leave and want to adjourn this\ncouncil until I will have decided in this matter.&rdquo;</p>",
                "content_abstract": "<p>\n<p>Here is another chapter of my slowburn. Finally, Jon and Sansa are reunited, but politics get in the way and they have to discuss what to do about Jon&rsquo;s claim to the throne. Also on <a href=\"https://archiveofourown.org/works/8470255/chapters/40692992\">AO3</a>.</p>\n<p>Jon was so\ntired, he thought he would fall asleep on his feet. Now that he had arrived,\nand they had somehow managed to beat the White Walkers at least for the moment,\nhis immediate fear was gone, but he felt dread creeping at his heart. Somehow,\nhe had managed to come in time to save Winterfell, but he did not want to meet\nSansa as a married woman, or rather he did not want to meet her husband. He\nthought of Arya&rsquo;s letter of Lord Royce&rsquo;s letter, of Sansa&rsquo;s letter.</p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "sayruq",
        "blog": {
            "name": "sayruq",
            "title": "404 url not found",
            "description": "",
            "url": "https://sayruq.tumblr.com/",
            "uuid": "t:DNbYwNQ6H6NUTgpN8-AKbw",
            "updated": 1561768268
        },
        "id": 181713540599,
        "post_url": "https://sayruq.tumblr.com/post/181713540599/why-did-grrm-approve-sansas-rape-plot-it-means",
        "slug": "why-did-grrm-approve-sansas-rape-plot-it-means",
        "date": "2019-01-04 17:52:37 GMT",
        "timestamp": 1546624357,
        "state": "published",
        "format": "html",
        "reblog_key": "RkLG5Zuy",
        "tags": [
            "Sansa Stark",
            "rape tw",
            "song of ice and fire",
            "anti grrm",
            "Anonymous"
        ],
        "short_url": "https://tmblr.co/ZcPeYo2fE_9Nt",
        "summary": "Why did GRRM approve Sansa's rape plot? It means it'll happen in the books too?",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 14,
        "asking_name": "Anonymous",
        "asking_url": null,
        "question": "Why did GRRM approve Sansa's rape plot? It means it'll happen in the books too?",
        "answer": "<p>I was one of those people who believed GRRM would never approve a rape scene involving Sansa because he’s a feminist. Since then I’ve grown as a person and I now know that GRRM being the man that he is thinks rape as a plot device is very cool and edgy. So many girls and women are subjected to sexual violence for the development of man and sometimes for the development of the female characters. So of course a rape scene could possibly happen in the books though GRRM did allegedly say he would never write a rape scene at it was happening. Who knows, he might leave it as a cliffhanger and we deal with the aftermath in the next chapter. Either way my faith in him is waning.</p>",
        "reblog": {
            "comment": "<p>I was one of those people who believed GRRM would never approve a rape scene involving Sansa because he’s a feminist. Since then I’ve grown as a person and I now know that GRRM being the man that he is thinks rape as a plot device is very cool and edgy. So many girls and women are subjected to sexual violence for the development of man and sometimes for the development of the female characters. So of course a rape scene could possibly happen in the books though GRRM did allegedly say he would never write a rape scene at it was happening. Who knows, he might leave it as a cliffhanger and we deal with the aftermath in the next chapter. Either way my faith in him is waning.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "sayruq",
                    "active": true,
                    "theme": {
                        "header_full_width": 540,
                        "header_full_height": 304,
                        "header_focus_width": 540,
                        "header_focus_height": 303,
                        "avatar_shape": "circle",
                        "background_color": "#bbe4d0",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,540,303,0",
                        "header_image": "https://static.tumblr.com/49a939b5fb4ebc08fffc2c6d0a16d4c6/el9ks9m/zxcps6dgb/tumblr_static_8qpqneumfmkgw0cgsc0wwog8k.gif",
                        "header_image_focused": "https://static.tumblr.com/49a939b5fb4ebc08fffc2c6d0a16d4c6/el9ks9m/aN1ps6dgf/tumblr_static_tumblr_static_8qpqneumfmkgw0cgsc0wwog8k_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/49a939b5fb4ebc08fffc2c6d0a16d4c6/el9ks9m/zxcps6dgb/tumblr_static_8qpqneumfmkgw0cgsc0wwog8k_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#45966e",
                        "show_avatar": true,
                        "show_description": false,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Georgia",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181713540599"
                },
                "content_raw": "<p>I was one of those people who believed GRRM would never approve a rape scene involving Sansa because he’s a feminist. Since then I’ve grown as a person and I now know that GRRM being the man that he is thinks rape as a plot device is very cool and edgy. So many girls and women are subjected to sexual violence for the development of man and sometimes for the development of the female characters. So of course a rape scene could possibly happen in the books though GRRM did allegedly say he would never write a rape scene at it was happening. Who knows, he might leave it as a cliffhanger and we deal with the aftermath in the next chapter. Either way my faith in him is waning.</p>",
                "content": "<p>I was one of those people who believed GRRM would never approve a rape scene involving Sansa because he&rsquo;s a feminist. Since then I&rsquo;ve grown as a person and I now know that GRRM being the man that he is thinks rape as a plot device is very cool and edgy. So many girls and women are subjected to sexual violence for the development of man and sometimes for the development of the female characters. So of course a rape scene could possibly happen in the books though GRRM did allegedly say he would never write a rape scene at it was happening. Who knows, he might leave it as a cliffhanger and we deal with the aftermath in the next chapter. Either way my faith in him is waning.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "tyrellflowrs",
        "blog": {
            "name": "tyrellflowrs",
            "title": "TyrellFlowrs",
            "description": "Allison, 16 // got edits .  // check out my sideblog @pevensiebaudeliare  ",
            "url": "https://tyrellflowrs.tumblr.com/",
            "uuid": "t:sIyvngx-zEg7R17vstNFBA",
            "updated": 1558759842
        },
        "id": 181713252068,
        "post_url": "https://tyrellflowrs.tumblr.com/post/181713252068/not-me-he-says-you-cant-love-me-i-am-dust-and",
        "slug": "not-me-he-says-you-cant-love-me-i-am-dust-and",
        "date": "2019-01-04 17:40:21 GMT",
        "timestamp": 1546623621,
        "state": "published",
        "format": "html",
        "reblog_key": "vykYmAAP",
        "tags": [
            "theon x sansa",
            "theon greyjoy",
            "theon greyjoy edit",
            "sansa stark",
            "sansa stark edit",
            "theonsa",
            "my edit",
            "sansastarkTF",
            "theonsaTF",
            "theongreyjoyTF",
            "tyrellflowrsedit"
        ],
        "short_url": "https://tmblr.co/ZaBDHY2fEz2xa",
        "summary": "not me he says you can’t love me I am dust and dirt and nothing more to which I reply the earth is dust and dirt and nothing...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 81,
        "caption": "<blockquote><p><i>not me he says you can’t love me I am dust and dirt and nothing more to which I reply the earth is dust and dirt and nothing more and so you are my world</i></p></blockquote>",
        "reblog": {
            "comment": "<p><blockquote><p><i>not me he says you can’t love me I am dust and dirt and nothing more to which I reply the earth is dust and dirt and nothing more and so you are my world</i></p></blockquote></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "tyrellflowrs",
                    "active": true,
                    "theme": {
                        "header_full_width": 375,
                        "header_full_height": 211,
                        "header_focus_width": 375,
                        "header_focus_height": 210,
                        "avatar_shape": "circle",
                        "background_color": "#EEEEEE",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,375,210,0",
                        "header_image": "https://static.tumblr.com/0a9a0077faff91a717d301fd7fad1f57/lzxml6p/c2Spn5sa5/tumblr_static_1axfodyvokqskcsscw04kk40k.jpg",
                        "header_image_focused": "https://static.tumblr.com/3c3a942fd01b733f27a9970efe945dfc/lzxml6p/oWepn5sa6/tumblr_static_tumblr_static_1axfodyvokqskcsscw04kk40k_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/0a9a0077faff91a717d301fd7fad1f57/lzxml6p/c2Spn5sa5/tumblr_static_1axfodyvokqskcsscw04kk40k_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#f0bfb3",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#f0bfb3",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181713252068"
                },
                "content_raw": "<p><blockquote><p><i>not me he says you can’t love me I am dust and dirt and nothing more to which I reply the earth is dust and dirt and nothing more and so you are my world</i></p></blockquote></p>",
                "content": "<p><blockquote><p><i>not me he says you can&rsquo;t love me I am dust and dirt and nothing more to which I reply the earth is dust and dirt and nothing more and so you are my world</i></p></blockquote></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "11",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/5a49d0fca3b95fb804546d3cc62a8e80/tumblr_pksz03QXp21xk2prjo1_1280.jpg",
                    "width": 1242,
                    "height": 1242
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/5a49d0fca3b95fb804546d3cc62a8e80/tumblr_pksz03QXp21xk2prjo1_1280.jpg",
                        "width": 1242,
                        "height": 1242
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a49d0fca3b95fb804546d3cc62a8e80/tumblr_pksz03QXp21xk2prjo1_640.jpg",
                        "width": 640,
                        "height": 640
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a49d0fca3b95fb804546d3cc62a8e80/tumblr_pksz03QXp21xk2prjo1_540.jpg",
                        "width": 540,
                        "height": 540
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a49d0fca3b95fb804546d3cc62a8e80/tumblr_pksz03QXp21xk2prjo1_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a49d0fca3b95fb804546d3cc62a8e80/tumblr_pksz03QXp21xk2prjo1_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a49d0fca3b95fb804546d3cc62a8e80/tumblr_pksz03QXp21xk2prjo1_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a49d0fca3b95fb804546d3cc62a8e80/tumblr_pksz03QXp21xk2prjo1_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a49d0fca3b95fb804546d3cc62a8e80/tumblr_pksz03QXp21xk2prjo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/311a9807f2224ae56de4d41068222ed9/tumblr_pksz03QXp21xk2prjo2_1280.jpg",
                    "width": 865,
                    "height": 856
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/311a9807f2224ae56de4d41068222ed9/tumblr_pksz03QXp21xk2prjo2_1280.jpg",
                        "width": 865,
                        "height": 856
                    },
                    {
                        "url": "https://66.media.tumblr.com/311a9807f2224ae56de4d41068222ed9/tumblr_pksz03QXp21xk2prjo2_640.jpg",
                        "width": 640,
                        "height": 633
                    },
                    {
                        "url": "https://66.media.tumblr.com/311a9807f2224ae56de4d41068222ed9/tumblr_pksz03QXp21xk2prjo2_540.jpg",
                        "width": 540,
                        "height": 534
                    },
                    {
                        "url": "https://66.media.tumblr.com/311a9807f2224ae56de4d41068222ed9/tumblr_pksz03QXp21xk2prjo2_500.jpg",
                        "width": 500,
                        "height": 495
                    },
                    {
                        "url": "https://66.media.tumblr.com/311a9807f2224ae56de4d41068222ed9/tumblr_pksz03QXp21xk2prjo2_400.jpg",
                        "width": 400,
                        "height": 396
                    },
                    {
                        "url": "https://66.media.tumblr.com/311a9807f2224ae56de4d41068222ed9/tumblr_pksz03QXp21xk2prjo2_250.jpg",
                        "width": 250,
                        "height": 247
                    },
                    {
                        "url": "https://66.media.tumblr.com/311a9807f2224ae56de4d41068222ed9/tumblr_pksz03QXp21xk2prjo2_100.jpg",
                        "width": 100,
                        "height": 99
                    },
                    {
                        "url": "https://66.media.tumblr.com/311a9807f2224ae56de4d41068222ed9/tumblr_pksz03QXp21xk2prjo2_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "tsignpro",
        "blog": {
            "name": "tsignpro",
            "title": "T- Sign Productions",
            "description": "<p>Art and Animation up the Wazu...and you can ask me anything ...within reason</p>",
            "url": "https://tsignpro.tumblr.com/",
            "uuid": "t:u8Vb_9Jc4MQnB9xKGoKg5w",
            "updated": 1561463273
        },
        "id": 181709461511,
        "post_url": "https://tsignpro.tumblr.com/post/181709461511/raise-your-hand-if-you-understand-that-sansas",
        "slug": "raise-your-hand-if-you-understand-that-sansas",
        "date": "2019-01-04 14:58:33 GMT",
        "timestamp": 1546613913,
        "state": "published",
        "format": "html",
        "reblog_key": "kn21nyBx",
        "tags": [
            "anti sansan",
            "sandor clegane",
            "gameofthrones",
            "game of thrones",
            "sansa stark",
            "GoT",
            "sansa x sandor",
            "why do people ship it?",
            "sansa needs a hug",
            "sandor needs a hug but not from sansa or arya",
            "you forgot to mention that little detail",
            "coping"
        ],
        "short_url": "https://tmblr.co/ZwXLeo2fEkbW7",
        "summary": "Raise your hand if you understand that Sansa’s “romantic feelings”( huge finger quotes) for Sandor is a toxic coping mechanism...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 24,
        "title": null,
        "body": "<p>Raise your hand if you understand that Sansa’s “romantic feelings”( huge finger quotes) for Sandor is a toxic coping mechanism because out of all the abuse she suffered, Sandor was the least awful person. </p><figure class=\"tmblr-full\" data-orig-height=\"500\" data-orig-width=\"500\" data-tumblr-attribution=\"ihiphop:h2zWJCh5RkQWu9U_JOR0Gw:Zmj3ei2PMEAIg\"><img src=\"https://66.media.tumblr.com/0861da98663ecbd24157b285985ff35e/tumblr_ov70pzxppR1v1z098o1_500.gif\" data-orig-height=\"500\" data-orig-width=\"500\"/></figure><p><br/></p><p>And this was someone who&hellip;</p><p>- manhandled her</p><p>- constantly told her how stupid she was</p><p>- was creepy AF </p><p>- almost raped her (books)</p><p><br/></p><p>&hellip;and now I’m sad </p>",
        "reblog": {
            "comment": "<p>Raise your hand if you understand that Sansa’s “romantic feelings”( huge finger quotes) for Sandor is a toxic coping mechanism because out of all the abuse she suffered, Sandor was the least awful person. </p><figure class=\"tmblr-full\" data-orig-height=\"500\" data-orig-width=\"500\" data-tumblr-attribution=\"ihiphop:h2zWJCh5RkQWu9U_JOR0Gw:Zmj3ei2PMEAIg\"><img src=\"https://66.media.tumblr.com/0861da98663ecbd24157b285985ff35e/tumblr_ov70pzxppR1v1z098o1_500.gif\" data-orig-height=\"500\" data-orig-width=\"500\"></figure><p><br></p><p>And this was someone who…</p><p>- manhandled her</p><p>- constantly told her how stupid she was</p><p>- was creepy AF </p><p>- almost raped her (books)</p><p><br></p><p>…and now I’m sad </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "tsignpro",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/f36007a71f9aad46e520472e569b9d3a/8xb90fw/TYxnmifmk/tumblr_static_b1sbtpk70gwgs0ws0cw0s408s.jpg",
                        "header_image_focused": "https://static.tumblr.com/f36007a71f9aad46e520472e569b9d3a/8xb90fw/TYxnmifmk/tumblr_static_b1sbtpk70gwgs0ws0cw0s408s_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f36007a71f9aad46e520472e569b9d3a/8xb90fw/TYxnmifmk/tumblr_static_b1sbtpk70gwgs0ws0cw0s408s_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181709461511"
                },
                "content_raw": "<p>Raise your hand if you understand that Sansa’s “romantic feelings”( huge finger quotes) for Sandor is a toxic coping mechanism because out of all the abuse she suffered, Sandor was the least awful person. </p><figure class=\"tmblr-full\" data-orig-height=\"500\" data-orig-width=\"500\" data-tumblr-attribution=\"ihiphop:h2zWJCh5RkQWu9U_JOR0Gw:Zmj3ei2PMEAIg\"><img src=\"https://66.media.tumblr.com/0861da98663ecbd24157b285985ff35e/tumblr_ov70pzxppR1v1z098o1_500.gif\" data-orig-height=\"500\" data-orig-width=\"500\"></figure><p><br></p><p>And this was someone who…</p><p>- manhandled her</p><p>- constantly told her how stupid she was</p><p>- was creepy AF </p><p>- almost raped her (books)</p><p><br></p><p>…and now I’m sad </p>",
                "content": "<p>Raise your hand if you understand that Sansa&rsquo;s &ldquo;romantic feelings&rdquo;( huge finger quotes) for Sandor is a toxic coping mechanism because out of all the abuse she suffered, Sandor was the least awful person. </p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><p><br /></p><p>And this was someone who&hellip;</p><p>- manhandled her</p><p>- constantly told her how stupid she was</p><p>- was creepy AF </p><p>- almost raped her (books)</p><p><br /></p><p>&hellip;and now I&rsquo;m sad </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "dothrakidaenerys",
        "blog": {
            "name": "dothrakidaenerys",
            "title": "fire and blood",
            "description": "",
            "url": "https://dothrakidaenerys.tumblr.com/",
            "uuid": "t:LmGBRAQ8W6NQcjajjHuAfQ",
            "updated": 1561726826
        },
        "id": 181708422478,
        "post_url": "https://dothrakidaenerys.tumblr.com/post/181708422478/sansa-stark-in-every-episode-beyond-the-wall",
        "slug": "sansa-stark-in-every-episode-beyond-the-wall",
        "date": "2019-01-04 14:00:34 GMT",
        "timestamp": 1546610434,
        "state": "published",
        "format": "html",
        "reblog_key": "kO0wEF0t",
        "tags": [
            "sansa stark",
            "sophie turner",
            "arya stark",
            "masie williams",
            "game of thrones",
            "game of thrones season 7",
            "got season 7",
            "got gifs"
        ],
        "short_url": "https://tmblr.co/ZU2bKk2fEgdrE",
        "summary": "Sansa Stark In Every Episode: ↳ BEYOND THE WALL",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 34,
        "caption": "<p>\n\n<a href=\"http://dothrakidaenerys.tumblr.com/tagged/sansa%20meme\" target=\"_blank\">Sansa Stark In Every Episode:</a><br/>↳<b> </b><b><i>BEYOND THE WALL</i></b><br/></p>",
        "reblog": {
            "comment": "<p>\n\n<a href=\"http://dothrakidaenerys.tumblr.com/tagged/sansa%20meme\" target=\"_blank\">Sansa Stark In Every Episode:</a><br>↳<b> </b><b><i>BEYOND THE WALL</i></b><br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "dothrakidaenerys",
                    "active": true,
                    "theme": {
                        "header_full_width": 1500,
                        "header_full_height": 500,
                        "header_focus_width": 889,
                        "header_focus_height": 500,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1194,500,305",
                        "header_image": "https://static.tumblr.com/7e6602a4383a36e8c00cb6b9ef0d1672/essp0xr/FXposwtx8/tumblr_static_1ilipkteqeqs0skwo44wc04ok.png",
                        "header_image_focused": "https://static.tumblr.com/7e6602a4383a36e8c00cb6b9ef0d1672/essp0xr/Sq8pml9nt/tumblr_static_tumblr_static_1ilipkteqeqs0skwo44wc04ok_focused_v3.png",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_03_focused_v3.png?_v=a0f20b51ed40eb5a930ab86effe42a40",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181708422478"
                },
                "content_raw": "<p>\n\n<a href=\"http://dothrakidaenerys.tumblr.com/tagged/sansa%20meme\" target=\"_blank\">Sansa Stark In Every Episode:</a><br>↳<b> </b><b><i>BEYOND THE WALL</i></b><br></p>",
                "content": "<p>\n\n<a href=\"http://dothrakidaenerys.tumblr.com/tagged/sansa%20meme\" target=\"_blank\">Sansa Stark In Every Episode:</a><br />&#8627;<b> </b><b><i>BEYOND THE WALL</i></b><br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "22222",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/635265ffeaad196803fd232c1afe9f1b/tumblr_pb0c7iDrxf1uxb9ydo1_400.gif",
                    "width": 300,
                    "height": 179
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/635265ffeaad196803fd232c1afe9f1b/tumblr_pb0c7iDrxf1uxb9ydo1_400.gif",
                        "width": 300,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/635265ffeaad196803fd232c1afe9f1b/tumblr_pb0c7iDrxf1uxb9ydo1_250.gif",
                        "width": 250,
                        "height": 149
                    },
                    {
                        "url": "https://66.media.tumblr.com/635265ffeaad196803fd232c1afe9f1b/tumblr_pb0c7iDrxf1uxb9ydo1_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/635265ffeaad196803fd232c1afe9f1b/tumblr_pb0c7iDrxf1uxb9ydo1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/4c2844448a1722631f3be0ce3b2a3302/tumblr_pb0c7iDrxf1uxb9ydo10_400.gif",
                    "width": 300,
                    "height": 179
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/4c2844448a1722631f3be0ce3b2a3302/tumblr_pb0c7iDrxf1uxb9ydo10_400.gif",
                        "width": 300,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/4c2844448a1722631f3be0ce3b2a3302/tumblr_pb0c7iDrxf1uxb9ydo10_250.gif",
                        "width": 250,
                        "height": 149
                    },
                    {
                        "url": "https://66.media.tumblr.com/4c2844448a1722631f3be0ce3b2a3302/tumblr_pb0c7iDrxf1uxb9ydo10_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/4c2844448a1722631f3be0ce3b2a3302/tumblr_pb0c7iDrxf1uxb9ydo10_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/8544f6de9e776865bb5506a40e637e91/tumblr_pb0c7iDrxf1uxb9ydo2_400.gif",
                    "width": 300,
                    "height": 179
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/8544f6de9e776865bb5506a40e637e91/tumblr_pb0c7iDrxf1uxb9ydo2_400.gif",
                        "width": 300,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/8544f6de9e776865bb5506a40e637e91/tumblr_pb0c7iDrxf1uxb9ydo2_250.gif",
                        "width": 250,
                        "height": 149
                    },
                    {
                        "url": "https://66.media.tumblr.com/8544f6de9e776865bb5506a40e637e91/tumblr_pb0c7iDrxf1uxb9ydo2_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/8544f6de9e776865bb5506a40e637e91/tumblr_pb0c7iDrxf1uxb9ydo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/b5c50f274304f119517aa2e5d279db3e/tumblr_pb0c7iDrxf1uxb9ydo5_400.gif",
                    "width": 300,
                    "height": 179
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/b5c50f274304f119517aa2e5d279db3e/tumblr_pb0c7iDrxf1uxb9ydo5_400.gif",
                        "width": 300,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/b5c50f274304f119517aa2e5d279db3e/tumblr_pb0c7iDrxf1uxb9ydo5_250.gif",
                        "width": 250,
                        "height": 149
                    },
                    {
                        "url": "https://66.media.tumblr.com/b5c50f274304f119517aa2e5d279db3e/tumblr_pb0c7iDrxf1uxb9ydo5_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/b5c50f274304f119517aa2e5d279db3e/tumblr_pb0c7iDrxf1uxb9ydo5_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/2ad1e464b0cd0c6278f7cc077f68121e/tumblr_pb0c7iDrxf1uxb9ydo6_400.gif",
                    "width": 300,
                    "height": 179
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/2ad1e464b0cd0c6278f7cc077f68121e/tumblr_pb0c7iDrxf1uxb9ydo6_400.gif",
                        "width": 300,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/2ad1e464b0cd0c6278f7cc077f68121e/tumblr_pb0c7iDrxf1uxb9ydo6_250.gif",
                        "width": 250,
                        "height": 149
                    },
                    {
                        "url": "https://66.media.tumblr.com/2ad1e464b0cd0c6278f7cc077f68121e/tumblr_pb0c7iDrxf1uxb9ydo6_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/2ad1e464b0cd0c6278f7cc077f68121e/tumblr_pb0c7iDrxf1uxb9ydo6_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/84141904b4f002c6390e006364b05602/tumblr_pb0c7iDrxf1uxb9ydo3_400.gif",
                    "width": 300,
                    "height": 179
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/84141904b4f002c6390e006364b05602/tumblr_pb0c7iDrxf1uxb9ydo3_400.gif",
                        "width": 300,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/84141904b4f002c6390e006364b05602/tumblr_pb0c7iDrxf1uxb9ydo3_250.gif",
                        "width": 250,
                        "height": 149
                    },
                    {
                        "url": "https://66.media.tumblr.com/84141904b4f002c6390e006364b05602/tumblr_pb0c7iDrxf1uxb9ydo3_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/84141904b4f002c6390e006364b05602/tumblr_pb0c7iDrxf1uxb9ydo3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/7f09470e17154dc2d9e4e0272c4c79a1/tumblr_pb0c7iDrxf1uxb9ydo4_400.gif",
                    "width": 300,
                    "height": 179
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/7f09470e17154dc2d9e4e0272c4c79a1/tumblr_pb0c7iDrxf1uxb9ydo4_400.gif",
                        "width": 300,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/7f09470e17154dc2d9e4e0272c4c79a1/tumblr_pb0c7iDrxf1uxb9ydo4_250.gif",
                        "width": 250,
                        "height": 149
                    },
                    {
                        "url": "https://66.media.tumblr.com/7f09470e17154dc2d9e4e0272c4c79a1/tumblr_pb0c7iDrxf1uxb9ydo4_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/7f09470e17154dc2d9e4e0272c4c79a1/tumblr_pb0c7iDrxf1uxb9ydo4_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/8763db36e8c018218186c6229c59c12e/tumblr_pb0c7iDrxf1uxb9ydo8_400.gif",
                    "width": 300,
                    "height": 179
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/8763db36e8c018218186c6229c59c12e/tumblr_pb0c7iDrxf1uxb9ydo8_400.gif",
                        "width": 300,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/8763db36e8c018218186c6229c59c12e/tumblr_pb0c7iDrxf1uxb9ydo8_250.gif",
                        "width": 250,
                        "height": 149
                    },
                    {
                        "url": "https://66.media.tumblr.com/8763db36e8c018218186c6229c59c12e/tumblr_pb0c7iDrxf1uxb9ydo8_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/8763db36e8c018218186c6229c59c12e/tumblr_pb0c7iDrxf1uxb9ydo8_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/a10dfe2fb6063aa2a0007f666ea50c41/tumblr_pb0c7iDrxf1uxb9ydo7_400.gif",
                    "width": 300,
                    "height": 179
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/a10dfe2fb6063aa2a0007f666ea50c41/tumblr_pb0c7iDrxf1uxb9ydo7_400.gif",
                        "width": 300,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/a10dfe2fb6063aa2a0007f666ea50c41/tumblr_pb0c7iDrxf1uxb9ydo7_250.gif",
                        "width": 250,
                        "height": 149
                    },
                    {
                        "url": "https://66.media.tumblr.com/a10dfe2fb6063aa2a0007f666ea50c41/tumblr_pb0c7iDrxf1uxb9ydo7_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/a10dfe2fb6063aa2a0007f666ea50c41/tumblr_pb0c7iDrxf1uxb9ydo7_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/701c08a817b1bd5f9e78b963d6354048/tumblr_pb0c7iDrxf1uxb9ydo9_400.gif",
                    "width": 300,
                    "height": 179
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/701c08a817b1bd5f9e78b963d6354048/tumblr_pb0c7iDrxf1uxb9ydo9_400.gif",
                        "width": 300,
                        "height": 179
                    },
                    {
                        "url": "https://66.media.tumblr.com/701c08a817b1bd5f9e78b963d6354048/tumblr_pb0c7iDrxf1uxb9ydo9_250.gif",
                        "width": 250,
                        "height": 149
                    },
                    {
                        "url": "https://66.media.tumblr.com/701c08a817b1bd5f9e78b963d6354048/tumblr_pb0c7iDrxf1uxb9ydo9_100.gif",
                        "width": 100,
                        "height": 60
                    },
                    {
                        "url": "https://66.media.tumblr.com/701c08a817b1bd5f9e78b963d6354048/tumblr_pb0c7iDrxf1uxb9ydo9_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "hileywwe",
        "blog": {
            "name": "hileywwe",
            "title": "My World",
            "description": "Hello loves🔥 my name is Crystal ❤️/ 20 / Black 😘/ England native / Game of thrones is LIFE ♥ Star wars is LIFE 🖤/jonerys IS my life😍/kit and emilia are goals/positivity and laughter all around/ so if you don't like what I put here oh wells x",
            "url": "https://hileywwe.tumblr.com/",
            "uuid": "t:ySFns-9ttwUwmSjdf1wkXA",
            "updated": 1561416015
        },
        "id": 181708321805,
        "post_url": "https://hileywwe.tumblr.com/post/181708321805",
        "slug": "",
        "date": "2019-01-04 13:54:58 GMT",
        "timestamp": 1546610098,
        "state": "published",
        "format": "html",
        "reblog_key": "5yxkPosS",
        "tags": [
            "game of thrones",
            "jon snow",
            "daenerys targaryen",
            "sansa stark",
            "arya stark",
            "bran stark",
            "missandaei",
            "melissandre",
            "greyworm",
            "jorah mormont",
            "ser davos",
            "tormund",
            "ser bronn",
            "lady brienne",
            "lord varys",
            "tyrion lannister",
            "cersie lannister",
            "jamie lannister",
            "sam tarly",
            "gilly",
            "got",
            "george rr martin",
            "grrm",
            "s8",
            "euron greyjoy",
            "yara greyjoy",
            "theon greyjoy"
        ],
        "short_url": "https://tmblr.co/ZTyJHm2fEgFGD",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 73,
        "title": null,
        "body": "<p><figure class=\"tmblr-full\" data-orig-height=\"955\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/dcfbb18d69ff1b2ff52ad7611d56336a/tumblr_pkt7zi8bb81t2jvmt_540.jpg\" data-orig-height=\"955\" data-orig-width=\"1080\"/></figure></p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"225\" data-orig-width=\"395\"><img src=\"https://66.media.tumblr.com/1df3ab22df27f04f85173c4fe4d0edc5/tumblr_pkt7ziCFaT1t2jvmt_540.gif\" data-orig-height=\"225\" data-orig-width=\"395\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"435\"><img src=\"https://66.media.tumblr.com/0d0bcaa4e93ec28ba85634c35aaeb468/tumblr_pkt7zlQ3571t2jvmt_540.gif\" data-orig-height=\"250\" data-orig-width=\"435\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"200\" data-orig-width=\"410\"><img src=\"https://66.media.tumblr.com/16c4b282fe9c8625bef672a3f13ca9ba/tumblr_pkt7zjkcum1t2jvmt_540.gif\" data-orig-height=\"200\" data-orig-width=\"410\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"123\" data-orig-width=\"220\"><img src=\"https://66.media.tumblr.com/d3d6522544c64b7f199b9ce40876d4b8/tumblr_pkt7zkXNsN1t2jvmt_540.gif\" data-orig-height=\"123\" data-orig-width=\"220\"/></figure></div>",
        "reblog": {
            "comment": "<p><p><figure class=\"tmblr-full\" data-orig-height=\"955\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/dcfbb18d69ff1b2ff52ad7611d56336a/tumblr_pkt7zi8bb81t2jvmt_540.jpg\" data-orig-height=\"955\" data-orig-width=\"1080\"></figure></p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"225\" data-orig-width=\"395\"><img src=\"https://66.media.tumblr.com/1df3ab22df27f04f85173c4fe4d0edc5/tumblr_pkt7ziCFaT1t2jvmt_540.gif\" data-orig-height=\"225\" data-orig-width=\"395\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"435\"><img src=\"https://66.media.tumblr.com/0d0bcaa4e93ec28ba85634c35aaeb468/tumblr_pkt7zlQ3571t2jvmt_540.gif\" data-orig-height=\"250\" data-orig-width=\"435\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"200\" data-orig-width=\"410\"><img src=\"https://66.media.tumblr.com/16c4b282fe9c8625bef672a3f13ca9ba/tumblr_pkt7zjkcum1t2jvmt_540.gif\" data-orig-height=\"200\" data-orig-width=\"410\"></figure><figure class=\"tmblr-full\" data-orig-height=\"123\" data-orig-width=\"220\"><img src=\"https://66.media.tumblr.com/d3d6522544c64b7f199b9ce40876d4b8/tumblr_pkt7zkXNsN1t2jvmt_540.gif\" data-orig-height=\"123\" data-orig-width=\"220\"></figure></div></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "hileywwe",
                    "active": true,
                    "theme": {
                        "header_full_width": 1080,
                        "header_full_height": 1308,
                        "header_focus_width": 1056,
                        "header_focus_height": 594,
                        "avatar_shape": "circle",
                        "background_color": "#988D8B",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "55,1056,649,0",
                        "header_image": "https://static.tumblr.com/e12e2c46342a08569a07828b61029400/dinn9a7/ac2pnv6v3/tumblr_static_1194219211-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/83f3939a4a5d3bb3fbb49c3768966600/dinn9a7/QfFpnv6v5/tumblr_static_tumblr_static_1194219211-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e12e2c46342a08569a07828b61029400/dinn9a7/ac2pnv6v3/tumblr_static_1194219211-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181708321805"
                },
                "content_raw": "<p><p><figure class=\"tmblr-full\" data-orig-height=\"955\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/dcfbb18d69ff1b2ff52ad7611d56336a/tumblr_pkt7zi8bb81t2jvmt_540.jpg\" data-orig-height=\"955\" data-orig-width=\"1080\"></figure></p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"225\" data-orig-width=\"395\"><img src=\"https://66.media.tumblr.com/1df3ab22df27f04f85173c4fe4d0edc5/tumblr_pkt7ziCFaT1t2jvmt_540.gif\" data-orig-height=\"225\" data-orig-width=\"395\"></figure><figure class=\"tmblr-full\" data-orig-height=\"250\" data-orig-width=\"435\"><img src=\"https://66.media.tumblr.com/0d0bcaa4e93ec28ba85634c35aaeb468/tumblr_pkt7zlQ3571t2jvmt_540.gif\" data-orig-height=\"250\" data-orig-width=\"435\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"200\" data-orig-width=\"410\"><img src=\"https://66.media.tumblr.com/16c4b282fe9c8625bef672a3f13ca9ba/tumblr_pkt7zjkcum1t2jvmt_540.gif\" data-orig-height=\"200\" data-orig-width=\"410\"></figure><figure class=\"tmblr-full\" data-orig-height=\"123\" data-orig-width=\"220\"><img src=\"https://66.media.tumblr.com/d3d6522544c64b7f199b9ce40876d4b8/tumblr_pkt7zkXNsN1t2jvmt_540.gif\" data-orig-height=\"123\" data-orig-width=\"220\"></figure></div></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/dcfbb18d69ff1b2ff52ad7611d56336a/tumblr_pkt7zi8bb81t2jvmt_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/1df3ab22df27f04f85173c4fe4d0edc5/tumblr_pkt7ziCFaT1t2jvmt_540.gif\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0d0bcaa4e93ec28ba85634c35aaeb468/tumblr_pkt7zlQ3571t2jvmt_540.gif\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/16c4b282fe9c8625bef672a3f13ca9ba/tumblr_pkt7zjkcum1t2jvmt_540.gif\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d3d6522544c64b7f199b9ce40876d4b8/tumblr_pkt7zkXNsN1t2jvmt_540.gif\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "hileywwe",
        "blog": {
            "name": "hileywwe",
            "title": "My World",
            "description": "Hello loves🔥 my name is Crystal ❤️/ 20 / Black 😘/ England native / Game of thrones is LIFE ♥ Star wars is LIFE 🖤/jonerys IS my life😍/kit and emilia are goals/positivity and laughter all around/ so if you don't like what I put here oh wells x",
            "url": "https://hileywwe.tumblr.com/",
            "uuid": "t:ySFns-9ttwUwmSjdf1wkXA",
            "updated": 1561416015
        },
        "id": 181706799795,
        "post_url": "https://hileywwe.tumblr.com/post/181706799795",
        "slug": "",
        "date": "2019-01-04 12:22:00 GMT",
        "timestamp": 1546604520,
        "state": "published",
        "format": "html",
        "reblog_key": "cKYcZ2Ey",
        "tags": [
            "game of thrones",
            "jon snow",
            "daenerys targaryen",
            "sansa stark",
            "arya stark",
            "bran stark",
            "cersie lannister",
            "tyrion lannister",
            "jamie lannister",
            "greyworm",
            "missandaei",
            "melissandre",
            "got8",
            "lord varys",
            "ser davos",
            "ser bronn",
            "d&d",
            "george rr martin",
            "grrm",
            "khal drogo",
            "kit harington",
            "emilia clarke",
            "lena headey",
            "peter dinklage",
            "sophie turner",
            "maise williams",
            "jason mamoa",
            "nikolaj coster waldau",
            "jorah mormont",
            "theon greyjoy"
        ],
        "short_url": "https://tmblr.co/ZTyJHm2fEaRgp",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 17,
        "title": null,
        "body": "<h1>Too bad none of us can actually afford to go to the premiere 😂😏💀</h1><figure class=\"tmblr-full\" data-orig-height=\"1193\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/f2e7729e30c8f4ca23fc645912a5d0db/tumblr_pkt3ooFgWf1t2jvmt_540.jpg\" data-orig-height=\"1193\" data-orig-width=\"1080\"/></figure>",
        "reblog": {
            "comment": "<p><h1>Too bad none of us can actually afford to go to the premiere 😂😏💀</h1><figure class=\"tmblr-full\" data-orig-height=\"1193\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/f2e7729e30c8f4ca23fc645912a5d0db/tumblr_pkt3ooFgWf1t2jvmt_540.jpg\" data-orig-height=\"1193\" data-orig-width=\"1080\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "hileywwe",
                    "active": true,
                    "theme": {
                        "header_full_width": 1080,
                        "header_full_height": 1308,
                        "header_focus_width": 1056,
                        "header_focus_height": 594,
                        "avatar_shape": "circle",
                        "background_color": "#988D8B",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "55,1056,649,0",
                        "header_image": "https://static.tumblr.com/e12e2c46342a08569a07828b61029400/dinn9a7/ac2pnv6v3/tumblr_static_1194219211-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/83f3939a4a5d3bb3fbb49c3768966600/dinn9a7/QfFpnv6v5/tumblr_static_tumblr_static_1194219211-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e12e2c46342a08569a07828b61029400/dinn9a7/ac2pnv6v3/tumblr_static_1194219211-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181706799795"
                },
                "content_raw": "<p><h1>Too bad none of us can actually afford to go to the premiere 😂😏💀</h1><figure class=\"tmblr-full\" data-orig-height=\"1193\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/f2e7729e30c8f4ca23fc645912a5d0db/tumblr_pkt3ooFgWf1t2jvmt_540.jpg\" data-orig-height=\"1193\" data-orig-width=\"1080\"></figure></p>",
                "content": "<p><h1>Too bad none of us can actually afford to go to the premiere &#128514;&#128527;&#128128;</h1><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f2e7729e30c8f4ca23fc645912a5d0db/tumblr_pkt3ooFgWf1t2jvmt_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "astralapoplexy",
        "blog": {
            "name": "astralapoplexy",
            "title": "pdnos",
            "description": "<p>I’m 21</p>",
            "url": "https://astralapoplexy.tumblr.com/",
            "uuid": "t:htEqzsT8J4rs5FSG_79UEg",
            "updated": 1561708776
        },
        "id": 181706700359,
        "post_url": "https://astralapoplexy.tumblr.com/post/181706700359",
        "slug": "",
        "date": "2019-01-04 12:15:57 GMT",
        "timestamp": 1546604157,
        "state": "published",
        "format": "html",
        "reblog_key": "LtadMqQL",
        "tags": [
            "i feel like i may have already posted this",
            "anyway",
            "sansa stark",
            "depression fatigue"
        ],
        "short_url": "https://tmblr.co/ZpmULh2fEa3P7",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"565\" data-orig-width=\"2650\"><img src=\"https://66.media.tumblr.com/9cb423604c07f1b69128ea7553e7f412/tumblr_pkt3ekw5wh1s0kjwv_540.jpg\" data-orig-height=\"565\" data-orig-width=\"2650\"/></figure>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"565\" data-orig-width=\"2650\"><img src=\"https://66.media.tumblr.com/9cb423604c07f1b69128ea7553e7f412/tumblr_pkt3ekw5wh1s0kjwv_540.jpg\" data-orig-height=\"565\" data-orig-width=\"2650\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "astralapoplexy",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#3D1D32",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/255db9e18db965252a100095df0c1d9f/gfgpkms/6kgo5id96/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/255db9e18db965252a100095df0c1d9f/gfgpkms/6kgo5id96/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/255db9e18db965252a100095df0c1d9f/gfgpkms/6kgo5id96/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#9f0320",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#E50000",
                        "title_font": "Grumpy Black 48",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181706700359"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"565\" data-orig-width=\"2650\"><img src=\"https://66.media.tumblr.com/9cb423604c07f1b69128ea7553e7f412/tumblr_pkt3ekw5wh1s0kjwv_540.jpg\" data-orig-height=\"565\" data-orig-width=\"2650\"></figure></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/9cb423604c07f1b69128ea7553e7f412/tumblr_pkt3ekw5wh1s0kjwv_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "athimbleful",
        "blog": {
            "name": "athimbleful",
            "title": "A Thimbleful",
            "description": "...of salt and other stuff. (Not an asoiaf fan)",
            "url": "https://athimbleful.tumblr.com/",
            "uuid": "t:oj4uH7xCCGBzpvDYt2iv-w",
            "updated": 1561764633
        },
        "id": 181706645930,
        "post_url": "https://athimbleful.tumblr.com/post/181706645930/i-just-read-an-article-talking-about-how-sansa",
        "slug": "i-just-read-an-article-talking-about-how-sansa",
        "date": "2019-01-04 12:12:32 GMT",
        "timestamp": 1546603952,
        "state": "published",
        "format": "html",
        "reblog_key": "1DwGKI76",
        "tags": [
            "Anonymous",
            "sansa stark",
            "my asks"
        ],
        "short_url": "https://tmblr.co/ZQiwbg2fEZs6g",
        "summary": "i just read an article talking about how sansa might die early on in the new season when the white walkers storm winterfell to...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 28,
        "asking_name": "Anonymous",
        "asking_url": null,
        "question": "i just read an article talking about how sansa might die early on in the new season when the white walkers storm winterfell to remind the audience that no one is safe bc we haven’t had a major character death in a little. sansa is my fav and i rlly don’t want her to die but this theory kinda makes sense when you consider all the foreshadowing that winterfell, where sansa feels safe, will turn out to be not so safe. idk whether i rlly believe this though. what do you think?",
        "answer": "<p>I very much doubt it, anon.</p><p>Now, I believe Sansa will survive the whole thing. I believe she’s been written to be the person who rebuilds Winterfell and carries on the Stark legacy. People have written a lot of meta about that, so I won’t go into it here.</p><p>But let’s say we’re wrong. Let’s say Sansa is going to die in s8. That still doesn’t mean she’ll die early on.</p><p>The Starks are the heart of the story. They’re the close-knit family people can root for and want to be a part of and generally adore in a show where most other families are trying to kill one another (and sometimes succeeding). And season by season, they’ve gone through horrible, traumatic shit but, more importantly, learned a lot of valuable lessons. It’s a bit like a video game. You learn new abilities before meeting a boss where these abilities will be crucial.</p><p>That’s what the Starklings have done.</p><p>Bran has learned how to control his warging and greensight and become the Three Eyed Raven. Arya has learned how to fight, kill, and be a Faceless Man. Jon has learned how to fight, how to spy/infiltrate, how to command. And Sansa has learned how to stop being a pawn and start being a player who knows how to move the different pieces. And season seven was their graduating. It was their completing the level before the final boss fight to prove to us all they have the skills to make it, if only they play this well enough:</p><p>Sansa, Bran, and Arya teamed up to take down one of the biggest villains in Game of Thrones, all by using their different abilities&ndash;even though LF for a long time seemed to be successful in playing them. And Jon managed to get D/ny on his side by using all the tools in his arsenal&ndash;even though he for a long time was her prisoner she was hellbent on getting to kneel.</p><p>Next season the pack’s going to work together, and while any of them technically could die, none of them will die early on. Especially not Sansa, whose abilities will be needed throughout the season just like the rest of them.</p><p>Thanks for the ask!</p>",
        "reblog": {
            "comment": "<p>I very much doubt it, anon.</p><p>Now, I believe Sansa will survive the whole thing. I believe she’s been written to be the person who rebuilds Winterfell and carries on the Stark legacy. People have written a lot of meta about that, so I won’t go into it here.</p><p>But let’s say we’re wrong. Let’s say Sansa is going to die in s8. That still doesn’t mean she’ll die early on.</p><p>The Starks are the heart of the story. They’re the close-knit family people can root for and want to be a part of and generally adore in a show where most other families are trying to kill one another (and sometimes succeeding). And season by season, they’ve gone through horrible, traumatic shit but, more importantly, learned a lot of valuable lessons. It’s a bit like a video game. You learn new abilities before meeting a boss where these abilities will be crucial.</p><p>That’s what the Starklings have done.</p><p>Bran has learned how to control his warging and greensight and become the Three Eyed Raven. Arya has learned how to fight, kill, and be a Faceless Man. Jon has learned how to fight, how to spy/infiltrate, how to command. And Sansa has learned how to stop being a pawn and start being a player who knows how to move the different pieces. And season seven was their graduating. It was their completing the level before the final boss fight to prove to us all they have the skills to make it, if only they play this well enough:</p><p>Sansa, Bran, and Arya teamed up to take down one of the biggest villains in Game of Thrones, all by using their different abilities–even though LF for a long time seemed to be successful in playing them. And Jon managed to get D/ny on his side by using all the tools in his arsenal–even though he for a long time was her prisoner she was hellbent on getting to kneel.</p><p>Next season the pack’s going to work together, and while any of them technically could die, none of them will die early on. Especially not Sansa, whose abilities will be needed throughout the season just like the rest of them.</p><p>Thanks for the ask!</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "athimbleful",
                    "active": true,
                    "theme": {
                        "header_full_width": 400,
                        "header_full_height": 202,
                        "header_focus_width": 359,
                        "header_focus_height": 202,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,379,202,20",
                        "header_image": "https://static.tumblr.com/a5134dc00f2b8b931dbc1509e13cb952/zm5xgbp/2VQpqvmwg/tumblr_static_5cyntf7s5n0o8sk8cc8o0s40w.gif",
                        "header_image_focused": "https://static.tumblr.com/a5134dc00f2b8b931dbc1509e13cb952/zm5xgbp/x8ppqvmwk/tumblr_static_tumblr_static_5cyntf7s5n0o8sk8cc8o0s40w_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/a5134dc00f2b8b931dbc1509e13cb952/zm5xgbp/2VQpqvmwg/tumblr_static_5cyntf7s5n0o8sk8cc8o0s40w_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181706645930"
                },
                "content_raw": "<p>I very much doubt it, anon.</p><p>Now, I believe Sansa will survive the whole thing. I believe she’s been written to be the person who rebuilds Winterfell and carries on the Stark legacy. People have written a lot of meta about that, so I won’t go into it here.</p><p>But let’s say we’re wrong. Let’s say Sansa is going to die in s8. That still doesn’t mean she’ll die early on.</p><p>The Starks are the heart of the story. They’re the close-knit family people can root for and want to be a part of and generally adore in a show where most other families are trying to kill one another (and sometimes succeeding). And season by season, they’ve gone through horrible, traumatic shit but, more importantly, learned a lot of valuable lessons. It’s a bit like a video game. You learn new abilities before meeting a boss where these abilities will be crucial.</p><p>That’s what the Starklings have done.</p><p>Bran has learned how to control his warging and greensight and become the Three Eyed Raven. Arya has learned how to fight, kill, and be a Faceless Man. Jon has learned how to fight, how to spy/infiltrate, how to command. And Sansa has learned how to stop being a pawn and start being a player who knows how to move the different pieces. And season seven was their graduating. It was their completing the level before the final boss fight to prove to us all they have the skills to make it, if only they play this well enough:</p><p>Sansa, Bran, and Arya teamed up to take down one of the biggest villains in Game of Thrones, all by using their different abilities–even though LF for a long time seemed to be successful in playing them. And Jon managed to get D/ny on his side by using all the tools in his arsenal–even though he for a long time was her prisoner she was hellbent on getting to kneel.</p><p>Next season the pack’s going to work together, and while any of them technically could die, none of them will die early on. Especially not Sansa, whose abilities will be needed throughout the season just like the rest of them.</p><p>Thanks for the ask!</p>",
                "content": "<p>I very much doubt it, anon.</p><p>Now, I believe Sansa will survive the whole thing. I believe she&rsquo;s been written to be the person who rebuilds Winterfell and carries on the Stark legacy. People have written a lot of meta about that, so I won&rsquo;t go into it here.</p><p>But let&rsquo;s say we&rsquo;re wrong. Let&rsquo;s say Sansa is going to die in s8. That still doesn&rsquo;t mean she&rsquo;ll die early on.</p><p>The Starks are the heart of the story. They&rsquo;re the close-knit family people can root for and want to be a part of and generally adore in a show where most other families are trying to kill one another (and sometimes succeeding). And season by season, they&rsquo;ve gone through horrible, traumatic shit but, more importantly, learned a lot of valuable lessons. It&rsquo;s a bit like a video game. You learn new abilities before meeting a boss where these abilities will be crucial.</p><p>That&rsquo;s what the Starklings have done.</p><p>Bran has learned how to control his warging and greensight and become the Three Eyed Raven. Arya has learned how to fight, kill, and be a Faceless Man. Jon has learned how to fight, how to spy/infiltrate, how to command. And Sansa has learned how to stop being a pawn and start being a player who knows how to move the different pieces. And season seven was their graduating. It was their completing the level before the final boss fight to prove to us all they have the skills to make it, if only they play this well enough:</p><p>Sansa, Bran, and Arya teamed up to take down one of the biggest villains in Game of Thrones, all by using their different abilities&ndash;even though LF for a long time seemed to be successful in playing them. And Jon managed to get D/ny on his side by using all the tools in his arsenal&ndash;even though he for a long time was her prisoner she was hellbent on getting to kneel.</p><p>Next season the pack&rsquo;s going to work together, and while any of them technically could die, none of them will die early on. Especially not Sansa, whose abilities will be needed throughout the season just like the rest of them.</p><p>Thanks for the ask!</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "silkygoldmilkweed",
        "blog": {
            "name": "silkygoldmilkweed",
            "title": "sansa stark & sandor clegane are soulmates",
            "description": "",
            "url": "https://silkygoldmilkweed.tumblr.com/",
            "uuid": "t:luzi-3qD5YMtFIhFTSd34w",
            "updated": 1561664777
        },
        "id": 181705262522,
        "post_url": "https://silkygoldmilkweed.tumblr.com/post/181705262522/sansas-third-wedding-will-be-different",
        "slug": "sansas-third-wedding-will-be-different",
        "date": "2019-01-04 10:54:42 GMT",
        "timestamp": 1546599282,
        "state": "published",
        "format": "html",
        "reblog_key": "sk2HLIRk",
        "tags": [
            "sansan",
            "sandor clegane",
            "sansa stark",
            "sansa x sandor",
            "sansa stark x sandor clegane",
            "lem lemoncloak",
            "sansan marriage"
        ],
        "short_url": "https://tmblr.co/Z2u95j2fEUaMw",
        "summary": "Sansa’s third wedding will be different",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 76,
        "title": null,
        "body": "<h1>Sansa’s third wedding will be different</h1><p>* Long unbound princess hair (versus extremely styled updos for first two weddings)</p><p>* Actual beloved family members present, instead of monsters who murdered her family</p><p>* first wedding she was given away by false King Joffrey, standing in for Ned as “father of the realm,” versus at her third wedding she will be given away by true king Jon Snow, standing in for their father Ned Stark </p><p>* Arya will “give away” Sandor, because she’s his “daughter” and he has no other family to speak of</p><p>* Groom’s cloak will be that rag Sandor took off Lem Lemoncloak—thank goodness Beric insisted on hanging or it would be covered in blood like the cloaks he gives her in the books. (Check my <b>Lem</b> <b>Lemoncloak</b> tag for more on this.)</p><p>* I suspect it could be held in the sept Ned built for Cat at a Winterfell, because Sandor’s people kept the New Gods, because Septon Ray was so important to his character growth, and because Ramsay may have ruined heart-tree/forest weddings for Sansa</p><p>* the wedding dress will be either a totally no-nonsense everyday war-wedding dress of no significance, because for once the marriage is more important than the wedding, OR they will let Michele Clapton go crazy and create something astonishing under the story guise that Sansa has secretly been sewing her own wedding dress for years in hopes that her husband Sandor Clegane would someday return to her. </p><p>* If Sansa makes her own wedding dress or anything for Sandor to wear, fanon holds that it must somewhere be embroidered with a big black dog and a little red bird. </p><p><b>What are your thoughts on Sansa’s third wedding?</b></p>",
        "reblog": {
            "comment": "<p><h1>Sansa’s third wedding will be different</h1><p>* Long unbound princess hair (versus extremely styled updos for first two weddings)</p><p>* Actual beloved family members present, instead of monsters who murdered her family</p><p>* first wedding she was given away by false King Joffrey, standing in for Ned as “father of the realm,” versus at her third wedding she will be given away by true king Jon Snow, standing in for their father Ned Stark </p><p>* Arya will “give away” Sandor, because she’s his “daughter” and he has no other family to speak of</p><p>* Groom’s cloak will be that rag Sandor took off Lem Lemoncloak—thank goodness Beric insisted on hanging or it would be covered in blood like the cloaks he gives her in the books. (Check my <b>Lem</b> <b>Lemoncloak</b> tag for more on this.)</p><p>* I suspect it could be held in the sept Ned built for Cat at a Winterfell, because Sandor’s people kept the New Gods, because Septon Ray was so important to his character growth, and because Ramsay may have ruined heart-tree/forest weddings for Sansa</p><p>* the wedding dress will be either a totally no-nonsense everyday war-wedding dress of no significance, because for once the marriage is more important than the wedding, OR they will let Michele Clapton go crazy and create something astonishing under the story guise that Sansa has secretly been sewing her own wedding dress for years in hopes that her husband Sandor Clegane would someday return to her. </p><p>* If Sansa makes her own wedding dress or anything for Sandor to wear, fanon holds that it must somewhere be embroidered with a big black dog and a little red bird. </p><p><b>What are your thoughts on Sansa’s third wedding?</b></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "silkygoldmilkweed",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/f15be24c4d47975e686c7ea1c7e386ea/s22tgnt/kY9pe5h6p/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/f15be24c4d47975e686c7ea1c7e386ea/s22tgnt/kY9pe5h6p/tumblr_static__2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f15be24c4d47975e686c7ea1c7e386ea/s22tgnt/kY9pe5h6p/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181705262522"
                },
                "content_raw": "<p><h1>Sansa’s third wedding will be different</h1><p>* Long unbound princess hair (versus extremely styled updos for first two weddings)</p><p>* Actual beloved family members present, instead of monsters who murdered her family</p><p>* first wedding she was given away by false King Joffrey, standing in for Ned as “father of the realm,” versus at her third wedding she will be given away by true king Jon Snow, standing in for their father Ned Stark </p><p>* Arya will “give away” Sandor, because she’s his “daughter” and he has no other family to speak of</p><p>* Groom’s cloak will be that rag Sandor took off Lem Lemoncloak—thank goodness Beric insisted on hanging or it would be covered in blood like the cloaks he gives her in the books. (Check my <b>Lem</b> <b>Lemoncloak</b> tag for more on this.)</p><p>* I suspect it could be held in the sept Ned built for Cat at a Winterfell, because Sandor’s people kept the New Gods, because Septon Ray was so important to his character growth, and because Ramsay may have ruined heart-tree/forest weddings for Sansa</p><p>* the wedding dress will be either a totally no-nonsense everyday war-wedding dress of no significance, because for once the marriage is more important than the wedding, OR they will let Michele Clapton go crazy and create something astonishing under the story guise that Sansa has secretly been sewing her own wedding dress for years in hopes that her husband Sandor Clegane would someday return to her. </p><p>* If Sansa makes her own wedding dress or anything for Sandor to wear, fanon holds that it must somewhere be embroidered with a big black dog and a little red bird. </p><p><b>What are your thoughts on Sansa’s third wedding?</b></p></p>",
                "content": "<p><h1>Sansa&rsquo;s third wedding will be different</h1><p>* Long unbound princess hair (versus extremely styled updos for first two weddings)</p><p>* Actual beloved family members present, instead of monsters who murdered her family</p><p>* first wedding she was given away by false King Joffrey, standing in for Ned as &ldquo;father of the realm,&rdquo; versus at her third wedding she will be given away by true king Jon Snow, standing in for their father Ned Stark </p><p>* Arya will &ldquo;give away&rdquo; Sandor, because she&rsquo;s his &ldquo;daughter&rdquo; and he has no other family to speak of</p><p>* Groom&rsquo;s cloak will be that rag Sandor took off Lem Lemoncloak&mdash;thank goodness Beric insisted on hanging or it would be covered in blood like the cloaks he gives her in the books. (Check my <b>Lem</b> <b>Lemoncloak</b> tag for more on this.)</p><p>* I suspect it could be held in the sept Ned built for Cat at a Winterfell, because Sandor&rsquo;s people kept the New Gods, because Septon Ray was so important to his character growth, and because Ramsay may have ruined heart-tree/forest weddings for Sansa</p><p>* the wedding dress will be either a totally no-nonsense everyday war-wedding dress of no significance, because for once the marriage is more important than the wedding, OR they will let Michele Clapton go crazy and create something astonishing under the story guise that Sansa has secretly been sewing her own wedding dress for years in hopes that her husband Sandor Clegane would someday return to her. </p><p>* If Sansa makes her own wedding dress or anything for Sandor to wear, fanon holds that it must somewhere be embroidered with a big black dog and a little red bird. </p><p><b>What are your thoughts on Sansa&rsquo;s third wedding?</b></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]