[
    {
        "type": "text",
        "blog_name": "mollyraesly",
        "blog": {
            "name": "mollyraesly",
            "title": "Thank You For Being Here Today",
            "description": "",
            "url": "https://mollyraesly.tumblr.com/",
            "uuid": "t:RKMNKLdEcDstHDDjKYZP4w",
            "updated": 1561677755
        },
        "id": 181177997617,
        "post_url": "https://mollyraesly.tumblr.com/post/181177997617/time-with-wolves-chapter-19",
        "slug": "time-with-wolves-chapter-19",
        "date": "2018-12-16 21:06:43 GMT",
        "timestamp": 1544994403,
        "state": "published",
        "format": "html",
        "reblog_key": "DUXvK2jx",
        "tags": [
            "timewithwolves",
            "Molly Raesly",
            "mollyraesly",
            "jon snow",
            "sansa stark",
            "jonsa",
            "jonsa fan fic",
            "jonsa fanfic",
            "jonsa fanfiction",
            "jonsa fan fiction"
        ],
        "short_url": "https://tmblr.co/ZU72pw2el3Dan",
        "summary": "Time with Wolves -- Chapter 19",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 21,
        "title": "Time with Wolves -- Chapter 19",
        "body": "<p>\n\n&ldquo;I think your boyfriend must really like you,&rdquo; Bran told her the morning before the wedding as they waited for the shop owner to bring out the tuxes they were renting. <br/><br/>Sansa couldn&rsquo;t help the smile tugging at her lips. &ldquo;Yeah, what makes you say that?&rdquo;<br/><br/>&ldquo;He&rsquo;s not once complained about Rickon.&rdquo;<br/></p><!-- more --><p>\n<br/>\n&ldquo;Ugh, don&rsquo;t get me started.&rdquo;<br/><br/>\n&ldquo;One would think that the same dick joke\ntold again and again would lead to diminishing returns, but I&rsquo;m not sure our\nlittle brother understands the basics of economics—or comedy.&rdquo;<br/><br/>\n&ldquo;Or manners,&rdquo; Sansa lamented with a\nsigh. Rickon hadn&rsquo;t been the only one to test her boyfriend&rsquo;s resolve; besides\ndealing with Margaery upon his arrival, he&rsquo;d had to meet both of her parents\nfor the first time just as they learned that the wedding venue wanted to charge\nanother $2,500 fee for the rush and Jeyne&rsquo;s parents were refusing to pay\nit—leading to the question of whether there&rsquo;d be a wedding at all. After some\nheated telephone exchanges, Sansa was pretty sure her father had talked the\nvenue down to just charging a $1,000 late fee, but she was fairly certain that\nmoney was coming out of his own checkbook. </p><p>Arya blamed Robb for being so stupid and inconsiderate, and\nSansa tried her very best not to chime in when she started ranting about their\nolder brother and all the money he was costing their parents. But at least Arya\nwas trying not to complain too much in front of company. She’d kept the\nsarcastic comments directed mainly to Sansa and Gendry.</p><p><br/>\n&ldquo;We&rsquo;re eloping,&rdquo; she&rsquo;d told Gendry the\nother day—much to her boyfriend’s surprise.<br/><br/>\n&ldquo;Really?&rdquo; he&rsquo;d managed to choke out.<br/><br/>\n&ldquo;Yes,&rdquo; she&rsquo;d replied matter-of-factly.\n&ldquo;We can have a party afterwards. Hotpie can make a cake because the best\npart is the cake. But I&rsquo;m not putting myself through all this garbage. This\nwedding crap is giving me hives. I won’t go through this bullshit again. And\nI’ll be wearing pants.&rdquo;<br/><br/>\n&ldquo;Whatever you want,&rdquo; he said.\n&ldquo;I&rsquo;ve got what I want.&rdquo;<br/><br/>\n&ldquo;Cake?&rdquo;<br/><br/>\n&ldquo;Nah, I&rsquo;ve got you thinking about marrying\nme,&rdquo; he preened.<br/><br/>\nThe whole exchange had actually been quite adorable—to\nthe point Sansa had wished she had a camera—until Arya sucker punched him.<br/><br/>\nPoor Dickon had missed the whole thing, though,\nbecause he&rsquo;d very nobly agreed to help her father shovel the driveway—despite\nnot having much personal experience with deep snow. After an hour and a half\nwhen they’d come back inside, Dickon’s fingers had been frozen, his lips blue.<br/><br/>\nShe sighed again. &ldquo;He has been a real\ntrooper.&rdquo; She leaned over to place her hand on Bran’s shoulder. “Thanks\nfor inviting him to hang out with you and Gendry last night. I know he\nappreciated it.”<br/><br/>\nAs Robb’s stag night had been the week before\nand quite a 21-and-over event—Sansa saw Theon the other day and wondered if he\nwas still hungover—the night before had been a quiet one. Robb had spent the\nnight with Jeyne and her family, and Rickon luckily had been at a friend’s\nhouse; Sansa suspected that had been her mother’s doing, for which she was most\ngrateful. <br/><br/>\nSansa and Arya were roped into helping their mom\nwith last-minute seating chart arrangements and making favors, and their father\nhad to work.<br/><br/>\nSo Bran has taken the initiative to order pizza\nand play video games with Dickon—and invite Gendry, too, so there wouldn’t be\nas much pressure to bond with the younger brother.<br/><br/>\n“I like Dickon.”<br/><br/>\n“You do?”<br/><br/>\n“Yeah, he knows a lot about the Westerosi\ncriminal code and how to evade certain charges on technicalities. I think those\ntalents will prove useful in the future, should Rickon reach 18.”<br/><br/>\nSansa swallowed her laugh. “I’ll keep that in\nmind.” She tapped her foot. “What time is it?”<br/><br/>\n“10:52.”<br/><br/>\n“And what time were these supposed to be ready?”<br/><br/>\n“I think 10:45, but since Robb isn’t here to\nsign for them&hellip;” Robb was supposed to be here to meet them and help with\npicking up the tuxes, but there&rsquo;d been a minor catastrophe with the catering.\nThere’d been minor catastrophes with everything, it seemed. This wedding, if it\nactually took place, would be a miracle.<br/><br/>\nSansa took a deep breath. “All right, you stay\nhere.”<br/><br/>\n“Where are you going?”<br/><br/>\n“To get our tuxes.”<br/><br/>\nSix minutes later, Sansa returned to the front\ncounter with a bag-laden shop worker hurrying behind her. <br/><br/>\nShe gave Bran a smile as the man typed\neverything into the cash register. <br/><br/>\n“There’s nine bags” Bran counted as the man went\nthrough them all. “We’re only supposed to pick up eight tuxes.”<br/><br/>\n“Something caught my eye, and I’m an excellent\nnegotiator,” Sansa told her little brother with a wink.<br/><br/>\n“Everything is in order, Miss Stark.”<br/><br/>\n“Thank you so much, Illyrio. You’ve been such a\nhelp.”</p><p>“Let me help you to your car.”</p><p>When everything was packed, Sansa shook the man’s hand in\ngratitude and thanked him once more. </p><p>“You will look radiant, Miss Stark. I just know it.”</p><p>Sansa grinned and waved goodbye. When she got behind the\ndriver’s seat, Bran looked at her in confusion. “I thought you told Mom you\nalready had a dress for the wedding.”</p><p>“I did,” Sansa replied. “But a very wise woman told me just\nthe other day that there’s always time for a new dress.”</p><p>“What if it doesn’t fit? Did you even try it on?”</p><p>“It’ll fit,” Sansa told him. “Don’t you fret, Bran. I have an\neye for these things.”</p><p>“How did you get him to give it to you for free?”</p><p>Sansa grinned. “There’s nothing a little bit of persuasion\nand good manners can’t accomplish.”</p><p>Bran applauded softly. “If only Robb had you around to deal\nwith the caterers this morning.”</p><p>“Yes, well, we all know that Robb can manage just fine on his\nown.” Upon his silence, she turned to her younger brother and winked. </p><p>Tuxes in tow, they went to the florist next and then dropped\noff a check at the limousine shop. As they were leaving, Sansa’s stomach\ngrumbled. “Did you have a chance to look at the menu of the place we’re going\ntonight—it’s a Dornish restaurant, right?”</p><p>Bran sighed. “Over-priced and needlessly pretentious. You can’t\npick your side dish; they get automatically assigned. And of course all the\ngood meat options are paired with the worst vegetables.”</p><p>“Does the vegetarian option at least look good? Sometimes—”</p><p>“It’s not only vegetarian but also vegan and gluten-free. A\nmeal for all the difficult people.”</p><p>Sansa frowned. “Why in the name of all the gods would we go\nthere then?”</p><p>“Mom said it was close to the venue.”</p><p>Sansa bit her tongue to avoid saying what she was thinking.\nHer stomach grumbled again. “We should eat now. At least we’ll be able to get\none good meal in today.”</p><p>“The Ice Shack isn’t too far from here,” said Bran, grinning.\n“We could get milkshakes—strawberry.”</p><p>For a moment, she was 15, sitting in the Ice Shack parking\nlot, sipping on a strawberry milkshake and munching on fries in the front seat\nof Jon Snow’s car.</p><p>But when she blinked, she was 21 again and in the driver’s\nseat. “All that dairy won’t be good right before we have to take so many\npictures. Why don’t we stop and get some sandwiches to bring home? I’m sure\neveryone is hungry there.”</p><p>Bran accepted her excuse, and she drove toward the nearest\nsandwich shop.</p><p>“Thank you, little one,” her father said when they returned with\nchores completed and lunch for everyone. “We would not survive this weekend\nwithout you.”</p><p>“That’s not true,” Sansa said, though she was not so sure.  </p><p>“Let’s not find out,” Ned muttered. “Go on and get ready. The\nboys and I can take it from here.”</p><p>“You sure?”</p><p>“Yes. All’s that left is getting things in the car and\ngetting everybody dressed up before we go set up at the church. Maybe see if\nyou can convince Arya—”</p><p>Sansa laughed. “I’ve never been able to convince Arya to do a\nsingle thing in my entire life. Do you really think this is the weekend when\nthat’s going to change?”</p><p>With his laughter ringing in the hall, she made her way\nupstairs and to the bathroom. There wasn’t much time, but she desperately\nwanted a bath. It was going to be a long weekend; she needed to take the\nopportunities for quiet solitude when she could. </p><p>The bath worked, somewhat, to calm her down, but with each\nhour the rehearsal loomed closer, she could feel her pulse quicken. </p><p>Once dry and hair blown out, Sansa sat in front of her vanity\nmirror and applied her makeup as carefully as she could. Sansa was usually\npretty good at doing makeup, but she wanted to make sure that it looked\nabsolutely perfect. Before applying her lipstick, a rose pink shade, she\nslipped into her outfit for the evening: a dark teal silk dress with long\nsleeves and buttons down the front. </p><p>She hummed under her breath as she methodically braided her\nlong hair into a fish tail and then studied herself in the mirror.</p><p>“You are Sansa Stark of Winterfell. You are Ned and Cat’s\ndaughter. You can do this,” she whispered under her breath. Do what exactly, she\nwasn’t sure. But saying it aloud made her feel like it was true. </p><p>As she was slipping into her heels, a knock sounded on her\ndoor. “It’s open!” she said as she tried to find where she’d put her purse.</p><p>“Wow, Sansa, you look really pretty.”</p><p>Sansa stopped searching for her purse and turned to smile at\nher little brother Rickon; his hair was wild, but he still looked so sweet in his\ngrey suit with the tie still undone.</p><p>“Thank you. C’mere, I’ll do up your tie for you.”</p><p>“I tried, but Bran’s directions didn’t make any sense.”</p><p>“That’s okay. I’m very good at ties. Mom taught me how to do\nRobb’s ties for him when we were your age.”</p><p>“Why?” Rickon ask as he watched Sansa’s fingers work the\nfabric. “Why didn’t she teach him?”</p><p>“Well, Robb couldn’t very well be trusted to do it himself,\ncould he?” In truth, Cat had tried over and over again, but Robb had always\nbeen a bit hopeless at it. Sansa, whose fingers were nimble even then from\nknitting, was a much better student for it.</p><p>The joke made Rickon laugh, but his smiled turned to a frown.\n“I can’t believe Robb’s getting married.”</p><p><i>Neither\ncan I</i>, Sansa thought. “There,” she said instead as she patted the\ntie against his chest. She brought him over to her mirror to take a look. “Now\ndon’t you look handsome?”</p><p>The compliment made him glow, but he tore his eyes away from his\nreflection to look at her instead. “Will you dance with me at the wedding\ntomorrow?”</p><p>“Of course I will. What a lucky girl I am; my dance card\nseems quite full. It is going to be one eventful wedding for sure.”</p><p>Rickon\ninsisted on assisting Sansa down the stairs, even though she tried to assure\nhim that she didn’t need any help walking in heels, even if they were stilettos.</p><p>“Those\nare death traps, Sansa. No one should walk in those.”</p><p>“Agreed,”\nArya said as she squeezed past them. “And it’s not like you need to be any\ntaller anyway.”</p><p>Arya\nhad kept her hair down, but the green dress she wore was quite pretty, even\nwhen offset by the combat boots Sansa had bought for her. </p><p>“Tall\ngirls can still wear heels,” Sansa insisted. </p><p>“They\njust need the right date.” Dickon had appeared at the bottom of the stairs. He\nlooked so good in his navy suit that Sansa let out a sigh. </p><p>“You\nlook beautiful,” he told her.</p><p>“I\nalready told her that,” Rickon told Dickon. </p><p>Dickon\nshrugged. “Better late than never, I guess. You ready?” he asked as he handed Sansa\nher coat. “I think your parents want us to meet them in the car.”</p><p>“Yes,”\nshe lied. “Let me just grab some tissues for my purse. You go on ahead.”</p><p>Arya\nfound Sansa, staring at the tissue box in the downstairs bathroom, and reached\nout to squeeze her hand. The look in her eyes told Sansa she knew exactly what\nwas making her older sister so nervous. </p><p>“It’s\njust a few words and then dinner,” Arya whispered to her. “You’ll get through\nit. Even with him there.”</p><p>Sansa\nnodded and squeezed Arya’s hand back. </p><p>Arya\nseemed unable to allow the tenderness of the moment to last any longer. “C’mon,\nlet’s go get this over with. We’re not only gaining a sister, we are hopefully\nlosing a brother.”</p><p>“Arya!”\nSansa hissed, despite letting out a short shout of laughter.</p><p>“Don’t\ntell Mom I said that!”</p><p>“You\nhave no manners whatsoever, Arya Stark.”</p><p>“Well,\nsomeone has to keep us entertained.”</p><p>Sansa\nsighed and held her chin high as she made her way to the car. <i>You can do this.</i><br/><br/><br/></p>",
        "body_abstract": "<p>\n\n&ldquo;I think your boyfriend must really like you,&rdquo; Bran told her the morning before the wedding as they waited for the shop owner to bring out the tuxes they were renting. <br><br>Sansa couldn&rsquo;t help the smile tugging at her lips. &ldquo;Yeah, what makes you say that?&rdquo;<br><br>&ldquo;He&rsquo;s not once complained about Rickon.&rdquo;<br></p>",
        "reblog": {
            "comment": "<p>\n\n“I think your boyfriend must really like you,” Bran told her the morning before the wedding as they waited for the shop owner to bring out the tuxes they were renting. <br><br>Sansa couldn’t help the smile tugging at her lips. “Yeah, what makes you say that?”<br><br>“He’s not once complained about Rickon.”<br></p>[[MORE]]<p>\n<br>\n“Ugh, don’t get me started.”<br><br>\n“One would think that the same dick joke\ntold again and again would lead to diminishing returns, but I’m not sure our\nlittle brother understands the basics of economics—or comedy.”<br><br>\n“Or manners,” Sansa lamented with a\nsigh. Rickon hadn’t been the only one to test her boyfriend’s resolve; besides\ndealing with Margaery upon his arrival, he’d had to meet both of her parents\nfor the first time just as they learned that the wedding venue wanted to charge\nanother $2,500 fee for the rush and Jeyne’s parents were refusing to pay\nit—leading to the question of whether there’d be a wedding at all. After some\nheated telephone exchanges, Sansa was pretty sure her father had talked the\nvenue down to just charging a $1,000 late fee, but she was fairly certain that\nmoney was coming out of his own checkbook. </p><p>Arya blamed Robb for being so stupid and inconsiderate, and\nSansa tried her very best not to chime in when she started ranting about their\nolder brother and all the money he was costing their parents. But at least Arya\nwas trying not to complain too much in front of company. She’d kept the\nsarcastic comments directed mainly to Sansa and Gendry.</p><p><br>\n“We’re eloping,” she’d told Gendry the\nother day—much to her boyfriend’s surprise.<br><br>\n“Really?” he’d managed to choke out.<br><br>\n“Yes,” she’d replied matter-of-factly.\n“We can have a party afterwards. Hotpie can make a cake because the best\npart is the cake. But I’m not putting myself through all this garbage. This\nwedding crap is giving me hives. I won’t go through this bullshit again. And\nI’ll be wearing pants.”<br><br>\n“Whatever you want,” he said.\n“I’ve got what I want.”<br><br>\n“Cake?”<br><br>\n“Nah, I’ve got you thinking about marrying\nme,” he preened.<br><br>\nThe whole exchange had actually been quite adorable—to\nthe point Sansa had wished she had a camera—until Arya sucker punched him.<br><br>\nPoor Dickon had missed the whole thing, though,\nbecause he’d very nobly agreed to help her father shovel the driveway—despite\nnot having much personal experience with deep snow. After an hour and a half\nwhen they’d come back inside, Dickon’s fingers had been frozen, his lips blue.<br><br>\nShe sighed again. “He has been a real\ntrooper.” She leaned over to place her hand on Bran’s shoulder. “Thanks\nfor inviting him to hang out with you and Gendry last night. I know he\nappreciated it.”<br><br>\nAs Robb’s stag night had been the week before\nand quite a 21-and-over event—Sansa saw Theon the other day and wondered if he\nwas still hungover—the night before had been a quiet one. Robb had spent the\nnight with Jeyne and her family, and Rickon luckily had been at a friend’s\nhouse; Sansa suspected that had been her mother’s doing, for which she was most\ngrateful. <br><br>\nSansa and Arya were roped into helping their mom\nwith last-minute seating chart arrangements and making favors, and their father\nhad to work.<br><br>\nSo Bran has taken the initiative to order pizza\nand play video games with Dickon—and invite Gendry, too, so there wouldn’t be\nas much pressure to bond with the younger brother.<br><br>\n“I like Dickon.”<br><br>\n“You do?”<br><br>\n“Yeah, he knows a lot about the Westerosi\ncriminal code and how to evade certain charges on technicalities. I think those\ntalents will prove useful in the future, should Rickon reach 18.”<br><br>\nSansa swallowed her laugh. “I’ll keep that in\nmind.” She tapped her foot. “What time is it?”<br><br>\n“10:52.”<br><br>\n“And what time were these supposed to be ready?”<br><br>\n“I think 10:45, but since Robb isn’t here to\nsign for them…” Robb was supposed to be here to meet them and help with\npicking up the tuxes, but there’d been a minor catastrophe with the catering.\nThere’d been minor catastrophes with everything, it seemed. This wedding, if it\nactually took place, would be a miracle.<br><br>\nSansa took a deep breath. “All right, you stay\nhere.”<br><br>\n“Where are you going?”<br><br>\n“To get our tuxes.”<br><br>\nSix minutes later, Sansa returned to the front\ncounter with a bag-laden shop worker hurrying behind her. <br><br>\nShe gave Bran a smile as the man typed\neverything into the cash register. <br><br>\n“There’s nine bags” Bran counted as the man went\nthrough them all. “We’re only supposed to pick up eight tuxes.”<br><br>\n“Something caught my eye, and I’m an excellent\nnegotiator,” Sansa told her little brother with a wink.<br><br>\n“Everything is in order, Miss Stark.”<br><br>\n“Thank you so much, Illyrio. You’ve been such a\nhelp.”</p><p>“Let me help you to your car.”</p><p>When everything was packed, Sansa shook the man’s hand in\ngratitude and thanked him once more. </p><p>“You will look radiant, Miss Stark. I just know it.”</p><p>Sansa grinned and waved goodbye. When she got behind the\ndriver’s seat, Bran looked at her in confusion. “I thought you told Mom you\nalready had a dress for the wedding.”</p><p>“I did,” Sansa replied. “But a very wise woman told me just\nthe other day that there’s always time for a new dress.”</p><p>“What if it doesn’t fit? Did you even try it on?”</p><p>“It’ll fit,” Sansa told him. “Don’t you fret, Bran. I have an\neye for these things.”</p><p>“How did you get him to give it to you for free?”</p><p>Sansa grinned. “There’s nothing a little bit of persuasion\nand good manners can’t accomplish.”</p><p>Bran applauded softly. “If only Robb had you around to deal\nwith the caterers this morning.”</p><p>“Yes, well, we all know that Robb can manage just fine on his\nown.” Upon his silence, she turned to her younger brother and winked. </p><p>Tuxes in tow, they went to the florist next and then dropped\noff a check at the limousine shop. As they were leaving, Sansa’s stomach\ngrumbled. “Did you have a chance to look at the menu of the place we’re going\ntonight—it’s a Dornish restaurant, right?”</p><p>Bran sighed. “Over-priced and needlessly pretentious. You can’t\npick your side dish; they get automatically assigned. And of course all the\ngood meat options are paired with the worst vegetables.”</p><p>“Does the vegetarian option at least look good? Sometimes—”</p><p>“It’s not only vegetarian but also vegan and gluten-free. A\nmeal for all the difficult people.”</p><p>Sansa frowned. “Why in the name of all the gods would we go\nthere then?”</p><p>“Mom said it was close to the venue.”</p><p>Sansa bit her tongue to avoid saying what she was thinking.\nHer stomach grumbled again. “We should eat now. At least we’ll be able to get\none good meal in today.”</p><p>“The Ice Shack isn’t too far from here,” said Bran, grinning.\n“We could get milkshakes—strawberry.”</p><p>For a moment, she was 15, sitting in the Ice Shack parking\nlot, sipping on a strawberry milkshake and munching on fries in the front seat\nof Jon Snow’s car.</p><p>But when she blinked, she was 21 again and in the driver’s\nseat. “All that dairy won’t be good right before we have to take so many\npictures. Why don’t we stop and get some sandwiches to bring home? I’m sure\neveryone is hungry there.”</p><p>Bran accepted her excuse, and she drove toward the nearest\nsandwich shop.</p><p>“Thank you, little one,” her father said when they returned with\nchores completed and lunch for everyone. “We would not survive this weekend\nwithout you.”</p><p>“That’s not true,” Sansa said, though she was not so sure.  </p><p>“Let’s not find out,” Ned muttered. “Go on and get ready. The\nboys and I can take it from here.”</p><p>“You sure?”</p><p>“Yes. All’s that left is getting things in the car and\ngetting everybody dressed up before we go set up at the church. Maybe see if\nyou can convince Arya—”</p><p>Sansa laughed. “I’ve never been able to convince Arya to do a\nsingle thing in my entire life. Do you really think this is the weekend when\nthat’s going to change?”</p><p>With his laughter ringing in the hall, she made her way\nupstairs and to the bathroom. There wasn’t much time, but she desperately\nwanted a bath. It was going to be a long weekend; she needed to take the\nopportunities for quiet solitude when she could. </p><p>The bath worked, somewhat, to calm her down, but with each\nhour the rehearsal loomed closer, she could feel her pulse quicken. </p><p>Once dry and hair blown out, Sansa sat in front of her vanity\nmirror and applied her makeup as carefully as she could. Sansa was usually\npretty good at doing makeup, but she wanted to make sure that it looked\nabsolutely perfect. Before applying her lipstick, a rose pink shade, she\nslipped into her outfit for the evening: a dark teal silk dress with long\nsleeves and buttons down the front. </p><p>She hummed under her breath as she methodically braided her\nlong hair into a fish tail and then studied herself in the mirror.</p><p>“You are Sansa Stark of Winterfell. You are Ned and Cat’s\ndaughter. You can do this,” she whispered under her breath. Do what exactly, she\nwasn’t sure. But saying it aloud made her feel like it was true. </p><p>As she was slipping into her heels, a knock sounded on her\ndoor. “It’s open!” she said as she tried to find where she’d put her purse.</p><p>“Wow, Sansa, you look really pretty.”</p><p>Sansa stopped searching for her purse and turned to smile at\nher little brother Rickon; his hair was wild, but he still looked so sweet in his\ngrey suit with the tie still undone.</p><p>“Thank you. C’mere, I’ll do up your tie for you.”</p><p>“I tried, but Bran’s directions didn’t make any sense.”</p><p>“That’s okay. I’m very good at ties. Mom taught me how to do\nRobb’s ties for him when we were your age.”</p><p>“Why?” Rickon ask as he watched Sansa’s fingers work the\nfabric. “Why didn’t she teach him?”</p><p>“Well, Robb couldn’t very well be trusted to do it himself,\ncould he?” In truth, Cat had tried over and over again, but Robb had always\nbeen a bit hopeless at it. Sansa, whose fingers were nimble even then from\nknitting, was a much better student for it.</p><p>The joke made Rickon laugh, but his smiled turned to a frown.\n“I can’t believe Robb’s getting married.”</p><p><i>Neither\ncan I</i>, Sansa thought. “There,” she said instead as she patted the\ntie against his chest. She brought him over to her mirror to take a look. “Now\ndon’t you look handsome?”</p><p>The compliment made him glow, but he tore his eyes away from his\nreflection to look at her instead. “Will you dance with me at the wedding\ntomorrow?”</p><p>“Of course I will. What a lucky girl I am; my dance card\nseems quite full. It is going to be one eventful wedding for sure.”</p><p>Rickon\ninsisted on assisting Sansa down the stairs, even though she tried to assure\nhim that she didn’t need any help walking in heels, even if they were stilettos.</p><p>“Those\nare death traps, Sansa. No one should walk in those.”</p><p>“Agreed,”\nArya said as she squeezed past them. “And it’s not like you need to be any\ntaller anyway.”</p><p>Arya\nhad kept her hair down, but the green dress she wore was quite pretty, even\nwhen offset by the combat boots Sansa had bought for her. </p><p>“Tall\ngirls can still wear heels,” Sansa insisted. </p><p>“They\njust need the right date.” Dickon had appeared at the bottom of the stairs. He\nlooked so good in his navy suit that Sansa let out a sigh. </p><p>“You\nlook beautiful,” he told her.</p><p>“I\nalready told her that,” Rickon told Dickon. </p><p>Dickon\nshrugged. “Better late than never, I guess. You ready?” he asked as he handed Sansa\nher coat. “I think your parents want us to meet them in the car.”</p><p>“Yes,”\nshe lied. “Let me just grab some tissues for my purse. You go on ahead.”</p><p>Arya\nfound Sansa, staring at the tissue box in the downstairs bathroom, and reached\nout to squeeze her hand. The look in her eyes told Sansa she knew exactly what\nwas making her older sister so nervous. </p><p>“It’s\njust a few words and then dinner,” Arya whispered to her. “You’ll get through\nit. Even with him there.”</p><p>Sansa\nnodded and squeezed Arya’s hand back. </p><p>Arya\nseemed unable to allow the tenderness of the moment to last any longer. “C’mon,\nlet’s go get this over with. We’re not only gaining a sister, we are hopefully\nlosing a brother.”</p><p>“Arya!”\nSansa hissed, despite letting out a short shout of laughter.</p><p>“Don’t\ntell Mom I said that!”</p><p>“You\nhave no manners whatsoever, Arya Stark.”</p><p>“Well,\nsomeone has to keep us entertained.”</p><p>Sansa\nsighed and held her chin high as she made her way to the car. <i>You can do this.</i><br><br><br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "mollyraesly",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 427,
                        "header_focus_width": 532,
                        "header_focus_height": 299,
                        "avatar_shape": "square",
                        "background_color": "#B60D3B",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "64,586,363,54",
                        "header_image": "https://static.tumblr.com/35abd6e63b463bfb1c3a69b6ee37196f/suvrwdd/Owup1p6eb/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/35abd6e63b463bfb1c3a69b6ee37196f/suvrwdd/i2ip1p6eb/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/35abd6e63b463bfb1c3a69b6ee37196f/suvrwdd/Owup1p6eb/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181177997617"
                },
                "content_raw": "<p>\n\n“I think your boyfriend must really like you,” Bran told her the morning before the wedding as they waited for the shop owner to bring out the tuxes they were renting. <br><br>Sansa couldn’t help the smile tugging at her lips. “Yeah, what makes you say that?”<br><br>“He’s not once complained about Rickon.”<br></p>[[MORE]]<p>\n<br>\n“Ugh, don’t get me started.”<br><br>\n“One would think that the same dick joke\ntold again and again would lead to diminishing returns, but I’m not sure our\nlittle brother understands the basics of economics—or comedy.”<br><br>\n“Or manners,” Sansa lamented with a\nsigh. Rickon hadn’t been the only one to test her boyfriend’s resolve; besides\ndealing with Margaery upon his arrival, he’d had to meet both of her parents\nfor the first time just as they learned that the wedding venue wanted to charge\nanother $2,500 fee for the rush and Jeyne’s parents were refusing to pay\nit—leading to the question of whether there’d be a wedding at all. After some\nheated telephone exchanges, Sansa was pretty sure her father had talked the\nvenue down to just charging a $1,000 late fee, but she was fairly certain that\nmoney was coming out of his own checkbook. </p><p>Arya blamed Robb for being so stupid and inconsiderate, and\nSansa tried her very best not to chime in when she started ranting about their\nolder brother and all the money he was costing their parents. But at least Arya\nwas trying not to complain too much in front of company. She’d kept the\nsarcastic comments directed mainly to Sansa and Gendry.</p><p><br>\n“We’re eloping,” she’d told Gendry the\nother day—much to her boyfriend’s surprise.<br><br>\n“Really?” he’d managed to choke out.<br><br>\n“Yes,” she’d replied matter-of-factly.\n“We can have a party afterwards. Hotpie can make a cake because the best\npart is the cake. But I’m not putting myself through all this garbage. This\nwedding crap is giving me hives. I won’t go through this bullshit again. And\nI’ll be wearing pants.”<br><br>\n“Whatever you want,” he said.\n“I’ve got what I want.”<br><br>\n“Cake?”<br><br>\n“Nah, I’ve got you thinking about marrying\nme,” he preened.<br><br>\nThe whole exchange had actually been quite adorable—to\nthe point Sansa had wished she had a camera—until Arya sucker punched him.<br><br>\nPoor Dickon had missed the whole thing, though,\nbecause he’d very nobly agreed to help her father shovel the driveway—despite\nnot having much personal experience with deep snow. After an hour and a half\nwhen they’d come back inside, Dickon’s fingers had been frozen, his lips blue.<br><br>\nShe sighed again. “He has been a real\ntrooper.” She leaned over to place her hand on Bran’s shoulder. “Thanks\nfor inviting him to hang out with you and Gendry last night. I know he\nappreciated it.”<br><br>\nAs Robb’s stag night had been the week before\nand quite a 21-and-over event—Sansa saw Theon the other day and wondered if he\nwas still hungover—the night before had been a quiet one. Robb had spent the\nnight with Jeyne and her family, and Rickon luckily had been at a friend’s\nhouse; Sansa suspected that had been her mother’s doing, for which she was most\ngrateful. <br><br>\nSansa and Arya were roped into helping their mom\nwith last-minute seating chart arrangements and making favors, and their father\nhad to work.<br><br>\nSo Bran has taken the initiative to order pizza\nand play video games with Dickon—and invite Gendry, too, so there wouldn’t be\nas much pressure to bond with the younger brother.<br><br>\n“I like Dickon.”<br><br>\n“You do?”<br><br>\n“Yeah, he knows a lot about the Westerosi\ncriminal code and how to evade certain charges on technicalities. I think those\ntalents will prove useful in the future, should Rickon reach 18.”<br><br>\nSansa swallowed her laugh. “I’ll keep that in\nmind.” She tapped her foot. “What time is it?”<br><br>\n“10:52.”<br><br>\n“And what time were these supposed to be ready?”<br><br>\n“I think 10:45, but since Robb isn’t here to\nsign for them…” Robb was supposed to be here to meet them and help with\npicking up the tuxes, but there’d been a minor catastrophe with the catering.\nThere’d been minor catastrophes with everything, it seemed. This wedding, if it\nactually took place, would be a miracle.<br><br>\nSansa took a deep breath. “All right, you stay\nhere.”<br><br>\n“Where are you going?”<br><br>\n“To get our tuxes.”<br><br>\nSix minutes later, Sansa returned to the front\ncounter with a bag-laden shop worker hurrying behind her. <br><br>\nShe gave Bran a smile as the man typed\neverything into the cash register. <br><br>\n“There’s nine bags” Bran counted as the man went\nthrough them all. “We’re only supposed to pick up eight tuxes.”<br><br>\n“Something caught my eye, and I’m an excellent\nnegotiator,” Sansa told her little brother with a wink.<br><br>\n“Everything is in order, Miss Stark.”<br><br>\n“Thank you so much, Illyrio. You’ve been such a\nhelp.”</p><p>“Let me help you to your car.”</p><p>When everything was packed, Sansa shook the man’s hand in\ngratitude and thanked him once more. </p><p>“You will look radiant, Miss Stark. I just know it.”</p><p>Sansa grinned and waved goodbye. When she got behind the\ndriver’s seat, Bran looked at her in confusion. “I thought you told Mom you\nalready had a dress for the wedding.”</p><p>“I did,” Sansa replied. “But a very wise woman told me just\nthe other day that there’s always time for a new dress.”</p><p>“What if it doesn’t fit? Did you even try it on?”</p><p>“It’ll fit,” Sansa told him. “Don’t you fret, Bran. I have an\neye for these things.”</p><p>“How did you get him to give it to you for free?”</p><p>Sansa grinned. “There’s nothing a little bit of persuasion\nand good manners can’t accomplish.”</p><p>Bran applauded softly. “If only Robb had you around to deal\nwith the caterers this morning.”</p><p>“Yes, well, we all know that Robb can manage just fine on his\nown.” Upon his silence, she turned to her younger brother and winked. </p><p>Tuxes in tow, they went to the florist next and then dropped\noff a check at the limousine shop. As they were leaving, Sansa’s stomach\ngrumbled. “Did you have a chance to look at the menu of the place we’re going\ntonight—it’s a Dornish restaurant, right?”</p><p>Bran sighed. “Over-priced and needlessly pretentious. You can’t\npick your side dish; they get automatically assigned. And of course all the\ngood meat options are paired with the worst vegetables.”</p><p>“Does the vegetarian option at least look good? Sometimes—”</p><p>“It’s not only vegetarian but also vegan and gluten-free. A\nmeal for all the difficult people.”</p><p>Sansa frowned. “Why in the name of all the gods would we go\nthere then?”</p><p>“Mom said it was close to the venue.”</p><p>Sansa bit her tongue to avoid saying what she was thinking.\nHer stomach grumbled again. “We should eat now. At least we’ll be able to get\none good meal in today.”</p><p>“The Ice Shack isn’t too far from here,” said Bran, grinning.\n“We could get milkshakes—strawberry.”</p><p>For a moment, she was 15, sitting in the Ice Shack parking\nlot, sipping on a strawberry milkshake and munching on fries in the front seat\nof Jon Snow’s car.</p><p>But when she blinked, she was 21 again and in the driver’s\nseat. “All that dairy won’t be good right before we have to take so many\npictures. Why don’t we stop and get some sandwiches to bring home? I’m sure\neveryone is hungry there.”</p><p>Bran accepted her excuse, and she drove toward the nearest\nsandwich shop.</p><p>“Thank you, little one,” her father said when they returned with\nchores completed and lunch for everyone. “We would not survive this weekend\nwithout you.”</p><p>“That’s not true,” Sansa said, though she was not so sure.  </p><p>“Let’s not find out,” Ned muttered. “Go on and get ready. The\nboys and I can take it from here.”</p><p>“You sure?”</p><p>“Yes. All’s that left is getting things in the car and\ngetting everybody dressed up before we go set up at the church. Maybe see if\nyou can convince Arya—”</p><p>Sansa laughed. “I’ve never been able to convince Arya to do a\nsingle thing in my entire life. Do you really think this is the weekend when\nthat’s going to change?”</p><p>With his laughter ringing in the hall, she made her way\nupstairs and to the bathroom. There wasn’t much time, but she desperately\nwanted a bath. It was going to be a long weekend; she needed to take the\nopportunities for quiet solitude when she could. </p><p>The bath worked, somewhat, to calm her down, but with each\nhour the rehearsal loomed closer, she could feel her pulse quicken. </p><p>Once dry and hair blown out, Sansa sat in front of her vanity\nmirror and applied her makeup as carefully as she could. Sansa was usually\npretty good at doing makeup, but she wanted to make sure that it looked\nabsolutely perfect. Before applying her lipstick, a rose pink shade, she\nslipped into her outfit for the evening: a dark teal silk dress with long\nsleeves and buttons down the front. </p><p>She hummed under her breath as she methodically braided her\nlong hair into a fish tail and then studied herself in the mirror.</p><p>“You are Sansa Stark of Winterfell. You are Ned and Cat’s\ndaughter. You can do this,” she whispered under her breath. Do what exactly, she\nwasn’t sure. But saying it aloud made her feel like it was true. </p><p>As she was slipping into her heels, a knock sounded on her\ndoor. “It’s open!” she said as she tried to find where she’d put her purse.</p><p>“Wow, Sansa, you look really pretty.”</p><p>Sansa stopped searching for her purse and turned to smile at\nher little brother Rickon; his hair was wild, but he still looked so sweet in his\ngrey suit with the tie still undone.</p><p>“Thank you. C’mere, I’ll do up your tie for you.”</p><p>“I tried, but Bran’s directions didn’t make any sense.”</p><p>“That’s okay. I’m very good at ties. Mom taught me how to do\nRobb’s ties for him when we were your age.”</p><p>“Why?” Rickon ask as he watched Sansa’s fingers work the\nfabric. “Why didn’t she teach him?”</p><p>“Well, Robb couldn’t very well be trusted to do it himself,\ncould he?” In truth, Cat had tried over and over again, but Robb had always\nbeen a bit hopeless at it. Sansa, whose fingers were nimble even then from\nknitting, was a much better student for it.</p><p>The joke made Rickon laugh, but his smiled turned to a frown.\n“I can’t believe Robb’s getting married.”</p><p><i>Neither\ncan I</i>, Sansa thought. “There,” she said instead as she patted the\ntie against his chest. She brought him over to her mirror to take a look. “Now\ndon’t you look handsome?”</p><p>The compliment made him glow, but he tore his eyes away from his\nreflection to look at her instead. “Will you dance with me at the wedding\ntomorrow?”</p><p>“Of course I will. What a lucky girl I am; my dance card\nseems quite full. It is going to be one eventful wedding for sure.”</p><p>Rickon\ninsisted on assisting Sansa down the stairs, even though she tried to assure\nhim that she didn’t need any help walking in heels, even if they were stilettos.</p><p>“Those\nare death traps, Sansa. No one should walk in those.”</p><p>“Agreed,”\nArya said as she squeezed past them. “And it’s not like you need to be any\ntaller anyway.”</p><p>Arya\nhad kept her hair down, but the green dress she wore was quite pretty, even\nwhen offset by the combat boots Sansa had bought for her. </p><p>“Tall\ngirls can still wear heels,” Sansa insisted. </p><p>“They\njust need the right date.” Dickon had appeared at the bottom of the stairs. He\nlooked so good in his navy suit that Sansa let out a sigh. </p><p>“You\nlook beautiful,” he told her.</p><p>“I\nalready told her that,” Rickon told Dickon. </p><p>Dickon\nshrugged. “Better late than never, I guess. You ready?” he asked as he handed Sansa\nher coat. “I think your parents want us to meet them in the car.”</p><p>“Yes,”\nshe lied. “Let me just grab some tissues for my purse. You go on ahead.”</p><p>Arya\nfound Sansa, staring at the tissue box in the downstairs bathroom, and reached\nout to squeeze her hand. The look in her eyes told Sansa she knew exactly what\nwas making her older sister so nervous. </p><p>“It’s\njust a few words and then dinner,” Arya whispered to her. “You’ll get through\nit. Even with him there.”</p><p>Sansa\nnodded and squeezed Arya’s hand back. </p><p>Arya\nseemed unable to allow the tenderness of the moment to last any longer. “C’mon,\nlet’s go get this over with. We’re not only gaining a sister, we are hopefully\nlosing a brother.”</p><p>“Arya!”\nSansa hissed, despite letting out a short shout of laughter.</p><p>“Don’t\ntell Mom I said that!”</p><p>“You\nhave no manners whatsoever, Arya Stark.”</p><p>“Well,\nsomeone has to keep us entertained.”</p><p>Sansa\nsighed and held her chin high as she made her way to the car. <i>You can do this.</i><br><br><br></p>",
                "content": "<p>\n\n&ldquo;I think your boyfriend must really like you,&rdquo; Bran told her the morning before the wedding as they waited for the shop owner to bring out the tuxes they were renting. <br /><br />Sansa couldn&rsquo;t help the smile tugging at her lips. &ldquo;Yeah, what makes you say that?&rdquo;<br /><br />&ldquo;He&rsquo;s not once complained about Rickon.&rdquo;<br /></p><p>\n<br />\n&ldquo;Ugh, don&rsquo;t get me started.&rdquo;<br /><br />\n&ldquo;One would think that the same dick joke\ntold again and again would lead to diminishing returns, but I&rsquo;m not sure our\nlittle brother understands the basics of economics&mdash;or comedy.&rdquo;<br /><br />\n&ldquo;Or manners,&rdquo; Sansa lamented with a\nsigh. Rickon hadn&rsquo;t been the only one to test her boyfriend&rsquo;s resolve; besides\ndealing with Margaery upon his arrival, he&rsquo;d had to meet both of her parents\nfor the first time just as they learned that the wedding venue wanted to charge\nanother $2,500 fee for the rush and Jeyne&rsquo;s parents were refusing to pay\nit&mdash;leading to the question of whether there&rsquo;d be a wedding at all. After some\nheated telephone exchanges, Sansa was pretty sure her father had talked the\nvenue down to just charging a $1,000 late fee, but she was fairly certain that\nmoney was coming out of his own checkbook. </p><p>Arya blamed Robb for being so stupid and inconsiderate, and\nSansa tried her very best not to chime in when she started ranting about their\nolder brother and all the money he was costing their parents. But at least Arya\nwas trying not to complain too much in front of company. She&rsquo;d kept the\nsarcastic comments directed mainly to Sansa and Gendry.</p><p><br />\n&ldquo;We&rsquo;re eloping,&rdquo; she&rsquo;d told Gendry the\nother day&mdash;much to her boyfriend&rsquo;s surprise.<br /><br />\n&ldquo;Really?&rdquo; he&rsquo;d managed to choke out.<br /><br />\n&ldquo;Yes,&rdquo; she&rsquo;d replied matter-of-factly.\n&ldquo;We can have a party afterwards. Hotpie can make a cake because the best\npart is the cake. But I&rsquo;m not putting myself through all this garbage. This\nwedding crap is giving me hives. I won&rsquo;t go through this bullshit again. And\nI&rsquo;ll be wearing pants.&rdquo;<br /><br />\n&ldquo;Whatever you want,&rdquo; he said.\n&ldquo;I&rsquo;ve got what I want.&rdquo;<br /><br />\n&ldquo;Cake?&rdquo;<br /><br />\n&ldquo;Nah, I&rsquo;ve got you thinking about marrying\nme,&rdquo; he preened.<br /><br />\nThe whole exchange had actually been quite adorable&mdash;to\nthe point Sansa had wished she had a camera&mdash;until Arya sucker punched him.<br /><br />\nPoor Dickon had missed the whole thing, though,\nbecause he&rsquo;d very nobly agreed to help her father shovel the driveway&mdash;despite\nnot having much personal experience with deep snow. After an hour and a half\nwhen they&rsquo;d come back inside, Dickon&rsquo;s fingers had been frozen, his lips blue.<br /><br />\nShe sighed again. &ldquo;He has been a real\ntrooper.&rdquo; She leaned over to place her hand on Bran&rsquo;s shoulder. &ldquo;Thanks\nfor inviting him to hang out with you and Gendry last night. I know he\nappreciated it.&rdquo;<br /><br />\nAs Robb&rsquo;s stag night had been the week before\nand quite a 21-and-over event&mdash;Sansa saw Theon the other day and wondered if he\nwas still hungover&mdash;the night before had been a quiet one. Robb had spent the\nnight with Jeyne and her family, and Rickon luckily had been at a friend&rsquo;s\nhouse; Sansa suspected that had been her mother&rsquo;s doing, for which she was most\ngrateful.&nbsp;<br /><br />\nSansa and Arya were roped into helping their mom\nwith last-minute seating chart arrangements and making favors, and their father\nhad to work.<br /><br />\nSo Bran has taken the initiative to order pizza\nand play video games with Dickon&mdash;and invite Gendry, too, so there wouldn&rsquo;t be\nas much pressure to bond with the younger brother.<br /><br />\n&ldquo;I like Dickon.&rdquo;<br /><br />\n&ldquo;You do?&rdquo;<br /><br />\n&ldquo;Yeah, he knows a lot about the Westerosi\ncriminal code and how to evade certain charges on technicalities. I think those\ntalents will prove useful in the future, should Rickon reach 18.&rdquo;<br /><br />\nSansa swallowed her laugh. &ldquo;I&rsquo;ll keep that in\nmind.&rdquo; She tapped her foot. &ldquo;What time is it?&rdquo;<br /><br />\n&ldquo;10:52.&rdquo;<br /><br />\n&ldquo;And what time were these supposed to be ready?&rdquo;<br /><br />\n&ldquo;I think 10:45, but since Robb isn&rsquo;t here to\nsign for them&hellip;&rdquo; Robb was supposed to be here to meet them and help with\npicking up the tuxes, but there&rsquo;d been a minor catastrophe with the catering.\nThere&rsquo;d been minor catastrophes with everything, it seemed. This wedding, if it\nactually took place, would be a miracle.<br /><br />\nSansa took a deep breath. &ldquo;All right, you stay\nhere.&rdquo;<br /><br />\n&ldquo;Where are you going?&rdquo;<br /><br />\n&ldquo;To get our tuxes.&rdquo;<br /><br />\nSix minutes later, Sansa returned to the front\ncounter with a bag-laden shop worker hurrying behind her.&nbsp;<br /><br />\nShe gave Bran a smile as the man typed\neverything into the cash register.&nbsp;<br /><br />\n&ldquo;There&rsquo;s nine bags&rdquo; Bran counted as the man went\nthrough them all. &ldquo;We&rsquo;re only supposed to pick up eight tuxes.&rdquo;<br /><br />\n&ldquo;Something caught my eye, and I&rsquo;m an excellent\nnegotiator,&rdquo; Sansa told her little brother with a wink.<br /><br />\n&ldquo;Everything is in order, Miss Stark.&rdquo;<br /><br />\n&ldquo;Thank you so much, Illyrio. You&rsquo;ve been such a\nhelp.&rdquo;</p><p>&ldquo;Let me help you to your car.&rdquo;</p><p>When everything was packed, Sansa shook the man&rsquo;s hand in\ngratitude and thanked him once more. </p><p>&ldquo;You will look radiant, Miss Stark. I just know it.&rdquo;</p><p>Sansa grinned and waved goodbye. When she got behind the\ndriver&rsquo;s seat, Bran looked at her in confusion. &ldquo;I thought you told Mom you\nalready had a dress for the wedding.&rdquo;</p><p>&ldquo;I did,&rdquo; Sansa replied. &ldquo;But a very wise woman told me just\nthe other day that there&rsquo;s always time for a new dress.&rdquo;</p><p>&ldquo;What if it doesn&rsquo;t fit? Did you even try it on?&rdquo;</p><p>&ldquo;It&rsquo;ll fit,&rdquo; Sansa told him. &ldquo;Don&rsquo;t you fret, Bran. I have an\neye for these things.&rdquo;</p><p>&ldquo;How did you get him to give it to you for free?&rdquo;</p><p>Sansa grinned. &ldquo;There&rsquo;s nothing a little bit of persuasion\nand good manners can&rsquo;t accomplish.&rdquo;</p><p>Bran applauded softly. &ldquo;If only Robb had you around to deal\nwith the caterers this morning.&rdquo;</p><p>&ldquo;Yes, well, we all know that Robb can manage just fine on his\nown.&rdquo; Upon his silence, she turned to her younger brother and winked. </p><p>Tuxes in tow, they went to the florist next and then dropped\noff a check at the limousine shop. As they were leaving, Sansa&rsquo;s stomach\ngrumbled. &ldquo;Did you have a chance to look at the menu of the place we&rsquo;re going\ntonight&mdash;it&rsquo;s a Dornish restaurant, right?&rdquo;</p><p>Bran sighed. &ldquo;Over-priced and needlessly pretentious. You can&rsquo;t\npick your side dish; they get automatically assigned. And of course all the\ngood meat options are paired with the worst vegetables.&rdquo;</p><p>&ldquo;Does the vegetarian option at least look good? Sometimes&mdash;&rdquo;</p><p>&ldquo;It&rsquo;s not only vegetarian but also vegan and gluten-free. A\nmeal for all the difficult people.&rdquo;</p><p>Sansa frowned. &ldquo;Why in the name of all the gods would we go\nthere then?&rdquo;</p><p>&ldquo;Mom said it was close to the venue.&rdquo;</p><p>Sansa bit her tongue to avoid saying what she was thinking.\nHer stomach grumbled again. &ldquo;We should eat now. At least we&rsquo;ll be able to get\none good meal in today.&rdquo;</p><p>&ldquo;The Ice Shack isn&rsquo;t too far from here,&rdquo; said Bran, grinning.\n&ldquo;We could get milkshakes&mdash;strawberry.&rdquo;</p><p>For a moment, she was 15, sitting in the Ice Shack parking\nlot, sipping on a strawberry milkshake and munching on fries in the front seat\nof Jon Snow&rsquo;s car.</p><p>But when she blinked, she was 21 again and in the driver&rsquo;s\nseat. &ldquo;All that dairy won&rsquo;t be good right before we have to take so many\npictures. Why don&rsquo;t we stop and get some sandwiches to bring home? I&rsquo;m sure\neveryone is hungry there.&rdquo;</p><p>Bran accepted her excuse, and she drove toward the nearest\nsandwich shop.</p><p>&ldquo;Thank you, little one,&rdquo; her father said when they returned with\nchores completed and lunch for everyone. &ldquo;We would not survive this weekend\nwithout you.&rdquo;</p><p>&ldquo;That&rsquo;s not true,&rdquo; Sansa said, though she was not so sure. &nbsp;</p><p>&ldquo;Let&rsquo;s not find out,&rdquo; Ned muttered. &ldquo;Go on and get ready. The\nboys and I can take it from here.&rdquo;</p><p>&ldquo;You sure?&rdquo;</p><p>&ldquo;Yes. All&rsquo;s that left is getting things in the car and\ngetting everybody dressed up before we go set up at the church. Maybe see if\nyou can convince Arya&mdash;&rdquo;</p><p>Sansa laughed. &ldquo;I&rsquo;ve never been able to convince Arya to do a\nsingle thing in my entire life. Do you really think this is the weekend when\nthat&rsquo;s going to change?&rdquo;</p><p>With his laughter ringing in the hall, she made her way\nupstairs and to the bathroom. There wasn&rsquo;t much time, but she desperately\nwanted a bath. It was going to be a long weekend; she needed to take the\nopportunities for quiet solitude when she could. </p><p>The bath worked, somewhat, to calm her down, but with each\nhour the rehearsal loomed closer, she could feel her pulse quicken. </p><p>Once dry and hair blown out, Sansa sat in front of her vanity\nmirror and applied her makeup as carefully as she could. Sansa was usually\npretty good at doing makeup, but she wanted to make sure that it looked\nabsolutely perfect. Before applying her lipstick, a rose pink shade, she\nslipped into her outfit for the evening: a dark teal silk dress with long\nsleeves and buttons down the front. </p><p>She hummed under her breath as she methodically braided her\nlong hair into a fish tail and then studied herself in the mirror.</p><p>&ldquo;You are Sansa Stark of Winterfell. You are Ned and Cat&rsquo;s\ndaughter. You can do this,&rdquo; she whispered under her breath. Do what exactly, she\nwasn&rsquo;t sure. But saying it aloud made her feel like it was true. </p><p>As she was slipping into her heels, a knock sounded on her\ndoor. &ldquo;It&rsquo;s open!&rdquo; she said as she tried to find where she&rsquo;d put her purse.</p><p>&ldquo;Wow, Sansa, you look really pretty.&rdquo;</p><p>Sansa stopped searching for her purse and turned to smile at\nher little brother Rickon; his hair was wild, but he still looked so sweet in his\ngrey suit with the tie still undone.</p><p>&ldquo;Thank you. C&rsquo;mere, I&rsquo;ll do up your tie for you.&rdquo;</p><p>&ldquo;I tried, but Bran&rsquo;s directions didn&rsquo;t make any sense.&rdquo;</p><p>&ldquo;That&rsquo;s okay. I&rsquo;m very good at ties. Mom taught me how to do\nRobb&rsquo;s ties for him when we were your age.&rdquo;</p><p>&ldquo;Why?&rdquo; Rickon ask as he watched Sansa&rsquo;s fingers work the\nfabric. &ldquo;Why didn&rsquo;t she teach him?&rdquo;</p><p>&ldquo;Well, Robb couldn&rsquo;t very well be trusted to do it himself,\ncould he?&rdquo; In truth, Cat had tried over and over again, but Robb had always\nbeen a bit hopeless at it. Sansa, whose fingers were nimble even then from\nknitting, was a much better student for it.</p><p>The joke made Rickon laugh, but his smiled turned to a frown.\n&ldquo;I can&rsquo;t believe Robb&rsquo;s getting married.&rdquo;</p><p><i>Neither\ncan I</i>, Sansa thought. &ldquo;There,&rdquo; she said instead as she patted the\ntie against his chest. She brought him over to her mirror to take a look. &ldquo;Now\ndon&rsquo;t you look handsome?&rdquo;</p><p>The compliment made him glow, but he tore his eyes away from his\nreflection to look at her instead. &ldquo;Will you dance with me at the wedding\ntomorrow?&rdquo;</p><p>&ldquo;Of course I will. What a lucky girl I am; my dance card\nseems quite full. It is going to be one eventful wedding for sure.&rdquo;</p><p>Rickon\ninsisted on assisting Sansa down the stairs, even though she tried to assure\nhim that she didn&rsquo;t need any help walking in heels, even if they were stilettos.</p><p>&ldquo;Those\nare death traps, Sansa. No one should walk in those.&rdquo;</p><p>&ldquo;Agreed,&rdquo;\nArya said as she squeezed past them. &ldquo;And it&rsquo;s not like you need to be any\ntaller anyway.&rdquo;</p><p>Arya\nhad kept her hair down, but the green dress she wore was quite pretty, even\nwhen offset by the combat boots Sansa had bought for her. </p><p>&ldquo;Tall\ngirls can still wear heels,&rdquo; Sansa insisted. </p><p>&ldquo;They\njust need the right date.&rdquo; Dickon had appeared at the bottom of the stairs. He\nlooked so good in his navy suit that Sansa let out a sigh. </p><p>&ldquo;You\nlook beautiful,&rdquo; he told her.</p><p>&ldquo;I\nalready told her that,&rdquo; Rickon told Dickon. </p><p>Dickon\nshrugged. &ldquo;Better late than never, I guess. You ready?&rdquo; he asked as he handed Sansa\nher coat. &ldquo;I think your parents want us to meet them in the car.&rdquo;</p><p>&ldquo;Yes,&rdquo;\nshe lied. &ldquo;Let me just grab some tissues for my purse. You go on ahead.&rdquo;</p><p>Arya\nfound Sansa, staring at the tissue box in the downstairs bathroom, and reached\nout to squeeze her hand. The look in her eyes told Sansa she knew exactly what\nwas making her older sister so nervous. </p><p>&ldquo;It&rsquo;s\njust a few words and then dinner,&rdquo; Arya whispered to her. &ldquo;You&rsquo;ll get through\nit. Even with him there.&rdquo;</p><p>Sansa\nnodded and squeezed Arya&rsquo;s hand back. </p><p>Arya\nseemed unable to allow the tenderness of the moment to last any longer. &ldquo;C&rsquo;mon,\nlet&rsquo;s go get this over with. We&rsquo;re not only gaining a sister, we are hopefully\nlosing a brother.&rdquo;</p><p>&ldquo;Arya!&rdquo;\nSansa hissed, despite letting out a short shout of laughter.</p><p>&ldquo;Don&rsquo;t\ntell Mom I said that!&rdquo;</p><p>&ldquo;You\nhave no manners whatsoever, Arya Stark.&rdquo;</p><p>&ldquo;Well,\nsomeone has to keep us entertained.&rdquo;</p><p>Sansa\nsighed and held her chin high as she made her way to the car. <i>You can do this.</i><br /><br /><br /></p>",
                "content_abstract": "<p>\n\n&ldquo;I think your boyfriend must really like you,&rdquo; Bran told her the morning before the wedding as they waited for the shop owner to bring out the tuxes they were renting. <br /><br />Sansa couldn&rsquo;t help the smile tugging at her lips. &ldquo;Yeah, what makes you say that?&rdquo;<br /><br />&ldquo;He&rsquo;s not once complained about Rickon.&rdquo;<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "devilsbastion",
        "blog": {
            "name": "devilsbastion",
            "title": "I came from the sea",
            "description": "'Game of Thrones & a Parting Glass' lives here, don't ask why, but you can search by character or author if you wish. and sometimes i snap photos, write words, and paint pictures. and sometimes i realize it's all futile. <!-- Start of StatCounter Code for Tumblr -->\n \n \n<!-- End of StatCounter Code for Tumblr -->",
            "url": "https://devilsbastion.tumblr.com/",
            "uuid": "t:589BeNT5iTFHIYMnv-MNPg",
            "updated": 1561753231
        },
        "id": 181177827260,
        "post_url": "https://devilsbastion.tumblr.com/post/181177827260",
        "slug": "",
        "date": "2018-12-16 21:00:40 GMT",
        "timestamp": 1544994040,
        "state": "published",
        "format": "html",
        "reblog_key": "t5MnYYah",
        "tags": [
            "jon snow",
            "GoT&aPartingGlass",
            "oscar wilde",
            "Robb Stark",
            "game of thrones edit"
        ],
        "short_url": "https://tmblr.co/ZnJr5l2el2Z_y",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 11,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "image_permalink": "https://devilsbastion.tumblr.com/image/181177827260",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/4bd03f1f73889dad3d5b3a2273008073/tumblr_pju46ouZrB1upmviso1_1280.jpg",
                    "width": 1280,
                    "height": 720
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/4bd03f1f73889dad3d5b3a2273008073/tumblr_pju46ouZrB1upmviso1_1280.jpg",
                        "width": 1280,
                        "height": 720
                    },
                    {
                        "url": "https://66.media.tumblr.com/4bd03f1f73889dad3d5b3a2273008073/tumblr_pju46ouZrB1upmviso1_640.jpg",
                        "width": 640,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/4bd03f1f73889dad3d5b3a2273008073/tumblr_pju46ouZrB1upmviso1_540.jpg",
                        "width": 540,
                        "height": 304
                    },
                    {
                        "url": "https://66.media.tumblr.com/4bd03f1f73889dad3d5b3a2273008073/tumblr_pju46ouZrB1upmviso1_500.jpg",
                        "width": 500,
                        "height": 281
                    },
                    {
                        "url": "https://66.media.tumblr.com/4bd03f1f73889dad3d5b3a2273008073/tumblr_pju46ouZrB1upmviso1_400.jpg",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/4bd03f1f73889dad3d5b3a2273008073/tumblr_pju46ouZrB1upmviso1_250.jpg",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/4bd03f1f73889dad3d5b3a2273008073/tumblr_pju46ouZrB1upmviso1_100.jpg",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/4bd03f1f73889dad3d5b3a2273008073/tumblr_pju46ouZrB1upmviso1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "watcherswall",
        "blog": {
            "name": "watcherswall",
            "title": "watchers on the wall",
            "description": "Welcome to the official Tumblr of Watchers on the Wall, a Game of Thrones community for breaking news, casting, and commentary. We post the latest news, updates, pictures, videos, gifs, and graphics every day. We are currently accepting applications...",
            "url": "https://watcherswall.tumblr.com/",
            "uuid": "t:jOhFjEjFIwgtG6IRCc4oMw",
            "updated": 1561758387
        },
        "id": 181177572128,
        "post_url": "https://watcherswall.tumblr.com/post/181177572128/looking-for-a-last-minute-gift-for-the-game-of",
        "slug": "looking-for-a-last-minute-gift-for-the-game-of",
        "date": "2018-12-16 20:51:07 GMT",
        "timestamp": 1544993467,
        "state": "published",
        "format": "html",
        "reblog_key": "4tuMj4PG",
        "tags": [
            "CultureFly",
            "Game of Thrones",
            "ASOIAF",
            "Tyrion Lannister",
            "Jon Snow",
            "Longclaw",
            "House Stark",
            "Night King",
            "Noble Feast of Westeros"
        ],
        "short_url": "https://tmblr.co/ZXgPLk2el1biW",
        "summary": "Looking for a last-minute gift for the Game of Thrones fan in your life? (...or for yourself. That's cool too.) Box III in...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 6,
        "caption": "<p>\nLooking for a last-minute gift for the Game of Thrones fan in your life? (&hellip;or for yourself. That&rsquo;s cool too.) Box III in <b>CultureFly’s Game of Thrones Premium Collection </b>of limited edition collectibles is on its way! <br/></p><h2><a href=\"https://culturefly.com/pages/game-of-thrones?rfsn=862052.5f55f5\"><b>Order now</b></a><br/></h2>",
        "reblog": {
            "comment": "<p><p>\nLooking for a last-minute gift for the Game of Thrones fan in your life? (…or for yourself. That’s cool too.) Box III in <b>CultureFly’s Game of Thrones Premium Collection </b>of limited edition collectibles is on its way! <br></p><h2><a href=\"https://culturefly.com/pages/game-of-thrones?rfsn=862052.5f55f5\"><b>Order now</b></a><br></h2></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "watcherswall",
                    "active": true,
                    "theme": {
                        "header_full_width": 910,
                        "header_full_height": 400,
                        "header_focus_width": 711,
                        "header_focus_height": 400,
                        "avatar_shape": "circle",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,810,400,99",
                        "header_image": "https://static.tumblr.com/84fa1d24fa900c7e1d41d9d4b83ab97a/c1t2eaw/YCdntj25k/tumblr_static_ddoxwjgw4k08w0cccwcwc888c.png",
                        "header_image_focused": "https://static.tumblr.com/84fa1d24fa900c7e1d41d9d4b83ab97a/c1t2eaw/mw6ntj25m/tumblr_static_tumblr_static_ddoxwjgw4k08w0cccwcwc888c_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/84fa1d24fa900c7e1d41d9d4b83ab97a/c1t2eaw/YCdntj25k/tumblr_static_ddoxwjgw4k08w0cccwcwc888c_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#bad8eb",
                        "show_avatar": true,
                        "show_description": false,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Avalon",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181177572128"
                },
                "content_raw": "<p><p>\nLooking for a last-minute gift for the Game of Thrones fan in your life? (…or for yourself. That’s cool too.) Box III in <b>CultureFly’s Game of Thrones Premium Collection </b>of limited edition collectibles is on its way! <br></p><h2><a href=\"https://culturefly.com/pages/game-of-thrones?rfsn=862052.5f55f5\"><b>Order now</b></a><br></h2></p>",
                "content": "<p><p>\nLooking for a last-minute gift for the Game of Thrones fan in your life? (&hellip;or for yourself. That&rsquo;s cool too.) Box III in <b>CultureFly&rsquo;s Game of Thrones Premium Collection </b>of limited edition collectibles is on its way! <br /></p><h2><a href=\"https://culturefly.com/pages/game-of-thrones?rfsn=862052.5f55f5\"><b>Order now</b></a><br /></h2></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://watcherswall.tumblr.com/image/181177572128",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/3cadaca8c6f370678b46929660e49c6a/tumblr_pjukl7LCJR1uxwan3o1_1280.jpg",
                    "width": 723,
                    "height": 717
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/3cadaca8c6f370678b46929660e49c6a/tumblr_pjukl7LCJR1uxwan3o1_1280.jpg",
                        "width": 723,
                        "height": 717
                    },
                    {
                        "url": "https://66.media.tumblr.com/3cadaca8c6f370678b46929660e49c6a/tumblr_pjukl7LCJR1uxwan3o1_640.jpg",
                        "width": 640,
                        "height": 635
                    },
                    {
                        "url": "https://66.media.tumblr.com/3cadaca8c6f370678b46929660e49c6a/tumblr_pjukl7LCJR1uxwan3o1_540.jpg",
                        "width": 540,
                        "height": 536
                    },
                    {
                        "url": "https://66.media.tumblr.com/3cadaca8c6f370678b46929660e49c6a/tumblr_pjukl7LCJR1uxwan3o1_500.jpg",
                        "width": 500,
                        "height": 496
                    },
                    {
                        "url": "https://66.media.tumblr.com/3cadaca8c6f370678b46929660e49c6a/tumblr_pjukl7LCJR1uxwan3o1_400.jpg",
                        "width": 400,
                        "height": 397
                    },
                    {
                        "url": "https://66.media.tumblr.com/3cadaca8c6f370678b46929660e49c6a/tumblr_pjukl7LCJR1uxwan3o1_250.jpg",
                        "width": 250,
                        "height": 248
                    },
                    {
                        "url": "https://66.media.tumblr.com/3cadaca8c6f370678b46929660e49c6a/tumblr_pjukl7LCJR1uxwan3o1_100.jpg",
                        "width": 100,
                        "height": 99
                    },
                    {
                        "url": "https://66.media.tumblr.com/3cadaca8c6f370678b46929660e49c6a/tumblr_pjukl7LCJR1uxwan3o1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "targaryens-restoration",
        "blog": {
            "name": "targaryens-restoration",
            "title": "Mother Of Dragons",
            "description": "",
            "url": "https://targaryens-restoration.tumblr.com/",
            "uuid": "t:0fN_IRkhYCEW3lsfQarqzQ",
            "updated": 1556917388
        },
        "id": 181175343962,
        "post_url": "https://targaryens-restoration.tumblr.com/post/181175343962/i-am-dead",
        "slug": "i-am-dead",
        "date": "2018-12-16 19:22:57 GMT",
        "timestamp": 1544988177,
        "state": "published",
        "format": "html",
        "reblog_key": "piNF2wAi",
        "tags": [
            "game of thrones",
            "jon snow",
            "daenerys targaryen",
            "jon x daenerys",
            "jonerys",
            "daenerys stormborn",
            "season 8",
            "jon x dany",
            "house targaryen",
            "aegon targaryen",
            "house stark",
            "house stargaryen",
            "anti sansa",
            "anti sansa stark",
            "anti jonsa"
        ],
        "short_url": "https://tmblr.co/ZGHd8b2ekv5jQ",
        "summary": "I am dead 😂😂😂😂😂😂😂",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 282,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1007\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/8b0e899a06a0d2187a44528bda067e3b/tumblr_pjugi8HGE01vzef6y_540.jpg\" data-orig-height=\"1007\" data-orig-width=\"750\"/></figure><p>I am dead 😂😂😂😂😂😂😂</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1007\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/8b0e899a06a0d2187a44528bda067e3b/tumblr_pjugi8HGE01vzef6y_540.jpg\" data-orig-height=\"1007\" data-orig-width=\"750\"></figure><p>I am dead 😂😂😂😂😂😂😂</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "targaryens-restoration",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/c04e84bd283635551a9c60ed130fa82c/bmvgxud/975p5ymhr/tumblr_static_filename.png",
                        "header_image_focused": "https://static.tumblr.com/c04e84bd283635551a9c60ed130fa82c/bmvgxud/975p5ymhr/tumblr_static_filename_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/c04e84bd283635551a9c60ed130fa82c/bmvgxud/975p5ymhr/tumblr_static_filename_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#C0A4D2",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181175343962"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1007\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/8b0e899a06a0d2187a44528bda067e3b/tumblr_pjugi8HGE01vzef6y_540.jpg\" data-orig-height=\"1007\" data-orig-width=\"750\"></figure><p>I am dead 😂😂😂😂😂😂😂</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/8b0e899a06a0d2187a44528bda067e3b/tumblr_pjugi8HGE01vzef6y_540.jpg\" class=\"\"/></figure><p>I am dead &#128514;&#128514;&#128514;&#128514;&#128514;&#128514;&#128514;</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "wightjon",
        "blog": {
            "name": "wightjon",
            "title": "liam cunningham is still a jonsa",
            "description": "elizabeth. Sophie Turner thinks I'm amazing",
            "url": "https://wightjon.tumblr.com/",
            "uuid": "t:6t6BJbmIGzcqXH2MHmuAfQ",
            "updated": 1561263975
        },
        "id": 181173945419,
        "post_url": "https://wightjon.tumblr.com/post/181173945419",
        "slug": "jon-x-val-hockey-au-the-wildlings-and-crows-were",
        "date": "2018-12-16 18:28:20 GMT",
        "timestamp": 1544984900,
        "state": "published",
        "format": "html",
        "reblog_key": "ZBsEr7PG",
        "tags": [
            "jon snow",
            "val",
            "jon x val",
            "val x jon",
            "wildling weekend",
            "asoiafrare",
            "game of thrones"
        ],
        "short_url": "https://tmblr.co/Zqp0Iy2ekpmHB",
        "summary": "Jon x Val: Hockey AU\nThe Wildlings and Crows were heated rivals-but when Jon convinced the team owner Stannis Baratheon to steal...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 34,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/fa695fd3f48c6548c676a21ae701197f/tumblr_pjudz87iqW1qbi4h2_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"/></figure><p><b>Jon x Val: Hockey AU</b></p><p>The Wildlings and Crows were heated rivals-but when Jon convinced the team owner Stannis Baratheon to steal Val for their team, he never imagined he’d fall in love with the feisty player. </p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/fa695fd3f48c6548c676a21ae701197f/tumblr_pjudz87iqW1qbi4h2_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"></figure><p><b>Jon x Val: Hockey AU</b></p><p>The Wildlings and Crows were heated rivals-but when Jon convinced the team owner Stannis Baratheon to steal Val for their team, he never imagined he’d fall in love with the feisty player. </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "wightjon",
                    "active": true,
                    "theme": {
                        "header_full_width": 540,
                        "header_full_height": 720,
                        "header_focus_width": 462,
                        "header_focus_height": 260,
                        "avatar_shape": "circle",
                        "background_color": "#B6CDEE",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "230,501,490,39",
                        "header_image": "https://static.tumblr.com/d487e60e071119943effee1aa1e794cd/wl7pkph/FqGpp9j8p/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/b52c93dbde5e2bba3dcd3bcc52faa198/wl7pkph/yXNpp9j8q/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/d487e60e071119943effee1aa1e794cd/wl7pkph/FqGpp9j8p/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#243B5D",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#243B5D",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181173945419"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/fa695fd3f48c6548c676a21ae701197f/tumblr_pjudz87iqW1qbi4h2_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"></figure><p><b>Jon x Val: Hockey AU</b></p><p>The Wildlings and Crows were heated rivals-but when Jon convinced the team owner Stannis Baratheon to steal Val for their team, he never imagined he’d fall in love with the feisty player. </p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/fa695fd3f48c6548c676a21ae701197f/tumblr_pjudz87iqW1qbi4h2_540.jpg\" class=\"\"/></figure><p><b>Jon x Val: Hockey AU</b></p><p>The Wildlings and Crows were heated rivals-but when Jon convinced the team owner Stannis Baratheon to steal Val for their team, he never imagined he&rsquo;d fall in love with the feisty player. </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "keep-cahaha",
        "blog": {
            "name": "keep-cahaha",
            "title": "Kind of creative blog",
            "description": "Deny x 20 x Pančevo x Srbija\nSnap: d_denyyy ig: iamfunnybunny69",
            "url": "https://keep-cahaha.tumblr.com/",
            "uuid": "t:P-7zV8Zb9NmHArbCwvM1NA",
            "updated": 1549312588
        },
        "id": 181171096615,
        "post_url": "https://keep-cahaha.tumblr.com/post/181171096615/w-i-n-t-e-r-i-s-c-o-m-i-n-g",
        "slug": "w-i-n-t-e-r-i-s-c-o-m-i-n-g",
        "date": "2018-12-16 16:36:48 GMT",
        "timestamp": 1544978208,
        "state": "published",
        "format": "html",
        "reblog_key": "cy6qDjwi",
        "tags": [
            "winter",
            "winteriscoming",
            "snow",
            "snowball",
            "jon snow",
            "lights",
            "personal"
        ],
        "short_url": "https://tmblr.co/Z3mIjX2ekeumd",
        "summary": "W i n t e r   i s   c o m i n g  ❄️",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1,
        "title": null,
        "body": "<p>W i n t e r   i s   c o m i n g  ❄️</p><figure class=\"tmblr-full\" data-orig-height=\"2160\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/0d271ec72aceee26921f4edace85d0ac/tumblr_pju8tbUj9M1wv4d7i_540.jpg\" data-orig-height=\"2160\" data-orig-width=\"1080\"/></figure>",
        "reblog": {
            "comment": "<p><p>W i n t e r   i s   c o m i n g  ❄️</p><figure class=\"tmblr-full\" data-orig-height=\"2160\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/0d271ec72aceee26921f4edace85d0ac/tumblr_pju8tbUj9M1wv4d7i_540.jpg\" data-orig-height=\"2160\" data-orig-width=\"1080\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "keep-cahaha",
                    "active": true,
                    "theme": {
                        "header_full_width": 3000,
                        "header_full_height": 3750,
                        "header_focus_width": 1500,
                        "header_focus_height": 843,
                        "avatar_shape": "circle",
                        "background_color": "#86BBD9",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1500,843,0",
                        "header_image": "https://static.tumblr.com/f9fced3245e814a01fdf999fee1ce32d/ooqbfup/450pjrffh/tumblr_static_1110180628-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/832f3ae853d815f1118da264c0f7dc0e/ooqbfup/hWkpjrfhc/tumblr_static_tumblr_static_1110180628-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f9fced3245e814a01fdf999fee1ce32d/ooqbfup/450pjrffh/tumblr_static_1110180628-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#192155",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#BAE8F1",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181171096615"
                },
                "content_raw": "<p><p>W i n t e r   i s   c o m i n g  ❄️</p><figure class=\"tmblr-full\" data-orig-height=\"2160\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/0d271ec72aceee26921f4edace85d0ac/tumblr_pju8tbUj9M1wv4d7i_540.jpg\" data-orig-height=\"2160\" data-orig-width=\"1080\"></figure></p>",
                "content": "<p><p>W i n t e r   i s   c o m i n g  &#10052;&#65039;</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0d271ec72aceee26921f4edace85d0ac/tumblr_pju8tbUj9M1wv4d7i_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "alwaysjonsa",
        "blog": {
            "name": "alwaysjonsa",
            "title": "the wolf always wins",
            "description": "<p>you can call me mano, 21</p><p>i am literal garbage don’t mind me.  <a href=\"http://alwaysjonsa.wikia.com\">alwaysjonsa.wikia.com</a></p>",
            "url": "https://alwaysjonsa.tumblr.com/",
            "uuid": "t:PqVCOol4RB-Ar0AMHdEzNw",
            "updated": 1561503405
        },
        "id": 181170370343,
        "post_url": "https://alwaysjonsa.tumblr.com/post/181170370343/does-anyone-ever-wonder-what-wouldve-happened-if",
        "slug": "does-anyone-ever-wonder-what-wouldve-happened-if",
        "date": "2018-12-16 16:07:01 GMT",
        "timestamp": 1544976421,
        "state": "published",
        "format": "html",
        "reblog_key": "HQzfI2cA",
        "tags": [
            "jon snow",
            "game of thrones",
            "game of thrones au"
        ],
        "short_url": "https://tmblr.co/ZhCnCe2ekc7Sd",
        "summary": "does anyone ever wonder what would’ve happened if jon hadn’t gon to the wall?",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1,
        "title": null,
        "body": "<h1>does anyone ever wonder what would’ve happened if jon hadn’t gon to the wall?</h1>",
        "reblog": {
            "comment": "<p><h1>does anyone ever wonder what would’ve happened if jon hadn’t gon to the wall?</h1></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "alwaysjonsa",
                    "active": true,
                    "theme": {
                        "header_full_width": 1920,
                        "header_full_height": 1080,
                        "header_focus_width": 1867,
                        "header_focus_height": 1051,
                        "avatar_shape": "square",
                        "background_color": "#808080",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "14,1893,1065,26",
                        "header_image": "https://static.tumblr.com/259c36a1c5c732bc267e3b8a0ce665dc/eue4o5l/gMpouc5nh/tumblr_static_8a5byfv71wsogsok44sc40gg0.jpg",
                        "header_image_focused": "https://static.tumblr.com/259c36a1c5c732bc267e3b8a0ce665dc/eue4o5l/Bqgouc5nm/tumblr_static_tumblr_static_8a5byfv71wsogsok44sc40gg0_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/259c36a1c5c732bc267e3b8a0ce665dc/eue4o5l/gMpouc5nh/tumblr_static_8a5byfv71wsogsok44sc40gg0_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#F7F7F7",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#2DA3EA",
                        "title_font": "Typewriter FS",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181170370343"
                },
                "content_raw": "<p><h1>does anyone ever wonder what would’ve happened if jon hadn’t gon to the wall?</h1></p>",
                "content": "<p><h1>does anyone ever wonder what would&rsquo;ve happened if jon hadn&rsquo;t gon to the wall?</h1></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "jonerys-art",
        "blog": {
            "name": "jonerys-art",
            "title": "Ice + Fire",
            "description": "Blog dedicated to art of Jon Snow and Daenerys Targaryen.",
            "url": "https://jonerys-art.tumblr.com/",
            "uuid": "t:1-9pFvudselAunl9tZfwrw",
            "updated": 1561748451
        },
        "id": 181170224189,
        "post_url": "https://jonerys-art.tumblr.com/post/181170224189/jon-snow-and-daenerys-targaryen-by-alba-fajula-on",
        "slug": "jon-snow-and-daenerys-targaryen-by-alba-fajula-on",
        "date": "2018-12-16 16:00:50 GMT",
        "timestamp": 1544976050,
        "state": "published",
        "format": "html",
        "reblog_key": "XXhqHqav",
        "tags": [
            "alba fajula",
            "jon snow",
            "daenerys targaryen",
            "portraits",
            "fanart"
        ],
        "short_url": "https://tmblr.co/Z-JR_c2ekbZmz",
        "summary": "Jon Snow and Daenerys Targaryen by Alba Fajula on Behance",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 13,
        "caption": "<p><a href=\"https://www.behance.net/gallery/7030709/Game-of-Thrones-Series-Studies\">Jon Snow and Daenerys Targaryen</a> by <a href=\"https://www.behance.net/winderly\">Alba Fajula</a> on Behance<br/></p>",
        "reblog": {
            "comment": "<p><a href=\"https://www.behance.net/gallery/7030709/Game-of-Thrones-Series-Studies\">Jon Snow and Daenerys Targaryen</a> by <a href=\"https://www.behance.net/winderly\">Alba Fajula</a> on Behance<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jonerys-art",
                    "active": true,
                    "theme": {
                        "header_full_width": 1000,
                        "header_full_height": 500,
                        "header_focus_width": 889,
                        "header_focus_height": 500,
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,944,500,55",
                        "header_image": "https://static.tumblr.com/72dd6c4f457757b33929767edd460918/o2g22ll/e3Spqjv6f/tumblr_static_a959ww7tj08wksskg0kw4c4sg.png",
                        "header_image_focused": "https://static.tumblr.com/9587af85262eb5e77402fc78e18d2855/o2g22ll/vg5pqjv6h/tumblr_static_tumblr_static_a959ww7tj08wksskg0kw4c4sg_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/72dd6c4f457757b33929767edd460918/o2g22ll/e3Spqjv6f/tumblr_static_a959ww7tj08wksskg0kw4c4sg_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#75b1d6",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181170224189"
                },
                "content_raw": "<p><a href=\"https://www.behance.net/gallery/7030709/Game-of-Thrones-Series-Studies\">Jon Snow and Daenerys Targaryen</a> by <a href=\"https://www.behance.net/winderly\">Alba Fajula</a> on Behance<br></p>",
                "content": "<p><a href=\"https://www.behance.net/gallery/7030709/Game-of-Thrones-Series-Studies\">Jon Snow and Daenerys Targaryen</a> by <a href=\"https://www.behance.net/winderly\">Alba Fajula</a> on Behance<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "2",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/2f1582b0d61fba7f4828e74cdcbd494c/tumblr_p82spfnaNZ1wz1imko2_640.jpg",
                    "width": 600,
                    "height": 960
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/2f1582b0d61fba7f4828e74cdcbd494c/tumblr_p82spfnaNZ1wz1imko2_640.jpg",
                        "width": 600,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/2f1582b0d61fba7f4828e74cdcbd494c/tumblr_p82spfnaNZ1wz1imko2_540.jpg",
                        "width": 506,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/2f1582b0d61fba7f4828e74cdcbd494c/tumblr_p82spfnaNZ1wz1imko2_500.jpg",
                        "width": 469,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/2f1582b0d61fba7f4828e74cdcbd494c/tumblr_p82spfnaNZ1wz1imko2_400.jpg",
                        "width": 375,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/2f1582b0d61fba7f4828e74cdcbd494c/tumblr_p82spfnaNZ1wz1imko2_250.jpg",
                        "width": 250,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/2f1582b0d61fba7f4828e74cdcbd494c/tumblr_p82spfnaNZ1wz1imko2_100.jpg",
                        "width": 100,
                        "height": 160
                    },
                    {
                        "url": "https://66.media.tumblr.com/2f1582b0d61fba7f4828e74cdcbd494c/tumblr_p82spfnaNZ1wz1imko2_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/0be161fcbc9c317c0d8ece6a35663be6/tumblr_p82spfnaNZ1wz1imko1_1280.jpg",
                    "width": 600,
                    "height": 1039
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/0be161fcbc9c317c0d8ece6a35663be6/tumblr_p82spfnaNZ1wz1imko1_1280.jpg",
                        "width": 600,
                        "height": 1039
                    },
                    {
                        "url": "https://66.media.tumblr.com/0be161fcbc9c317c0d8ece6a35663be6/tumblr_p82spfnaNZ1wz1imko1_640.jpg",
                        "width": 554,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/0be161fcbc9c317c0d8ece6a35663be6/tumblr_p82spfnaNZ1wz1imko1_540.jpg",
                        "width": 468,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/0be161fcbc9c317c0d8ece6a35663be6/tumblr_p82spfnaNZ1wz1imko1_500.jpg",
                        "width": 433,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/0be161fcbc9c317c0d8ece6a35663be6/tumblr_p82spfnaNZ1wz1imko1_400.jpg",
                        "width": 346,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/0be161fcbc9c317c0d8ece6a35663be6/tumblr_p82spfnaNZ1wz1imko1_250.jpg",
                        "width": 231,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/0be161fcbc9c317c0d8ece6a35663be6/tumblr_p82spfnaNZ1wz1imko1_100.jpg",
                        "width": 100,
                        "height": 173
                    },
                    {
                        "url": "https://66.media.tumblr.com/0be161fcbc9c317c0d8ece6a35663be6/tumblr_p82spfnaNZ1wz1imko1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "zografa",
        "blog": {
            "name": "zografa",
            "title": "Valar Morghulis",
            "description": "Heya, I'm Ioanna! | Greek from Germany\n| Art blog <a href=\"https://zografia.tumblr.com\">@zografia</a>| Too many Fandoms | \nI love Astrology & Space | INTP-T | Leo♌\n| Shipping pretty much everything here btw | Witchblr Blog: <a href=\"https://astravtei. tumblr.com\">@astravtei</a> | Langblr Blog: <a href=\"https://aristorias.tumblr.com\">@aristorias</a>",
            "url": "https://zografa.tumblr.com/",
            "uuid": "t:i8CyByW4SMWqFM4-jJGy3g",
            "updated": 1561735626
        },
        "id": 181169569054,
        "post_url": "https://zografa.tumblr.com/post/181169569054/am-i-kicked-out-of-the-game-of-thrones-fandom-yet",
        "slug": "am-i-kicked-out-of-the-game-of-thrones-fandom-yet",
        "date": "2018-12-16 15:31:19 GMT",
        "timestamp": 1544974279,
        "state": "published",
        "format": "html",
        "reblog_key": "oKkFghXg",
        "tags": [
            "jon snow",
            "I'm sorry",
            ".....not really tbh",
            "game of thrones",
            "house stark",
            "house targaryen",
            "got"
        ],
        "short_url": "https://tmblr.co/ZYD-Hi2ekZ3qU",
        "summary": "Am I kicked out of the Game of Thrones fandom yet?",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": null,
        "body": "<p>Am I kicked out of the Game of Thrones fandom yet?</p><figure class=\"tmblr-full\" data-orig-height=\"2988\" data-orig-width=\"5312\"><img src=\"https://66.media.tumblr.com/2fd03a8cd22b4edb928ea7aff27d5d8d/tumblr_pju5s2Xv3D1tlkcaq_540.jpg\" data-orig-height=\"2988\" data-orig-width=\"5312\"/></figure>",
        "reblog": {
            "comment": "<p><p>Am I kicked out of the Game of Thrones fandom yet?</p><figure class=\"tmblr-full\" data-orig-height=\"2988\" data-orig-width=\"5312\"><img src=\"https://66.media.tumblr.com/2fd03a8cd22b4edb928ea7aff27d5d8d/tumblr_pju5s2Xv3D1tlkcaq_540.jpg\" data-orig-height=\"2988\" data-orig-width=\"5312\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "zografa",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#050020",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/a084e43d88bbe78316f18b86b6555c70/zziflgq/pmxp1d8o4/tumblr_static_cxe61odgkp4404ocwgco0kocs.jpg",
                        "header_image_focused": "https://static.tumblr.com/a084e43d88bbe78316f18b86b6555c70/zziflgq/pmxp1d8o4/tumblr_static_cxe61odgkp4404ocwgco0kocs_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/a084e43d88bbe78316f18b86b6555c70/zziflgq/pmxp1d8o4/tumblr_static_cxe61odgkp4404ocwgco0kocs_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#291F4F",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFAED",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181169569054"
                },
                "content_raw": "<p><p>Am I kicked out of the Game of Thrones fandom yet?</p><figure class=\"tmblr-full\" data-orig-height=\"2988\" data-orig-width=\"5312\"><img src=\"https://66.media.tumblr.com/2fd03a8cd22b4edb928ea7aff27d5d8d/tumblr_pju5s2Xv3D1tlkcaq_540.jpg\" data-orig-height=\"2988\" data-orig-width=\"5312\"></figure></p>",
                "content": "<p><p>Am I kicked out of the Game of Thrones fandom yet?</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/2fd03a8cd22b4edb928ea7aff27d5d8d/tumblr_pju5s2Xv3D1tlkcaq_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "fallatyourfeet",
        "blog": {
            "name": "fallatyourfeet",
            "title": "GoT words",
            "description": "Lou | Hufflepuff | INFJ | GoT is my main thing, I have started writing SPN fics, but other fandons will come | 'A Northern Light' is my labour of love, it's a GoT x Reader chapter series | <a href=https://fallatyourfeet.tumblr.com/post/181995681297/masterlist\">Masterlist</a> | Please drop me a message",
            "url": "https://fallatyourfeet.tumblr.com/",
            "uuid": "t:YiQbZHBf0X9p1f6vCn5JYA",
            "updated": 1561001465
        },
        "id": 181168861972,
        "post_url": "https://fallatyourfeet.tumblr.com/post/181168861972/unexpected-jon-snow-x-reader-part-2",
        "slug": "unexpected-jon-snow-x-reader-part-2",
        "date": "2018-12-16 14:57:57 GMT",
        "timestamp": 1544972277,
        "state": "published",
        "format": "html",
        "reblog_key": "xhj0W3xh",
        "tags": [
            "jon snow",
            "jon snow imagines",
            "jon snow fanfic",
            "jon snow x reader",
            "jon snow imagine",
            "jon snow fanfiction",
            "Winterfell",
            "winterfell imagine",
            "winterfell fanfic",
            "got",
            "got x reader",
            "got fanfiction",
            "got imagines",
            "got imagine"
        ],
        "short_url": "https://tmblr.co/ZZVAXc2ekWNCK",
        "summary": "Unexpected (Jon Snow x Reader) - Part 2",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 242,
        "title": "Unexpected (Jon Snow x Reader) - Part 2",
        "body": "<figure data-orig-width=\"268\" data-orig-height=\"169\" data-tumblr-attribution=\"joneryswarrior:MwM_HOQ6j-R2J1Fb1fS71g:ZEj6yc2PQYODT\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/804a373659a1b4638a5831c000b93ac0/tumblr_ovf3rt8POK1wzrkalo1_400.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"169\"/></figure><p><b>Summary: A sequel to my Jon Snow x reader imagine, where Jon finds himself having unexpected feelings for the reader.  This part is from the reader&rsquo;s point of view</b></p><p><b>Word count: 1138</b></p><p><b>Warnings: Quite angsty, mentions of violence and anxiety, where the reader feels emotionally broken.</b></p><p><b>A/N: <i>Please feel free to send me a message/comment/ask, I would love to know what you think.</i></b></p><h2><i>If you like this, please feel free to visit my blog and take a look around!</i><br/></h2><h2><i>Tags are open</i></h2><p><b><b><i><b><b><i>If you want to read the first part, please head to my blog and navigate through my masterlist.</i></b></b></i></b></b></p><p>After Ramsay, (YN) thought she would never fully heal, she felt damaged beyond repair….permanently broken.  Not that she had ever let Ramsay see that, never did she show him just how much he had ruined her, she wouldn’t allow it, she wouldn’t give him the satisfaction.  It was only at night, when she knew she was all alone, when she was sure no one could hear her, that she would finally allow her broken side to simmer up to the surface, leaving her in a debilitating, tearless mess on the cold and dirty floor. Only to pick herself up the next morning, dust off her dirty clothes and hold her head up high, just so she could look Ramsay straight into his cold, dead, eyes again.  <br/></p><p>When she and Sansa, first escaped Winterfell, never did she think, she would find room in her heart for love.  A love for her friends and her departed family, yes, that was easy, but a real love, an intimate and tender love, no, she was far too messed up for that. Well, that’s what she had lead herself to believe.  And so, waking from her fever in a strange bed, with her eyes falling upon a strange man, should have had her terrified. Instead, she gazed into a pair of unknown, but somehow familiar dark eyes and instantly she felt safe, unable and not willing to stop the warm smile from spreading across her weak and fatigued features.  Feeling just a glimmer of hope, flicker to life in her disillusioned heart.</p><!-- more --><p>“You know he likes you, don’t you?”  Sansa said, as she stood brushing Lady (YN)’s (HC) hair, as she sat up in the bed.  After being awake for several days now, she was still too weak to be up and about, in fact, she hadn’t even been strong enough to leave the room yet.   Sansa’s words had (YN) biting the inside of her cheek, trying to suppress a smile,  Nevertheless, Sansa could see right through her, she had grown up so much since the first time (YN) had met her, way back when Sansa, her father and sister stayed at her family’s home, along with the King, as they travelled south to King’s Landing. Sansa had been so young and naïve then, but here she was now all grown up and so much wiser, not that she had a say in the matter, the past few years had not been kind to the poor girl, so there was no other choice but for the young girl to grow up.  </p><p>(YN) didn’t reply, though Sansa’s comment brought a healthy pink hue to her still pale complexion.  It hadn’t gone unnoticed by (YN), just how attentive Jon had been since she first woke up and realising this fact, had a warm glow bubbling away in her chest. Whenever he had a spare moment, he would come knocking at her door, well, his door actually, he had so kindly given up his bed to her the moment she arrived and wouldn’t hear of her moving to another room, at least until she had fully recovered.  (YN) had felt so guilty about this, but he would just give her a small smile and say, ‘Really I don’t mind, you need it more than I do’. Often he would bring her meals, sitting with her while she ate, (YN) feeling as though he only stayed to ensure she was eating enough food.  Each day telling her she was looking a little better and always going out of his way, making sure she had everything she needed or wanted.</p><p>Yet, one of the biggest giveaways was the way he looked at her, just the thought of it had another healthy glow spreading across her cheeks. In the evening, both Jon and Sansa would come to sit by her side, keeping her company until it was time for sleep.  Sometimes, they would all talk, sometimes it was just her and Sansa, while Jon sat quietly at his desk or by the fire, catching up with his leftover paperwork. (YN) would often catch him sneaking a sideways glance at her, with those deep and broody dark eyes, only to have him look away or his gaze drop to the floor, his beautiful dark curls falling into his face.  The sight was adorable and every time it happened, she felt the air catch in her throat.</p><p>Above all else though, were the times Jon would burst through the chamber door, in the middle of the night.  When her fever had finally broken, the nightmares unfortunately began. Dreams of freezing kennels and vicious barking hounds, of Ramsay standing too close, his vile breath hitting her face as he sweetly whispered unthinkable words into her ear, before sending a blow so heavy to the side of her head, it had her falling limply to the ground.  (YN) would never wake up screaming.  Instead, Sansa who slept beside her would be woken up by (YN) tossing, turning and thrashing about.  Frantically mumbling incoherent words, desperate sounding words, sending unpleasant shivers down Sansa’s spine, bringing back her own horrible and violent memories of Ramsay.  And it was Sansa’s distressed attempts to calm her down, which had Jon waking and scrambling his way into the room, from next door, taking (YN) in his arms, rocking her back and forth, assuring her that she was safe and out of Ramsay’s reach. Not wanting or willing to let her out of his embrace, until her tearless weeps had faded and she was sleeping soundly once more.  Staying with her until the morning, when (YN) would wake to find him sleeping uncomfortably in the chair beside her bed, his hand resting tenderly upon hers.</p><p>It was during these harrowing and monopolising moments (YN) blissfully realised, maybe he had more than just simple feelings for her.  It was in the way he held her protectively in his arms, in the way he softly held her face between his strong, calloused hands as his beautiful eyes stared deeply into hers, silently calming her troubled soul.  And it was there, behind those dark, silent eyes, she saw a burning anger grow from a mere flickering ember.  An anger reserved for the monster who created the agonising scene before him.  The anger was fierce, it was brutal and relentless and (YN) knew it would never go away, not until he had his moment with that monster, the monster who tried to break the one he held his arms, tried to break, but failed.  And it was only then (YN) realised she wasn’t broken, she had never been broken, there had always been a glimmer of hope in her heart, it was there all along, she just never knew it.  And how happy she was, to realise that glimmer of hope was Jon.  </p><p><a>@marvelous-revengers @tessimagines</a> <a href=\"https://tmblr.co/mJyopGQk0OtNLaozaLwUaLQ\">@disneyprincessbuffyannesummers</a> <a href=\"https://tmblr.co/mR66EnpofMvxuwSBpSnkxog\">@heyohheyitsgabi</a></p>",
        "body_abstract": "\n<figure data-orig-width=\"268\" data-orig-height=\"169\" data-tumblr-attribution=\"joneryswarrior:MwM_HOQ6j-R2J1Fb1fS71g:ZEj6yc2PQYODT\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/804a373659a1b4638a5831c000b93ac0/tumblr_ovf3rt8POK1wzrkalo1_400.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"169\"></figure><p><b>Summary: A sequel to my Jon Snow x reader imagine, where Jon finds himself having unexpected feelings for the reader.&nbsp; This part is from the reader&rsquo;s point of view</b></p>\n<p><b>Word count: 1138</b></p>\n<p><b>Warnings: Quite angsty, mentions of violence and anxiety, where the reader feels emotionally broken.</b></p>\n<p><b>A/N: <i>Please feel free to send me a message/comment/ask, I would love to know what you think.</i></b></p>\n<h2>\n<i>If you like this, please feel free to visit my blog and take a look around!</i><br>\n</h2>\n<h2><i>Tags are open</i></h2>\n<p><b><b><i><b><b><i>If you want to read the first part, please head to my blog and navigate through my masterlist.</i></b></b></i></b></b></p>\n<p>After Ramsay, (YN) thought she would never fully heal, she felt damaged beyond repair&hellip;.permanently broken.&nbsp; Not that she had ever let Ramsay see that, never did she show him just how much he had ruined her, she wouldn&rsquo;t allow it, she wouldn&rsquo;t give him the satisfaction. &nbsp;It was only at night, when she knew she was all alone, when she was sure no one could hear her, that she would finally allow her broken side to simmer up to the surface, leaving her in a debilitating, tearless mess on the cold and dirty floor. Only to pick herself up the next morning, dust off her dirty clothes and hold her head up high, just so she could look Ramsay straight into his cold, dead, eyes again.&nbsp;&nbsp;<br></p>\n<p>When she and Sansa, first escaped Winterfell, never did she think, she would find room in her heart for love. &nbsp;A love for her friends and her departed family, yes, that was easy, but a real love, an intimate and tender love, no, she was far too messed up for that. Well, that&rsquo;s what she had lead herself to believe.&nbsp; And so, waking from her fever in a strange bed, with her eyes falling upon a strange man, should have had her terrified. Instead, she gazed into a pair of unknown, but somehow familiar dark eyes and instantly she felt safe, unable and not willing to stop the warm smile from spreading across her weak and fatigued features. &nbsp;Feeling just a glimmer of hope, flicker to life in her disillusioned heart.</p>\n",
        "reblog": {
            "comment": "<p><figure data-orig-width=\"268\" data-orig-height=\"169\" data-tumblr-attribution=\"joneryswarrior:MwM_HOQ6j-R2J1Fb1fS71g:ZEj6yc2PQYODT\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/804a373659a1b4638a5831c000b93ac0/tumblr_ovf3rt8POK1wzrkalo1_400.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"169\"></figure><p><b>Summary: A sequel to my Jon Snow x reader imagine, where Jon finds himself having unexpected feelings for the reader.  This part is from the reader’s point of view</b></p><p><b>Word count: 1138</b></p><p><b>Warnings: Quite angsty, mentions of violence and anxiety, where the reader feels emotionally broken.</b></p><p><b>A/N: <i>Please feel free to send me a message/comment/ask, I would love to know what you think.</i></b></p><h2><i>If you like this, please feel free to visit my blog and take a look around!</i><br></h2><h2><i>Tags are open</i></h2><p><b><b><i><b><b><i>If you want to read the first part, please head to my blog and navigate through my masterlist.</i></b></b></i></b></b></p><p>After Ramsay, (YN) thought she would never fully heal, she felt damaged beyond repair….permanently broken.  Not that she had ever let Ramsay see that, never did she show him just how much he had ruined her, she wouldn’t allow it, she wouldn’t give him the satisfaction.  It was only at night, when she knew she was all alone, when she was sure no one could hear her, that she would finally allow her broken side to simmer up to the surface, leaving her in a debilitating, tearless mess on the cold and dirty floor. Only to pick herself up the next morning, dust off her dirty clothes and hold her head up high, just so she could look Ramsay straight into his cold, dead, eyes again.  <br></p><p>When she and Sansa, first escaped Winterfell, never did she think, she would find room in her heart for love.  A love for her friends and her departed family, yes, that was easy, but a real love, an intimate and tender love, no, she was far too messed up for that. Well, that’s what she had lead herself to believe.  And so, waking from her fever in a strange bed, with her eyes falling upon a strange man, should have had her terrified. Instead, she gazed into a pair of unknown, but somehow familiar dark eyes and instantly she felt safe, unable and not willing to stop the warm smile from spreading across her weak and fatigued features.  Feeling just a glimmer of hope, flicker to life in her disillusioned heart.</p>[[MORE]]<p>“You know he likes you, don’t you?”  Sansa said, as she stood brushing Lady (YN)’s (HC) hair, as she sat up in the bed.  After being awake for several days now, she was still too weak to be up and about, in fact, she hadn’t even been strong enough to leave the room yet.   Sansa’s words had (YN) biting the inside of her cheek, trying to suppress a smile,  Nevertheless, Sansa could see right through her, she had grown up so much since the first time (YN) had met her, way back when Sansa, her father and sister stayed at her family’s home, along with the King, as they travelled south to King’s Landing. Sansa had been so young and naïve then, but here she was now all grown up and so much wiser, not that she had a say in the matter, the past few years had not been kind to the poor girl, so there was no other choice but for the young girl to grow up.  </p><p>(YN) didn’t reply, though Sansa’s comment brought a healthy pink hue to her still pale complexion.  It hadn’t gone unnoticed by (YN), just how attentive Jon had been since she first woke up and realising this fact, had a warm glow bubbling away in her chest. Whenever he had a spare moment, he would come knocking at her door, well, his door actually, he had so kindly given up his bed to her the moment she arrived and wouldn’t hear of her moving to another room, at least until she had fully recovered.  (YN) had felt so guilty about this, but he would just give her a small smile and say, ‘Really I don’t mind, you need it more than I do’. Often he would bring her meals, sitting with her while she ate, (YN) feeling as though he only stayed to ensure she was eating enough food.  Each day telling her she was looking a little better and always going out of his way, making sure she had everything she needed or wanted.</p><p>Yet, one of the biggest giveaways was the way he looked at her, just the thought of it had another healthy glow spreading across her cheeks. In the evening, both Jon and Sansa would come to sit by her side, keeping her company until it was time for sleep.  Sometimes, they would all talk, sometimes it was just her and Sansa, while Jon sat quietly at his desk or by the fire, catching up with his leftover paperwork. (YN) would often catch him sneaking a sideways glance at her, with those deep and broody dark eyes, only to have him look away or his gaze drop to the floor, his beautiful dark curls falling into his face.  The sight was adorable and every time it happened, she felt the air catch in her throat.</p><p>Above all else though, were the times Jon would burst through the chamber door, in the middle of the night.  When her fever had finally broken, the nightmares unfortunately began. Dreams of freezing kennels and vicious barking hounds, of Ramsay standing too close, his vile breath hitting her face as he sweetly whispered unthinkable words into her ear, before sending a blow so heavy to the side of her head, it had her falling limply to the ground.  (YN) would never wake up screaming.  Instead, Sansa who slept beside her would be woken up by (YN) tossing, turning and thrashing about.  Frantically mumbling incoherent words, desperate sounding words, sending unpleasant shivers down Sansa’s spine, bringing back her own horrible and violent memories of Ramsay.  And it was Sansa’s distressed attempts to calm her down, which had Jon waking and scrambling his way into the room, from next door, taking (YN) in his arms, rocking her back and forth, assuring her that she was safe and out of Ramsay’s reach. Not wanting or willing to let her out of his embrace, until her tearless weeps had faded and she was sleeping soundly once more.  Staying with her until the morning, when (YN) would wake to find him sleeping uncomfortably in the chair beside her bed, his hand resting tenderly upon hers.</p><p>It was during these harrowing and monopolising moments (YN) blissfully realised, maybe he had more than just simple feelings for her.  It was in the way he held her protectively in his arms, in the way he softly held her face between his strong, calloused hands as his beautiful eyes stared deeply into hers, silently calming her troubled soul.  And it was there, behind those dark, silent eyes, she saw a burning anger grow from a mere flickering ember.  An anger reserved for the monster who created the agonising scene before him.  The anger was fierce, it was brutal and relentless and (YN) knew it would never go away, not until he had his moment with that monster, the monster who tried to break the one he held his arms, tried to break, but failed.  And it was only then (YN) realised she wasn’t broken, she had never been broken, there had always been a glimmer of hope in her heart, it was there all along, she just never knew it.  And how happy she was, to realise that glimmer of hope was Jon.  </p><p><a>@marvelous-revengers @tessimagines</a> <a href=\"https://tmblr.co/mJyopGQk0OtNLaozaLwUaLQ\">@disneyprincessbuffyannesummers</a> <a href=\"https://tmblr.co/mR66EnpofMvxuwSBpSnkxog\">@heyohheyitsgabi</a></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fallatyourfeet",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#9a8e8e",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/16f0a7681b90f528257cd5829fef8e9c/y9wt4mk/KPUpg1uhc/tumblr_static_ybiqoihsv74scg40cw08w8cw.png",
                        "header_image_focused": "https://static.tumblr.com/16f0a7681b90f528257cd5829fef8e9c/y9wt4mk/KPUpg1uhc/tumblr_static_ybiqoihsv74scg40cw08w8cw_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/16f0a7681b90f528257cd5829fef8e9c/y9wt4mk/KPUpg1uhc/tumblr_static_ybiqoihsv74scg40cw08w8cw_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#bad8eb",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181168861972"
                },
                "content_raw": "<p><figure data-orig-width=\"268\" data-orig-height=\"169\" data-tumblr-attribution=\"joneryswarrior:MwM_HOQ6j-R2J1Fb1fS71g:ZEj6yc2PQYODT\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/804a373659a1b4638a5831c000b93ac0/tumblr_ovf3rt8POK1wzrkalo1_400.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"169\"></figure><p><b>Summary: A sequel to my Jon Snow x reader imagine, where Jon finds himself having unexpected feelings for the reader.  This part is from the reader’s point of view</b></p><p><b>Word count: 1138</b></p><p><b>Warnings: Quite angsty, mentions of violence and anxiety, where the reader feels emotionally broken.</b></p><p><b>A/N: <i>Please feel free to send me a message/comment/ask, I would love to know what you think.</i></b></p><h2><i>If you like this, please feel free to visit my blog and take a look around!</i><br></h2><h2><i>Tags are open</i></h2><p><b><b><i><b><b><i>If you want to read the first part, please head to my blog and navigate through my masterlist.</i></b></b></i></b></b></p><p>After Ramsay, (YN) thought she would never fully heal, she felt damaged beyond repair….permanently broken.  Not that she had ever let Ramsay see that, never did she show him just how much he had ruined her, she wouldn’t allow it, she wouldn’t give him the satisfaction.  It was only at night, when she knew she was all alone, when she was sure no one could hear her, that she would finally allow her broken side to simmer up to the surface, leaving her in a debilitating, tearless mess on the cold and dirty floor. Only to pick herself up the next morning, dust off her dirty clothes and hold her head up high, just so she could look Ramsay straight into his cold, dead, eyes again.  <br></p><p>When she and Sansa, first escaped Winterfell, never did she think, she would find room in her heart for love.  A love for her friends and her departed family, yes, that was easy, but a real love, an intimate and tender love, no, she was far too messed up for that. Well, that’s what she had lead herself to believe.  And so, waking from her fever in a strange bed, with her eyes falling upon a strange man, should have had her terrified. Instead, she gazed into a pair of unknown, but somehow familiar dark eyes and instantly she felt safe, unable and not willing to stop the warm smile from spreading across her weak and fatigued features.  Feeling just a glimmer of hope, flicker to life in her disillusioned heart.</p>[[MORE]]<p>“You know he likes you, don’t you?”  Sansa said, as she stood brushing Lady (YN)’s (HC) hair, as she sat up in the bed.  After being awake for several days now, she was still too weak to be up and about, in fact, she hadn’t even been strong enough to leave the room yet.   Sansa’s words had (YN) biting the inside of her cheek, trying to suppress a smile,  Nevertheless, Sansa could see right through her, she had grown up so much since the first time (YN) had met her, way back when Sansa, her father and sister stayed at her family’s home, along with the King, as they travelled south to King’s Landing. Sansa had been so young and naïve then, but here she was now all grown up and so much wiser, not that she had a say in the matter, the past few years had not been kind to the poor girl, so there was no other choice but for the young girl to grow up.  </p><p>(YN) didn’t reply, though Sansa’s comment brought a healthy pink hue to her still pale complexion.  It hadn’t gone unnoticed by (YN), just how attentive Jon had been since she first woke up and realising this fact, had a warm glow bubbling away in her chest. Whenever he had a spare moment, he would come knocking at her door, well, his door actually, he had so kindly given up his bed to her the moment she arrived and wouldn’t hear of her moving to another room, at least until she had fully recovered.  (YN) had felt so guilty about this, but he would just give her a small smile and say, ‘Really I don’t mind, you need it more than I do’. Often he would bring her meals, sitting with her while she ate, (YN) feeling as though he only stayed to ensure she was eating enough food.  Each day telling her she was looking a little better and always going out of his way, making sure she had everything she needed or wanted.</p><p>Yet, one of the biggest giveaways was the way he looked at her, just the thought of it had another healthy glow spreading across her cheeks. In the evening, both Jon and Sansa would come to sit by her side, keeping her company until it was time for sleep.  Sometimes, they would all talk, sometimes it was just her and Sansa, while Jon sat quietly at his desk or by the fire, catching up with his leftover paperwork. (YN) would often catch him sneaking a sideways glance at her, with those deep and broody dark eyes, only to have him look away or his gaze drop to the floor, his beautiful dark curls falling into his face.  The sight was adorable and every time it happened, she felt the air catch in her throat.</p><p>Above all else though, were the times Jon would burst through the chamber door, in the middle of the night.  When her fever had finally broken, the nightmares unfortunately began. Dreams of freezing kennels and vicious barking hounds, of Ramsay standing too close, his vile breath hitting her face as he sweetly whispered unthinkable words into her ear, before sending a blow so heavy to the side of her head, it had her falling limply to the ground.  (YN) would never wake up screaming.  Instead, Sansa who slept beside her would be woken up by (YN) tossing, turning and thrashing about.  Frantically mumbling incoherent words, desperate sounding words, sending unpleasant shivers down Sansa’s spine, bringing back her own horrible and violent memories of Ramsay.  And it was Sansa’s distressed attempts to calm her down, which had Jon waking and scrambling his way into the room, from next door, taking (YN) in his arms, rocking her back and forth, assuring her that she was safe and out of Ramsay’s reach. Not wanting or willing to let her out of his embrace, until her tearless weeps had faded and she was sleeping soundly once more.  Staying with her until the morning, when (YN) would wake to find him sleeping uncomfortably in the chair beside her bed, his hand resting tenderly upon hers.</p><p>It was during these harrowing and monopolising moments (YN) blissfully realised, maybe he had more than just simple feelings for her.  It was in the way he held her protectively in his arms, in the way he softly held her face between his strong, calloused hands as his beautiful eyes stared deeply into hers, silently calming her troubled soul.  And it was there, behind those dark, silent eyes, she saw a burning anger grow from a mere flickering ember.  An anger reserved for the monster who created the agonising scene before him.  The anger was fierce, it was brutal and relentless and (YN) knew it would never go away, not until he had his moment with that monster, the monster who tried to break the one he held his arms, tried to break, but failed.  And it was only then (YN) realised she wasn’t broken, she had never been broken, there had always been a glimmer of hope in her heart, it was there all along, she just never knew it.  And how happy she was, to realise that glimmer of hope was Jon.  </p><p><a>@marvelous-revengers @tessimagines</a> <a href=\"https://tmblr.co/mJyopGQk0OtNLaozaLwUaLQ\">@disneyprincessbuffyannesummers</a> <a href=\"https://tmblr.co/mR66EnpofMvxuwSBpSnkxog\">@heyohheyitsgabi</a></p></p>",
                "content": "<p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><p><b>Summary: A sequel to my Jon Snow x reader imagine, where Jon finds himself having unexpected feelings for the reader.&nbsp; This part is from the reader&rsquo;s point of view</b></p><p><b>Word count: 1138</b></p><p><b>Warnings: Quite angsty, mentions of violence and anxiety, where the reader feels emotionally broken.</b></p><p><b>A/N: <i>Please feel free to send me a message/comment/ask, I would love to know what you think.</i></b></p><h2><i>If you like this, please feel free to visit my blog and take a look around!</i><br /></h2><h2><i>Tags are open</i></h2><p><b><b><i><b><b><i>If you want to read the first part, please head to my blog and navigate through my masterlist.</i></b></b></i></b></b></p><p>After Ramsay, (YN) thought she would never fully heal, she felt damaged beyond repair&hellip;.permanently broken.&nbsp; Not that she had ever let Ramsay see that, never did she show him just how much he had ruined her, she wouldn&rsquo;t allow it, she wouldn&rsquo;t give him the satisfaction. &nbsp;It was only at night, when she knew she was all alone, when she was sure no one could hear her, that she would finally allow her broken side to simmer up to the surface, leaving her in a debilitating, tearless mess on the cold and dirty floor. Only to pick herself up the next morning, dust off her dirty clothes and hold her head up high, just so she could look Ramsay straight into his cold, dead, eyes again.&nbsp;&nbsp;<br /></p><p>When she and Sansa, first escaped Winterfell, never did she think, she would find room in her heart for love. &nbsp;A love for her friends and her departed family, yes, that was easy, but a real love, an intimate and tender love, no, she was far too messed up for that. Well, that&rsquo;s what she had lead herself to believe.&nbsp; And so, waking from her fever in a strange bed, with her eyes falling upon a strange man, should have had her terrified. Instead, she gazed into a pair of unknown, but somehow familiar dark eyes and instantly she felt safe, unable and not willing to stop the warm smile from spreading across her weak and fatigued features. &nbsp;Feeling just a glimmer of hope, flicker to life in her disillusioned heart.</p><p>&ldquo;You know he likes you, don&rsquo;t you?&rdquo; &nbsp;Sansa said, as she stood brushing Lady (YN)&rsquo;s (HC) hair, as she sat up in the bed. &nbsp;After being awake for several days now, she was still too weak to be up and about, in fact, she hadn&rsquo;t even been strong enough to leave the room yet.&nbsp; &nbsp;Sansa&rsquo;s words had (YN) biting the inside of her cheek, trying to suppress a smile,&nbsp; Nevertheless, Sansa could see right through her, she had grown up so much since the first time (YN) had met her, way back when Sansa, her father and sister stayed at her family&rsquo;s home, along with the King, as they travelled south to King&rsquo;s Landing. Sansa had been so young and na&iuml;ve then, but here she was now all grown up and so much wiser, not that she had a say in the matter, the past few years had not been kind to the poor girl, so there was no other choice but for the young girl to grow up. &nbsp;</p><p>(YN) didn&rsquo;t reply, though Sansa&rsquo;s comment brought a healthy pink hue to her still pale complexion. &nbsp;It hadn&rsquo;t gone unnoticed by (YN), just how attentive Jon had been since she first woke up and realising this fact, had a warm glow bubbling away in her chest. Whenever he had a spare moment, he would come knocking at her door, well, his door actually, he had so kindly given up his bed to her the moment she arrived and wouldn&rsquo;t hear of her moving to another room, at least until she had fully recovered. &nbsp;(YN) had felt so guilty about this, but he would just give her a small smile and say, &lsquo;Really I don&rsquo;t mind, you need it more than I do&rsquo;. Often he would bring her meals, sitting with her while she ate, (YN) feeling as though he only stayed to ensure she was eating enough food. &nbsp;Each day telling her she was looking a little better and always going out of his way, making sure she had everything she needed or wanted.</p><p>Yet, one of the biggest giveaways was the way he looked at her, just the thought of it had another healthy glow spreading across her cheeks. In the evening, both Jon and Sansa would come to sit by her side, keeping her company until it was time for sleep. &nbsp;Sometimes, they would all talk, sometimes it was just her and Sansa, while Jon sat quietly at his desk or by the fire, catching up with his leftover paperwork. (YN) would often catch him sneaking a sideways glance at her, with those deep and broody dark eyes, only to have him look away or his gaze drop to the floor, his beautiful dark curls falling into his face. &nbsp;The sight was adorable and every time it happened, she felt the air catch in her throat.</p><p>Above all else though, were the times Jon would burst through the chamber door, in the middle of the night. &nbsp;When her fever had finally broken, the nightmares unfortunately began. Dreams of freezing kennels and vicious barking hounds, of Ramsay standing too close, his vile breath hitting her face as he sweetly whispered unthinkable words into her ear, before sending a blow so heavy to the side of her head, it had her falling limply to the ground. &nbsp;(YN) would never wake up screaming.&nbsp; Instead, Sansa who slept beside her would be woken up by (YN) tossing, turning and thrashing about. &nbsp;Frantically mumbling incoherent words, desperate sounding words, sending unpleasant shivers down Sansa&rsquo;s spine, bringing back her own horrible and violent memories of Ramsay. &nbsp;And it was Sansa&rsquo;s distressed attempts to calm her down, which had Jon waking and scrambling his way into the room, from next door, taking (YN) in his arms, rocking her back and forth, assuring her that she was safe and out of Ramsay&rsquo;s reach. Not wanting or willing to let her out of his embrace, until her tearless weeps had faded and she was sleeping soundly once more.&nbsp; Staying with her until the morning, when (YN) would wake to find him sleeping uncomfortably in the chair beside her bed, his hand resting tenderly upon hers.</p><p>It was during these harrowing and monopolising moments (YN) blissfully realised, maybe he had more than just simple feelings for her. &nbsp;It was in the way he held her protectively in his arms, in the way he softly held her face between his strong, calloused hands as his beautiful eyes stared deeply into hers, silently calming her troubled soul. &nbsp;And it was there, behind those dark, silent eyes, she saw a burning anger grow from a mere flickering ember. &nbsp;An anger reserved for the monster who created the agonising scene before him. &nbsp;The anger was fierce, it was brutal and relentless and (YN) knew it would never go away, not until he had his moment with that monster, the monster who tried to break the one he held his arms, tried to break, but failed. &nbsp;And it was only then (YN) realised she wasn&rsquo;t broken, she had never been broken, there had always been a glimmer of hope in her heart, it was there all along, she just never knew it.&nbsp; And how happy she was, to realise that glimmer of hope was Jon. &nbsp;</p><p><a>@marvelous-revengers @tessimagines</a> <a href=\"https://tmblr.co/mJyopGQk0OtNLaozaLwUaLQ\">@disneyprincessbuffyannesummers</a> <a href=\"https://tmblr.co/mR66EnpofMvxuwSBpSnkxog\">@heyohheyitsgabi</a></p></p>",
                "content_abstract": "<p>\n<figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure>\n<p><b>Summary: A sequel to my Jon Snow x reader imagine, where Jon finds himself having unexpected feelings for the reader.&nbsp; This part is from the reader&rsquo;s point of view</b></p>\n<p><b>Word count: 1138</b></p>\n<p><b>Warnings: Quite angsty, mentions of violence and anxiety, where the reader feels emotionally broken.</b></p>\n<p><b>A/N: <i>Please feel free to send me a message/comment/ask, I would love to know what you think.</i></b></p>\n<h2>\n<i>If you like this, please feel free to visit my blog and take a look around!</i><br />\n</h2>\n<h2><i>Tags are open</i></h2>\n<p><b><b><i><b><b><i>If you want to read the first part, please head to my blog and navigate through my masterlist.</i></b></b></i></b></b></p>\n<p>After Ramsay, (YN) thought she would never fully heal, she felt damaged beyond repair&hellip;.permanently broken.&nbsp; Not that she had ever let Ramsay see that, never did she show him just how much he had ruined her, she wouldn&rsquo;t allow it, she wouldn&rsquo;t give him the satisfaction. &nbsp;It was only at night, when she knew she was all alone, when she was sure no one could hear her, that she would finally allow her broken side to simmer up to the surface, leaving her in a debilitating, tearless mess on the cold and dirty floor. Only to pick herself up the next morning, dust off her dirty clothes and hold her head up high, just so she could look Ramsay straight into his cold, dead, eyes again.&nbsp;&nbsp;<br /></p>\n<p>When she and Sansa, first escaped Winterfell, never did she think, she would find room in her heart for love. &nbsp;A love for her friends and her departed family, yes, that was easy, but a real love, an intimate and tender love, no, she was far too messed up for that. Well, that&rsquo;s what she had lead herself to believe.&nbsp; And so, waking from her fever in a strange bed, with her eyes falling upon a strange man, should have had her terrified. Instead, she gazed into a pair of unknown, but somehow familiar dark eyes and instantly she felt safe, unable and not willing to stop the warm smile from spreading across her weak and fatigued features. &nbsp;Feeling just a glimmer of hope, flicker to life in her disillusioned heart.</p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "tragedyofromance",
        "blog": {
            "name": "tragedyofromance",
            "title": "tragedy is a romance we lose ourselves in",
            "description": "Mostly GOT- jonsa,will/reblog of criticizims of characters,feminist, \nlover of all things cute, aesthics",
            "url": "https://tragedyofromance.tumblr.com/",
            "uuid": "t:EBtR0SFXYD8QKNWm7Ww07A",
            "updated": 1561697534
        },
        "id": 181168849215,
        "post_url": "https://tragedyofromance.tumblr.com/post/181168849215/hes-never-been-a-bastard-hes-the-heir-to-the",
        "slug": "hes-never-been-a-bastard-hes-the-heir-to-the",
        "date": "2018-12-16 14:57:22 GMT",
        "timestamp": 1544972242,
        "state": "published",
        "format": "html",
        "reblog_key": "ZM0IbhmZ",
        "tags": [
            "snowsource",
            "direwolfdaily",
            "game of thrones",
            "jon snow",
            "gotjonsnow",
            "gotedit",
            "got",
            "my gifs",
            "mine",
            "jon",
            "jon gifs",
            "kit harington"
        ],
        "short_url": "https://tmblr.co/ZiCRpZ2ekWK4-",
        "summary": "“\n\nHe's never been a bastard. He's the heir to the Iron ...”",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 104,
        "caption": "<blockquote><p><i>\n\n“\n\nHe&rsquo;s never been a bastard. He&rsquo;s the heir to the Iron &hellip;”\n\n</i><br/></p></blockquote>",
        "reblog": {
            "comment": "<p><blockquote><p><i>\n\n“\n\nHe’s never been a bastard. He’s the heir to the Iron …”\n\n</i><br></p></blockquote></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "tragedyofromance",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#bababa",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/6a0505a5db951f802bf1ba7db9225d22/iraky7n/6T3pluu7a/tumblr_static_-2094806090-content.gif",
                        "header_image_focused": "https://static.tumblr.com/6a0505a5db951f802bf1ba7db9225d22/iraky7n/6T3pluu7a/tumblr_static_-2094806090-content_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/6a0505a5db951f802bf1ba7db9225d22/iraky7n/6T3pluu7a/tumblr_static_-2094806090-content_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#102029",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181168849215"
                },
                "content_raw": "<p><blockquote><p><i>\n\n“\n\nHe’s never been a bastard. He’s the heir to the Iron …”\n\n</i><br></p></blockquote></p>",
                "content": "<p><blockquote><p><i>\n\n&ldquo;\n\nHe&rsquo;s never been a bastard. He&rsquo;s the heir to the Iron &hellip;&rdquo;\n\n</i><br /></p></blockquote></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "2",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/87411f9b38442cf8060b76c4c2d0a05c/tumblr_pjtz6kPiL21xuduufo1_r1_400.gif",
                    "width": 300,
                    "height": 400
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/87411f9b38442cf8060b76c4c2d0a05c/tumblr_pjtz6kPiL21xuduufo1_r1_400.gif",
                        "width": 300,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/87411f9b38442cf8060b76c4c2d0a05c/tumblr_pjtz6kPiL21xuduufo1_r1_250.gif",
                        "width": 250,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/87411f9b38442cf8060b76c4c2d0a05c/tumblr_pjtz6kPiL21xuduufo1_r1_100.gif",
                        "width": 100,
                        "height": 133
                    },
                    {
                        "url": "https://66.media.tumblr.com/87411f9b38442cf8060b76c4c2d0a05c/tumblr_pjtz6kPiL21xuduufo1_r1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/79246b083d4db06ab4db6f0ebdb391a4/tumblr_pjtz6kPiL21xuduufo2_400.gif",
                    "width": 300,
                    "height": 400
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/79246b083d4db06ab4db6f0ebdb391a4/tumblr_pjtz6kPiL21xuduufo2_400.gif",
                        "width": 300,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/79246b083d4db06ab4db6f0ebdb391a4/tumblr_pjtz6kPiL21xuduufo2_250.gif",
                        "width": 250,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/79246b083d4db06ab4db6f0ebdb391a4/tumblr_pjtz6kPiL21xuduufo2_100.gif",
                        "width": 100,
                        "height": 133
                    },
                    {
                        "url": "https://66.media.tumblr.com/79246b083d4db06ab4db6f0ebdb391a4/tumblr_pjtz6kPiL21xuduufo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "rainhadaenerys",
        "blog": {
            "name": "rainhadaenerys",
            "title": "Daenerys Targaryen is the love of my life",
            "description": "I write about Daenerys Targaryen",
            "url": "https://rainhadaenerys.tumblr.com/",
            "uuid": "t:QTcNedfMHZ6H9ObEl6UO1A",
            "updated": 1561759260
        },
        "id": 181167967282,
        "post_url": "https://rainhadaenerys.tumblr.com/post/181167967282/why-i-see-jon-and-daenerys-as-equals",
        "slug": "why-i-see-jon-and-daenerys-as-equals",
        "date": "2018-12-16 14:12:59 GMT",
        "timestamp": 1544969579,
        "state": "published",
        "format": "html",
        "reblog_key": "Uv33NJL2",
        "tags": [
            "jonerys",
            "daenerys targaryen",
            "jon snow",
            "got meta",
            "I was going to post a book meta that I wrote but I think I'm going to wait until tuesday for that",
            "my post"
        ],
        "short_url": "https://tmblr.co/ZZf0nX2ekSymo",
        "summary": "Why I see Jon and Daenerys as equals",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 55,
        "title": "Why I see Jon and Daenerys as equals",
        "body": "<p>A lot of antis\ncomplain about Jonerys by saying that Jon and Dany are not equals, and by mocking\nJonerys shippers for thinking that they are. So I wanted talk about why I see\nJon and Dany as equals.</p><p>If we are going to\nconsider the amount of power that each one has, then yes, Jon and Dany are not\nequals, because Dany is much more powerful (I mean, of course, she has\ndragons!). Not only that, but Jon has bent the knee, which means that they\naren’t equals in status anymore. But that’s not what I think when I say they\nare equals. I see them as equals for several reasons:</p><p>1. When Jon and\nDany first meet, they are equal in status (even if not in power). Jon is a king\nand Dany is a queen. If it they had met at the beginning of the story, Viserys\nwould have considered Jon unworthy of even interacting with him and Dany for\nbeing a bastard. And Dany, being a girl, and an exiled and homeless princess,\nwouldn’t ever be given a voice or power of her own. I believe that Jon and Dany\nwould still have treated each other with respect, because they are both decent\npeople, but the society and the people around them would have made it\nimpossible for them to ever build a relationship. But now, as king and queen,\nthey are both empowered, they command respect in a way that they never would in\nthe beginning of the story. So when they finally meet, they meet as equals. Both\nhave the same power to decide their own fates and the fates of their people,\nand to build this relationship if they choose to, unlike other times in which\nthey were forced into relationships.</p><p>2. Not only are\nthey equals in status when they meet, but their life stories are similar to each other. Jon\nand Dany both came from a place of powerlessness. Jon is a bastard and Dany was\nhomeless and poor, and both of them rose to power. They both used this power to\nchange society and help the oppressed. Both think their duties as rulers is to protect\ntheir people. And both had to deal with similar challenges: lack of food in the\nNight’s Watch and in Meereen, making compromises for the sake of peace,\nsacrificing themselves for their people, fighting to reclaim their home,\nleading and uniting different groups of people, dealing with prejudice etc. And\nnow that they met, they are equals in experience. Dany is not an inexperienced\nlittle girl compared to Jon. Jon is not inexperienced compared to Dany. They\nare both seasoned rulers, equal in their capabilities. And this shared\nexperience is certainly one of the things that drew them to each other, what\nmakes them respect each other.</p><p>3. They respect\neach other. I know a lot of antis will say that Dany doesn’t respect Jon\nbecause she doesn’t call him a king in their first meeting, but that first\nmeeting is not really a good measure to see if Jon and Dany respect each other.\nDany obviously won’t acknowledge that Jon is a king, because her own claim to\nWesteros depends on his kingship being invalid, and she is trying to intimidate\nJon into bending the knee. Jon, on the other hand, is not in his best behavior either,\nlike when he berates her and calls her a child for not believing in the Army of\nthe Dead. This is understandable on Jon’s part because of the urgency of the\nsituation, but it’s still an insulting thing to say to a queen. This first\nmeeting is a moment of conflicting interests and distrust, so I don’t think\nusing only this scene is good enough to evaluate their relationship. But I\nthink that in all other scenes, we can see their respect for each other:</p><ul><li>Dany\napologizes for her father’s crimes; she gives Jon dragonglass and men to mine\nwithout asking for anything in return; she discusses the Army of the Dead with\nhim, even if she doesn’t believe it; she never calls him a bastard, and she\nstarts to call him a king after the first meeting; and she offers to help\ndestroy the Night King without asking Jon to bend the knee, because she realizes\nhow serious this is.</li><li>Jon,\non his part, recognizes her unwillingness to kill innocent people; he advises\nher when she asks for his help, without trying to tell her what to do; he recognizes\nthat her battle against the Lannister army is no different from his fight\nagainst the Boltons; and he bends the knee out of gratitude, because he recognizes\nthat giving her something in return is the honorable thing to do after all the\nhelp that Dany has offered and all the risk that she is taking to fight against\nthe dead (and he bends the knee because he wants to, not because Dany forced\nhim).<br/></li></ul><p>I really appreciate\ntheir how healthy and respectful their relationship is.</p><p>4. Lastly, they\nare equal in the narrative. None of them is narratively more important than the\nother. Dany is not a supporting character to Jon, and Jon is not a supporting\ncharacter to Dany. They are both the protagonists of their own stories. And\nthat is quite a refreshing thing, because in most romantic narratives, you will\nalways have one protagonist and one supporting character. I think it’s quite\ninteresting that Jon and Dany break that rule.</p><p>In the end, I\ndon’t think Jon and Dany need to have exactly the same amount of power to be equals.\nWhat matters to me is that their relationship is built in equality and respect.\nI also believe that if they survive and rule in the end, it will certainly be\nas equals. And that’s amazing in itself, because Westeros would have, for the\nfirst time, a woman and a bastard as its rulers.</p>",
        "reblog": {
            "comment": "<p>A lot of antis\ncomplain about Jonerys by saying that Jon and Dany are not equals, and by mocking\nJonerys shippers for thinking that they are. So I wanted talk about why I see\nJon and Dany as equals.</p><p>If we are going to\nconsider the amount of power that each one has, then yes, Jon and Dany are not\nequals, because Dany is much more powerful (I mean, of course, she has\ndragons!). Not only that, but Jon has bent the knee, which means that they\naren’t equals in status anymore. But that’s not what I think when I say they\nare equals. I see them as equals for several reasons:</p><p>1. When Jon and\nDany first meet, they are equal in status (even if not in power). Jon is a king\nand Dany is a queen. If it they had met at the beginning of the story, Viserys\nwould have considered Jon unworthy of even interacting with him and Dany for\nbeing a bastard. And Dany, being a girl, and an exiled and homeless princess,\nwouldn’t ever be given a voice or power of her own. I believe that Jon and Dany\nwould still have treated each other with respect, because they are both decent\npeople, but the society and the people around them would have made it\nimpossible for them to ever build a relationship. But now, as king and queen,\nthey are both empowered, they command respect in a way that they never would in\nthe beginning of the story. So when they finally meet, they meet as equals. Both\nhave the same power to decide their own fates and the fates of their people,\nand to build this relationship if they choose to, unlike other times in which\nthey were forced into relationships.</p><p>2. Not only are\nthey equals in status when they meet, but their life stories are similar to each other. Jon\nand Dany both came from a place of powerlessness. Jon is a bastard and Dany was\nhomeless and poor, and both of them rose to power. They both used this power to\nchange society and help the oppressed. Both think their duties as rulers is to protect\ntheir people. And both had to deal with similar challenges: lack of food in the\nNight’s Watch and in Meereen, making compromises for the sake of peace,\nsacrificing themselves for their people, fighting to reclaim their home,\nleading and uniting different groups of people, dealing with prejudice etc. And\nnow that they met, they are equals in experience. Dany is not an inexperienced\nlittle girl compared to Jon. Jon is not inexperienced compared to Dany. They\nare both seasoned rulers, equal in their capabilities. And this shared\nexperience is certainly one of the things that drew them to each other, what\nmakes them respect each other.</p><p>3. They respect\neach other. I know a lot of antis will say that Dany doesn’t respect Jon\nbecause she doesn’t call him a king in their first meeting, but that first\nmeeting is not really a good measure to see if Jon and Dany respect each other.\nDany obviously won’t acknowledge that Jon is a king, because her own claim to\nWesteros depends on his kingship being invalid, and she is trying to intimidate\nJon into bending the knee. Jon, on the other hand, is not in his best behavior either,\nlike when he berates her and calls her a child for not believing in the Army of\nthe Dead. This is understandable on Jon’s part because of the urgency of the\nsituation, but it’s still an insulting thing to say to a queen. This first\nmeeting is a moment of conflicting interests and distrust, so I don’t think\nusing only this scene is good enough to evaluate their relationship. But I\nthink that in all other scenes, we can see their respect for each other:</p><ul><li>Dany\napologizes for her father’s crimes; she gives Jon dragonglass and men to mine\nwithout asking for anything in return; she discusses the Army of the Dead with\nhim, even if she doesn’t believe it; she never calls him a bastard, and she\nstarts to call him a king after the first meeting; and she offers to help\ndestroy the Night King without asking Jon to bend the knee, because she realizes\nhow serious this is.</li><li>Jon,\non his part, recognizes her unwillingness to kill innocent people; he advises\nher when she asks for his help, without trying to tell her what to do; he recognizes\nthat her battle against the Lannister army is no different from his fight\nagainst the Boltons; and he bends the knee out of gratitude, because he recognizes\nthat giving her something in return is the honorable thing to do after all the\nhelp that Dany has offered and all the risk that she is taking to fight against\nthe dead (and he bends the knee because he wants to, not because Dany forced\nhim).<br></li></ul><p>I really appreciate\ntheir how healthy and respectful their relationship is.</p><p>4. Lastly, they\nare equal in the narrative. None of them is narratively more important than the\nother. Dany is not a supporting character to Jon, and Jon is not a supporting\ncharacter to Dany. They are both the protagonists of their own stories. And\nthat is quite a refreshing thing, because in most romantic narratives, you will\nalways have one protagonist and one supporting character. I think it’s quite\ninteresting that Jon and Dany break that rule.</p><p>In the end, I\ndon’t think Jon and Dany need to have exactly the same amount of power to be equals.\nWhat matters to me is that their relationship is built in equality and respect.\nI also believe that if they survive and rule in the end, it will certainly be\nas equals. And that’s amazing in itself, because Westeros would have, for the\nfirst time, a woman and a bastard as its rulers.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "rainhadaenerys",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/94a343a9cda4159c72a3ce8f77402d0b/4djfcly/mnepje7ao/tumblr_static_ejauhmkfh08c4sgo0cg008g8s.png",
                        "header_image_focused": "https://static.tumblr.com/94a343a9cda4159c72a3ce8f77402d0b/4djfcly/mnepje7ao/tumblr_static_ejauhmkfh08c4sgo0cg008g8s_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/94a343a9cda4159c72a3ce8f77402d0b/4djfcly/mnepje7ao/tumblr_static_ejauhmkfh08c4sgo0cg008g8s_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#d10b71",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#363535",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181167967282"
                },
                "content_raw": "<p>A lot of antis\ncomplain about Jonerys by saying that Jon and Dany are not equals, and by mocking\nJonerys shippers for thinking that they are. So I wanted talk about why I see\nJon and Dany as equals.</p><p>If we are going to\nconsider the amount of power that each one has, then yes, Jon and Dany are not\nequals, because Dany is much more powerful (I mean, of course, she has\ndragons!). Not only that, but Jon has bent the knee, which means that they\naren’t equals in status anymore. But that’s not what I think when I say they\nare equals. I see them as equals for several reasons:</p><p>1. When Jon and\nDany first meet, they are equal in status (even if not in power). Jon is a king\nand Dany is a queen. If it they had met at the beginning of the story, Viserys\nwould have considered Jon unworthy of even interacting with him and Dany for\nbeing a bastard. And Dany, being a girl, and an exiled and homeless princess,\nwouldn’t ever be given a voice or power of her own. I believe that Jon and Dany\nwould still have treated each other with respect, because they are both decent\npeople, but the society and the people around them would have made it\nimpossible for them to ever build a relationship. But now, as king and queen,\nthey are both empowered, they command respect in a way that they never would in\nthe beginning of the story. So when they finally meet, they meet as equals. Both\nhave the same power to decide their own fates and the fates of their people,\nand to build this relationship if they choose to, unlike other times in which\nthey were forced into relationships.</p><p>2. Not only are\nthey equals in status when they meet, but their life stories are similar to each other. Jon\nand Dany both came from a place of powerlessness. Jon is a bastard and Dany was\nhomeless and poor, and both of them rose to power. They both used this power to\nchange society and help the oppressed. Both think their duties as rulers is to protect\ntheir people. And both had to deal with similar challenges: lack of food in the\nNight’s Watch and in Meereen, making compromises for the sake of peace,\nsacrificing themselves for their people, fighting to reclaim their home,\nleading and uniting different groups of people, dealing with prejudice etc. And\nnow that they met, they are equals in experience. Dany is not an inexperienced\nlittle girl compared to Jon. Jon is not inexperienced compared to Dany. They\nare both seasoned rulers, equal in their capabilities. And this shared\nexperience is certainly one of the things that drew them to each other, what\nmakes them respect each other.</p><p>3. They respect\neach other. I know a lot of antis will say that Dany doesn’t respect Jon\nbecause she doesn’t call him a king in their first meeting, but that first\nmeeting is not really a good measure to see if Jon and Dany respect each other.\nDany obviously won’t acknowledge that Jon is a king, because her own claim to\nWesteros depends on his kingship being invalid, and she is trying to intimidate\nJon into bending the knee. Jon, on the other hand, is not in his best behavior either,\nlike when he berates her and calls her a child for not believing in the Army of\nthe Dead. This is understandable on Jon’s part because of the urgency of the\nsituation, but it’s still an insulting thing to say to a queen. This first\nmeeting is a moment of conflicting interests and distrust, so I don’t think\nusing only this scene is good enough to evaluate their relationship. But I\nthink that in all other scenes, we can see their respect for each other:</p><ul><li>Dany\napologizes for her father’s crimes; she gives Jon dragonglass and men to mine\nwithout asking for anything in return; she discusses the Army of the Dead with\nhim, even if she doesn’t believe it; she never calls him a bastard, and she\nstarts to call him a king after the first meeting; and she offers to help\ndestroy the Night King without asking Jon to bend the knee, because she realizes\nhow serious this is.</li><li>Jon,\non his part, recognizes her unwillingness to kill innocent people; he advises\nher when she asks for his help, without trying to tell her what to do; he recognizes\nthat her battle against the Lannister army is no different from his fight\nagainst the Boltons; and he bends the knee out of gratitude, because he recognizes\nthat giving her something in return is the honorable thing to do after all the\nhelp that Dany has offered and all the risk that she is taking to fight against\nthe dead (and he bends the knee because he wants to, not because Dany forced\nhim).<br></li></ul><p>I really appreciate\ntheir how healthy and respectful their relationship is.</p><p>4. Lastly, they\nare equal in the narrative. None of them is narratively more important than the\nother. Dany is not a supporting character to Jon, and Jon is not a supporting\ncharacter to Dany. They are both the protagonists of their own stories. And\nthat is quite a refreshing thing, because in most romantic narratives, you will\nalways have one protagonist and one supporting character. I think it’s quite\ninteresting that Jon and Dany break that rule.</p><p>In the end, I\ndon’t think Jon and Dany need to have exactly the same amount of power to be equals.\nWhat matters to me is that their relationship is built in equality and respect.\nI also believe that if they survive and rule in the end, it will certainly be\nas equals. And that’s amazing in itself, because Westeros would have, for the\nfirst time, a woman and a bastard as its rulers.</p>",
                "content": "<p>A lot of antis\ncomplain about Jonerys by saying that Jon and Dany are not equals, and by mocking\nJonerys shippers for thinking that they are. So I wanted talk about why I see\nJon and Dany as equals.</p><p>If we are going to\nconsider the amount of power that each one has, then yes, Jon and Dany are not\nequals, because Dany is much more powerful (I mean, of course, she has\ndragons!). Not only that, but Jon has bent the knee, which means that they\naren&rsquo;t equals in status anymore. But that&rsquo;s not what I think when I say they\nare equals. I see them as equals for several reasons:</p><p>1. When Jon and\nDany first meet, they are equal in status (even if not in power). Jon is a king\nand Dany is a queen. If it they had met at the beginning of the story, Viserys\nwould have considered Jon unworthy of even interacting with him and Dany for\nbeing a bastard. And Dany, being a girl, and an exiled and homeless princess,\nwouldn&rsquo;t ever be given a voice or power of her own. I believe that Jon and Dany\nwould still have treated each other with respect, because they are both decent\npeople, but the society and the people around them would have made it\nimpossible for them to ever build a relationship. But now, as king and queen,\nthey are both empowered, they command respect in a way that they never would in\nthe beginning of the story. So when they finally meet, they meet as equals. Both\nhave the same power to decide their own fates and the fates of their people,\nand to build this relationship if they choose to, unlike other times in which\nthey were forced into relationships.</p><p>2. Not only are\nthey equals in status when they meet, but their life stories are similar to each other. Jon\nand Dany both came from a place of powerlessness. Jon is a bastard and Dany was\nhomeless and poor, and both of them rose to power. They both used this power to\nchange society and help the oppressed. Both think their duties as rulers is to protect\ntheir people. And both had to deal with similar challenges: lack of food in the\nNight&rsquo;s Watch and in Meereen, making compromises for the sake of peace,\nsacrificing themselves for their people, fighting to reclaim their home,\nleading and uniting different groups of people, dealing with prejudice etc. And\nnow that they met, they are equals in experience. Dany is not an inexperienced\nlittle girl compared to Jon. Jon is not inexperienced compared to Dany. They\nare both seasoned rulers, equal in their capabilities. And this shared\nexperience is certainly one of the things that drew them to each other, what\nmakes them respect each other.</p><p>3. They respect\neach other. I know a lot of antis will say that Dany doesn&rsquo;t respect Jon\nbecause she doesn&rsquo;t call him a king in their first meeting, but that first\nmeeting is not really a good measure to see if Jon and Dany respect each other.\nDany obviously won&rsquo;t acknowledge that Jon is a king, because her own claim to\nWesteros depends on his kingship being invalid, and she is trying to intimidate\nJon into bending the knee. Jon, on the other hand, is not in his best behavior either,\nlike when he berates her and calls her a child for not believing in the Army of\nthe Dead. This is understandable on Jon&rsquo;s part because of the urgency of the\nsituation, but it&rsquo;s still an insulting thing to say to a queen. This first\nmeeting is a moment of conflicting interests and distrust, so I don&rsquo;t think\nusing only this scene is good enough to evaluate their relationship. But I\nthink that in all other scenes, we can see their respect for each other:</p><ul><li>Dany\napologizes for her father&rsquo;s crimes; she gives Jon dragonglass and men to mine\nwithout asking for anything in return; she discusses the Army of the Dead with\nhim, even if she doesn&rsquo;t believe it; she never calls him a bastard, and she\nstarts to call him a king after the first meeting; and she offers to help\ndestroy the Night King without asking Jon to bend the knee, because she realizes\nhow serious this is.</li><li>Jon,\non his part, recognizes her unwillingness to kill innocent people; he advises\nher when she asks for his help, without trying to tell her what to do; he recognizes\nthat her battle against the Lannister army is no different from his fight\nagainst the Boltons; and he bends the knee out of gratitude, because he recognizes\nthat giving her something in return is the honorable thing to do after all the\nhelp that Dany has offered and all the risk that she is taking to fight against\nthe dead (and he bends the knee because he wants to, not because Dany forced\nhim).<br /></li></ul><p>I really appreciate\ntheir how healthy and respectful their relationship is.</p><p>4. Lastly, they\nare equal in the narrative. None of them is narratively more important than the\nother. Dany is not a supporting character to Jon, and Jon is not a supporting\ncharacter to Dany. They are both the protagonists of their own stories. And\nthat is quite a refreshing thing, because in most romantic narratives, you will\nalways have one protagonist and one supporting character. I think it&rsquo;s quite\ninteresting that Jon and Dany break that rule.</p><p>In the end, I\ndon&rsquo;t think Jon and Dany need to have exactly the same amount of power to be equals.\nWhat matters to me is that their relationship is built in equality and respect.\nI also believe that if they survive and rule in the end, it will certainly be\nas equals. And that&rsquo;s amazing in itself, because Westeros would have, for the\nfirst time, a woman and a bastard as its rulers.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "targaryens-restoration",
        "blog": {
            "name": "targaryens-restoration",
            "title": "Mother Of Dragons",
            "description": "",
            "url": "https://targaryens-restoration.tumblr.com/",
            "uuid": "t:0fN_IRkhYCEW3lsfQarqzQ",
            "updated": 1556917388
        },
        "id": 181167481537,
        "post_url": "https://targaryens-restoration.tumblr.com/post/181167481537/jon-will-blame-to-dany-about-tarlys-execution-and",
        "slug": "jon-will-blame-to-dany-about-tarlys-execution-and",
        "date": "2018-12-16 13:47:25 GMT",
        "timestamp": 1544968045,
        "state": "published",
        "format": "html",
        "reblog_key": "I6hmXp46",
        "tags": [
            "game of thrones",
            "got8",
            "jon snow",
            "daenerys targaryen",
            "jonerys",
            "jon x daenerys",
            "jon x dany"
        ],
        "short_url": "https://tmblr.co/ZGHd8b2ekR6B1",
        "summary": "Jon will blame to Dany about Tarlys execution  and this idiot people thinks that Jon doesn’t know about that during monthes...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 7,
        "caption": "<h2><b><i>Jon will blame to Dany about Tarlys execution </i></b></h2><p><b><i>and this idiot people thinks that Jon doesn’t know about that during monthes when  he was in Dragonstone :D :D </i></b></p>",
        "reblog": {
            "comment": "<p><h2><b><i>Jon will blame to Dany about Tarlys execution </i></b></h2><p><b><i>and this idiot people thinks that Jon doesn’t know about that during monthes when  he was in Dragonstone :D :D </i></b></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "targaryens-restoration",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/c04e84bd283635551a9c60ed130fa82c/bmvgxud/975p5ymhr/tumblr_static_filename.png",
                        "header_image_focused": "https://static.tumblr.com/c04e84bd283635551a9c60ed130fa82c/bmvgxud/975p5ymhr/tumblr_static_filename_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/c04e84bd283635551a9c60ed130fa82c/bmvgxud/975p5ymhr/tumblr_static_filename_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#C0A4D2",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181167481537"
                },
                "content_raw": "<p><h2><b><i>Jon will blame to Dany about Tarlys execution </i></b></h2><p><b><i>and this idiot people thinks that Jon doesn’t know about that during monthes when  he was in Dragonstone :D :D </i></b></p></p>",
                "content": "<p><h2><b><i>Jon will blame to Dany about Tarlys execution&nbsp;</i></b></h2><p><b><i>and this idiot people thinks that Jon doesn&rsquo;t know about that during monthes when&nbsp; he was in Dragonstone :D :D&nbsp;</i></b></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://targaryens-restoration.tumblr.com/image/181167481537",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/66f6299c0067e2aff70e48858b333f88/tumblr_pju0z1Qvvq1x4sh98o1_500.gif",
                    "width": 500,
                    "height": 276
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/66f6299c0067e2aff70e48858b333f88/tumblr_pju0z1Qvvq1x4sh98o1_500.gif",
                        "width": 500,
                        "height": 276
                    },
                    {
                        "url": "https://66.media.tumblr.com/66f6299c0067e2aff70e48858b333f88/tumblr_pju0z1Qvvq1x4sh98o1_400.gif",
                        "width": 400,
                        "height": 221
                    },
                    {
                        "url": "https://66.media.tumblr.com/66f6299c0067e2aff70e48858b333f88/tumblr_pju0z1Qvvq1x4sh98o1_250.gif",
                        "width": 250,
                        "height": 138
                    },
                    {
                        "url": "https://66.media.tumblr.com/66f6299c0067e2aff70e48858b333f88/tumblr_pju0z1Qvvq1x4sh98o1_100.gif",
                        "width": 100,
                        "height": 55
                    },
                    {
                        "url": "https://66.media.tumblr.com/66f6299c0067e2aff70e48858b333f88/tumblr_pju0z1Qvvq1x4sh98o1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "stray-arrows",
        "blog": {
            "name": "stray-arrows",
            "title": " ☾ KING IN THE NORTH ☆ ",
            "description": "iss your ~problematic~ fave |  JON SNOW | CLERITH | CLOUD STRIFE | \n JONERYS | \nMATT MURDOCK | SPACE |  karedevil | kastle | mattelektra | ben poindexter | RICK GRIMES | richonne | CARYL | ichiruki | sasusaku | GAME OF THRONES | aliens | synthwave | the walking dead (1-6) ♥",
            "url": "https://stray-arrows.tumblr.com/",
            "uuid": "t:s0wMvU8xH6AoFIV7_wZFDw",
            "updated": 1561713299
        },
        "id": 181165468862,
        "post_url": "https://stray-arrows.tumblr.com/post/181165468862/when-winter-comes-for-war-you-shall-hear-no-lions",
        "slug": "when-winter-comes-for-war-you-shall-hear-no-lions",
        "date": "2018-12-16 11:46:50 GMT",
        "timestamp": 1544960810,
        "state": "published",
        "format": "html",
        "reblog_key": "pr3puub0",
        "tags": [
            "house stark",
            "jon snow",
            "arya stark",
            "sansa stark",
            "bran stark",
            "got"
        ],
        "short_url": "https://tmblr.co/ZveGhx2ekJQo_",
        "summary": "When winter comes for war, You shall hear no Lions roar. When winter forces you to yield, No Stags shall graze upon the field....",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 2,
        "title": null,
        "body": "<p>When winter comes for war,<br/>You shall hear no Lions roar.<br/>When winter forces you to yield,<br/>No Stags shall graze upon the field.<br/>When winter creeps upon you from the shadows,<br/>No Roses shall bloom from the meadows.<br/>When winter wreaks havoc on the land,<br/>You can bet there&rsquo;ll be no Snakes in the sand.<br/>When winter brings to life all it finds grim,<br/>The Krakens will freeze where they swim.<br/>When winter sets and the land begins to shiver,<br/>The Flayed Man will start to rot and wither.<br/>When winter fights to the last sliver,<br/>No more Trouts shall swim in the river.<br/>When winter ravages and all despair,<br/>No Falcons shall fly high in the air.<br/>When winter shows you what happens when snow falls,<br/>Not even Dragons Breath shall warm you in your halls.<br/>When winter comes with all it&rsquo;s might,<br/>Only the Wolves shall howl in the night!﻿</p><p><a href=\"https://asoiaf.westeros.org/index.php?/topic/114490-the-north-remembers/\">x</a></p>",
        "reblog": {
            "comment": "<p>When winter comes for war,<br>You shall hear no Lions roar.<br>When winter forces you to yield,<br>No Stags shall graze upon the field.<br>When winter creeps upon you from the shadows,<br>No Roses shall bloom from the meadows.<br>When winter wreaks havoc on the land,<br>You can bet there’ll be no Snakes in the sand.<br>When winter brings to life all it finds grim,<br>The Krakens will freeze where they swim.<br>When winter sets and the land begins to shiver,<br>The Flayed Man will start to rot and wither.<br>When winter fights to the last sliver,<br>No more Trouts shall swim in the river.<br>When winter ravages and all despair,<br>No Falcons shall fly high in the air.<br>When winter shows you what happens when snow falls,<br>Not even Dragons Breath shall warm you in your halls.<br>When winter comes with all it’s might,<br>Only the Wolves shall howl in the night!﻿</p><p><a href=\"https://asoiaf.westeros.org/index.php?/topic/114490-the-north-remembers/\">x</a></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "stray-arrows",
                    "active": true,
                    "theme": {
                        "header_full_width": 604,
                        "header_full_height": 340,
                        "header_focus_width": 604,
                        "header_focus_height": 339,
                        "avatar_shape": "square",
                        "background_color": "#F6F6F6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,604,339,0",
                        "header_image": "https://static.tumblr.com/f0afea764177bbfa85f97cfedcf676d8/rm7knor/dlepr116x/tumblr_static_35jhbxpepi68w40cso8csc8ko.jpg",
                        "header_image_focused": "https://static.tumblr.com/b709c61ac97389a2bc6359acc0c3c969/rm7knor/idepr116y/tumblr_static_tumblr_static_35jhbxpepi68w40cso8csc8ko_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f0afea764177bbfa85f97cfedcf676d8/rm7knor/dlepr116x/tumblr_static_35jhbxpepi68w40cso8csc8ko_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#7f1d1d",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#6f161a",
                        "title_font": "1785 GLC Baskerville",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181165468862"
                },
                "content_raw": "<p>When winter comes for war,<br>You shall hear no Lions roar.<br>When winter forces you to yield,<br>No Stags shall graze upon the field.<br>When winter creeps upon you from the shadows,<br>No Roses shall bloom from the meadows.<br>When winter wreaks havoc on the land,<br>You can bet there’ll be no Snakes in the sand.<br>When winter brings to life all it finds grim,<br>The Krakens will freeze where they swim.<br>When winter sets and the land begins to shiver,<br>The Flayed Man will start to rot and wither.<br>When winter fights to the last sliver,<br>No more Trouts shall swim in the river.<br>When winter ravages and all despair,<br>No Falcons shall fly high in the air.<br>When winter shows you what happens when snow falls,<br>Not even Dragons Breath shall warm you in your halls.<br>When winter comes with all it’s might,<br>Only the Wolves shall howl in the night!﻿</p><p><a href=\"https://asoiaf.westeros.org/index.php?/topic/114490-the-north-remembers/\">x</a></p>",
                "content": "<p>When winter comes for war,<br />You shall hear no Lions roar.<br />When winter forces you to yield,<br />No Stags shall graze upon the field.<br />When winter creeps upon you from the shadows,<br />No Roses shall bloom from the meadows.<br />When winter wreaks havoc on the land,<br />You can bet there&rsquo;ll be no Snakes in the sand.<br />When winter brings to life all it finds grim,<br />The Krakens will freeze where they swim.<br />When winter sets and the land begins to shiver,<br />The Flayed Man will start to rot and wither.<br />When winter fights to the last sliver,<br />No more Trouts shall swim in the river.<br />When winter ravages and all despair,<br />No Falcons shall fly high in the air.<br />When winter shows you what happens when snow falls,<br />Not even Dragons Breath shall warm you in your halls.<br />When winter comes with all it&rsquo;s might,<br />Only the Wolves shall howl in the night!&#65279;</p><p><a href=\"https://asoiaf.westeros.org/index.php?/topic/114490-the-north-remembers/\">x</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "targaryens-restoration",
        "blog": {
            "name": "targaryens-restoration",
            "title": "Mother Of Dragons",
            "description": "",
            "url": "https://targaryens-restoration.tumblr.com/",
            "uuid": "t:0fN_IRkhYCEW3lsfQarqzQ",
            "updated": 1556917388
        },
        "id": 181165315017,
        "post_url": "https://targaryens-restoration.tumblr.com/post/181165315017/jonsas-sansa-and-jon-are-main-characters-in",
        "slug": "jonsas-sansa-and-jon-are-main-characters-in",
        "date": "2018-12-16 11:36:58 GMT",
        "timestamp": 1544960218,
        "state": "published",
        "format": "html",
        "reblog_key": "PYQhbHfl",
        "tags": [
            "game of thrones",
            "jon snow",
            "daenerys targaryen",
            "jon x daenerys",
            "daenerys stormborn",
            "jonerys",
            "house targaryen",
            "season 8",
            "jon x dany",
            "aegon targaryen",
            "asoiaf",
            "house stargaryen",
            "house stark"
        ],
        "short_url": "https://tmblr.co/ZGHd8b2ekIrF9",
        "summary": "Jonsas: Sansa and Jon are main characters in season 8. They are a song if ice and fire\nAnother GOT fandom: \nJonsas: \n🤦‍♀️Dance...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 8,
        "title": null,
        "body": "<p>Jonsas: Sansa and Jon are main characters in season 8. They are a song if ice and fire</p><p>Another GOT fandom: </p><figure class=\"tmblr-full\" data-orig-height=\"180\" data-orig-width=\"245\" data-tumblr-attribution=\"alepeterslove:3upZIX5PYZCY84RIG2mR1g:ZH_Rid2PLOxWG\"><img src=\"https://66.media.tumblr.com/43438bd359f43fc31c215899cf4631a9/tumblr_ovb0ifxhrc1wriqrmo1_250.gif\" data-orig-height=\"180\" data-orig-width=\"245\"/></figure><p>Jonsas: </p><p>🤦‍♀️Dance with the dragon 2” is coming next season</p><p>🤦‍♀️ new love story is coming next season </p><p>🤦‍♀️ political Jon is coming </p><p>🤦‍♀️Dark Dany is coming</p><p>🤦‍♀️  Stark-Lannister allies is coming 🤦‍♀️🤦‍♀️🤦‍♀️</p><p>🤦‍♀️ Dany/Jon VS NK  </p><p>Dany VS Jon </p><p>Jon/Cersei VS Dany  is coming</p><p><br/></p><p>And I am realise that there is only 6 episode left 🙏🤦‍♀️🙏🤦‍♀️🙏</p><figure class=\"tmblr-full\" data-orig-height=\"360\" data-orig-width=\"640\" data-tumblr-attribution=\"jakeperalta11us:nrhWIehk2BTNmv0D6MEM2Q:Z7F-bc2UyHIME\"><img src=\"https://66.media.tumblr.com/d289e5c609a35c22fb3ceacb5f06d076/tumblr_p1v6htAb4M1wci791o1_640.gif\" data-orig-height=\"360\" data-orig-width=\"640\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"417\" data-orig-width=\"540\" data-tumblr-attribution=\"jdm-negan-mcnaughty:e4diSYGp53umI4Sgf5ZFvA:Z04ITf2Gi3ZX5\"><img src=\"https://66.media.tumblr.com/0c1062dcdf7a476266a0f0c47d3a88bb/tumblr_oj82fgc1jr1vk9p1bo1_540.gif\" data-orig-height=\"417\" data-orig-width=\"540\"/></figure>",
        "reblog": {
            "comment": "<p><p>Jonsas: Sansa and Jon are main characters in season 8. They are a song if ice and fire</p><p>Another GOT fandom: </p><figure class=\"tmblr-full\" data-orig-height=\"180\" data-orig-width=\"245\" data-tumblr-attribution=\"alepeterslove:3upZIX5PYZCY84RIG2mR1g:ZH_Rid2PLOxWG\"><img src=\"https://66.media.tumblr.com/43438bd359f43fc31c215899cf4631a9/tumblr_ovb0ifxhrc1wriqrmo1_250.gif\" data-orig-height=\"180\" data-orig-width=\"245\"></figure><p>Jonsas: </p><p>🤦‍♀️Dance with the dragon 2” is coming next season</p><p>🤦‍♀️ new love story is coming next season </p><p>🤦‍♀️ political Jon is coming </p><p>🤦‍♀️Dark Dany is coming</p><p>🤦‍♀️  Stark-Lannister allies is coming 🤦‍♀️🤦‍♀️🤦‍♀️</p><p>🤦‍♀️ Dany/Jon VS NK  </p><p>Dany VS Jon </p><p>Jon/Cersei VS Dany  is coming</p><p><br></p><p>And I am realise that there is only 6 episode left 🙏🤦‍♀️🙏🤦‍♀️🙏</p><figure class=\"tmblr-full\" data-orig-height=\"360\" data-orig-width=\"640\" data-tumblr-attribution=\"jakeperalta11us:nrhWIehk2BTNmv0D6MEM2Q:Z7F-bc2UyHIME\"><img src=\"https://66.media.tumblr.com/d289e5c609a35c22fb3ceacb5f06d076/tumblr_p1v6htAb4M1wci791o1_640.gif\" data-orig-height=\"360\" data-orig-width=\"640\"></figure><figure class=\"tmblr-full\" data-orig-height=\"417\" data-orig-width=\"540\" data-tumblr-attribution=\"jdm-negan-mcnaughty:e4diSYGp53umI4Sgf5ZFvA:Z04ITf2Gi3ZX5\"><img src=\"https://66.media.tumblr.com/0c1062dcdf7a476266a0f0c47d3a88bb/tumblr_oj82fgc1jr1vk9p1bo1_540.gif\" data-orig-height=\"417\" data-orig-width=\"540\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "targaryens-restoration",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/c04e84bd283635551a9c60ed130fa82c/bmvgxud/975p5ymhr/tumblr_static_filename.png",
                        "header_image_focused": "https://static.tumblr.com/c04e84bd283635551a9c60ed130fa82c/bmvgxud/975p5ymhr/tumblr_static_filename_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/c04e84bd283635551a9c60ed130fa82c/bmvgxud/975p5ymhr/tumblr_static_filename_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#C0A4D2",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181165315017"
                },
                "content_raw": "<p><p>Jonsas: Sansa and Jon are main characters in season 8. They are a song if ice and fire</p><p>Another GOT fandom: </p><figure class=\"tmblr-full\" data-orig-height=\"180\" data-orig-width=\"245\" data-tumblr-attribution=\"alepeterslove:3upZIX5PYZCY84RIG2mR1g:ZH_Rid2PLOxWG\"><img src=\"https://66.media.tumblr.com/43438bd359f43fc31c215899cf4631a9/tumblr_ovb0ifxhrc1wriqrmo1_250.gif\" data-orig-height=\"180\" data-orig-width=\"245\"></figure><p>Jonsas: </p><p>🤦‍♀️Dance with the dragon 2” is coming next season</p><p>🤦‍♀️ new love story is coming next season </p><p>🤦‍♀️ political Jon is coming </p><p>🤦‍♀️Dark Dany is coming</p><p>🤦‍♀️  Stark-Lannister allies is coming 🤦‍♀️🤦‍♀️🤦‍♀️</p><p>🤦‍♀️ Dany/Jon VS NK  </p><p>Dany VS Jon </p><p>Jon/Cersei VS Dany  is coming</p><p><br></p><p>And I am realise that there is only 6 episode left 🙏🤦‍♀️🙏🤦‍♀️🙏</p><figure class=\"tmblr-full\" data-orig-height=\"360\" data-orig-width=\"640\" data-tumblr-attribution=\"jakeperalta11us:nrhWIehk2BTNmv0D6MEM2Q:Z7F-bc2UyHIME\"><img src=\"https://66.media.tumblr.com/d289e5c609a35c22fb3ceacb5f06d076/tumblr_p1v6htAb4M1wci791o1_640.gif\" data-orig-height=\"360\" data-orig-width=\"640\"></figure><figure class=\"tmblr-full\" data-orig-height=\"417\" data-orig-width=\"540\" data-tumblr-attribution=\"jdm-negan-mcnaughty:e4diSYGp53umI4Sgf5ZFvA:Z04ITf2Gi3ZX5\"><img src=\"https://66.media.tumblr.com/0c1062dcdf7a476266a0f0c47d3a88bb/tumblr_oj82fgc1jr1vk9p1bo1_540.gif\" data-orig-height=\"417\" data-orig-width=\"540\"></figure></p>",
                "content": "<p><p>Jonsas: Sansa and Jon are main characters in season 8. They are a song if ice and fire</p><p>Another GOT fandom: </p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><p>Jonsas: </p><p>&#129318;&zwj;&#9792;&#65039;Dance with the dragon 2&rdquo; is coming next season</p><p>&#129318;&zwj;&#9792;&#65039; new love story is coming next season </p><p>&#129318;&zwj;&#9792;&#65039; political Jon is coming </p><p>&#129318;&zwj;&#9792;&#65039;Dark Dany is coming</p><p>&#129318;&zwj;&#9792;&#65039;  Stark-Lannister allies is coming &#129318;&zwj;&#9792;&#65039;&#129318;&zwj;&#9792;&#65039;&#129318;&zwj;&#9792;&#65039;</p><p>&#129318;&zwj;&#9792;&#65039; Dany/Jon VS NK  </p><p>Dany VS Jon </p><p>Jon/Cersei VS Dany  is coming</p><p><br /></p><p>And I am realise that there is only 6 episode left &#128591;&#129318;&zwj;&#9792;&#65039;&#128591;&#129318;&zwj;&#9792;&#65039;&#128591;</p><figure data-tumblr-media-id=\"1\" class=\"tmblr-full\"></figure><figure data-tumblr-media-id=\"2\" class=\"tmblr-full\"></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "stray-arrows",
        "blog": {
            "name": "stray-arrows",
            "title": " ☾ KING IN THE NORTH ☆ ",
            "description": "iss your ~problematic~ fave |  JON SNOW | CLERITH | CLOUD STRIFE | \n JONERYS | \nMATT MURDOCK | SPACE |  karedevil | kastle | mattelektra | ben poindexter | RICK GRIMES | richonne | CARYL | ichiruki | sasusaku | GAME OF THRONES | aliens | synthwave | the walking dead (1-6) ♥",
            "url": "https://stray-arrows.tumblr.com/",
            "uuid": "t:s0wMvU8xH6AoFIV7_wZFDw",
            "updated": 1561713299
        },
        "id": 181164818677,
        "post_url": "https://stray-arrows.tumblr.com/post/181164818677/the-final-season-of-game-of-thrones-comes-out-in-a",
        "slug": "the-final-season-of-game-of-thrones-comes-out-in-a",
        "date": "2018-12-16 11:05:15 GMT",
        "timestamp": 1544958315,
        "state": "published",
        "format": "html",
        "reblog_key": "Jru89fJf",
        "tags": [
            "game of thrones",
            "got",
            "jon snow",
            "daenerys targaryen",
            "tyrion lannister",
            "jaime lannister",
            "cersei lannister",
            "arya stark",
            "sansa stark",
            "sandor clegane",
            "bran stark",
            "a song of ice and fire",
            "jonerys",
            "got season 8",
            "game of thrones season 8"
        ],
        "short_url": "https://tmblr.co/ZveGhx2ekGy3r",
        "summary": "the final season of game of thrones comes out in a little more than four months and we still don’t have a got dang trailer. wth...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 77,
        "title": null,
        "body": "<p>the final season of game of thrones comes out in a little more than four months and we still don’t have a got dang trailer. wth is going on at hbo. stop starving us</p>",
        "reblog": {
            "comment": "<p>the final season of game of thrones comes out in a little more than four months and we still don’t have a got dang trailer. wth is going on at hbo. stop starving us</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "stray-arrows",
                    "active": true,
                    "theme": {
                        "header_full_width": 604,
                        "header_full_height": 340,
                        "header_focus_width": 604,
                        "header_focus_height": 339,
                        "avatar_shape": "square",
                        "background_color": "#F6F6F6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,604,339,0",
                        "header_image": "https://static.tumblr.com/f0afea764177bbfa85f97cfedcf676d8/rm7knor/dlepr116x/tumblr_static_35jhbxpepi68w40cso8csc8ko.jpg",
                        "header_image_focused": "https://static.tumblr.com/b709c61ac97389a2bc6359acc0c3c969/rm7knor/idepr116y/tumblr_static_tumblr_static_35jhbxpepi68w40cso8csc8ko_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f0afea764177bbfa85f97cfedcf676d8/rm7knor/dlepr116x/tumblr_static_35jhbxpepi68w40cso8csc8ko_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#7f1d1d",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#6f161a",
                        "title_font": "1785 GLC Baskerville",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181164818677"
                },
                "content_raw": "<p>the final season of game of thrones comes out in a little more than four months and we still don’t have a got dang trailer. wth is going on at hbo. stop starving us</p>",
                "content": "<p>the final season of game of thrones comes out in a little more than four months and we still don&rsquo;t have a got dang trailer. wth is going on at hbo. stop starving us</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "agentwhiskeysblog",
        "blog": {
            "name": "agentwhiskeysblog",
            "title": "🥃",
            "description": "",
            "url": "https://agentwhiskeysblog.tumblr.com/",
            "uuid": "t:VfmZFvW3YEMh-anBwIefUw",
            "updated": 1559932502
        },
        "id": 181161818598,
        "post_url": "https://agentwhiskeysblog.tumblr.com/post/181161818598/httpsyoutubeorpnvqujig",
        "slug": "httpsyoutubeorpnvqujig",
        "date": "2018-12-16 07:59:32 GMT",
        "timestamp": 1544947172,
        "state": "published",
        "format": "html",
        "reblog_key": "QGGGSpWQ",
        "tags": [
            "Jon Snow",
            "Game of Thrones",
            "Kit Harington",
            "Toothless",
            "How to Train Your Dragon"
        ],
        "short_url": "https://tmblr.co/ZQOPtj2ek5Vdc",
        "summary": "https://youtu.be/orpnvQ_ujig",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"720\" data-orig-width=\"1280\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pjtkstojW61uc88oz.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pjtkstojW61uc88oz.mp4\",\"type\":\"video/mp4\",\"width\":1280,\"height\":720},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pjtkstojW61uc88oz_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":1280,\"height\":720}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pjtkstojW61uc88oz_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pjtkstojW61uc88oz.mp4\" type=\"video/mp4\"></source></video></figure><p><a href=\"https://youtu.be/orpnvQ_ujig\">https://youtu.be/orpnvQ_ujig</a></p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"720\" data-orig-width=\"1280\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pjtkstojW61uc88oz.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pjtkstojW61uc88oz.mp4\",\"type\":\"video/mp4\",\"width\":1280,\"height\":720},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pjtkstojW61uc88oz_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":1280,\"height\":720}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pjtkstojW61uc88oz_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pjtkstojW61uc88oz.mp4\" type=\"video/mp4\"></source></video></figure><p><a href=\"https://youtu.be/orpnvQ_ujig\">https://youtu.be/orpnvQ_ujig</a></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "agentwhiskeysblog",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#4A4E6D",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/58e0bbbaf79562d9187eebcf1d1b5d05/jp8fwm1/RfFpm5lr0/tumblr_static_-516533761-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/58e0bbbaf79562d9187eebcf1d1b5d05/jp8fwm1/RfFpm5lr0/tumblr_static_-516533761-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/58e0bbbaf79562d9187eebcf1d1b5d05/jp8fwm1/RfFpm5lr0/tumblr_static_-516533761-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#CCB5FF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#CCB6DB",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181161818598"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"720\" data-orig-width=\"1280\" data-npf='{\"type\":\"video\",\"provider\":\"tumblr\",\"url\":\"https://ve.media.tumblr.com/tumblr_pjtkstojW61uc88oz.mp4\",\"media\":{\"url\":\"https://ve.media.tumblr.com/tumblr_pjtkstojW61uc88oz.mp4\",\"type\":\"video/mp4\",\"width\":1280,\"height\":720},\"poster\":[{\"url\":\"https://66.media.tumblr.com/tumblr_pjtkstojW61uc88oz_frame1.jpg\",\"type\":\"image/jpeg\",\"width\":1280,\"height\":720}]}'><video controls=\"controls\" autoplay=\"autoplay\" muted=\"muted\" poster=\"https://66.media.tumblr.com/tumblr_pjtkstojW61uc88oz_frame1.jpg\"><source src=\"https://ve.media.tumblr.com/tumblr_pjtkstojW61uc88oz.mp4\" type=\"video/mp4\"></source></video></figure><p><a href=\"https://youtu.be/orpnvQ_ujig\">https://youtu.be/orpnvQ_ujig</a></p></p>",
                "content": "<p><figure class=\"tmblr-full\" data-npf=\"{&quot;type&quot;:&quot;video&quot;,&quot;provider&quot;:&quot;tumblr&quot;,&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pjtkstojW61uc88oz.mp4&quot;,&quot;media&quot;:{&quot;url&quot;:&quot;https://ve.media.tumblr.com/tumblr_pjtkstojW61uc88oz.mp4&quot;,&quot;type&quot;:&quot;video/mp4&quot;,&quot;width&quot;:1280,&quot;height&quot;:720},&quot;poster&quot;:[{&quot;url&quot;:&quot;https://66.media.tumblr.com/tumblr_pjtkstojW61uc88oz_frame1.jpg&quot;,&quot;type&quot;:&quot;image/jpeg&quot;,&quot;width&quot;:1280,&quot;height&quot;:720}]}\"></figure><p><a href=\"https://youtu.be/orpnvQ_ujig\">https://youtu.be/orpnvQ_ujig</a></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "gendrydragon",
        "blog": {
            "name": "gendrydragon",
            "title": "Morgana",
            "description": "<p>Still bitter that the best character was killed off. Yes, I’m talking about Robb. Sansa is my queen. Jon never deserved ghost. Don’t hate me. </p>",
            "url": "https://gendrydragon.tumblr.com/",
            "uuid": "t:22Gl8EdZJ84w67OR6_iyfA",
            "updated": 1558319112
        },
        "id": 181161118761,
        "post_url": "https://gendrydragon.tumblr.com/post/181161118761/okay-so-what-if-dany-dies-this-season-and-we-get",
        "slug": "okay-so-what-if-dany-dies-this-season-and-we-get",
        "date": "2018-12-16 07:18:44 GMT",
        "timestamp": 1544944724,
        "state": "published",
        "format": "html",
        "reblog_key": "dJL4JSKR",
        "tags": [
            "got",
            "game of thrones",
            "jon snow",
            "theory",
            "dragons",
            "tyrion"
        ],
        "short_url": "https://tmblr.co/Z9neiX2ek2qmf",
        "summary": "Okay so what if Dany dies this season and we get Jon and, possibly, Tyrion as dragon-riders?",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": null,
        "body": "<h1>Okay so what if Dany dies this season and we get Jon and, possibly, Tyrion as dragon-riders? </h1><h1>It’s been hinted in the books that we’ll get Tyrion to be a rider, so it makes sense to me that if someone would ever ride Rhaegal, it would be him. </h1><h1>And why not Jon? It’s getting clearer and clearer that he is the star of the show and I get the feeling we’re about to (sadly) watch Dany’s doom. </h1><h1>If Drogon is the reincarnation of Balerion it makes sense that the Prince that was Promised rides him. </h1><h1>Besides, there’s&hellip; that:</h1><h1><br/></h1><figure class=\"tmblr-full\" data-orig-height=\"338\" data-orig-width=\"600\" data-tumblr-attribution=\"itsfuckingvampire:zFWc7T0fxRge59Fe97WaMQ:ZSYqFm2OfZ12f\"><img src=\"https://66.media.tumblr.com/43177164fe8875a5aae6d2f1bb4f3fd5/tumblr_oubhu7QoR51u1sg7xo1_640.gif\" data-orig-height=\"338\" data-orig-width=\"600\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"225\" data-orig-width=\"400\" data-tumblr-attribution=\"giantmonster:Li6NtW4O3NHi5FHiYyMbRw:ZMaMHx2Ov0hRq\"><img src=\"https://66.media.tumblr.com/0a18ac63b44f81d62c2ff4ae9b187fc0/tumblr_ounudgx4Yp1qmob6ro1_400.gif\" data-orig-height=\"225\" data-orig-width=\"400\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"183\" data-orig-width=\"268\" data-tumblr-attribution=\"monticue21:PAdFsFtzWNphkRo5dbe24A:ZE-Fks2OucxT-\"><img src=\"https://66.media.tumblr.com/7a8e17d47106a792d4050375b8c13122/tumblr_ounkq8BWTw1s8en0ro1_400.gif\" data-orig-height=\"183\" data-orig-width=\"268\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"183\" data-orig-width=\"268\" data-tumblr-attribution=\"dominobambino13:iQDgz8XmAVnprju92yGrYg:Zv46gr2OwOgGY\"><img src=\"https://66.media.tumblr.com/b15056ef5a95b4b78ed7c767259ee3d5/tumblr_oup1nwOWF71swr7fmo1_400.gif\" data-orig-height=\"183\" data-orig-width=\"268\"/></figure>",
        "reblog": {
            "comment": "<p><h1>Okay so what if Dany dies this season and we get Jon and, possibly, Tyrion as dragon-riders? </h1><h1>It’s been hinted in the books that we’ll get Tyrion to be a rider, so it makes sense to me that if someone would ever ride Rhaegal, it would be him. </h1><h1>And why not Jon? It’s getting clearer and clearer that he is the star of the show and I get the feeling we’re about to (sadly) watch Dany’s doom. </h1><h1>If Drogon is the reincarnation of Balerion it makes sense that the Prince that was Promised rides him. </h1><h1>Besides, there’s… that:</h1><h1><br></h1><figure class=\"tmblr-full\" data-orig-height=\"338\" data-orig-width=\"600\" data-tumblr-attribution=\"itsfuckingvampire:zFWc7T0fxRge59Fe97WaMQ:ZSYqFm2OfZ12f\"><img src=\"https://66.media.tumblr.com/43177164fe8875a5aae6d2f1bb4f3fd5/tumblr_oubhu7QoR51u1sg7xo1_640.gif\" data-orig-height=\"338\" data-orig-width=\"600\"></figure><figure class=\"tmblr-full\" data-orig-height=\"225\" data-orig-width=\"400\" data-tumblr-attribution=\"giantmonster:Li6NtW4O3NHi5FHiYyMbRw:ZMaMHx2Ov0hRq\"><img src=\"https://66.media.tumblr.com/0a18ac63b44f81d62c2ff4ae9b187fc0/tumblr_ounudgx4Yp1qmob6ro1_400.gif\" data-orig-height=\"225\" data-orig-width=\"400\"></figure><figure class=\"tmblr-full\" data-orig-height=\"183\" data-orig-width=\"268\" data-tumblr-attribution=\"monticue21:PAdFsFtzWNphkRo5dbe24A:ZE-Fks2OucxT-\"><img src=\"https://66.media.tumblr.com/7a8e17d47106a792d4050375b8c13122/tumblr_ounkq8BWTw1s8en0ro1_400.gif\" data-orig-height=\"183\" data-orig-width=\"268\"></figure><figure class=\"tmblr-full\" data-orig-height=\"183\" data-orig-width=\"268\" data-tumblr-attribution=\"dominobambino13:iQDgz8XmAVnprju92yGrYg:Zv46gr2OwOgGY\"><img src=\"https://66.media.tumblr.com/b15056ef5a95b4b78ed7c767259ee3d5/tumblr_oup1nwOWF71swr7fmo1_400.gif\" data-orig-height=\"183\" data-orig-width=\"268\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "gendrydragon",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 426,
                        "header_focus_width": 598,
                        "header_focus_height": 337,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "81,936,418,338",
                        "header_image": "https://static.tumblr.com/6a8b9ca1295837c27b08e2d4448c1cfc/89jh0kc/fv0pjtili/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/6a8b9ca1295837c27b08e2d4448c1cfc/89jh0kc/4YTpjtilj/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/6a8b9ca1295837c27b08e2d4448c1cfc/89jh0kc/fv0pjtili/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181161118761"
                },
                "content_raw": "<p><h1>Okay so what if Dany dies this season and we get Jon and, possibly, Tyrion as dragon-riders? </h1><h1>It’s been hinted in the books that we’ll get Tyrion to be a rider, so it makes sense to me that if someone would ever ride Rhaegal, it would be him. </h1><h1>And why not Jon? It’s getting clearer and clearer that he is the star of the show and I get the feeling we’re about to (sadly) watch Dany’s doom. </h1><h1>If Drogon is the reincarnation of Balerion it makes sense that the Prince that was Promised rides him. </h1><h1>Besides, there’s… that:</h1><h1><br></h1><figure class=\"tmblr-full\" data-orig-height=\"338\" data-orig-width=\"600\" data-tumblr-attribution=\"itsfuckingvampire:zFWc7T0fxRge59Fe97WaMQ:ZSYqFm2OfZ12f\"><img src=\"https://66.media.tumblr.com/43177164fe8875a5aae6d2f1bb4f3fd5/tumblr_oubhu7QoR51u1sg7xo1_640.gif\" data-orig-height=\"338\" data-orig-width=\"600\"></figure><figure class=\"tmblr-full\" data-orig-height=\"225\" data-orig-width=\"400\" data-tumblr-attribution=\"giantmonster:Li6NtW4O3NHi5FHiYyMbRw:ZMaMHx2Ov0hRq\"><img src=\"https://66.media.tumblr.com/0a18ac63b44f81d62c2ff4ae9b187fc0/tumblr_ounudgx4Yp1qmob6ro1_400.gif\" data-orig-height=\"225\" data-orig-width=\"400\"></figure><figure class=\"tmblr-full\" data-orig-height=\"183\" data-orig-width=\"268\" data-tumblr-attribution=\"monticue21:PAdFsFtzWNphkRo5dbe24A:ZE-Fks2OucxT-\"><img src=\"https://66.media.tumblr.com/7a8e17d47106a792d4050375b8c13122/tumblr_ounkq8BWTw1s8en0ro1_400.gif\" data-orig-height=\"183\" data-orig-width=\"268\"></figure><figure class=\"tmblr-full\" data-orig-height=\"183\" data-orig-width=\"268\" data-tumblr-attribution=\"dominobambino13:iQDgz8XmAVnprju92yGrYg:Zv46gr2OwOgGY\"><img src=\"https://66.media.tumblr.com/b15056ef5a95b4b78ed7c767259ee3d5/tumblr_oup1nwOWF71swr7fmo1_400.gif\" data-orig-height=\"183\" data-orig-width=\"268\"></figure></p>",
                "content": "<p><h1>Okay so what if Dany dies this season and we get Jon and, possibly, Tyrion as dragon-riders? </h1><h1>It&rsquo;s been hinted in the books that we&rsquo;ll get Tyrion to be a rider, so it makes sense to me that if someone would ever ride Rhaegal, it would be him. </h1><h1>And why not Jon? It&rsquo;s getting clearer and clearer that he is the star of the show and I get the feeling we&rsquo;re about to (sadly) watch Dany&rsquo;s doom. </h1><h1>If Drogon is the reincarnation of Balerion it makes sense that the Prince that was Promised rides him. </h1><h1>Besides, there&rsquo;s&hellip; that:</h1><h1><br /></h1><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><figure data-tumblr-media-id=\"1\" class=\"tmblr-full\"></figure><figure data-tumblr-media-id=\"2\" class=\"tmblr-full\"></figure><figure data-tumblr-media-id=\"3\" class=\"tmblr-full\"></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "asoiafrarepairs",
        "blog": {
            "name": "asoiafrarepairs",
            "title": "Asoiaf Rarepairs",
            "description": "Is your OTP overlooked by the fandom? Is there any pairing you wish you could find more content for? Do you like a good crackship? \nHave we got the blog for you!\nAll ships are welcome here, so long as they have fewer than 500 fics on AO3.\ntracking #asoiafrare\nclick here for prompts",
            "url": "https://asoiafrarepairs.tumblr.com/",
            "uuid": "t:Ug4SRhQ3eVFIG7fdzeQEGQ",
            "updated": 1561689716
        },
        "id": 181158669432,
        "post_url": "https://asoiafrarepairs.tumblr.com/post/181158669432/catelyn-starkjon-snow-he-shall-get-a-last-name",
        "slug": "catelyn-starkjon-snow-he-shall-get-a-last-name",
        "date": "2018-12-16 05:15:59 GMT",
        "timestamp": 1544937359,
        "state": "published",
        "format": "html",
        "reblog_key": "JGLqKaeX",
        "tags": [
            "catelyn x jon",
            "jon x catelyn",
            "catelyn stark",
            "jon snow",
            "prompts",
            "asoiaf",
            "game of thrones"
        ],
        "short_url": "https://tmblr.co/ZmQiKa2ejvUnu",
        "summary": "Catelyn Stark/Jon Snow. he shall get a last name but he has to marry his fathers widow",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 2,
        "asking_name": "Anonymous",
        "asking_url": null,
        "question": "Catelyn Stark/Jon Snow. he shall get a last name but he has to marry his fathers widow",
        "answer": "<p>\n\nAdded to our <a href=\"https://asoiafrarepairs.tumblr.com/prompts\">prompt page!</a>\n\n<br/></p>",
        "reblog": {
            "comment": "<p>\n\nAdded to our <a href=\"https://asoiafrarepairs.tumblr.com/prompts\">prompt page!</a>\n\n<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "asoiafrarepairs",
                    "active": true,
                    "theme": {
                        "header_full_width": 583,
                        "header_full_height": 327,
                        "header_focus_width": 582,
                        "header_focus_height": 327,
                        "avatar_shape": "circle",
                        "background_color": "#5c5e2b",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,582,327,0",
                        "header_image": "https://static.tumblr.com/0caf386ea0ec5d15dbab205d3063b997/viho0pj/m6wpsfjj4/tumblr_static_22nmacmo2cg0884sssc0k4oc4.gif",
                        "header_image_focused": "https://static.tumblr.com/0caf386ea0ec5d15dbab205d3063b997/viho0pj/diJpsfjj8/tumblr_static_tumblr_static_22nmacmo2cg0884sssc0k4oc4_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/0caf386ea0ec5d15dbab205d3063b997/viho0pj/m6wpsfjj4/tumblr_static_22nmacmo2cg0884sssc0k4oc4_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#F6F6F6",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#F6F6F6",
                        "title_font": "Typewriter FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181158669432"
                },
                "content_raw": "<p>\n\nAdded to our <a href=\"https://asoiafrarepairs.tumblr.com/prompts\">prompt page!</a>\n\n<br></p>",
                "content": "<p>\n\nAdded to our <a href=\"https://asoiafrarepairs.tumblr.com/prompts\">prompt page!</a>\n\n<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "ayumichans-art",
        "blog": {
            "name": "ayumichans-art",
            "title": "hkrs' art corner",
            "description": "<b>* PLEASE DO NOT REPOST MY ART ANYWHERE. I'LL NOT GIVE PERMISSION. *</b>\n<br>\n\"I recognize the council has made a decision. But given that it's a STUPID ASS decision, I've elected to ignore it.\"\n<br>\n<i>-- Nick Fury, A Legend</i>\n<br>\n<u>This blog is pretty random.</u>",
            "url": "https://ayumichans-art.tumblr.com/",
            "uuid": "t:Ho_v_C3LXTRp-wuCRXVOlg",
            "updated": 1560901591
        },
        "id": 181157194866,
        "post_url": "https://ayumichans-art.tumblr.com/post/181157194866/dna-doesnt-make-a-family-am-i-obsessing-over",
        "slug": "dna-doesnt-make-a-family-am-i-obsessing-over",
        "date": "2018-12-16 04:12:42 GMT",
        "timestamp": 1544933562,
        "state": "published",
        "format": "html",
        "reblog_key": "S4T55PlP",
        "tags": [
            "mya stone",
            "jon snow",
            "asoiaf art",
            "asoiaf modern au",
            "asoiaf",
            "bg lyabert",
            "bc of course there is. how else will they grow up together?"
        ],
        "short_url": "https://tmblr.co/ZGpMwi2ejpsno",
        "summary": "“dna doesn’t make a family.” am i obsessing over these two growing up together? yes. yes i am.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 83,
        "caption": "<blockquote><p><i>“dna doesn’t make a family.”</i></p></blockquote><p>am i obsessing over these two growing up together? yes. yes i am.</p>",
        "reblog": {
            "comment": "<p><blockquote><p><i>“dna doesn’t make a family.”</i></p></blockquote><p>am i obsessing over these two growing up together? yes. yes i am.</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ayumichans-art",
                    "active": true,
                    "theme": {
                        "header_full_width": 499,
                        "header_full_height": 280,
                        "header_focus_width": 498,
                        "header_focus_height": 280,
                        "avatar_shape": "circle",
                        "background_color": "#C6B9E0",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,498,280,0",
                        "header_image": "https://static.tumblr.com/83151fd7045db0ac7c73167ca87e64fb/h5xpxos/6Cooh2t9n/tumblr_static_6vmt54pcrq0wsg48wcos4cokc.gif",
                        "header_image_focused": "https://static.tumblr.com/83151fd7045db0ac7c73167ca87e64fb/h5xpxos/12Eoh2t9t/tumblr_static_tumblr_static_6vmt54pcrq0wsg48wcos4cokc_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/83151fd7045db0ac7c73167ca87e64fb/h5xpxos/6Cooh2t9n/tumblr_static_6vmt54pcrq0wsg48wcos4cokc_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#FFD731",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFE26B",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "181157194866"
                },
                "content_raw": "<p><blockquote><p><i>“dna doesn’t make a family.”</i></p></blockquote><p>am i obsessing over these two growing up together? yes. yes i am.</p></p>",
                "content": "<p><blockquote><p><i>&ldquo;dna doesn&rsquo;t make a family.&rdquo;</i></p></blockquote><p>am i obsessing over these two growing up together? yes. yes i am.</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://ayumichans-art.tumblr.com/image/181157194866",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/aa2548defdfe973fc4f81c61c68f4651/tumblr_pjtad6Ot371ule71bo1_1280.png",
                    "width": 768,
                    "height": 1024
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/aa2548defdfe973fc4f81c61c68f4651/tumblr_pjtad6Ot371ule71bo1_1280.png",
                        "width": 768,
                        "height": 1024
                    },
                    {
                        "url": "https://66.media.tumblr.com/aa2548defdfe973fc4f81c61c68f4651/tumblr_pjtad6Ot371ule71bo1_640.png",
                        "width": 640,
                        "height": 853
                    },
                    {
                        "url": "https://66.media.tumblr.com/aa2548defdfe973fc4f81c61c68f4651/tumblr_pjtad6Ot371ule71bo1_540.png",
                        "width": 540,
                        "height": 720
                    },
                    {
                        "url": "https://66.media.tumblr.com/aa2548defdfe973fc4f81c61c68f4651/tumblr_pjtad6Ot371ule71bo1_500.png",
                        "width": 500,
                        "height": 667
                    },
                    {
                        "url": "https://66.media.tumblr.com/aa2548defdfe973fc4f81c61c68f4651/tumblr_pjtad6Ot371ule71bo1_400.png",
                        "width": 400,
                        "height": 533
                    },
                    {
                        "url": "https://66.media.tumblr.com/aa2548defdfe973fc4f81c61c68f4651/tumblr_pjtad6Ot371ule71bo1_250.png",
                        "width": 250,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/aa2548defdfe973fc4f81c61c68f4651/tumblr_pjtad6Ot371ule71bo1_100.png",
                        "width": 100,
                        "height": 133
                    },
                    {
                        "url": "https://66.media.tumblr.com/aa2548defdfe973fc4f81c61c68f4651/tumblr_pjtad6Ot371ule71bo1_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]