[
    {
        "type": "text",
        "blog_name": "wildlingssansa",
        "blog": {
            "name": "wildlingssansa",
            "title": "Jonsnowbrooding - it's me guys ;)",
            "description": "Hi *waves* // Mostly about Game of thrones // Jonsa // my love for Theon Greyjoy // Starkid //It's always sunny in Philadelphia// AMC Preacher // Stranger things // Veep \n// Middle Earth is where I reside.",
            "url": "https://wildlingssansa.tumblr.com/",
            "uuid": "t:GWqwS1RvGAhCVdjxtnS3zQ",
            "updated": 1561758232
        },
        "id": 183101815324,
        "post_url": "https://wildlingssansa.tumblr.com/post/183101815324/gendry-we-lost-arya-sansa-how-what",
        "slug": "gendry-we-lost-arya-sansa-how-what",
        "date": "2019-02-27 21:23:52 GMT",
        "timestamp": 1551302632,
        "state": "published",
        "format": "html",
        "reblog_key": "7VG2VSAG",
        "tags": [
            "jon snow",
            "gendry waters",
            "arya stark",
            "sansa stark",
            "starklings",
            "incorrect got quotes"
        ],
        "short_url": "https://tmblr.co/ZVsstm2gXj-eS",
        "summary": "Gendry: we lost arya !\nSansa: How? What happened?!\nJon: in our defense, she's like 2 ft. tall",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 176,
        "title": null,
        "body": "<p>Gendry: we lost arya !</p><p>Sansa: How? What happened?!</p><p>Jon: in our defense, she&rsquo;s like 2 ft. tall</p>",
        "reblog": {
            "comment": "<p>Gendry: we lost arya !</p><p>Sansa: How? What happened?!</p><p>Jon: in our defense, she’s like 2 ft. tall</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "wildlingssansa",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#F4D0F5",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/b5739ae6969845a952e39b84ef86596e/letbltb/pw1psi675/tumblr_static_dbjxwv72ltwk8kcko0oo0swsk.gif",
                        "header_image_focused": "https://static.tumblr.com/b5739ae6969845a952e39b84ef86596e/letbltb/pw1psi675/tumblr_static_dbjxwv72ltwk8kcko0oo0swsk_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/b5739ae6969845a952e39b84ef86596e/letbltb/pw1psi675/tumblr_static_dbjxwv72ltwk8kcko0oo0swsk_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#78a8e8",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#FF634C",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183101815324"
                },
                "content_raw": "<p>Gendry: we lost arya !</p><p>Sansa: How? What happened?!</p><p>Jon: in our defense, she’s like 2 ft. tall</p>",
                "content": "<p>Gendry: we lost arya !</p><p>Sansa: How? What happened?!</p><p>Jon: in our defense, she&rsquo;s like 2 ft. tall</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "tacitwhisky",
        "blog": {
            "name": "tacitwhisky",
            "title": "Tacit Whisky",
            "description": "I write fanfic. Sometimes it's good. <a href=\"https://archiveofourown.org/users/TacitWhisky/pseuds/TacitWhisky\" rel=\"nofollow\">Check me out on AO3.</a>",
            "url": "https://tacitwhisky.tumblr.com/",
            "uuid": "t:HYCGeH57Wa5N2za8wvZQ1A",
            "updated": 1561741276
        },
        "id": 183101057440,
        "post_url": "https://tacitwhisky.tumblr.com/post/183101057440/jon-of-the-kingsguard-pt-1",
        "slug": "jon-of-the-kingsguard-pt-1",
        "date": "2019-02-27 20:48:05 GMT",
        "timestamp": 1551300485,
        "state": "published",
        "format": "html",
        "reblog_key": "ewQWUYlV",
        "tags": [
            "fanfic",
            "jonsa",
            "jonsafic",
            "gotfic",
            "jon snow",
            "Sansa Stark",
            "jon of the kingsguard"
        ],
        "short_url": "https://tmblr.co/Zj3U0Y2gXh6cW",
        "summary": "Jon of the Kingsguard, pt 1",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 12,
        "title": "Jon of the Kingsguard, pt 1",
        "body": "<p>Jon x Sansa<i> - AU where Jon goes to Kingslanding instead of the Wall, there’s no war, and he becomes a knight of the kingsguard even as Joffrey marries Sansa</i><b> </b>/ <a href=\"https://archiveofourown.org/works/17942843\" target=\"_blank\">AO3 Link</a></p><p><b></b></p><p>Jon speaks the words of the Kingsguard kneeling in a sept of seven glass walls before seven southron gods that are not his own. Barristan Selmy touches his sword to either of Jon’s shoulders and Jon swears to these strange gods to serve a king he hates, to forsake lands and titles and to never sire sons or know a woman’s touch. When it is done, Selmy drapes a white cloak across his shoulders and bids him rise. “Rise as a knight of the Kingsguard,” the old knight tells him, “rise as our brother.”</p><p><i>Rickon. Bran. Robb. Those are my brothers.</i> But that was a life ago in Winterfell, so Jon rises and clasps hands with Selmy and these new southron brothers of his: Jamie Lannister with his glittering eyes, scowling Meryn Trant, silent Arys Oakheart, cold eyed Preston Greenfield, bandy legged Boros Blount.</p><p>“Stand vigil until morning,” Selmy tells him. “Watch the candles and think on your vows. In the morning we will have need of you at the crowning of good King Joffrey and Queen Sansa.”</p><!-- more --><hr><p>Once, Jon had meant to join the Night’s Watch and have black brothers in place of white, but his lord father had only shaken his head when Jon told him. “Before Bran fell you might have gone to the Wall,” Ned had answered. “But things are different now. When the winter wind blows the wolves must gather. And winter is coming.”</p><p><i>Stark words,</i> Jon had thought bitterly, <i>but I am no Stark, or have you forgotten, father?</i></p><p>But there was no arguing with Lord Eddard Stark, and so Jon had bit his tongue and done as he was told. When his father journeyed south as Hand of the King he had followed, a bastard stowed in the baggage train.</p><p>“Show them how fierce we northerners are,” Robb tells him as they clasp hands in the cold of the Winterfell courtyard, snow falling on the horses and riders and servants churning around them. He grins at Jon, just like when they were boys. “And give the girls at court a kiss for me.”</p><p>Jon laughs, but there is a lump in his throat that he cannot seem to swallow. “Tell Bran…” He starts, but he does not know how to finish. He’d wanted to go the tower where Bran lay in a sleep from which he might never wake, but in the end the specter of lady Catelyn’s cold gaze had kept him away. To every woman a bastard was a reminder of the faithlessness and lusts of men, but the bastard of her own husband was a special afront. All his life in a thousand small ways Lady Catelyn had made it plain he was no Stark: a cold look, a terse word, a flattening of lips in displeasure when he mussed Arya’s hair, and he is too afraid that something in him will crack like old brittle ice if she tells him that a bastard like him has no place beside her son’s sickbed. “If Bran wakes…”</p><p>“I’ll tell him you said farewell,” Robb finishes for him, and for a moment he seems already serious and solemn as the lord he will one day be, “when he wakes.”</p><p>The door behind Robb swings open, and Sansa slips out. She’s dressed in what Jon recognizes as her best dress, blue and grey wool fit to the slim of her waist and hips. “Have you seen Arya?” She asks Robb in an aggrieved tone. “The queen’s <i>already</i> in the wheelhouse, and Arya’s supposed to be riding with us.”</p><p>“She’s probably hiding from the queen.” Jon wrinkles his nose. “I know I would.”</p><p>Sansa glances at him as Robb chuckles, brow scrunching as though she’s just remembered he exists. To Jon it seems she’s always looking at him like that. Rickon and Bran and Arya are all too young to truly know what it is for him to be a bastard, but Sansa knows and like her lady mother never forgets. “Do you know where Arya is?” She tosses her hair, the red-bronze sheen of it flashing in the light, a quiver wobbling the edge of her voice. “She’s going to ruin <i>everything</i>.”</p><p>Jon sighs and whistles Ghost to him. It will be worse for Arya if she’s late. “I’ll help you look.”</p><p>Ghost rises to his feet and pads behind Jon as he turns and sets off across the yard. A moment later Jon hears more than sees Sansa hurry to catch up to him. “I don’t know why Arya has to be so difficult,” she says with a huff. “The queen is very gracious to let us ride with her, and Joffrey said he will keep his horse near the wheelhouse as we ride.”</p><p>Jon resists the urge to roll his eyes. “How brave of him to protect you from all the dangers of a king’s procession.”</p><p>“It isn’t a matter of that.” Sansa gives Jon a pitying look, the same she gives him when he steps on Jeyne’s feet during lessons with Winterfell’s master of dance. “It’s courteous of him to offer to attend us at all, and a lord’s courtesies show his true heart.”</p><p>Jon scowls. <i>Joffrey is a little shit,</i> he’d told Arya days before, but he doubts Sansa will laugh the way Arya had if he says it now. Of all his half siblings Sansa is the one Jon’s always understood the least with her love of dances and sewing and songs of knights and maidens. With Arya he could muss her hair or tease her and she would huff or laugh, but not Sansa. She is too like her lady mother with her red Tully hair and distant eyes. Sansa loves her songs of gallant knights and maidens fair, of brave deeds and beautiful ladies, and there are never bastards in songs.</p><p>They reach the stables, and Nymeria pads out to nose Ghost and Lady. Sansa’s nose wrinkles at the sudden scent of horse and hay, and she lifts the hem of her skirts above the churned earth and mud. <i>And where is your prince now,</i> he thinks darkly, <i>or is trudging through mud a job only for bastards?</i> He motions for her to stay. “I’ll fetch Arya,” he tells as he strides into the stables, mud sucking at his boots.</p><p>Inside stable boys bustle about leading horses from their stalls and saddling them while Hullen, Winterfell’s master of horse, stands with his arms crossed before him shouting directions. He catches sight of Jon and waves him to the back of the stable. “Your horse is saddled, Snow. And speak to your sister, gods know I’ve tried.”</p><p>Jon nods his thanks and makes his way back to find Arya perched on a bale of hay. He grins at her. “Hiding, little sister?”</p><p>“No.” Arya scowls. “I was trying to get Hullen to give me a horse. Father is going to make me ride in the wheelhouse with Sansa and the queen.”</p><p>“A wheelhouse sounds warm.” Jon rubs the nose of his horse and lifts the reins from where they’re looped around a post. “I’d much prefer that to riding in the cold.”</p><p>“Arya, come <i>on</i>.” Sansa appears around the edge of the stall, nose still wrinkled, Lady padding beside her. “The queen is already waiting and we’re late.”</p><p>“I don’t care. I want to ride with Jon.”</p><p>“You don’t have a horse, idiot.” Sansa tugs Arya’s sleeve. “Now come <i>on</i>.”</p><p>Arya grumbles but jumps down from the bale of hay, and Jon leads his horse to follow Sansa. Once out in the yard again Sansa makes to walk off, but abruptly turns on her heel and gives Jon a swift courtesy. “Thank you for your aid, Jon.”</p><p>Jon blinks, too surprised to answer, and by the time he opens his mouth Sansa has turned again and is dragging Arya across the yard. The sight of the two of them already beginning to bicker makes Jon grin, but in his chest there is a desperate ache as he pulls himself up into the saddle and looks about the Winterfell yard. How long will it be until he see it again, until they are all like this again? <i>You knew this day would come eventually. Winterfell is the home of the Starks, and you have never been one.</i> And so as he whistles Ghost to him and turns his horse to the gates of Winterfell Jon does not know what to think. Kingslanding is not the Wall, but neither is it Winterfell. Perhaps a bastard could make a name for himself there.</p><hr><p>Weeks they are on the King’s Road, a fat snake of riders with snapping pennants and servants leading wayns heavy with tents and food and wine trickling southward. Every forest or field it seems they must stop for King Robert to go hunting or hawking or whoring. Of his lord father Jon sees little. He is always with the king, a chain of gold interlocking hands hanging heavy from his neck.</p><p>Much of his time Jon spends with the other Winterfell men or Arya. He has little interest in Joffrey or any of the squires and upstart sworn swords he keeps about him. A little shit, he’d called the prince back in Winterfell, and the longer their days on the road grow the truer Jon learns it to be. Joffrey can be gallant, even generous, among others, but when no one is watching his gold face falls away and he mocks and laughs at servants and his lessers.</p><p>It only makes it all the more galling the way Sansa fawns over him, the way she hangs on his every word and jest. Always together they are, a shining prince and his beautiful maid. It is enough to make Jon and Arya shake their heads and pretend to retch when no one is looking. Which often no one is. In Winterfell he’d promised Arya he would teach her what he knew of how to use a sword, and Arya forces him to keep the promise. Jon and her slip away for an hour or two from the camp every day and he shows her how to hold and swing and cut. The only one who notices is Mycah, a butcher’s boy who trails after them to watch some days.</p><p>For a week it lasts. They travel from Moat Cailin to the Trident, and on the day the sun dawns before the Inn of the Kneeling Man it all comes tumbling apart.</p><hr><p>With Jory, the captain of his father’s guard, Jon’s been all day. He still has no idea why his father insisted he journey south with him, but so long as he is he’s determined to learn more of how to be a man. Beside him Ghost’s head shoots up and his lips pull back in a silent snarl. Jon follows his gaze to see Joffrey riding into camp with a bloody arm, Sansa ashen faced beside him.</p><p>A cry goes up from somewhere in the camp, and then chaos consumes it as men swarm around Joffrey and Sansa. Jon pushes his way through the crowd. Sansa’s face is pale, the sleeve of her dress ripped, but her eyes latch onto him. “Jon?” She says faintly.</p><p>Jon shoves back the bannerman looming over Sansa and steps beside her. “What happened?” He asks, and finds himself surprised by the anger thrumming through him. Of course Sansa is his sister, but they have never been close, not like Arya and him. And yet something ugly twists in his chest as he asks, “did someone&hellip;?”</p><p>Sansa’s mouth opens and closes like a gasping fish. “Arya…” She starts, and clutches Jon’s arm. “You have to find-”</p><p>But what he has to find is lost as Joffrey starts shouting. And that’s how the story comes out: of how the Stark girl had set her demon wolf on the young prince and maimed him before escaping. Sansa’s fingers fall from Jon’s arm as she turns to Joffrey, and forgotten again Jon slips back through the crowd to Jory’s side. “We have to find Arya before the Lannister’s do.”</p><p>“Go to your lord father and tell him what’s happened.” Jory pushes Jon toward the king’s tent. “Go. We’ll saddle the horses.”</p><p>As hard as it is in that moment not to simply jump on his horse and go tearing after Arya, Jon nods and does as he’s bid, sprinting away to find Ned.</p><hr><p>Later Jon prefers not to think on all that happened after that: of how he and Jory found Arya miles from camp, of how small she’d felt in his arms as he held her tight, of the anger that boiled up into his chest as she told them with her eyes downcast of what had happened. And of after that, of how her fingers had dug into his arms like a hawk’s talons as they had to throw stones at Nymeria to make her stay away, of how how it felt like he was dragging a knife through his chest as he kneeled in front of Ghost and ran his fingers through his thick white fur a last time, looked in his red eyes and whispered for him to protect Nymeria and go north and find Robb and Bran and the rest of their pack, of how it was like cutting out a part of himself to ride away from where Ghost stood staring at him with his silent eyes as Nymeria slunk in the shadows behind him.</p><p>They brought Arya back to camp and she told her story: that Joffrey and Sansa had found her and the butcher’s boy beside the river playing with sticks, that Joffrey threatened them and Nymeria defended them. A slow fury filled Jon as Joffrey lied and lied and lied again, and Sansa refused to say the truth of what had happened. Never had he thought her possible of this, and he is sorely tempted not to stop Arya when she launches herself at Sansa. But all his anger had turned to cold dread as Cersei demanded Nymeria’s pelt, then Lady’s, and Robert did nothing to stop her.</p><p><i>The man that passes the sentence swings the sword. </i>It is the northern way, and because of it Jon refused to take Arya and the stunned and silent Sansa back to their tent with Jory when his father ordered him to. Instead he’d stayed beside Ned as Jory fetched Ice and stood still and watching until it was done. <i>Father will know if you look away,</i> he’d told Bran only months before when they’d watched sentence passed over the Night’s Watch deserter, and Jon does not blink now. <i>This is your fault.</i> He knows it in that moment more truly than he’s ever known anything in his life. <i>You gave Arya Needle, you encouraged her to play with swords. You’re the one who wasn’t there to watch her. You killed Lady sure as if you swung the sword.</i></p><p>Later he’ll learn of how the Hound ran down and slaughtered the butcher boy, but he is already gone searching for Arya by the time the Hound returns. He ducks through the door of a tent, but in place of Arya he finds Sansa with her knees hugged to her chest in a corner of the tent sobbing into her arm. He pauses, unsure what to do, all the anger he’d felt an hour before fled and cold and gone. “Sansa?” He asks tentatively.</p><p>Sansa looks up at her name, face splotched and red with tears, and before Jon can react she’s running to him, throwing her arms around his chest and clutching him to her, sobbing into his shirt. Jon opens his mouth to speak, but his own eyes are burning and he does not have the words. Instead he raises his arms and awkwardly wraps them around her, holds her as sob after sob wracks her slender frame.</p><p>And then just as sudden as she’d thrown herself at him she is pulling away, pushing him aside and fleeing out into the camp, leaving Jon standing alone and confused in the doorway of the tent.</p><p>He eventually finds Arya hiding in a tree, comforts her best as he can. She blames Sansa and Cersei and Robert, but Jon knows the truth, knows that it should have been him instead of Ned that swung Ice. <i>The man that passes the sentence swings the sword.</i> It’s why the next day Jon refuses to meet Sansa’s red rimmed eyes when they stumble into each other at the door of the tent. She tries to catch his gaze and her lips part as if she’s going to speak, but he mutters an apology and pushes past her before she can, anger and shame coiling in his gut.</p><p>Next Jon sees Sansa she is on her horse beside Joffrey, lovely as a sigh in her blue dress, and when she glances at him her eyes hold the same distant look they always have.</p><p>They never speak of what happened.</p><hr><p><b>AN:</b> This was supposed to be one of those lyrical oneshots that gracefully dip in and out of events and time, but it kind of, uh, grew in the telling. I went back and forth quite a bit on whether I should add the Jonsa tag or not. Ultimately I did decide to put it there (for now), because I think if you’re into Jonsa you’ll enjoy it, but do note that the romantic elements of this story are not at all overt, so fair warning.</p>",
        "body_abstract": "\n<p>Jon x Sansa<i> - AU where Jon goes to Kingslanding instead of the Wall, there&rsquo;s no war, and he becomes a knight of the kingsguard even as Joffrey marries Sansa</i><b>&nbsp;</b>/ <a href=\"https://archiveofourown.org/works/17942843\" target=\"_blank\">AO3 Link</a></p>\n<p><b></b></p>\n<p>Jon speaks the words of the Kingsguard kneeling in a sept of seven glass walls before seven southron gods that are not his own. Barristan Selmy touches his sword to either of Jon&rsquo;s shoulders and Jon swears to these strange gods to serve a king he hates, to forsake lands and titles and to never sire sons or know a woman&rsquo;s touch. When it is done, Selmy drapes a white cloak across his shoulders and bids him rise. &ldquo;Rise as a knight of the Kingsguard,&rdquo; the old knight tells him, &ldquo;rise as our brother.&rdquo;</p>\n<p><i>Rickon. Bran. Robb. Those are my brothers.</i> But that was a life ago in Winterfell, so Jon rises and clasps hands with Selmy and these new southron brothers of his: Jamie Lannister with his glittering eyes, scowling Meryn Trant, silent Arys Oakheart, cold eyed Preston Greenfield, bandy legged Boros Blount.</p>\n<p>&ldquo;Stand vigil until morning,&rdquo; Selmy tells him. &ldquo;Watch the candles and think on your vows. In the morning we will have need of you at the crowning of good King Joffrey and Queen Sansa.&rdquo;</p>\n",
        "reblog": {
            "comment": "<p>Jon x Sansa<i> - AU where Jon goes to Kingslanding instead of the Wall, there’s no war, and he becomes a knight of the kingsguard even as Joffrey marries Sansa</i><b> </b>/ <a href=\"https://archiveofourown.org/works/17942843\" target=\"_blank\">AO3 Link</a></p><p><b></b></p><p>Jon speaks the words of the Kingsguard kneeling in a sept of seven glass walls before seven southron gods that are not his own. Barristan Selmy touches his sword to either of Jon’s shoulders and Jon swears to these strange gods to serve a king he hates, to forsake lands and titles and to never sire sons or know a woman’s touch. When it is done, Selmy drapes a white cloak across his shoulders and bids him rise. “Rise as a knight of the Kingsguard,” the old knight tells him, “rise as our brother.”</p><p><i>Rickon. Bran. Robb. Those are my brothers.</i> But that was a life ago in Winterfell, so Jon rises and clasps hands with Selmy and these new southron brothers of his: Jamie Lannister with his glittering eyes, scowling Meryn Trant, silent Arys Oakheart, cold eyed Preston Greenfield, bandy legged Boros Blount.</p><p>“Stand vigil until morning,” Selmy tells him. “Watch the candles and think on your vows. In the morning we will have need of you at the crowning of good King Joffrey and Queen Sansa.”</p>[[MORE]]<hr><p>Once, Jon had meant to join the Night’s Watch and have black brothers in place of white, but his lord father had only shaken his head when Jon told him. “Before Bran fell you might have gone to the Wall,” Ned had answered. “But things are different now. When the winter wind blows the wolves must gather. And winter is coming.”</p><p><i>Stark words,</i> Jon had thought bitterly, <i>but I am no Stark, or have you forgotten, father?</i></p><p>But there was no arguing with Lord Eddard Stark, and so Jon had bit his tongue and done as he was told. When his father journeyed south as Hand of the King he had followed, a bastard stowed in the baggage train.</p><p>“Show them how fierce we northerners are,” Robb tells him as they clasp hands in the cold of the Winterfell courtyard, snow falling on the horses and riders and servants churning around them. He grins at Jon, just like when they were boys. “And give the girls at court a kiss for me.”</p><p>Jon laughs, but there is a lump in his throat that he cannot seem to swallow. “Tell Bran…” He starts, but he does not know how to finish. He’d wanted to go the tower where Bran lay in a sleep from which he might never wake, but in the end the specter of lady Catelyn’s cold gaze had kept him away. To every woman a bastard was a reminder of the faithlessness and lusts of men, but the bastard of her own husband was a special afront. All his life in a thousand small ways Lady Catelyn had made it plain he was no Stark: a cold look, a terse word, a flattening of lips in displeasure when he mussed Arya’s hair, and he is too afraid that something in him will crack like old brittle ice if she tells him that a bastard like him has no place beside her son’s sickbed. “If Bran wakes…”</p><p>“I’ll tell him you said farewell,” Robb finishes for him, and for a moment he seems already serious and solemn as the lord he will one day be, “when he wakes.”</p><p>The door behind Robb swings open, and Sansa slips out. She’s dressed in what Jon recognizes as her best dress, blue and grey wool fit to the slim of her waist and hips. “Have you seen Arya?” She asks Robb in an aggrieved tone. “The queen’s <i>already</i> in the wheelhouse, and Arya’s supposed to be riding with us.”</p><p>“She’s probably hiding from the queen.” Jon wrinkles his nose. “I know I would.”</p><p>Sansa glances at him as Robb chuckles, brow scrunching as though she’s just remembered he exists. To Jon it seems she’s always looking at him like that. Rickon and Bran and Arya are all too young to truly know what it is for him to be a bastard, but Sansa knows and like her lady mother never forgets. “Do you know where Arya is?” She tosses her hair, the red-bronze sheen of it flashing in the light, a quiver wobbling the edge of her voice. “She’s going to ruin <i>everything</i>.”</p><p>Jon sighs and whistles Ghost to him. It will be worse for Arya if she’s late. “I’ll help you look.”</p><p>Ghost rises to his feet and pads behind Jon as he turns and sets off across the yard. A moment later Jon hears more than sees Sansa hurry to catch up to him. “I don’t know why Arya has to be so difficult,” she says with a huff. “The queen is very gracious to let us ride with her, and Joffrey said he will keep his horse near the wheelhouse as we ride.”</p><p>Jon resists the urge to roll his eyes. “How brave of him to protect you from all the dangers of a king’s procession.”</p><p>“It isn’t a matter of that.” Sansa gives Jon a pitying look, the same she gives him when he steps on Jeyne’s feet during lessons with Winterfell’s master of dance. “It’s courteous of him to offer to attend us at all, and a lord’s courtesies show his true heart.”</p><p>Jon scowls. <i>Joffrey is a little shit,</i> he’d told Arya days before, but he doubts Sansa will laugh the way Arya had if he says it now. Of all his half siblings Sansa is the one Jon’s always understood the least with her love of dances and sewing and songs of knights and maidens. With Arya he could muss her hair or tease her and she would huff or laugh, but not Sansa. She is too like her lady mother with her red Tully hair and distant eyes. Sansa loves her songs of gallant knights and maidens fair, of brave deeds and beautiful ladies, and there are never bastards in songs.</p><p>They reach the stables, and Nymeria pads out to nose Ghost and Lady. Sansa’s nose wrinkles at the sudden scent of horse and hay, and she lifts the hem of her skirts above the churned earth and mud. <i>And where is your prince now,</i> he thinks darkly, <i>or is trudging through mud a job only for bastards?</i> He motions for her to stay. “I’ll fetch Arya,” he tells as he strides into the stables, mud sucking at his boots.</p><p>Inside stable boys bustle about leading horses from their stalls and saddling them while Hullen, Winterfell’s master of horse, stands with his arms crossed before him shouting directions. He catches sight of Jon and waves him to the back of the stable. “Your horse is saddled, Snow. And speak to your sister, gods know I’ve tried.”</p><p>Jon nods his thanks and makes his way back to find Arya perched on a bale of hay. He grins at her. “Hiding, little sister?”</p><p>“No.” Arya scowls. “I was trying to get Hullen to give me a horse. Father is going to make me ride in the wheelhouse with Sansa and the queen.”</p><p>“A wheelhouse sounds warm.” Jon rubs the nose of his horse and lifts the reins from where they’re looped around a post. “I’d much prefer that to riding in the cold.”</p><p>“Arya, come <i>on</i>.” Sansa appears around the edge of the stall, nose still wrinkled, Lady padding beside her. “The queen is already waiting and we’re late.”</p><p>“I don’t care. I want to ride with Jon.”</p><p>“You don’t have a horse, idiot.” Sansa tugs Arya’s sleeve. “Now come <i>on</i>.”</p><p>Arya grumbles but jumps down from the bale of hay, and Jon leads his horse to follow Sansa. Once out in the yard again Sansa makes to walk off, but abruptly turns on her heel and gives Jon a swift courtesy. “Thank you for your aid, Jon.”</p><p>Jon blinks, too surprised to answer, and by the time he opens his mouth Sansa has turned again and is dragging Arya across the yard. The sight of the two of them already beginning to bicker makes Jon grin, but in his chest there is a desperate ache as he pulls himself up into the saddle and looks about the Winterfell yard. How long will it be until he see it again, until they are all like this again? <i>You knew this day would come eventually. Winterfell is the home of the Starks, and you have never been one.</i> And so as he whistles Ghost to him and turns his horse to the gates of Winterfell Jon does not know what to think. Kingslanding is not the Wall, but neither is it Winterfell. Perhaps a bastard could make a name for himself there.</p><hr><p>Weeks they are on the King’s Road, a fat snake of riders with snapping pennants and servants leading wayns heavy with tents and food and wine trickling southward. Every forest or field it seems they must stop for King Robert to go hunting or hawking or whoring. Of his lord father Jon sees little. He is always with the king, a chain of gold interlocking hands hanging heavy from his neck.</p><p>Much of his time Jon spends with the other Winterfell men or Arya. He has little interest in Joffrey or any of the squires and upstart sworn swords he keeps about him. A little shit, he’d called the prince back in Winterfell, and the longer their days on the road grow the truer Jon learns it to be. Joffrey can be gallant, even generous, among others, but when no one is watching his gold face falls away and he mocks and laughs at servants and his lessers.</p><p>It only makes it all the more galling the way Sansa fawns over him, the way she hangs on his every word and jest. Always together they are, a shining prince and his beautiful maid. It is enough to make Jon and Arya shake their heads and pretend to retch when no one is looking. Which often no one is. In Winterfell he’d promised Arya he would teach her what he knew of how to use a sword, and Arya forces him to keep the promise. Jon and her slip away for an hour or two from the camp every day and he shows her how to hold and swing and cut. The only one who notices is Mycah, a butcher’s boy who trails after them to watch some days.</p><p>For a week it lasts. They travel from Moat Cailin to the Trident, and on the day the sun dawns before the Inn of the Kneeling Man it all comes tumbling apart.</p><hr><p>With Jory, the captain of his father’s guard, Jon’s been all day. He still has no idea why his father insisted he journey south with him, but so long as he is he’s determined to learn more of how to be a man. Beside him Ghost’s head shoots up and his lips pull back in a silent snarl. Jon follows his gaze to see Joffrey riding into camp with a bloody arm, Sansa ashen faced beside him.</p><p>A cry goes up from somewhere in the camp, and then chaos consumes it as men swarm around Joffrey and Sansa. Jon pushes his way through the crowd. Sansa’s face is pale, the sleeve of her dress ripped, but her eyes latch onto him. “Jon?” She says faintly.</p><p>Jon shoves back the bannerman looming over Sansa and steps beside her. “What happened?” He asks, and finds himself surprised by the anger thrumming through him. Of course Sansa is his sister, but they have never been close, not like Arya and him. And yet something ugly twists in his chest as he asks, “did someone…?”</p><p>Sansa’s mouth opens and closes like a gasping fish. “Arya…” She starts, and clutches Jon’s arm. “You have to find-”</p><p>But what he has to find is lost as Joffrey starts shouting. And that’s how the story comes out: of how the Stark girl had set her demon wolf on the young prince and maimed him before escaping. Sansa’s fingers fall from Jon’s arm as she turns to Joffrey, and forgotten again Jon slips back through the crowd to Jory’s side. “We have to find Arya before the Lannister’s do.”</p><p>“Go to your lord father and tell him what’s happened.” Jory pushes Jon toward the king’s tent. “Go. We’ll saddle the horses.”</p><p>As hard as it is in that moment not to simply jump on his horse and go tearing after Arya, Jon nods and does as he’s bid, sprinting away to find Ned.</p><hr><p>Later Jon prefers not to think on all that happened after that: of how he and Jory found Arya miles from camp, of how small she’d felt in his arms as he held her tight, of the anger that boiled up into his chest as she told them with her eyes downcast of what had happened. And of after that, of how her fingers had dug into his arms like a hawk’s talons as they had to throw stones at Nymeria to make her stay away, of how how it felt like he was dragging a knife through his chest as he kneeled in front of Ghost and ran his fingers through his thick white fur a last time, looked in his red eyes and whispered for him to protect Nymeria and go north and find Robb and Bran and the rest of their pack, of how it was like cutting out a part of himself to ride away from where Ghost stood staring at him with his silent eyes as Nymeria slunk in the shadows behind him.</p><p>They brought Arya back to camp and she told her story: that Joffrey and Sansa had found her and the butcher’s boy beside the river playing with sticks, that Joffrey threatened them and Nymeria defended them. A slow fury filled Jon as Joffrey lied and lied and lied again, and Sansa refused to say the truth of what had happened. Never had he thought her possible of this, and he is sorely tempted not to stop Arya when she launches herself at Sansa. But all his anger had turned to cold dread as Cersei demanded Nymeria’s pelt, then Lady’s, and Robert did nothing to stop her.</p><p><i>The man that passes the sentence swings the sword. </i>It is the northern way, and because of it Jon refused to take Arya and the stunned and silent Sansa back to their tent with Jory when his father ordered him to. Instead he’d stayed beside Ned as Jory fetched Ice and stood still and watching until it was done. <i>Father will know if you look away,</i> he’d told Bran only months before when they’d watched sentence passed over the Night’s Watch deserter, and Jon does not blink now. <i>This is your fault.</i> He knows it in that moment more truly than he’s ever known anything in his life. <i>You gave Arya Needle, you encouraged her to play with swords. You’re the one who wasn’t there to watch her. You killed Lady sure as if you swung the sword.</i></p><p>Later he’ll learn of how the Hound ran down and slaughtered the butcher boy, but he is already gone searching for Arya by the time the Hound returns. He ducks through the door of a tent, but in place of Arya he finds Sansa with her knees hugged to her chest in a corner of the tent sobbing into her arm. He pauses, unsure what to do, all the anger he’d felt an hour before fled and cold and gone. “Sansa?” He asks tentatively.</p><p>Sansa looks up at her name, face splotched and red with tears, and before Jon can react she’s running to him, throwing her arms around his chest and clutching him to her, sobbing into his shirt. Jon opens his mouth to speak, but his own eyes are burning and he does not have the words. Instead he raises his arms and awkwardly wraps them around her, holds her as sob after sob wracks her slender frame.</p><p>And then just as sudden as she’d thrown herself at him she is pulling away, pushing him aside and fleeing out into the camp, leaving Jon standing alone and confused in the doorway of the tent.</p><p>He eventually finds Arya hiding in a tree, comforts her best as he can. She blames Sansa and Cersei and Robert, but Jon knows the truth, knows that it should have been him instead of Ned that swung Ice. <i>The man that passes the sentence swings the sword.</i> It’s why the next day Jon refuses to meet Sansa’s red rimmed eyes when they stumble into each other at the door of the tent. She tries to catch his gaze and her lips part as if she’s going to speak, but he mutters an apology and pushes past her before she can, anger and shame coiling in his gut.</p><p>Next Jon sees Sansa she is on her horse beside Joffrey, lovely as a sigh in her blue dress, and when she glances at him her eyes hold the same distant look they always have.</p><p>They never speak of what happened.</p><hr><p><b>AN:</b> This was supposed to be one of those lyrical oneshots that gracefully dip in and out of events and time, but it kind of, uh, grew in the telling. I went back and forth quite a bit on whether I should add the Jonsa tag or not. Ultimately I did decide to put it there (for now), because I think if you’re into Jonsa you’ll enjoy it, but do note that the romantic elements of this story are not at all overt, so fair warning.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "tacitwhisky",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/508109dfa59858e607ca6654e2c2fddc/aaatqgt/Cjeps0gwb/tumblr_static_b9s9z6xxvdsg880c8sk84cwsg.jpg",
                        "header_image_focused": "https://static.tumblr.com/508109dfa59858e607ca6654e2c2fddc/aaatqgt/Cjeps0gwb/tumblr_static_b9s9z6xxvdsg880c8sk84cwsg_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/508109dfa59858e607ca6654e2c2fddc/aaatqgt/Cjeps0gwb/tumblr_static_b9s9z6xxvdsg880c8sk84cwsg_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#102029",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183101057440"
                },
                "content_raw": "<p>Jon x Sansa<i> - AU where Jon goes to Kingslanding instead of the Wall, there’s no war, and he becomes a knight of the kingsguard even as Joffrey marries Sansa</i><b> </b>/ <a href=\"https://archiveofourown.org/works/17942843\" target=\"_blank\">AO3 Link</a></p><p><b></b></p><p>Jon speaks the words of the Kingsguard kneeling in a sept of seven glass walls before seven southron gods that are not his own. Barristan Selmy touches his sword to either of Jon’s shoulders and Jon swears to these strange gods to serve a king he hates, to forsake lands and titles and to never sire sons or know a woman’s touch. When it is done, Selmy drapes a white cloak across his shoulders and bids him rise. “Rise as a knight of the Kingsguard,” the old knight tells him, “rise as our brother.”</p><p><i>Rickon. Bran. Robb. Those are my brothers.</i> But that was a life ago in Winterfell, so Jon rises and clasps hands with Selmy and these new southron brothers of his: Jamie Lannister with his glittering eyes, scowling Meryn Trant, silent Arys Oakheart, cold eyed Preston Greenfield, bandy legged Boros Blount.</p><p>“Stand vigil until morning,” Selmy tells him. “Watch the candles and think on your vows. In the morning we will have need of you at the crowning of good King Joffrey and Queen Sansa.”</p>[[MORE]]<hr><p>Once, Jon had meant to join the Night’s Watch and have black brothers in place of white, but his lord father had only shaken his head when Jon told him. “Before Bran fell you might have gone to the Wall,” Ned had answered. “But things are different now. When the winter wind blows the wolves must gather. And winter is coming.”</p><p><i>Stark words,</i> Jon had thought bitterly, <i>but I am no Stark, or have you forgotten, father?</i></p><p>But there was no arguing with Lord Eddard Stark, and so Jon had bit his tongue and done as he was told. When his father journeyed south as Hand of the King he had followed, a bastard stowed in the baggage train.</p><p>“Show them how fierce we northerners are,” Robb tells him as they clasp hands in the cold of the Winterfell courtyard, snow falling on the horses and riders and servants churning around them. He grins at Jon, just like when they were boys. “And give the girls at court a kiss for me.”</p><p>Jon laughs, but there is a lump in his throat that he cannot seem to swallow. “Tell Bran…” He starts, but he does not know how to finish. He’d wanted to go the tower where Bran lay in a sleep from which he might never wake, but in the end the specter of lady Catelyn’s cold gaze had kept him away. To every woman a bastard was a reminder of the faithlessness and lusts of men, but the bastard of her own husband was a special afront. All his life in a thousand small ways Lady Catelyn had made it plain he was no Stark: a cold look, a terse word, a flattening of lips in displeasure when he mussed Arya’s hair, and he is too afraid that something in him will crack like old brittle ice if she tells him that a bastard like him has no place beside her son’s sickbed. “If Bran wakes…”</p><p>“I’ll tell him you said farewell,” Robb finishes for him, and for a moment he seems already serious and solemn as the lord he will one day be, “when he wakes.”</p><p>The door behind Robb swings open, and Sansa slips out. She’s dressed in what Jon recognizes as her best dress, blue and grey wool fit to the slim of her waist and hips. “Have you seen Arya?” She asks Robb in an aggrieved tone. “The queen’s <i>already</i> in the wheelhouse, and Arya’s supposed to be riding with us.”</p><p>“She’s probably hiding from the queen.” Jon wrinkles his nose. “I know I would.”</p><p>Sansa glances at him as Robb chuckles, brow scrunching as though she’s just remembered he exists. To Jon it seems she’s always looking at him like that. Rickon and Bran and Arya are all too young to truly know what it is for him to be a bastard, but Sansa knows and like her lady mother never forgets. “Do you know where Arya is?” She tosses her hair, the red-bronze sheen of it flashing in the light, a quiver wobbling the edge of her voice. “She’s going to ruin <i>everything</i>.”</p><p>Jon sighs and whistles Ghost to him. It will be worse for Arya if she’s late. “I’ll help you look.”</p><p>Ghost rises to his feet and pads behind Jon as he turns and sets off across the yard. A moment later Jon hears more than sees Sansa hurry to catch up to him. “I don’t know why Arya has to be so difficult,” she says with a huff. “The queen is very gracious to let us ride with her, and Joffrey said he will keep his horse near the wheelhouse as we ride.”</p><p>Jon resists the urge to roll his eyes. “How brave of him to protect you from all the dangers of a king’s procession.”</p><p>“It isn’t a matter of that.” Sansa gives Jon a pitying look, the same she gives him when he steps on Jeyne’s feet during lessons with Winterfell’s master of dance. “It’s courteous of him to offer to attend us at all, and a lord’s courtesies show his true heart.”</p><p>Jon scowls. <i>Joffrey is a little shit,</i> he’d told Arya days before, but he doubts Sansa will laugh the way Arya had if he says it now. Of all his half siblings Sansa is the one Jon’s always understood the least with her love of dances and sewing and songs of knights and maidens. With Arya he could muss her hair or tease her and she would huff or laugh, but not Sansa. She is too like her lady mother with her red Tully hair and distant eyes. Sansa loves her songs of gallant knights and maidens fair, of brave deeds and beautiful ladies, and there are never bastards in songs.</p><p>They reach the stables, and Nymeria pads out to nose Ghost and Lady. Sansa’s nose wrinkles at the sudden scent of horse and hay, and she lifts the hem of her skirts above the churned earth and mud. <i>And where is your prince now,</i> he thinks darkly, <i>or is trudging through mud a job only for bastards?</i> He motions for her to stay. “I’ll fetch Arya,” he tells as he strides into the stables, mud sucking at his boots.</p><p>Inside stable boys bustle about leading horses from their stalls and saddling them while Hullen, Winterfell’s master of horse, stands with his arms crossed before him shouting directions. He catches sight of Jon and waves him to the back of the stable. “Your horse is saddled, Snow. And speak to your sister, gods know I’ve tried.”</p><p>Jon nods his thanks and makes his way back to find Arya perched on a bale of hay. He grins at her. “Hiding, little sister?”</p><p>“No.” Arya scowls. “I was trying to get Hullen to give me a horse. Father is going to make me ride in the wheelhouse with Sansa and the queen.”</p><p>“A wheelhouse sounds warm.” Jon rubs the nose of his horse and lifts the reins from where they’re looped around a post. “I’d much prefer that to riding in the cold.”</p><p>“Arya, come <i>on</i>.” Sansa appears around the edge of the stall, nose still wrinkled, Lady padding beside her. “The queen is already waiting and we’re late.”</p><p>“I don’t care. I want to ride with Jon.”</p><p>“You don’t have a horse, idiot.” Sansa tugs Arya’s sleeve. “Now come <i>on</i>.”</p><p>Arya grumbles but jumps down from the bale of hay, and Jon leads his horse to follow Sansa. Once out in the yard again Sansa makes to walk off, but abruptly turns on her heel and gives Jon a swift courtesy. “Thank you for your aid, Jon.”</p><p>Jon blinks, too surprised to answer, and by the time he opens his mouth Sansa has turned again and is dragging Arya across the yard. The sight of the two of them already beginning to bicker makes Jon grin, but in his chest there is a desperate ache as he pulls himself up into the saddle and looks about the Winterfell yard. How long will it be until he see it again, until they are all like this again? <i>You knew this day would come eventually. Winterfell is the home of the Starks, and you have never been one.</i> And so as he whistles Ghost to him and turns his horse to the gates of Winterfell Jon does not know what to think. Kingslanding is not the Wall, but neither is it Winterfell. Perhaps a bastard could make a name for himself there.</p><hr><p>Weeks they are on the King’s Road, a fat snake of riders with snapping pennants and servants leading wayns heavy with tents and food and wine trickling southward. Every forest or field it seems they must stop for King Robert to go hunting or hawking or whoring. Of his lord father Jon sees little. He is always with the king, a chain of gold interlocking hands hanging heavy from his neck.</p><p>Much of his time Jon spends with the other Winterfell men or Arya. He has little interest in Joffrey or any of the squires and upstart sworn swords he keeps about him. A little shit, he’d called the prince back in Winterfell, and the longer their days on the road grow the truer Jon learns it to be. Joffrey can be gallant, even generous, among others, but when no one is watching his gold face falls away and he mocks and laughs at servants and his lessers.</p><p>It only makes it all the more galling the way Sansa fawns over him, the way she hangs on his every word and jest. Always together they are, a shining prince and his beautiful maid. It is enough to make Jon and Arya shake their heads and pretend to retch when no one is looking. Which often no one is. In Winterfell he’d promised Arya he would teach her what he knew of how to use a sword, and Arya forces him to keep the promise. Jon and her slip away for an hour or two from the camp every day and he shows her how to hold and swing and cut. The only one who notices is Mycah, a butcher’s boy who trails after them to watch some days.</p><p>For a week it lasts. They travel from Moat Cailin to the Trident, and on the day the sun dawns before the Inn of the Kneeling Man it all comes tumbling apart.</p><hr><p>With Jory, the captain of his father’s guard, Jon’s been all day. He still has no idea why his father insisted he journey south with him, but so long as he is he’s determined to learn more of how to be a man. Beside him Ghost’s head shoots up and his lips pull back in a silent snarl. Jon follows his gaze to see Joffrey riding into camp with a bloody arm, Sansa ashen faced beside him.</p><p>A cry goes up from somewhere in the camp, and then chaos consumes it as men swarm around Joffrey and Sansa. Jon pushes his way through the crowd. Sansa’s face is pale, the sleeve of her dress ripped, but her eyes latch onto him. “Jon?” She says faintly.</p><p>Jon shoves back the bannerman looming over Sansa and steps beside her. “What happened?” He asks, and finds himself surprised by the anger thrumming through him. Of course Sansa is his sister, but they have never been close, not like Arya and him. And yet something ugly twists in his chest as he asks, “did someone…?”</p><p>Sansa’s mouth opens and closes like a gasping fish. “Arya…” She starts, and clutches Jon’s arm. “You have to find-”</p><p>But what he has to find is lost as Joffrey starts shouting. And that’s how the story comes out: of how the Stark girl had set her demon wolf on the young prince and maimed him before escaping. Sansa’s fingers fall from Jon’s arm as she turns to Joffrey, and forgotten again Jon slips back through the crowd to Jory’s side. “We have to find Arya before the Lannister’s do.”</p><p>“Go to your lord father and tell him what’s happened.” Jory pushes Jon toward the king’s tent. “Go. We’ll saddle the horses.”</p><p>As hard as it is in that moment not to simply jump on his horse and go tearing after Arya, Jon nods and does as he’s bid, sprinting away to find Ned.</p><hr><p>Later Jon prefers not to think on all that happened after that: of how he and Jory found Arya miles from camp, of how small she’d felt in his arms as he held her tight, of the anger that boiled up into his chest as she told them with her eyes downcast of what had happened. And of after that, of how her fingers had dug into his arms like a hawk’s talons as they had to throw stones at Nymeria to make her stay away, of how how it felt like he was dragging a knife through his chest as he kneeled in front of Ghost and ran his fingers through his thick white fur a last time, looked in his red eyes and whispered for him to protect Nymeria and go north and find Robb and Bran and the rest of their pack, of how it was like cutting out a part of himself to ride away from where Ghost stood staring at him with his silent eyes as Nymeria slunk in the shadows behind him.</p><p>They brought Arya back to camp and she told her story: that Joffrey and Sansa had found her and the butcher’s boy beside the river playing with sticks, that Joffrey threatened them and Nymeria defended them. A slow fury filled Jon as Joffrey lied and lied and lied again, and Sansa refused to say the truth of what had happened. Never had he thought her possible of this, and he is sorely tempted not to stop Arya when she launches herself at Sansa. But all his anger had turned to cold dread as Cersei demanded Nymeria’s pelt, then Lady’s, and Robert did nothing to stop her.</p><p><i>The man that passes the sentence swings the sword. </i>It is the northern way, and because of it Jon refused to take Arya and the stunned and silent Sansa back to their tent with Jory when his father ordered him to. Instead he’d stayed beside Ned as Jory fetched Ice and stood still and watching until it was done. <i>Father will know if you look away,</i> he’d told Bran only months before when they’d watched sentence passed over the Night’s Watch deserter, and Jon does not blink now. <i>This is your fault.</i> He knows it in that moment more truly than he’s ever known anything in his life. <i>You gave Arya Needle, you encouraged her to play with swords. You’re the one who wasn’t there to watch her. You killed Lady sure as if you swung the sword.</i></p><p>Later he’ll learn of how the Hound ran down and slaughtered the butcher boy, but he is already gone searching for Arya by the time the Hound returns. He ducks through the door of a tent, but in place of Arya he finds Sansa with her knees hugged to her chest in a corner of the tent sobbing into her arm. He pauses, unsure what to do, all the anger he’d felt an hour before fled and cold and gone. “Sansa?” He asks tentatively.</p><p>Sansa looks up at her name, face splotched and red with tears, and before Jon can react she’s running to him, throwing her arms around his chest and clutching him to her, sobbing into his shirt. Jon opens his mouth to speak, but his own eyes are burning and he does not have the words. Instead he raises his arms and awkwardly wraps them around her, holds her as sob after sob wracks her slender frame.</p><p>And then just as sudden as she’d thrown herself at him she is pulling away, pushing him aside and fleeing out into the camp, leaving Jon standing alone and confused in the doorway of the tent.</p><p>He eventually finds Arya hiding in a tree, comforts her best as he can. She blames Sansa and Cersei and Robert, but Jon knows the truth, knows that it should have been him instead of Ned that swung Ice. <i>The man that passes the sentence swings the sword.</i> It’s why the next day Jon refuses to meet Sansa’s red rimmed eyes when they stumble into each other at the door of the tent. She tries to catch his gaze and her lips part as if she’s going to speak, but he mutters an apology and pushes past her before she can, anger and shame coiling in his gut.</p><p>Next Jon sees Sansa she is on her horse beside Joffrey, lovely as a sigh in her blue dress, and when she glances at him her eyes hold the same distant look they always have.</p><p>They never speak of what happened.</p><hr><p><b>AN:</b> This was supposed to be one of those lyrical oneshots that gracefully dip in and out of events and time, but it kind of, uh, grew in the telling. I went back and forth quite a bit on whether I should add the Jonsa tag or not. Ultimately I did decide to put it there (for now), because I think if you’re into Jonsa you’ll enjoy it, but do note that the romantic elements of this story are not at all overt, so fair warning.</p>",
                "content": "<p>Jon x Sansa<i> - AU where Jon goes to Kingslanding instead of the Wall, there&rsquo;s no war, and he becomes a knight of the kingsguard even as Joffrey marries Sansa</i><b>&nbsp;</b>/ <a href=\"https://archiveofourown.org/works/17942843\" target=\"_blank\">AO3 Link</a></p><p><b></b></p><p>Jon speaks the words of the Kingsguard kneeling in a sept of seven glass walls before seven southron gods that are not his own. Barristan Selmy touches his sword to either of Jon&rsquo;s shoulders and Jon swears to these strange gods to serve a king he hates, to forsake lands and titles and to never sire sons or know a woman&rsquo;s touch. When it is done, Selmy drapes a white cloak across his shoulders and bids him rise. &ldquo;Rise as a knight of the Kingsguard,&rdquo; the old knight tells him, &ldquo;rise as our brother.&rdquo;</p><p><i>Rickon. Bran. Robb. Those are my brothers.</i> But that was a life ago in Winterfell, so Jon rises and clasps hands with Selmy and these new southron brothers of his: Jamie Lannister with his glittering eyes, scowling Meryn Trant, silent Arys Oakheart, cold eyed Preston Greenfield, bandy legged Boros Blount.</p><p>&ldquo;Stand vigil until morning,&rdquo; Selmy tells him. &ldquo;Watch the candles and think on your vows. In the morning we will have need of you at the crowning of good King Joffrey and Queen Sansa.&rdquo;</p><hr /><p>Once, Jon had meant to join the Night&rsquo;s Watch and have black brothers in place of white, but his lord father had only shaken his head when Jon told him. &ldquo;Before Bran fell you might have gone to the Wall,&rdquo; Ned had answered. &ldquo;But things are different now. When the winter wind blows the wolves must gather. And winter is coming.&rdquo;</p><p><i>Stark words,</i> Jon had thought bitterly, <i>but I am no Stark, or have you forgotten, father?</i></p><p>But there was no arguing with Lord Eddard Stark, and so Jon had bit his tongue and done as he was told. When his father journeyed south as Hand of the King he had followed, a bastard stowed in the baggage train.</p><p>&ldquo;Show them how fierce we northerners are,&rdquo; Robb tells him as they clasp hands in the cold of the Winterfell courtyard, snow falling on the horses and riders and servants churning around them. He grins at Jon, just like when they were boys. &ldquo;And give the girls at court a kiss for me.&rdquo;</p><p>Jon laughs, but there is a lump in his throat that he cannot seem to swallow. &ldquo;Tell Bran&hellip;&rdquo; He starts, but he does not know how to finish. He&rsquo;d wanted to go the tower where Bran lay in a sleep from which he might never wake, but in the end the specter of lady Catelyn&rsquo;s cold gaze had kept him away. To every woman a bastard was a reminder of the faithlessness and lusts of men, but the bastard of her own husband was a special afront. All his life in a thousand small ways Lady Catelyn had made it plain he was no Stark: a cold look, a terse word, a flattening of lips in displeasure when he mussed Arya&rsquo;s hair, and he is too afraid that something in him will crack like old brittle ice if she tells him that a bastard like him has no place beside her son&rsquo;s sickbed. &ldquo;If Bran wakes&hellip;&rdquo;</p><p>&ldquo;I&rsquo;ll tell him you said farewell,&rdquo; Robb finishes for him, and for a moment he seems already serious and solemn as the lord he will one day be, &ldquo;when he wakes.&rdquo;</p><p>The door behind Robb swings open, and Sansa slips out. She&rsquo;s dressed in what Jon recognizes as her best dress, blue and grey wool fit to the slim of her waist and hips. &ldquo;Have you seen Arya?&rdquo; She asks Robb in an aggrieved tone. &ldquo;The queen&rsquo;s <i>already</i> in the wheelhouse, and Arya&rsquo;s supposed to be riding with us.&rdquo;</p><p>&ldquo;She&rsquo;s probably hiding from the queen.&rdquo; Jon wrinkles his nose. &ldquo;I know I would.&rdquo;</p><p>Sansa glances at him as Robb chuckles, brow scrunching as though she&rsquo;s just remembered he exists. To Jon it seems she&rsquo;s always looking at him like that. Rickon and Bran and Arya are all too young to truly know what it is for him to be a bastard, but Sansa knows and like her lady mother never forgets. &ldquo;Do you know where Arya is?&rdquo; She tosses her hair, the red-bronze sheen of it flashing in the light, a quiver wobbling the edge of her voice. &ldquo;She&rsquo;s going to ruin <i>everything</i>.&rdquo;</p><p>Jon sighs and whistles Ghost to him. It will be worse for Arya if she&rsquo;s late. &ldquo;I&rsquo;ll help you look.&rdquo;</p><p>Ghost rises to his feet and pads behind Jon as he turns and sets off across the yard. A moment later Jon hears more than sees Sansa hurry to catch up to him. &ldquo;I don&rsquo;t know why Arya has to be so difficult,&rdquo; she says with a huff. &ldquo;The queen is very gracious to let us ride with her, and Joffrey said he will keep his horse near the wheelhouse as we ride.&rdquo;</p><p>Jon resists the urge to roll his eyes. &ldquo;How brave of him to protect you from all the dangers of a king&rsquo;s procession.&rdquo;</p><p>&ldquo;It isn&rsquo;t a matter of that.&rdquo; Sansa gives Jon a pitying look, the same she gives him when he steps on Jeyne&rsquo;s feet during lessons with Winterfell&rsquo;s master of dance. &ldquo;It&rsquo;s courteous of him to offer to attend us at all, and a lord&rsquo;s courtesies show his true heart.&rdquo;</p><p>Jon scowls. <i>Joffrey is a little shit,</i> he&rsquo;d told Arya days before, but he doubts Sansa will laugh the way Arya had if he says it now. Of all his half siblings Sansa is the one Jon&rsquo;s always understood the least with her love of dances and sewing and songs of knights and maidens. With Arya he could muss her hair or tease her and she would huff or laugh, but not Sansa. She is too like her lady mother with her red Tully hair and distant eyes. Sansa loves her songs of gallant knights and maidens fair, of brave deeds and beautiful ladies, and there are never bastards in songs.</p><p>They reach the stables, and Nymeria pads out to nose Ghost and Lady. Sansa&rsquo;s nose wrinkles at the sudden scent of horse and hay, and she lifts the hem of her skirts above the churned earth and mud. <i>And where is your prince now,</i> he thinks darkly, <i>or is trudging through mud a job only for bastards?</i> He motions for her to stay. &ldquo;I&rsquo;ll fetch Arya,&rdquo; he tells as he strides into the stables, mud sucking at his boots.</p><p>Inside stable boys bustle about leading horses from their stalls and saddling them while Hullen, Winterfell&rsquo;s master of horse, stands with his arms crossed before him shouting directions. He catches sight of Jon and waves him to the back of the stable. &ldquo;Your horse is saddled, Snow. And speak to your sister, gods know I&rsquo;ve tried.&rdquo;</p><p>Jon nods his thanks and makes his way back to find Arya perched on a bale of hay. He grins at her. &ldquo;Hiding, little sister?&rdquo;</p><p>&ldquo;No.&rdquo; Arya scowls. &ldquo;I was trying to get Hullen to give me a horse. Father is going to make me ride in the wheelhouse with Sansa and the queen.&rdquo;</p><p>&ldquo;A wheelhouse sounds warm.&rdquo; Jon rubs the nose of his horse and lifts the reins from where they&rsquo;re looped around a post. &ldquo;I&rsquo;d much prefer that to riding in the cold.&rdquo;</p><p>&ldquo;Arya, come <i>on</i>.&rdquo; Sansa appears around the edge of the stall, nose still wrinkled, Lady padding beside her. &ldquo;The queen is already waiting and we&rsquo;re late.&rdquo;</p><p>&ldquo;I don&rsquo;t care. I want to ride with Jon.&rdquo;</p><p>&ldquo;You don&rsquo;t have a horse, idiot.&rdquo; Sansa tugs Arya&rsquo;s sleeve. &ldquo;Now come <i>on</i>.&rdquo;</p><p>Arya grumbles but jumps down from the bale of hay, and Jon leads his horse to follow Sansa. Once out in the yard again Sansa makes to walk off, but abruptly turns on her heel and gives Jon a swift courtesy. &ldquo;Thank you for your aid, Jon.&rdquo;</p><p>Jon blinks, too surprised to answer, and by the time he opens his mouth Sansa has turned again and is dragging Arya across the yard. The sight of the two of them already beginning to bicker makes Jon grin, but in his chest there is a desperate ache as he pulls himself up into the saddle and looks about the Winterfell yard. How long will it be until he see it again, until they are all like this again? <i>You knew this day would come eventually. Winterfell is the home of the Starks, and you have never been one.</i> And so as he whistles Ghost to him and turns his horse to the gates of Winterfell Jon does not know what to think. Kingslanding is not the Wall, but neither is it Winterfell. Perhaps a bastard could make a name for himself there.</p><hr /><p>Weeks they are on the King&rsquo;s Road, a fat snake of riders with snapping pennants and servants leading wayns heavy with tents and food and wine trickling southward. Every forest or field it seems they must stop for King Robert to go hunting or hawking or whoring. Of his lord father Jon sees little. He is always with the king, a chain of gold interlocking hands hanging heavy from his neck.</p><p>Much of his time Jon spends with the other Winterfell men or Arya. He has little interest in Joffrey or any of the squires and upstart sworn swords he keeps about him. A little shit, he&rsquo;d called the prince back in Winterfell, and the longer their days on the road grow the truer Jon learns it to be. Joffrey can be gallant, even generous, among others, but when no one is watching his gold face falls away and he mocks and laughs at servants and his lessers.</p><p>It only makes it all the more galling the way Sansa fawns over him, the way she hangs on his every word and jest. Always together they are, a shining prince and his beautiful maid. It is enough to make Jon and Arya shake their heads and pretend to retch when no one is looking. Which often no one is. In Winterfell he&rsquo;d promised Arya he would teach her what he knew of how to use a sword, and Arya forces him to keep the promise. Jon and her slip away for an hour or two from the camp every day and he shows her how to hold and swing and cut. The only one who notices is Mycah, a butcher&rsquo;s boy who trails after them to watch some days.</p><p>For a week it lasts. They travel from Moat Cailin to the Trident, and on the day the sun dawns before the Inn of the Kneeling Man it all comes tumbling apart.</p><hr /><p>With Jory, the captain of his father&rsquo;s guard, Jon&rsquo;s been all day. He still has no idea why his father insisted he journey south with him, but so long as he is he&rsquo;s determined to learn more of how to be a man. Beside him Ghost&rsquo;s head shoots up and his lips pull back in a silent snarl. Jon follows his gaze to see Joffrey riding into camp with a bloody arm, Sansa ashen faced beside him.</p><p>A cry goes up from somewhere in the camp, and then chaos consumes it as men swarm around Joffrey and Sansa. Jon pushes his way through the crowd. Sansa&rsquo;s face is pale, the sleeve of her dress ripped, but her eyes latch onto him. &ldquo;Jon?&rdquo; She says faintly.</p><p>Jon shoves back the bannerman looming over Sansa and steps beside her. &ldquo;What happened?&rdquo; He asks, and finds himself surprised by the anger thrumming through him. Of course Sansa is his sister, but they have never been close, not like Arya and him. And yet something ugly twists in his chest as he asks, &ldquo;did someone&hellip;?&rdquo;</p><p>Sansa&rsquo;s mouth opens and closes like a gasping fish. &ldquo;Arya&hellip;&rdquo; She starts, and clutches Jon&rsquo;s arm. &ldquo;You have to find-&rdquo;</p><p>But what he has to find is lost as Joffrey starts shouting. And that&rsquo;s how the story comes out: of how the Stark girl had set her demon wolf on the young prince and maimed him before escaping. Sansa&rsquo;s fingers fall from Jon&rsquo;s arm as she turns to Joffrey, and forgotten again Jon slips back through the crowd to Jory&rsquo;s side. &ldquo;We have to find Arya before the Lannister&rsquo;s do.&rdquo;</p><p>&ldquo;Go to your lord father and tell him what&rsquo;s happened.&rdquo; Jory pushes Jon toward the king&rsquo;s tent. &ldquo;Go. We&rsquo;ll saddle the horses.&rdquo;</p><p>As hard as it is in that moment not to simply jump on his horse and go tearing after Arya, Jon nods and does as he&rsquo;s bid, sprinting away to find Ned.</p><hr /><p>Later Jon prefers not to think on all that happened after that: of how he and Jory found Arya miles from camp, of how small she&rsquo;d felt in his arms as he held her tight, of the anger that boiled up into his chest as she told them with her eyes downcast of what had happened. And of after that, of how her fingers had dug into his arms like a hawk&rsquo;s talons as they had to throw stones at Nymeria to make her stay away, of how how it felt like he was dragging a knife through his chest as he kneeled in front of Ghost and ran his fingers through his thick white fur a last time, looked in his red eyes and whispered for him to protect Nymeria and go north and find Robb and Bran and the rest of their pack, of how it was like cutting out a part of himself to ride away from where Ghost stood staring at him with his silent eyes as Nymeria slunk in the shadows behind him.</p><p>They brought Arya back to camp and she told her story: that Joffrey and Sansa had found her and the butcher&rsquo;s boy beside the river playing with sticks, that Joffrey threatened them and Nymeria defended them. A slow fury filled Jon as Joffrey lied and lied and lied again, and Sansa refused to say the truth of what had happened. Never had he thought her possible of this, and he is sorely tempted not to stop Arya when she launches herself at Sansa. But all his anger had turned to cold dread as Cersei demanded Nymeria&rsquo;s pelt, then Lady&rsquo;s, and Robert did nothing to stop her.</p><p><i>The man that passes the sentence swings the sword. </i>It is the northern way, and because of it Jon refused to take Arya and the stunned and silent Sansa back to their tent with Jory when his father ordered him to. Instead he&rsquo;d stayed beside Ned as Jory fetched Ice and stood still and watching until it was done. <i>Father will know if you look away,</i> he&rsquo;d told Bran only months before when they&rsquo;d watched sentence passed over the Night&rsquo;s Watch deserter, and Jon does not blink now. <i>This is your fault.</i> He knows it in that moment more truly than he&rsquo;s ever known anything in his life. <i>You gave Arya Needle, you encouraged her to play with swords. You&rsquo;re the one who wasn&rsquo;t there to watch her. You killed Lady sure as if you swung the sword.</i></p><p>Later he&rsquo;ll learn of how the Hound ran down and slaughtered the butcher boy, but he is already gone searching for Arya by the time the Hound returns. He ducks through the door of a tent, but in place of Arya he finds Sansa with her knees hugged to her chest in a corner of the tent sobbing into her arm. He pauses, unsure what to do, all the anger he&rsquo;d felt an hour before fled and cold and gone. &ldquo;Sansa?&rdquo; He asks tentatively.</p><p>Sansa looks up at her name, face splotched and red with tears, and before Jon can react she&rsquo;s running to him, throwing her arms around his chest and clutching him to her, sobbing into his shirt. Jon opens his mouth to speak, but his own eyes are burning and he does not have the words. Instead he raises his arms and awkwardly wraps them around her, holds her as sob after sob wracks her slender frame.</p><p>And then just as sudden as she&rsquo;d thrown herself at him she is pulling away, pushing him aside and fleeing out into the camp, leaving Jon standing alone and confused in the doorway of the tent.</p><p>He eventually finds Arya hiding in a tree, comforts her best as he can. She blames Sansa and Cersei and Robert, but Jon knows the truth, knows that it should have been him instead of Ned that swung Ice. <i>The man that passes the sentence swings the sword.</i> It&rsquo;s why the next day Jon refuses to meet Sansa&rsquo;s red rimmed eyes when they stumble into each other at the door of the tent. She tries to catch his gaze and her lips part as if she&rsquo;s going to speak, but he mutters an apology and pushes past her before she can, anger and shame coiling in his gut.</p><p>Next Jon sees Sansa she is on her horse beside Joffrey, lovely as a sigh in her blue dress, and when she glances at him her eyes hold the same distant look they always have.</p><p>They never speak of what happened.</p><hr /><p><b>AN:</b>&nbsp;This was supposed to be one of those lyrical oneshots that gracefully dip in and out of events and time, but it kind of, uh, grew in the telling. I went back and forth quite a bit on whether I should add the Jonsa tag or not. Ultimately I did decide to put it there (for now), because I think if you&rsquo;re into Jonsa you&rsquo;ll enjoy it, but do note that the romantic elements of this story are not at all overt, so fair warning.</p>",
                "content_abstract": "<p>\n<p>Jon x Sansa<i> - AU where Jon goes to Kingslanding instead of the Wall, there&rsquo;s no war, and he becomes a knight of the kingsguard even as Joffrey marries Sansa</i><b>&nbsp;</b>/ <a href=\"https://archiveofourown.org/works/17942843\" target=\"_blank\">AO3 Link</a></p>\n<p><b></b></p>\n<p>Jon speaks the words of the Kingsguard kneeling in a sept of seven glass walls before seven southron gods that are not his own. Barristan Selmy touches his sword to either of Jon&rsquo;s shoulders and Jon swears to these strange gods to serve a king he hates, to forsake lands and titles and to never sire sons or know a woman&rsquo;s touch. When it is done, Selmy drapes a white cloak across his shoulders and bids him rise. &ldquo;Rise as a knight of the Kingsguard,&rdquo; the old knight tells him, &ldquo;rise as our brother.&rdquo;</p>\n<p><i>Rickon. Bran. Robb. Those are my brothers.</i> But that was a life ago in Winterfell, so Jon rises and clasps hands with Selmy and these new southron brothers of his: Jamie Lannister with his glittering eyes, scowling Meryn Trant, silent Arys Oakheart, cold eyed Preston Greenfield, bandy legged Boros Blount.</p>\n<p>&ldquo;Stand vigil until morning,&rdquo; Selmy tells him. &ldquo;Watch the candles and think on your vows. In the morning we will have need of you at the crowning of good King Joffrey and Queen Sansa.&rdquo;</p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "thronesdragons",
        "blog": {
            "name": "thronesdragons",
            "title": "Game of Thrones",
            "description": "<p><span style=\"color: #00; font-family: Helvetica, Arial, sans-serif; font-size: 12px;\"><a href=\"https://thronesdragons.tumblr.com/\">Game of Thrones (GOT)</a> Fans : Pictures, Art, Memes and More!</span></p>",
            "url": "https://thronesdragons.tumblr.com/",
            "uuid": "t:kfrbcbINX-athn6CZWMlWQ",
            "updated": 1560200770
        },
        "id": 183100878352,
        "post_url": "https://thronesdragons.tumblr.com/post/183100878352/more-we-shall-build-our-kingdom-from-their",
        "slug": "more-we-shall-build-our-kingdom-from-their",
        "date": "2019-02-27 20:38:59 GMT",
        "timestamp": 1551299939,
        "state": "published",
        "format": "html",
        "reblog_key": "s62LVBQG",
        "tags": [
            "Game of Thrones",
            "Got",
            "Jon Snow",
            "Targaryen",
            "Stark",
            "Westeros",
            "Dragons"
        ],
        "short_url": "https://tmblr.co/Zj9jIc2gXgQuG",
        "summary": "[[MORE]] We shall build our kingdom from their ashes  by  mishellyArt -\n\n#GameOfThrones #GoT #Daenerys #Khaleesi #JonSnow...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 22,
        "caption": "<p><!-- more --> We shall build our kingdom from their ashes  by  mishellyArt -</p>\n\n<p>#GameOfThrones #GoT #Daenerys #Khaleesi #JonSnow #GotArt #GameOfThronesArt #DaenerysTargaryen #Daenerys #Targaryen #MotherOfDragons #Dany #EmiliaClarke #KitHarington #GameOfThronesFamilly #GoTFamily #GoTPage #GoTFanPage #GotFanArt #Winterfell #Westeros #Ironthrone #asoiaf #ASongOfIceAndFire #Dragon #Dragons #Drogon #Rhaegal #Viserion #ThronesDragons</p>",
        "caption_abstract": "<p></p>",
        "reblog": {
            "comment": "<p>[[MORE]] We shall build our kingdom from their ashes  by  mishellyArt -</p>\n\n<p>#GameOfThrones #GoT #Daenerys #Khaleesi #JonSnow #GotArt #GameOfThronesArt #DaenerysTargaryen #Daenerys #Targaryen #MotherOfDragons #Dany #EmiliaClarke #KitHarington #GameOfThronesFamilly #GoTFamily #GoTPage #GoTFanPage #GotFanArt #Winterfell #Westeros #Ironthrone #asoiaf #ASongOfIceAndFire #Dragon #Dragons #Drogon #Rhaegal #Viserion #ThronesDragons</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thronesdragons",
                    "active": true,
                    "theme": {
                        "header_full_width": 1063,
                        "header_full_height": 354,
                        "header_focus_width": 621,
                        "header_focus_height": 349,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c.jpg",
                        "header_image_focused": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/CZ2oyee5j/tumblr_static_tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183100878352"
                },
                "content_raw": "<p>[[MORE]] We shall build our kingdom from their ashes  by  mishellyArt -</p>\n\n<p>#GameOfThrones #GoT #Daenerys #Khaleesi #JonSnow #GotArt #GameOfThronesArt #DaenerysTargaryen #Daenerys #Targaryen #MotherOfDragons #Dany #EmiliaClarke #KitHarington #GameOfThronesFamilly #GoTFamily #GoTPage #GoTFanPage #GotFanArt #Winterfell #Westeros #Ironthrone #asoiaf #ASongOfIceAndFire #Dragon #Dragons #Drogon #Rhaegal #Viserion #ThronesDragons</p>",
                "content": "<p> We shall build our kingdom from their ashes &nbsp;by  mishellyArt -</p>\n\n<p>#GameOfThrones #GoT #Daenerys #Khaleesi #JonSnow #GotArt #GameOfThronesArt #DaenerysTargaryen #Daenerys #Targaryen #MotherOfDragons #Dany #EmiliaClarke #KitHarington #GameOfThronesFamilly #GoTFamily #GoTPage #GoTFanPage #GotFanArt #Winterfell #Westeros #Ironthrone #asoiaf #ASongOfIceAndFire #Dragon #Dragons #Drogon #Rhaegal #Viserion #ThronesDragons</p>",
                "content_abstract": "",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://thronesdragons.tumblr.com/image/183100878352",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/fe19e1430de78ecf8ab2e82887eacaa0/tumblr_pnlqoz5t0C1wfiwxso1_500.jpg",
                    "width": 500,
                    "height": 288
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/fe19e1430de78ecf8ab2e82887eacaa0/tumblr_pnlqoz5t0C1wfiwxso1_500.jpg",
                        "width": 500,
                        "height": 288
                    },
                    {
                        "url": "https://66.media.tumblr.com/fe19e1430de78ecf8ab2e82887eacaa0/tumblr_pnlqoz5t0C1wfiwxso1_400.jpg",
                        "width": 400,
                        "height": 230
                    },
                    {
                        "url": "https://66.media.tumblr.com/fe19e1430de78ecf8ab2e82887eacaa0/tumblr_pnlqoz5t0C1wfiwxso1_250.jpg",
                        "width": 250,
                        "height": 144
                    },
                    {
                        "url": "https://66.media.tumblr.com/fe19e1430de78ecf8ab2e82887eacaa0/tumblr_pnlqoz5t0C1wfiwxso1_100.jpg",
                        "width": 100,
                        "height": 58
                    },
                    {
                        "url": "https://66.media.tumblr.com/fe19e1430de78ecf8ab2e82887eacaa0/tumblr_pnlqoz5t0C1wfiwxso1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "thronesdragons",
        "blog": {
            "name": "thronesdragons",
            "title": "Game of Thrones",
            "description": "<p><span style=\"color: #00; font-family: Helvetica, Arial, sans-serif; font-size: 12px;\"><a href=\"https://thronesdragons.tumblr.com/\">Game of Thrones (GOT)</a> Fans : Pictures, Art, Memes and More!</span></p>",
            "url": "https://thronesdragons.tumblr.com/",
            "uuid": "t:kfrbcbINX-athn6CZWMlWQ",
            "updated": 1560200770
        },
        "id": 183100877682,
        "post_url": "https://thronesdragons.tumblr.com/post/183100877682/more-a-storm-of-swords-daenerys-vi-meereen",
        "slug": "more-a-storm-of-swords-daenerys-vi-meereen",
        "date": "2019-02-27 20:38:57 GMT",
        "timestamp": 1551299937,
        "state": "published",
        "format": "html",
        "reblog_key": "z7yPMgHg",
        "tags": [
            "Game of Thrones",
            "Got",
            "Jon Snow",
            "Targaryen",
            "Stark",
            "Westeros",
            "Dragons"
        ],
        "short_url": "https://tmblr.co/Zj9jIc2gXgQjo",
        "summary": "[[MORE]] A Storm of Swords: Daenerys VI  Meereen  by  lVlorf3us -\n\n#GameOfThrones #GoT #Daenerys #Khaleesi #JonSnow #GotArt...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 10,
        "caption": "<p><!-- more --> A Storm of Swords: Daenerys VI  Meereen  by  lVlorf3us -</p>\n\n<p>#GameOfThrones #GoT #Daenerys #Khaleesi #JonSnow #GotArt #GameOfThronesArt #DaenerysTargaryen #Daenerys #Targaryen #MotherOfDragons #Dany #EmiliaClarke #KitHarington #GameOfThronesFamilly #GoTFamily #GoTPage #GoTFanPage #GotFanArt #Winterfell #Westeros #Ironthrone #asoiaf #ASongOfIceAndFire #Dragon #Dragons #Drogon #Rhaegal #Viserion #ThronesDragons</p>",
        "caption_abstract": "<p></p>",
        "reblog": {
            "comment": "<p>[[MORE]] A Storm of Swords: Daenerys VI  Meereen  by  lVlorf3us -</p>\n\n<p>#GameOfThrones #GoT #Daenerys #Khaleesi #JonSnow #GotArt #GameOfThronesArt #DaenerysTargaryen #Daenerys #Targaryen #MotherOfDragons #Dany #EmiliaClarke #KitHarington #GameOfThronesFamilly #GoTFamily #GoTPage #GoTFanPage #GotFanArt #Winterfell #Westeros #Ironthrone #asoiaf #ASongOfIceAndFire #Dragon #Dragons #Drogon #Rhaegal #Viserion #ThronesDragons</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thronesdragons",
                    "active": true,
                    "theme": {
                        "header_full_width": 1063,
                        "header_full_height": 354,
                        "header_focus_width": 621,
                        "header_focus_height": 349,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c.jpg",
                        "header_image_focused": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/CZ2oyee5j/tumblr_static_tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e5ace08f5045b210ea91f966a9dce3be/hanpehk/Fohoyedzb/tumblr_static_a2rahipxdfs4wo40kkkg8gg4c_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183100877682"
                },
                "content_raw": "<p>[[MORE]] A Storm of Swords: Daenerys VI  Meereen  by  lVlorf3us -</p>\n\n<p>#GameOfThrones #GoT #Daenerys #Khaleesi #JonSnow #GotArt #GameOfThronesArt #DaenerysTargaryen #Daenerys #Targaryen #MotherOfDragons #Dany #EmiliaClarke #KitHarington #GameOfThronesFamilly #GoTFamily #GoTPage #GoTFanPage #GotFanArt #Winterfell #Westeros #Ironthrone #asoiaf #ASongOfIceAndFire #Dragon #Dragons #Drogon #Rhaegal #Viserion #ThronesDragons</p>",
                "content": "<p> A Storm of Swords: Daenerys VI  Meereen  by  lVlorf3us -</p>\n\n<p>#GameOfThrones #GoT #Daenerys #Khaleesi #JonSnow #GotArt #GameOfThronesArt #DaenerysTargaryen #Daenerys #Targaryen #MotherOfDragons #Dany #EmiliaClarke #KitHarington #GameOfThronesFamilly #GoTFamily #GoTPage #GoTFanPage #GotFanArt #Winterfell #Westeros #Ironthrone #asoiaf #ASongOfIceAndFire #Dragon #Dragons #Drogon #Rhaegal #Viserion #ThronesDragons</p>",
                "content_abstract": "",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://thronesdragons.tumblr.com/image/183100877682",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/553d03f63ebaa7743025b3a8ada15d4f/tumblr_pnlqoxXbpE1wfiwxso1_500.jpg",
                    "width": 500,
                    "height": 281
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/553d03f63ebaa7743025b3a8ada15d4f/tumblr_pnlqoxXbpE1wfiwxso1_500.jpg",
                        "width": 500,
                        "height": 281
                    },
                    {
                        "url": "https://66.media.tumblr.com/553d03f63ebaa7743025b3a8ada15d4f/tumblr_pnlqoxXbpE1wfiwxso1_400.jpg",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/553d03f63ebaa7743025b3a8ada15d4f/tumblr_pnlqoxXbpE1wfiwxso1_250.jpg",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/553d03f63ebaa7743025b3a8ada15d4f/tumblr_pnlqoxXbpE1wfiwxso1_100.jpg",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/553d03f63ebaa7743025b3a8ada15d4f/tumblr_pnlqoxXbpE1wfiwxso1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "nat111love",
        "blog": {
            "name": "nat111love",
            "title": "",
            "description": "Nat. Self-proclaimed TV addict. Fangirl.\nTV SHOWS:  Got,Tvd,  Sense8, Vikings, SOA, Daredevil, jessica jones, luke cage, peaky blinders,  the defenders, Outlander,... Current mood mayans mc",
            "url": "https://nat111love.tumblr.com/",
            "uuid": "t:Ryb0969d3qF5yUY6AQm-sA",
            "updated": 1561674624
        },
        "id": 183099686140,
        "post_url": "https://nat111love.tumblr.com/post/183099686140/hbo-stop-playing-with-us-the-entire-fandom-is",
        "slug": "hbo-stop-playing-with-us-the-entire-fandom-is",
        "date": "2019-02-27 19:37:13 GMT",
        "timestamp": 1551296233,
        "state": "published",
        "format": "html",
        "reblog_key": "4Ylk3TYl",
        "tags": [
            "game of thrones",
            "jonsa",
            "sansa stark",
            "jon snow",
            "this is too much",
            "is it april yet?"
        ],
        "short_url": "https://tmblr.co/Z3QAir2gXbtpy",
        "summary": "@hbo stop playing  with us the entire fandom is losing its shit people are starving over here just leak the damn thing…l mean...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 52,
        "title": null,
        "body": "<h2>@hbo stop playing  with us the entire fandom is losing its shit people are starving over here just leak the damn thing…l mean you don’t have to leak the entire season the jonsa kiss will do</h2><figure class=\"tmblr-full\" data-orig-width=\"1024\" data-orig-height=\"664\"><img alt=\"image\" src=\"https://66.media.tumblr.com/db1d0add3b76ca5f36c179dcfea94d03/tumblr_inline_plcelnLZS21s2ybxf_1280.jpg\" data-orig-width=\"1024\" data-orig-height=\"664\"/></figure>",
        "reblog": {
            "comment": "<p><h2>@hbo stop playing  with us the entire fandom is losing its shit people are starving over here just leak the damn thing…l mean you don’t have to leak the entire season the jonsa kiss will do</h2><figure class=\"tmblr-full\" data-orig-width=\"1024\" data-orig-height=\"664\"><img alt=\"image\" src=\"https://66.media.tumblr.com/db1d0add3b76ca5f36c179dcfea94d03/tumblr_inline_plcelnLZS21s2ybxf_1280.jpg\" data-orig-width=\"1024\" data-orig-height=\"664\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "nat111love",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#EEEEEE",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/a5f7e4daa6e6f8045c26e4bc48b19189/xwur9mn/rhCov0cjj/tumblr_static_59kq53r6uf0gccgo8wk40w4o8.gif",
                        "header_image_focused": "https://static.tumblr.com/a5f7e4daa6e6f8045c26e4bc48b19189/xwur9mn/rhCov0cjj/tumblr_static_59kq53r6uf0gccgo8wk40w4o8_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/a5f7e4daa6e6f8045c26e4bc48b19189/xwur9mn/rhCov0cjj/tumblr_static_59kq53r6uf0gccgo8wk40w4o8_2048_v2.gif",
                        "header_stretch": false,
                        "link_color": "#565f75",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183099686140"
                },
                "content_raw": "<p><h2>@hbo stop playing  with us the entire fandom is losing its shit people are starving over here just leak the damn thing…l mean you don’t have to leak the entire season the jonsa kiss will do</h2><figure class=\"tmblr-full\" data-orig-width=\"1024\" data-orig-height=\"664\"><img alt=\"image\" src=\"https://66.media.tumblr.com/db1d0add3b76ca5f36c179dcfea94d03/tumblr_inline_plcelnLZS21s2ybxf_1280.jpg\" data-orig-width=\"1024\" data-orig-height=\"664\"></figure></p>",
                "content": "<p><h2>@hbo stop playing&nbsp; with us the entire fandom is losing its shit people are starving over here just leak the damn thing&hellip;l mean you don&rsquo;t have to leak the entire season the jonsa kiss will do</h2><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/db1d0add3b76ca5f36c179dcfea94d03/tumblr_inline_plcelnLZS21s2ybxf_1280.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "nat111love",
        "blog": {
            "name": "nat111love",
            "title": "",
            "description": "Nat. Self-proclaimed TV addict. Fangirl.\nTV SHOWS:  Got,Tvd,  Sense8, Vikings, SOA, Daredevil, jessica jones, luke cage, peaky blinders,  the defenders, Outlander,... Current mood mayans mc",
            "url": "https://nat111love.tumblr.com/",
            "uuid": "t:Ryb0969d3qF5yUY6AQm-sA",
            "updated": 1561674624
        },
        "id": 183099498550,
        "post_url": "https://nat111love.tumblr.com/post/183099498550/can-you-believe-that-jon-and-sansa-who-havent",
        "slug": "can-you-believe-that-jon-and-sansa-who-havent",
        "date": "2019-02-27 19:27:05 GMT",
        "timestamp": 1551295625,
        "state": "published",
        "format": "html",
        "reblog_key": "Pl5IWB4f",
        "tags": [
            "jonsa",
            "cersei x wildfire",
            "Sansa Stark",
            "jon snow",
            "Cersei Lannister",
            "y 'all look at my ships...a girl with good taste",
            "jonsa is really the sip that was promised"
        ],
        "short_url": "https://tmblr.co/Z3QAir2gXbA0s",
        "summary": "can you believe that jon and sansa who haven’t kissed yet  are the hottest pairing in got the only pairing that comes close to...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 40,
        "title": null,
        "body": "<p>can you believe that jon and sansa who haven’t kissed yet  are the hottest pairing in got the only pairing that comes close to their hotness is cersei with a glass of wine in her hand x wildfire </p><p><br/></p><figure class=\"tmblr-full\" data-orig-width=\"500\" data-orig-height=\"324\"><img alt=\"image\" src=\"https://66.media.tumblr.com/108f382ee14614d0ee81ac954a01375e/tumblr_inline_pmf2c0y1kW1s2ybxf_540.gif\" data-orig-width=\"500\" data-orig-height=\"324\"/></figure>",
        "reblog": {
            "comment": "<p><p>can you believe that jon and sansa who haven’t kissed yet  are the hottest pairing in got the only pairing that comes close to their hotness is cersei with a glass of wine in her hand x wildfire </p><p><br></p><figure class=\"tmblr-full\" data-orig-width=\"500\" data-orig-height=\"324\"><img alt=\"image\" src=\"https://66.media.tumblr.com/108f382ee14614d0ee81ac954a01375e/tumblr_inline_pmf2c0y1kW1s2ybxf_540.gif\" data-orig-width=\"500\" data-orig-height=\"324\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "nat111love",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#EEEEEE",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/a5f7e4daa6e6f8045c26e4bc48b19189/xwur9mn/rhCov0cjj/tumblr_static_59kq53r6uf0gccgo8wk40w4o8.gif",
                        "header_image_focused": "https://static.tumblr.com/a5f7e4daa6e6f8045c26e4bc48b19189/xwur9mn/rhCov0cjj/tumblr_static_59kq53r6uf0gccgo8wk40w4o8_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/a5f7e4daa6e6f8045c26e4bc48b19189/xwur9mn/rhCov0cjj/tumblr_static_59kq53r6uf0gccgo8wk40w4o8_2048_v2.gif",
                        "header_stretch": false,
                        "link_color": "#565f75",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183099498550"
                },
                "content_raw": "<p><p>can you believe that jon and sansa who haven’t kissed yet  are the hottest pairing in got the only pairing that comes close to their hotness is cersei with a glass of wine in her hand x wildfire </p><p><br></p><figure class=\"tmblr-full\" data-orig-width=\"500\" data-orig-height=\"324\"><img alt=\"image\" src=\"https://66.media.tumblr.com/108f382ee14614d0ee81ac954a01375e/tumblr_inline_pmf2c0y1kW1s2ybxf_540.gif\" data-orig-width=\"500\" data-orig-height=\"324\"></figure></p>",
                "content": "<p><p>can you believe that jon and sansa who haven&rsquo;t kissed yet&nbsp; are the hottest pairing in got the only pairing that comes close to their hotness is cersei with a glass of wine in her hand x wildfire&nbsp;</p><p><br /></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/108f382ee14614d0ee81ac954a01375e/tumblr_inline_pmf2c0y1kW1s2ybxf_540.gif\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "link",
        "blog_name": "odroslore",
        "blog": {
            "name": "odroslore",
            "title": "Odros Lore",
            "description": "  We are enthusiastic and fantasy oriented people. We will deliver you all the stories and lore you need for your favorite fantasy universe, TV series, books, comics, and games.  ",
            "url": "https://odroslore.tumblr.com/",
            "uuid": "t:E7N71hThxFHtMvk3yaMLug",
            "updated": 1560592431
        },
        "id": 183099385046,
        "post_url": "https://odroslore.tumblr.com/post/183099385046/game-of-thrones-lore-story-of-house-buckler",
        "slug": "game-of-thrones-lore-story-of-house-buckler",
        "date": "2019-02-27 19:20:53 GMT",
        "timestamp": 1551295253,
        "state": "published",
        "format": "html",
        "reblog_key": "ciw9kdLN",
        "tags": [
            "game of thrones",
            "jon snow",
            "winteriscoming",
            "long night",
            "geek",
            "Geek Girl",
            "storytelling",
            "hbo",
            "TV series",
            "tv shows",
            "sea",
            "wolf",
            "winter",
            "stark"
        ],
        "short_url": "https://tmblr.co/Ze74gX2gXakJM",
        "summary": "Game of Thrones Lore: Story of House Buckler",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": "Game of Thrones Lore: Story of House Buckler",
        "url": "https://www.odroslore.com/game-of-thrones-lore/game-of-thrones-lore-story-of-house-buckler",
        "link_image": "https://66.media.tumblr.com/d19e6722ff30da20764534cc845c7448/tumblr_pnln2tRiOG1y369a8_og_540.jpg",
        "link_image_dimensions": {
            "width": 540,
            "height": 304
        },
        "link_author": null,
        "excerpt": "House Buckler of Bronzegate is a noble house from Bronzegate in the stormlands sworn to Storm's End.\nAccording to semi-canon sources their arms depict three brass buckles on blue. Their motto is unknown.",
        "publisher": "odroslore.com",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/d19e6722ff30da20764534cc845c7448/tumblr_pnln2tRiOG1y369a8_og_1280.jpg",
                    "width": 1280,
                    "height": 720
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/d19e6722ff30da20764534cc845c7448/tumblr_pnln2tRiOG1y369a8_og_1280.jpg",
                        "width": 1280,
                        "height": 720
                    },
                    {
                        "url": "https://66.media.tumblr.com/d19e6722ff30da20764534cc845c7448/tumblr_pnln2tRiOG1y369a8_og_640.jpg",
                        "width": 640,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/d19e6722ff30da20764534cc845c7448/tumblr_pnln2tRiOG1y369a8_og_540.jpg",
                        "width": 540,
                        "height": 304
                    },
                    {
                        "url": "https://66.media.tumblr.com/d19e6722ff30da20764534cc845c7448/tumblr_pnln2tRiOG1y369a8_og_500.jpg",
                        "width": 500,
                        "height": 281
                    },
                    {
                        "url": "https://66.media.tumblr.com/d19e6722ff30da20764534cc845c7448/tumblr_pnln2tRiOG1y369a8_og_400.jpg",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/d19e6722ff30da20764534cc845c7448/tumblr_pnln2tRiOG1y369a8_og_250.jpg",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/d19e6722ff30da20764534cc845c7448/tumblr_pnln2tRiOG1y369a8_og_100.jpg",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/d19e6722ff30da20764534cc845c7448/tumblr_pnln2tRiOG1y369a8_og_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "description": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "jonnysnowballs",
        "blog": {
            "name": "jonnysnowballs",
            "title": "ew, what?",
            "description": "<p>just trash at this point.</p>",
            "url": "https://jonnysnowballs.tumblr.com/",
            "uuid": "t:qB_fFWrcJN1TvSjZxXaebw",
            "updated": 1561654213
        },
        "id": 183098124099,
        "post_url": "https://jonnysnowballs.tumblr.com/post/183098124099/jon-tormund-everything-you-have-is-wildly",
        "slug": "jon-tormund-everything-you-have-is-wildly",
        "date": "2019-02-27 18:11:54 GMT",
        "timestamp": 1551291114,
        "state": "published",
        "format": "html",
        "reblog_key": "wFUi61Xm",
        "tags": [
            "jon snow",
            "tormund giantsbane",
            "game of thrones",
            "game of thrones crack",
            "jonerys",
            "if you squint i guess",
            "ALTHOUGH I DON’T THINK DANY WOULD MIND SEEING JON IN JUST A LOIN CLOTH",
            "daenerys targeryen",
            "got",
            "got crack",
            "jonerys crack",
            "still amusing myself",
            "parks and rec",
            "parks and recreation",
            "incorrect quotes",
            "ann perkins",
            "leslie knope",
            "mine",
            "how queue you"
        ],
        "short_url": "https://tmblr.co/Z2AZow2gXVwT3",
        "summary": "Jon: Tormund, everything you have is wildly inappropriate for me to wear to meet Queen Daenerys. I need to be serious. This is...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 49,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> Tormund, everything you have is wildly inappropriate for me to wear to meet Queen Daenerys. I need to be serious. This is literally just a loin cloth. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tormund</b>: I know; I look really good in it. </p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> Tormund, everything you have is wildly inappropriate for me to wear to meet Queen Daenerys. I need to be serious. This is literally just a loin cloth. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tormund</b>: I know; I look really good in it. </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jonnysnowballs",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 719,
                        "header_focus_width": 1278,
                        "header_focus_height": 719,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1278,719,0",
                        "header_image": "https://static.tumblr.com/f45823a2b4c1b17b06e7b8f84a4a96a8/nry4pzc/uRgpqleyl/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/014926446554b6115f25ac72bb54aac9/nry4pzc/q0Spqleyp/tumblr_static_tumblr_static__focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/f45823a2b4c1b17b06e7b8f84a4a96a8/nry4pzc/uRgpqleyl/tumblr_static__2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#8A2020",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#8A2020",
                        "title_font": "Pratt Pro",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183098124099"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> Tormund, everything you have is wildly inappropriate for me to wear to meet Queen Daenerys. I need to be serious. This is literally just a loin cloth. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tormund</b>: I know; I look really good in it. </p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Jon:</b> Tormund, everything you have is wildly inappropriate for me to wear to meet Queen Daenerys. I need to be serious. This is literally just a loin cloth. </p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Tormund</b>: I know; I look really good in it. </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "lady-griffin",
        "blog": {
            "name": "lady-griffin",
            "title": "LadyGriffin's Home",
            "description": "A bad idea written down is far better and far more useful to you than a blank sheet of paper and a mythical piece of brilliance that has been stuck in your head out of fear of failure. Go ahead and fail. Then make it better.",
            "url": "https://lady-griffin.tumblr.com/",
            "uuid": "t:SXv6-e67D2Rdwk-ovNHtiQ",
            "updated": 1561755620
        },
        "id": 183097858741,
        "post_url": "https://lady-griffin.tumblr.com/post/183097858741/crypt-teaser",
        "slug": "crypt-teaser",
        "date": "2019-02-27 17:57:10 GMT",
        "timestamp": 1551290230,
        "state": "published",
        "format": "html",
        "reblog_key": "nFjJt7S4",
        "tags": [
            "House Stark",
            "Jon Snow",
            "Sasnsa Stark",
            "Arya Stark",
            "Crypt Teaser",
            "Jonsa",
            "GOT",
            "Game of Thrones",
            "Lyanna Stark",
            "Ned Stark",
            "Catelyn Stark",
            "Game of thrones teaser"
        ],
        "short_url": "https://tmblr.co/ZFOdnx2gXUvgr",
        "summary": "Crypt Teaser",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 116,
        "title": "Crypt Teaser",
        "body": "<figure class=\"tmblr-embed tmblr-full\" data-provider=\"youtube\" data-orig-width=\"540\" data-orig-height=\"304\" data-url=\"https%3A%2F%2Fwww.youtube.com%2Fwatch%3Ftime_continue%3D20%26v%3D7LiyXFYaEAY\"><iframe width=\"540\" height=\"304\" id=\"youtube_iframe\" src=\"https://www.youtube.com/embed/7LiyXFYaEAY?feature=oembed&amp;enablejsapi=1&amp;origin=https://safe.txmblr.com&amp;wmode=opaque\" frameborder=\"0\" allowfullscreen=\"\"></iframe></figure><p>I’ve been wanting to talk about promo since I first saw it, but work has been overwhelming and I needed time to write my thoughts down. So sorry, if no one cares about this promo anymore.<br/></p><p>I’m going to be talking about what I think the Crypt promo is hinting or foreshadowing at. But first…</p><p>It is very interesting Sansa is made to be in the center at the end, especially since Jon is at first in the center - standing between both Arya and Sansa as the three meet up. </p><p>But then as they walk to their statues, he moves around Sansa to be on her side, which puts her in the center. This is a 100% deliberate choice, they could’ve easily had them all walk straight towards their own statues with no rearrangements.</p><p>They literally have Jon stay behind Arya and Sansa and then move around Sansa, so he wouldn’t be in the center.</p><p>So why? </p><p>One reasoning, is that it might actually be to avoid certain Targaryen imagery &ndash; specifically Aegon the Conqueror who in official art (?) and fan art is often flanked on both sides by his two-sister-wives. </p><p>The second, I imagined Jon being in the center, flanked on either side by his sisters, my mind went to Aegon and his sister-wives… so perhaps, it’s best to avoid that idea altogether. Especially if you don’t want your audience to be weirded out by Jon and Sansa (if I think what is happening is happening).</p><p>It could also be that visually Sansa is the tallest one, so it creates more of a symmetrical aesthetic.</p><p>Especially, when both Jon and Arya draw their swords to face the upcoming danger.</p><p>If Sansa was on the side as both Jon and Arya pull out their swords, that would’ve sideline her from the action – keeping her in the center, keeps her in the scene.</p><p>It could also just be to cement the idea that Sansa is a major player to this season and to the end of the story.</p><p>Basically, from just a promo standpoint, it makes sense to put Sansa in the center, though this promo is all about Jon. Either just to avoid certain Targaryen visuals or to reinforce already existing ideas.</p><p>Now let’s go into some of the story/plot-driven reasons for this promo and its choices (foreshadowing).</p><hr><!-- more --><figure data-orig-width=\"1500\" data-orig-height=\"843\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/9f92f3fb68a8327bdef7cfcaf30fc5fa/tumblr_inline_pnlim8goVd1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"1500\" data-orig-height=\"843\"/></figure><p><br/>One idea (and I’ve seen this a lot) is that this promo is hinting at the Winterfell Crypts residents waking up and attacking. Now there are many theories about this, so I’m not going to go into all that much. But that seems like a possibility…</p><p>Winterfell’s Crypts are mentioned a great deal and the Big Bad is a being who can raise the dead and we know Winterfell will be a major setting so it  all adds up. But in all honestly, I think this a more of red herring idea than actual foreshadowing.</p><p>One of the main reasons is that “realistically” most of the bodies in the crypts are just ashes and pieces of bone, so what exactly is going to be reanimated?</p><p>Really, I think this season is all about the politics and the Walking Dead is a red herring/false start, so that’s what this promo is potentially foreshadowing for us, not the old kings literally coming back and attacking, but more who will become the next “Stark Kings&quot; or those remembered by history (more about that later).</p><p>But reanimated old Kings would be fun to see. </p><hr><figure data-orig-width=\"735\" data-orig-height=\"485\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/945dc33f9539c9fe336fb5f31d8079e1/tumblr_inline_pnlio3FsCW1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"735\" data-orig-height=\"485\"/></figure><p>Jon, Arya and Sansa&rsquo;s meeting or their walk coverging is very nice. It gives the impression of the Starks being a united front and it’s also a nice homage to when Sansa and Arya were first reunited in front of Ned Stark’s statue.<br/></p><figure data-orig-width=\"700\" data-orig-height=\"700\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/12e291814a93b3fc554e3b6d980372bf/tumblr_inline_pnljci8EeF1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"700\" data-orig-height=\"700\"/></figure><p><br/>But really, the meet-up/convergence of these three, is reflecting the past tension between Sansa and Arya in the past season(s) (and when they were young). </p><p>Their past fights and “stand-offs” are no longer important or relevant when the three walks converge as the two sisters have a new mission when Jon enters the scene. They can’t find amongst themselves, when they have Jon to protect.</p><p>But yet, the promo doesn’t end indicating that Sansa and Arya will protect Jon. But instead, that Jon and Arya will protect Sansa.</p><figure data-orig-width=\"1554\" data-orig-height=\"840\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d74e2f21aa68cdaf6458840e618897da/tumblr_inline_pnliq3z7Eo1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"1554\" data-orig-height=\"840\"/></figure><p><br/>The idea of Sansa potentially being kidnapped is a possibility and Arya and Jon drawing their swords to protect her, could be hinting at this. But this moment could also just be showing that Sansa is more vulnerable to outside threats, but nonetheless is protected by the Stark family.<br/></p><p>The two Starks that might be viewed by outsiders as “wild-cards,” the King who bent the knee and the girl who grew up to be a “Faceless assassin,” have no hesitation in standing against the upcoming threat and protecting their own.</p><p>The Starks are a unit or pack. </p><p>Also, while I’ve brought it up, it is important to note that Jon was in the center, but moved to Sansa’s side. This might be a stretch, but this might indicate that Jon is not the key to get the Stark Alliance.</p><p>Daenerys and her camp (as well as Cersei) both focused on Jon being the key to getting the North (which makes sense, he was the King). But Jon moving to the side, putting Sansa center and front, shows the audience who the central figure to the Stark Family is.</p><p>Which leads into the idea, that Sansa is central to the Starks’ Future.</p><p>Multiple times she has been referred to as the Key to the North and has been viewed as the legitimate heir to Winterfell. And both Tywin Lannister and Roose Bolton (and Littlefinger) believed whoever sired a child with Sansa, would be in control of Winterfell as that child would be the future Lord.</p><p>So, Sansa is definitely a key to the future of House Starks in several ways.</p><p>The real interesting thing though, is this promo isn’t about Sansa or even House Stark as a whole.</p><p>It’s all about Jon.</p><p>All the lines pertain to him and it’s about who he really is and his story, and yet Sansa still gets a lot of attention. More so than Arya, as the time between them isn’t split evenly. Hinting that Sansa plays an important part to who Jon currently is, but also where his story and future are going.</p><p>And I know I keep repeating this, but it’s odd to make Sansa the central character in the end – as</p><p>A. The Promo isn’t about her<br/>B. Jon is a more central character to the story</p><p>But really a main idea that I think some people are overlooking, is that Jon is heavily connected to the Starks and their present and future. He is an integral part to the Stark Pack. </p><hr><p><b> The Intro Walks of Jon, Sansa and Arya.</b></p><figure data-orig-width=\"600\" data-orig-height=\"425\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/34ad74068ea5014aa491ec6d81da8b55/tumblr_inline_pnlisdQenn1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"600\" data-orig-height=\"425\"/></figure><p><b>Jon’s 1<sup>st</sup> walk is 17/18 seconds long<br/></b><b>Jon’s 2<sup>nd</sup> walk is 9 seconds long </b></p><p><b>26/27 seconds altogether</b></p><p>He gets the most time and two separate walks to boot.</p><p>This makes sense, as he is the focus of this promo and is one of the biggest focuses of the show’s overall story. </p><p>Jon walks right past Lyanna’s statue. This is a reflection of Jon always wanting to know who his mother was, but was blind (lied to) about the truth. He walks right past the truth and his real mother and later pauses and stares directly at the man (Ned) he based so much on who he is now. </p><p>It is telling that Lyanna’s line is spoken before Ned’s though. </p><p>Indicating, that Jon will learn of his true parentage, falter in his identity, only to be reminded (by Ned’s line) that he’s never been a Stark in name and yet, has always been a Stark in blood.  </p><p>When Ned’s Line is spoken and Jon is looking at Ned’s Statue, it really does come across that Ned is directly talking to Jon in that moment. While Sansa also looks at Catelyn’s statue, it’s different as we don’t get the impression she can hear Catelyn’s words.</p><p>Jon can hear Ned’s words. </p><p>Also Lyanna’s line, while I think is reminding us of who “Jon really is” isn’t the one where she told Ned that Jon was Aegon Targaryen, instead it’s her begging Ned to protect Jon.</p><p>Though Robert, who Lyanna afraid would hurt her child, is now gone. So who is this past plead about now? The Starks? Maybe. Or perhaps, another Targaryen who might see Jon as a threat. </p><p>Lyanna’s line is also interesting, because her pleading is connected to Jon being taken in by Ned and Ned claiming him as his son, which caused a rift in Ned’s marriage and in the Stark family. </p><p>Finally, I think both Lyanna and Ned are indicators of who Jon will choose in the end. Jon is a Stark through Lyanna, but also chooses to be a Stark through the father he chooses. </p><p>This is further emphasized by the statue of Jon in the end. As in the books, the statues are really only reserved for the former Kings and Lords of Winterfell, but will get to that in a bit.</p><p>Jon’s parentage reveal will have a big impact on Jon, as it should. </p><p>A big portion of Jon’s identity is constructed around him thinking Ned is his father and he himself is a bastard. Learning that he’s not Ned’s son is going to shake Jon’s world, no matter what, but also learning that he is a Targaryen and has a claim to the Iron Throne is a whole other thing on top of that. </p><figure data-orig-width=\"1153\" data-orig-height=\"615\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0ce38cf4d47891c56c1a7758556420b2/tumblr_inline_pnliv8hX8G1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"1153\" data-orig-height=\"615\"/></figure><p>Before Jon’s first walk ends, he looks back and pauses, almost as though he heard the feather fall, only to turn back to continue forward.<br/></p><p>This could be interpreted as many different things, but for me it really comes down to Jon “hearing” Lyanna. Everyone is so focused on Rhaegar being Jon’s father, that they forget Lyanna is the mother Jon never knew he had and has wanted from the very beginning.</p><p>I think there will be a moment where Jon is in front of Lyanna’s statue, perhaps finding a connection to a woman he never noticed all the times he was in the Crypts of Winterfell as a child. Always so focus on the Old Kings of Winterfell and how he would never be one. </p><p>Jon turning back to continue walking leads into Sansa’s walk beginning – at first this makes it seem as though she is just following him down the same corridor, but she is not.</p><p>But nonetheless, the feather falling ends Jon’s walk and begins Sansa’s. </p><figure data-orig-width=\"590\" data-orig-height=\"350\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/6005e8cebeee20f974853bb3c7bbf74d/tumblr_inline_pnlittzooe1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"590\" data-orig-height=\"350\"/></figure><p><b>Sansa’s Solo Walk is 6/7 seconds long</b><br/></p><p>Her walk is less “dynamic” than Jon’s, less overall shots and plot info being laid out, but she looks back onto her mother’s statue as we begin to hear Catelyn’s voice and the beginning of her quote &ndash;</p><p>“All this horror that has come to my family…”</p><p>Catelyn’s full quote is about how all the tragedies that have fallen upon the Starks was because she couldn’t love Jon. </p><p>What has happened to the Starks has nothing to do with the fact that Catelyn ostracized Jon, but it is still an important character moment for Catelyn and one of the few lines she has about Jon. </p><p>It also puts a certain idea into the audience’s head –</p><p>The salvation for the Stark family, the future where they won’t be the victims of countless tragedies, is contingent on them embracing and loving Jon.</p><p>However, unlike Cat, who couldn’t love Jon because she thought he was Ned’s son, the Stark children (Arya and Sansa), might have the opposite problem. </p><p>Finding it difficult to accept Jon when they find out “he’s not one of them.” Though that might be more Arya and less Sansa, but will get into that in a bit. </p><p>I would like to point out that both this teaser and the Tapestry one, bring to the forefront the pain Catelyn felt for Ned bringing Jon home and the rift it caused in their relationship.</p><p>You could easily bring up Jon’s parentage without that aspect, so it’s interesting that idea keeps being mentioned. But back to the walk -</p><p>Jon’s walk ends with him looking back as the feather (Lyanna) fell to the ground.</p><p>Sansa in the show has been associated with both the feather and Lyanna’s statue as well as sporting if not the same hairstyle in the promo, one very similar to Lyanna’s when she was married to Rhaegar. Possibly indicating a bridal future for Sansa, but also -</p><p>That Jon’s connection to the Starks are through his mother and Sansa (possibly his future wife).</p><p>Overall the emphasis on the feather is quite interesting.</p><p>Though it makes sense, since it’s the only iconic item to Lyanna Stark within the active narrative of show, the blue rose is hinted at in the promos, backgrounds, and extra featurettes of the show, but it’s not as prevalent in the show as it is in the books.</p><p>When I first watched the promo, I really thought Sansa was going to pick the feather up from the ground –</p><p>Showing the connection between Lyanna, Jon, and Sansa, as while as telling us that Sansa will carry on Lyanna’s dying wish of protecting Jon. And connecting aunt and niece as connections for Jon to his Stark family.</p><p>The first part of Catelyn’s quote is the end of Sansa’s walk, but the second part is the beginning of Arya’s quote.</p><figure data-orig-width=\"2276\" data-orig-height=\"1242\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/96a2a70d2885010f5da8e0a6f8e4946e/tumblr_inline_pnliwt84Mn1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"2276\" data-orig-height=\"1242\"/></figure><p><b>Arya’s Solo Walk is about 4 seconds –</b><br/></p><p>Arya’s walk is shorter than both Jon and Sansa’s and she doesn’t look at any statues (past figures). So, you might think there’s less to discuss.</p><p>However, the second part of Catelyn’s voiceover is over Arya’s walk.</p><p>“…it’s all because I couldn’t love a motherless child.”</p><p>Catelyn line being over both Arya and Sansa, connects the two sisters to not only Catelyn, but also Jon and put forth the challenge of them being better than their mother in how they treat him.</p><p>However, the part of how Catelyn couldn’t love Jon, could be hinting at a future struggle for Arya.</p><p>Arya has certainly changed from the girl she used to be.</p><p>In many ways, her world view has become more than a bit severe. And Arya has grown a strong sense of place with her identity as a Stark and seeking revenge for those who’ve wrong the Starks in the past.</p><p>She slaughtered the Freys for the Starks and was more than willing to behead the Northern Lords in order to protect Jon.</p><p>While that last one might indicate Arya would never “turn” on Jon, it also shows that Arya’s loyalty might not be exactly to who Jon is now, but to her memory of him. To her family.</p><p>If she feels he doesn’t have the same loyalty, then….</p><p>Arya is also not exactly the most open person anymore, nor understanding – especially when it comes to political games or shows.</p><p>Sansa might be willing to give Dany Winterfell or at least be willing to say as much and bear and grin it, but Arya might have a harder time swallowing her tongue. </p><p>While Jon and Sansa take after who Ned really was, someone who was quite capable of deceiving those he loved and doing dishonorable things for a greater purpose. Arya (and Robb) seem to take after the image of who their father was, the honorable man who never strayed from the path of what he believed was right (though Arya is a much darker and twisted take on that idea)</p><p>And Arya also has gained some of Catelyn’s less than admirable traits, so&hellip;</p><p>Plus, Catelyn’s struggle was that she couldn’t love Jon, because she believed he was Ned’s bastard. So, it would be interesting that Arya might struggle with her relationship with Jon, because he’s not Ned’s bastard.</p><p>Perhaps not that literally, but &ndash;</p><p>Arya and Jon always got along, as the two outsider children and Arya found comfort in Jon being different in how she thought she was different (though arguably young Arya was likely projecting onto Jon).</p><p>But Jon being revealed to not being her brother and him possibly playing the political game and showing more loyalty to Dany, even just for show, might not go over well with Arya.</p><p>I’m not saying Arya is going to hurt Jon, but there might be some tense moments. Especially since…</p><p>Jon and Arya’s reunion has been built up so much by the fans and the characters within the show as being this wonderful and sweet reunion to happen - so there being tension between these two wouldn’t surprise me.</p><p>But while I think this might a struggle for Arya and the seed for some tense moments, Arya will protect her family, no matter what. </p><hr><figure data-orig-width=\"644\" data-orig-height=\"410\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d120a1f92dd3f8446b08e509da913c12/tumblr_inline_pnlj0blZIB1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"644\" data-orig-height=\"410\"/></figure><p><br/>The Statues in the crypt are great in my opinion. Doing the wonderful surface-level job of hinting at their deaths (like many of the season promos have done). Especially since, Jon and Sansa, walked past fallen characters who now have their own statues.<br/></p><p>Perhaps this is telling us these three will die in the upcoming battle, or perhaps the statues are telling us who will be remembered in history. </p><p>You can’t have a legacy until your dead (and you will die in the end).</p><p>Jon, Sansa and Arya will be remembered. The Statues to me don’t really signify their upcoming deaths, but that they are immortalized by their actions and the present for future generations. </p><p>Bran being absent is very telling. Showing us what role, he might play in this story.</p><p>Bran and his story are strongly tied to magic and the Night King, his own absence from the trailer and his lack of statue, indicates that while he might be integral to defeating the Others (him, not dragons), he won’t have a role to play afterwards.</p><p>He might not be remembered as an important figure in history or at least not in the political history. While Jon, Sansa and Arya will be remembered just as Arya remembered Aegon, Visenya and Rhaenys.</p><p>Its also possible, Bran might get his own promo highlighting his importance to the story, but separating him from the Stark narrative.</p><p>Basically, I believe, the statues are telling us who will be important in the history books. Those three will be the ones who future generations remember when they’re playing with each other as kids and who the future songs will be about.</p><p><b>The Torches Going Out</b></p><p>This is far from new. The candles, torches or fireplaces going out representing the Others and Winter coming has been a stable to GOT promos, since pretty much the beginning. But it’s also starting to take on a different meaning, or not different, but clearer.</p><p>Fire may destroy the wights, but we’ve seen within the show itself that even dragon fire is nothing to the Night King. Fire (the dragons) aren’t effective when it comes to White Walkers.</p><p>Actually, and this is random, but when I saw this and when I was thinking about it, I thought of the matching phone game – Empires &amp; Puzzles. In the game,</p><p>Fire is effective against Nature and Nature is effective Ice and Ice is effective against Fire.</p><p>Fire (dragons) can destroy the Weirwood Trees (Winterfell)</p><p>The Weirwood Trees (Bran) can destroy the White Walkers</p><p>The White Walkers can destroy the Dragons</p><p>Similar to the Tapestry Promo, this may be less of a war between two opposing force, but three forces.</p><p>Either way I think promo worked really well and I’m excited to seeing the Starks once more (which is the true goal of a promo). Sorry for the messy writing and analysis. </p>",
        "body_abstract": "\n<figure class=\"tmblr-embed tmblr-full\" data-provider=\"youtube\" data-orig-width=\"540\" data-orig-height=\"304\" data-url=\"https%3A%2F%2Fwww.youtube.com%2Fwatch%3Ftime_continue%3D20%26v%3D7LiyXFYaEAY\"><iframe width=\"540\" height=\"304\" id=\"youtube_iframe\" src=\"https://www.youtube.com/embed/7LiyXFYaEAY?feature=oembed&amp;enablejsapi=1&amp;origin=https://safe.txmblr.com&amp;wmode=opaque\" frameborder=\"0\" allowfullscreen=\"\"></iframe></figure><p>I&rsquo;ve been wanting to talk about promo since I first saw it, but work has been overwhelming and I needed time to write my thoughts down. So sorry, if no one cares about this promo anymore.<br></p>\n<p>I&rsquo;m going to be talking about what I think the Crypt promo is hinting or foreshadowing at. But first&hellip;</p>\n<p>It is very interesting Sansa is made to be in the center at the end, especially since Jon is at first in the center - standing between both Arya and Sansa as the three meet up. </p>\n<p>But then as they walk to their statues, he moves around Sansa to be on her side, which puts her in the center. This is a 100% deliberate choice, they could&rsquo;ve easily had them all walk straight towards their own statues with no rearrangements.</p>\n<p>They literally have Jon stay behind Arya and Sansa and then move around Sansa, so he wouldn&rsquo;t be in the center.</p>\n<p>So why? </p>\n<p>One reasoning, is that it might actually be to avoid certain Targaryen imagery &ndash; specifically Aegon the Conqueror who in official art (?) and fan art is often flanked on both sides by his two-sister-wives. </p>\n<p>The second, I imagined Jon being in the center, flanked on either side by his sisters, my mind went to Aegon and his sister-wives&hellip; so perhaps, it&rsquo;s best to avoid that idea altogether. Especially if you don&rsquo;t want your audience to be weirded out by Jon and Sansa (if I think what is happening is happening).</p>\n<p>It could also be that visually Sansa is the tallest one, so it creates more of a symmetrical aesthetic.</p>\n<p>Especially, when both Jon and Arya draw their swords to face the upcoming danger.</p>\n<p>If Sansa was on the side as both Jon and Arya pull out their swords, that would&rsquo;ve sideline her from the action &ndash; keeping her in the center, keeps her in the scene.</p>\n<p>It could also just be to cement the idea that Sansa is a major player to this season and to the end of the story.</p>\n<p>Basically, from just a promo standpoint, it makes sense to put Sansa in the center, though this promo is all about Jon. Either just to avoid certain Targaryen visuals or to reinforce already existing ideas.</p>\n<p>Now let&rsquo;s go into some of the story/plot-driven reasons for this promo and its choices (foreshadowing).</p>\n<hr>\n",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-embed tmblr-full\" data-provider=\"youtube\" data-orig-width=\"540\" data-orig-height=\"304\" data-url=\"https%3A%2F%2Fwww.youtube.com%2Fwatch%3Ftime_continue%3D20%26v%3D7LiyXFYaEAY\"><iframe width=\"540\" height=\"304\" id=\"youtube_iframe\" src=\"https://www.youtube.com/embed/7LiyXFYaEAY?feature=oembed&amp;enablejsapi=1&amp;origin=https://safe.txmblr.com&amp;wmode=opaque\" frameborder=\"0\" allowfullscreen=\"\"></iframe></figure><p>I’ve been wanting to talk about promo since I first saw it, but work has been overwhelming and I needed time to write my thoughts down. So sorry, if no one cares about this promo anymore.<br></p><p>I’m going to be talking about what I think the Crypt promo is hinting or foreshadowing at. But first…</p><p>It is very interesting Sansa is made to be in the center at the end, especially since Jon is at first in the center - standing between both Arya and Sansa as the three meet up. </p><p>But then as they walk to their statues, he moves around Sansa to be on her side, which puts her in the center. This is a 100% deliberate choice, they could’ve easily had them all walk straight towards their own statues with no rearrangements.</p><p>They literally have Jon stay behind Arya and Sansa and then move around Sansa, so he wouldn’t be in the center.</p><p>So why? </p><p>One reasoning, is that it might actually be to avoid certain Targaryen imagery – specifically Aegon the Conqueror who in official art (?) and fan art is often flanked on both sides by his two-sister-wives. </p><p>The second, I imagined Jon being in the center, flanked on either side by his sisters, my mind went to Aegon and his sister-wives… so perhaps, it’s best to avoid that idea altogether. Especially if you don’t want your audience to be weirded out by Jon and Sansa (if I think what is happening is happening).</p><p>It could also be that visually Sansa is the tallest one, so it creates more of a symmetrical aesthetic.</p><p>Especially, when both Jon and Arya draw their swords to face the upcoming danger.</p><p>If Sansa was on the side as both Jon and Arya pull out their swords, that would’ve sideline her from the action – keeping her in the center, keeps her in the scene.</p><p>It could also just be to cement the idea that Sansa is a major player to this season and to the end of the story.</p><p>Basically, from just a promo standpoint, it makes sense to put Sansa in the center, though this promo is all about Jon. Either just to avoid certain Targaryen visuals or to reinforce already existing ideas.</p><p>Now let’s go into some of the story/plot-driven reasons for this promo and its choices (foreshadowing).</p><hr>[[MORE]]<figure data-orig-width=\"1500\" data-orig-height=\"843\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/9f92f3fb68a8327bdef7cfcaf30fc5fa/tumblr_inline_pnlim8goVd1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"1500\" data-orig-height=\"843\"></figure><p><br>One idea (and I’ve seen this a lot) is that this promo is hinting at the Winterfell Crypts residents waking up and attacking. Now there are many theories about this, so I’m not going to go into all that much. But that seems like a possibility…</p><p>Winterfell’s Crypts are mentioned a great deal and the Big Bad is a being who can raise the dead and we know Winterfell will be a major setting so it  all adds up. But in all honestly, I think this a more of red herring idea than actual foreshadowing.</p><p>One of the main reasons is that “realistically” most of the bodies in the crypts are just ashes and pieces of bone, so what exactly is going to be reanimated?</p><p>Really, I think this season is all about the politics and the Walking Dead is a red herring/false start, so that’s what this promo is potentially foreshadowing for us, not the old kings literally coming back and attacking, but more who will become the next “Stark Kings\" or those remembered by history (more about that later).</p><p>But reanimated old Kings would be fun to see. </p><hr><figure data-orig-width=\"735\" data-orig-height=\"485\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/945dc33f9539c9fe336fb5f31d8079e1/tumblr_inline_pnlio3FsCW1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"735\" data-orig-height=\"485\"></figure><p>Jon, Arya and Sansa’s meeting or their walk coverging is very nice. It gives the impression of the Starks being a united front and it’s also a nice homage to when Sansa and Arya were first reunited in front of Ned Stark’s statue.<br></p><figure data-orig-width=\"700\" data-orig-height=\"700\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/12e291814a93b3fc554e3b6d980372bf/tumblr_inline_pnljci8EeF1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"700\" data-orig-height=\"700\"></figure><p><br>But really, the meet-up/convergence of these three, is reflecting the past tension between Sansa and Arya in the past season(s) (and when they were young). </p><p>Their past fights and “stand-offs” are no longer important or relevant when the three walks converge as the two sisters have a new mission when Jon enters the scene. They can’t find amongst themselves, when they have Jon to protect.</p><p>But yet, the promo doesn’t end indicating that Sansa and Arya will protect Jon. But instead, that Jon and Arya will protect Sansa.</p><figure data-orig-width=\"1554\" data-orig-height=\"840\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d74e2f21aa68cdaf6458840e618897da/tumblr_inline_pnliq3z7Eo1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"1554\" data-orig-height=\"840\"></figure><p><br>The idea of Sansa potentially being kidnapped is a possibility and Arya and Jon drawing their swords to protect her, could be hinting at this. But this moment could also just be showing that Sansa is more vulnerable to outside threats, but nonetheless is protected by the Stark family.<br></p><p>The two Starks that might be viewed by outsiders as “wild-cards,” the King who bent the knee and the girl who grew up to be a “Faceless assassin,” have no hesitation in standing against the upcoming threat and protecting their own.</p><p>The Starks are a unit or pack. </p><p>Also, while I’ve brought it up, it is important to note that Jon was in the center, but moved to Sansa’s side. This might be a stretch, but this might indicate that Jon is not the key to get the Stark Alliance.</p><p>Daenerys and her camp (as well as Cersei) both focused on Jon being the key to getting the North (which makes sense, he was the King). But Jon moving to the side, putting Sansa center and front, shows the audience who the central figure to the Stark Family is.</p><p>Which leads into the idea, that Sansa is central to the Starks’ Future.</p><p>Multiple times she has been referred to as the Key to the North and has been viewed as the legitimate heir to Winterfell. And both Tywin Lannister and Roose Bolton (and Littlefinger) believed whoever sired a child with Sansa, would be in control of Winterfell as that child would be the future Lord.</p><p>So, Sansa is definitely a key to the future of House Starks in several ways.</p><p>The real interesting thing though, is this promo isn’t about Sansa or even House Stark as a whole.</p><p>It’s all about Jon.</p><p>All the lines pertain to him and it’s about who he really is and his story, and yet Sansa still gets a lot of attention. More so than Arya, as the time between them isn’t split evenly. Hinting that Sansa plays an important part to who Jon currently is, but also where his story and future are going.</p><p>And I know I keep repeating this, but it’s odd to make Sansa the central character in the end – as</p><p>A. The Promo isn’t about her<br>B. Jon is a more central character to the story</p><p>But really a main idea that I think some people are overlooking, is that Jon is heavily connected to the Starks and their present and future. He is an integral part to the Stark Pack. </p><hr><p><b> The Intro Walks of Jon, Sansa and Arya.</b></p><figure data-orig-width=\"600\" data-orig-height=\"425\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/34ad74068ea5014aa491ec6d81da8b55/tumblr_inline_pnlisdQenn1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"600\" data-orig-height=\"425\"></figure><p><b>Jon’s 1<sup>st</sup> walk is 17/18 seconds long<br></b><b>Jon’s 2<sup>nd</sup> walk is 9 seconds long </b></p><p><b>26/27 seconds altogether</b></p><p>He gets the most time and two separate walks to boot.</p><p>This makes sense, as he is the focus of this promo and is one of the biggest focuses of the show’s overall story. </p><p>Jon walks right past Lyanna’s statue. This is a reflection of Jon always wanting to know who his mother was, but was blind (lied to) about the truth. He walks right past the truth and his real mother and later pauses and stares directly at the man (Ned) he based so much on who he is now. </p><p>It is telling that Lyanna’s line is spoken before Ned’s though. </p><p>Indicating, that Jon will learn of his true parentage, falter in his identity, only to be reminded (by Ned’s line) that he’s never been a Stark in name and yet, has always been a Stark in blood.  </p><p>When Ned’s Line is spoken and Jon is looking at Ned’s Statue, it really does come across that Ned is directly talking to Jon in that moment. While Sansa also looks at Catelyn’s statue, it’s different as we don’t get the impression she can hear Catelyn’s words.</p><p>Jon can hear Ned’s words. </p><p>Also Lyanna’s line, while I think is reminding us of who “Jon really is” isn’t the one where she told Ned that Jon was Aegon Targaryen, instead it’s her begging Ned to protect Jon.</p><p>Though Robert, who Lyanna afraid would hurt her child, is now gone. So who is this past plead about now? The Starks? Maybe. Or perhaps, another Targaryen who might see Jon as a threat. </p><p>Lyanna’s line is also interesting, because her pleading is connected to Jon being taken in by Ned and Ned claiming him as his son, which caused a rift in Ned’s marriage and in the Stark family. </p><p>Finally, I think both Lyanna and Ned are indicators of who Jon will choose in the end. Jon is a Stark through Lyanna, but also chooses to be a Stark through the father he chooses. </p><p>This is further emphasized by the statue of Jon in the end. As in the books, the statues are really only reserved for the former Kings and Lords of Winterfell, but will get to that in a bit.</p><p>Jon’s parentage reveal will have a big impact on Jon, as it should. </p><p>A big portion of Jon’s identity is constructed around him thinking Ned is his father and he himself is a bastard. Learning that he’s not Ned’s son is going to shake Jon’s world, no matter what, but also learning that he is a Targaryen and has a claim to the Iron Throne is a whole other thing on top of that. </p><figure data-orig-width=\"1153\" data-orig-height=\"615\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0ce38cf4d47891c56c1a7758556420b2/tumblr_inline_pnliv8hX8G1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"1153\" data-orig-height=\"615\"></figure><p>Before Jon’s first walk ends, he looks back and pauses, almost as though he heard the feather fall, only to turn back to continue forward.<br></p><p>This could be interpreted as many different things, but for me it really comes down to Jon “hearing” Lyanna. Everyone is so focused on Rhaegar being Jon’s father, that they forget Lyanna is the mother Jon never knew he had and has wanted from the very beginning.</p><p>I think there will be a moment where Jon is in front of Lyanna’s statue, perhaps finding a connection to a woman he never noticed all the times he was in the Crypts of Winterfell as a child. Always so focus on the Old Kings of Winterfell and how he would never be one. </p><p>Jon turning back to continue walking leads into Sansa’s walk beginning – at first this makes it seem as though she is just following him down the same corridor, but she is not.</p><p>But nonetheless, the feather falling ends Jon’s walk and begins Sansa’s. </p><figure data-orig-width=\"590\" data-orig-height=\"350\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/6005e8cebeee20f974853bb3c7bbf74d/tumblr_inline_pnlittzooe1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"590\" data-orig-height=\"350\"></figure><p><b>Sansa’s Solo Walk is 6/7 seconds long</b><br></p><p>Her walk is less “dynamic” than Jon’s, less overall shots and plot info being laid out, but she looks back onto her mother’s statue as we begin to hear Catelyn’s voice and the beginning of her quote –</p><p>“All this horror that has come to my family…”</p><p>Catelyn’s full quote is about how all the tragedies that have fallen upon the Starks was because she couldn’t love Jon. </p><p>What has happened to the Starks has nothing to do with the fact that Catelyn ostracized Jon, but it is still an important character moment for Catelyn and one of the few lines she has about Jon. </p><p>It also puts a certain idea into the audience’s head –</p><p>The salvation for the Stark family, the future where they won’t be the victims of countless tragedies, is contingent on them embracing and loving Jon.</p><p>However, unlike Cat, who couldn’t love Jon because she thought he was Ned’s son, the Stark children (Arya and Sansa), might have the opposite problem. </p><p>Finding it difficult to accept Jon when they find out “he’s not one of them.” Though that might be more Arya and less Sansa, but will get into that in a bit. </p><p>I would like to point out that both this teaser and the Tapestry one, bring to the forefront the pain Catelyn felt for Ned bringing Jon home and the rift it caused in their relationship.</p><p>You could easily bring up Jon’s parentage without that aspect, so it’s interesting that idea keeps being mentioned. But back to the walk -</p><p>Jon’s walk ends with him looking back as the feather (Lyanna) fell to the ground.</p><p>Sansa in the show has been associated with both the feather and Lyanna’s statue as well as sporting if not the same hairstyle in the promo, one very similar to Lyanna’s when she was married to Rhaegar. Possibly indicating a bridal future for Sansa, but also -</p><p>That Jon’s connection to the Starks are through his mother and Sansa (possibly his future wife).</p><p>Overall the emphasis on the feather is quite interesting.</p><p>Though it makes sense, since it’s the only iconic item to Lyanna Stark within the active narrative of show, the blue rose is hinted at in the promos, backgrounds, and extra featurettes of the show, but it’s not as prevalent in the show as it is in the books.</p><p>When I first watched the promo, I really thought Sansa was going to pick the feather up from the ground –</p><p>Showing the connection between Lyanna, Jon, and Sansa, as while as telling us that Sansa will carry on Lyanna’s dying wish of protecting Jon. And connecting aunt and niece as connections for Jon to his Stark family.</p><p>The first part of Catelyn’s quote is the end of Sansa’s walk, but the second part is the beginning of Arya’s quote.</p><figure data-orig-width=\"2276\" data-orig-height=\"1242\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/96a2a70d2885010f5da8e0a6f8e4946e/tumblr_inline_pnliwt84Mn1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"2276\" data-orig-height=\"1242\"></figure><p><b>Arya’s Solo Walk is about 4 seconds –</b><br></p><p>Arya’s walk is shorter than both Jon and Sansa’s and she doesn’t look at any statues (past figures). So, you might think there’s less to discuss.</p><p>However, the second part of Catelyn’s voiceover is over Arya’s walk.</p><p>“…it’s all because I couldn’t love a motherless child.”</p><p>Catelyn line being over both Arya and Sansa, connects the two sisters to not only Catelyn, but also Jon and put forth the challenge of them being better than their mother in how they treat him.</p><p>However, the part of how Catelyn couldn’t love Jon, could be hinting at a future struggle for Arya.</p><p>Arya has certainly changed from the girl she used to be.</p><p>In many ways, her world view has become more than a bit severe. And Arya has grown a strong sense of place with her identity as a Stark and seeking revenge for those who’ve wrong the Starks in the past.</p><p>She slaughtered the Freys for the Starks and was more than willing to behead the Northern Lords in order to protect Jon.</p><p>While that last one might indicate Arya would never “turn” on Jon, it also shows that Arya’s loyalty might not be exactly to who Jon is now, but to her memory of him. To her family.</p><p>If she feels he doesn’t have the same loyalty, then….</p><p>Arya is also not exactly the most open person anymore, nor understanding – especially when it comes to political games or shows.</p><p>Sansa might be willing to give Dany Winterfell or at least be willing to say as much and bear and grin it, but Arya might have a harder time swallowing her tongue. </p><p>While Jon and Sansa take after who Ned really was, someone who was quite capable of deceiving those he loved and doing dishonorable things for a greater purpose. Arya (and Robb) seem to take after the image of who their father was, the honorable man who never strayed from the path of what he believed was right (though Arya is a much darker and twisted take on that idea)</p><p>And Arya also has gained some of Catelyn’s less than admirable traits, so…</p><p>Plus, Catelyn’s struggle was that she couldn’t love Jon, because she believed he was Ned’s bastard. So, it would be interesting that Arya might struggle with her relationship with Jon, because he’s not Ned’s bastard.</p><p>Perhaps not that literally, but –</p><p>Arya and Jon always got along, as the two outsider children and Arya found comfort in Jon being different in how she thought she was different (though arguably young Arya was likely projecting onto Jon).</p><p>But Jon being revealed to not being her brother and him possibly playing the political game and showing more loyalty to Dany, even just for show, might not go over well with Arya.</p><p>I’m not saying Arya is going to hurt Jon, but there might be some tense moments. Especially since…</p><p>Jon and Arya’s reunion has been built up so much by the fans and the characters within the show as being this wonderful and sweet reunion to happen - so there being tension between these two wouldn’t surprise me.</p><p>But while I think this might a struggle for Arya and the seed for some tense moments, Arya will protect her family, no matter what. </p><hr><figure data-orig-width=\"644\" data-orig-height=\"410\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d120a1f92dd3f8446b08e509da913c12/tumblr_inline_pnlj0blZIB1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"644\" data-orig-height=\"410\"></figure><p><br>The Statues in the crypt are great in my opinion. Doing the wonderful surface-level job of hinting at their deaths (like many of the season promos have done). Especially since, Jon and Sansa, walked past fallen characters who now have their own statues.<br></p><p>Perhaps this is telling us these three will die in the upcoming battle, or perhaps the statues are telling us who will be remembered in history. </p><p>You can’t have a legacy until your dead (and you will die in the end).</p><p>Jon, Sansa and Arya will be remembered. The Statues to me don’t really signify their upcoming deaths, but that they are immortalized by their actions and the present for future generations. </p><p>Bran being absent is very telling. Showing us what role, he might play in this story.</p><p>Bran and his story are strongly tied to magic and the Night King, his own absence from the trailer and his lack of statue, indicates that while he might be integral to defeating the Others (him, not dragons), he won’t have a role to play afterwards.</p><p>He might not be remembered as an important figure in history or at least not in the political history. While Jon, Sansa and Arya will be remembered just as Arya remembered Aegon, Visenya and Rhaenys.</p><p>Its also possible, Bran might get his own promo highlighting his importance to the story, but separating him from the Stark narrative.</p><p>Basically, I believe, the statues are telling us who will be important in the history books. Those three will be the ones who future generations remember when they’re playing with each other as kids and who the future songs will be about.</p><p><b>The Torches Going Out</b></p><p>This is far from new. The candles, torches or fireplaces going out representing the Others and Winter coming has been a stable to GOT promos, since pretty much the beginning. But it’s also starting to take on a different meaning, or not different, but clearer.</p><p>Fire may destroy the wights, but we’ve seen within the show itself that even dragon fire is nothing to the Night King. Fire (the dragons) aren’t effective when it comes to White Walkers.</p><p>Actually, and this is random, but when I saw this and when I was thinking about it, I thought of the matching phone game – Empires &amp; Puzzles. In the game,</p><p>Fire is effective against Nature and Nature is effective Ice and Ice is effective against Fire.</p><p>Fire (dragons) can destroy the Weirwood Trees (Winterfell)</p><p>The Weirwood Trees (Bran) can destroy the White Walkers</p><p>The White Walkers can destroy the Dragons</p><p>Similar to the Tapestry Promo, this may be less of a war between two opposing force, but three forces.</p><p>Either way I think promo worked really well and I’m excited to seeing the Starks once more (which is the true goal of a promo). Sorry for the messy writing and analysis. </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "lady-griffin",
                    "active": true,
                    "theme": {
                        "header_full_width": 1800,
                        "header_full_height": 1200,
                        "header_focus_width": 1016,
                        "header_focus_height": 572,
                        "avatar_shape": "circle",
                        "background_color": "#f7dced",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "75,1414,647,398",
                        "header_image": "https://static.tumblr.com/2c6c960f02e34a147605448f2c619b93/uv26dhy/VMfnri5cq/tumblr_static_105ayis3lr8gg8wo0ssow0sss.jpg",
                        "header_image_focused": "https://static.tumblr.com/2c6c960f02e34a147605448f2c619b93/uv26dhy/w9Rpst9mx/tumblr_static_tumblr_static_105ayis3lr8gg8wo0ssow0sss_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_08_focused_v3.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_stretch": true,
                        "link_color": "#86649b",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183097858741"
                },
                "content_raw": "<p><figure class=\"tmblr-embed tmblr-full\" data-provider=\"youtube\" data-orig-width=\"540\" data-orig-height=\"304\" data-url=\"https%3A%2F%2Fwww.youtube.com%2Fwatch%3Ftime_continue%3D20%26v%3D7LiyXFYaEAY\"><iframe width=\"540\" height=\"304\" id=\"youtube_iframe\" src=\"https://www.youtube.com/embed/7LiyXFYaEAY?feature=oembed&amp;enablejsapi=1&amp;origin=https://safe.txmblr.com&amp;wmode=opaque\" frameborder=\"0\" allowfullscreen=\"\"></iframe></figure><p>I’ve been wanting to talk about promo since I first saw it, but work has been overwhelming and I needed time to write my thoughts down. So sorry, if no one cares about this promo anymore.<br></p><p>I’m going to be talking about what I think the Crypt promo is hinting or foreshadowing at. But first…</p><p>It is very interesting Sansa is made to be in the center at the end, especially since Jon is at first in the center - standing between both Arya and Sansa as the three meet up. </p><p>But then as they walk to their statues, he moves around Sansa to be on her side, which puts her in the center. This is a 100% deliberate choice, they could’ve easily had them all walk straight towards their own statues with no rearrangements.</p><p>They literally have Jon stay behind Arya and Sansa and then move around Sansa, so he wouldn’t be in the center.</p><p>So why? </p><p>One reasoning, is that it might actually be to avoid certain Targaryen imagery – specifically Aegon the Conqueror who in official art (?) and fan art is often flanked on both sides by his two-sister-wives. </p><p>The second, I imagined Jon being in the center, flanked on either side by his sisters, my mind went to Aegon and his sister-wives… so perhaps, it’s best to avoid that idea altogether. Especially if you don’t want your audience to be weirded out by Jon and Sansa (if I think what is happening is happening).</p><p>It could also be that visually Sansa is the tallest one, so it creates more of a symmetrical aesthetic.</p><p>Especially, when both Jon and Arya draw their swords to face the upcoming danger.</p><p>If Sansa was on the side as both Jon and Arya pull out their swords, that would’ve sideline her from the action – keeping her in the center, keeps her in the scene.</p><p>It could also just be to cement the idea that Sansa is a major player to this season and to the end of the story.</p><p>Basically, from just a promo standpoint, it makes sense to put Sansa in the center, though this promo is all about Jon. Either just to avoid certain Targaryen visuals or to reinforce already existing ideas.</p><p>Now let’s go into some of the story/plot-driven reasons for this promo and its choices (foreshadowing).</p><hr>[[MORE]]<figure data-orig-width=\"1500\" data-orig-height=\"843\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/9f92f3fb68a8327bdef7cfcaf30fc5fa/tumblr_inline_pnlim8goVd1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"1500\" data-orig-height=\"843\"></figure><p><br>One idea (and I’ve seen this a lot) is that this promo is hinting at the Winterfell Crypts residents waking up and attacking. Now there are many theories about this, so I’m not going to go into all that much. But that seems like a possibility…</p><p>Winterfell’s Crypts are mentioned a great deal and the Big Bad is a being who can raise the dead and we know Winterfell will be a major setting so it  all adds up. But in all honestly, I think this a more of red herring idea than actual foreshadowing.</p><p>One of the main reasons is that “realistically” most of the bodies in the crypts are just ashes and pieces of bone, so what exactly is going to be reanimated?</p><p>Really, I think this season is all about the politics and the Walking Dead is a red herring/false start, so that’s what this promo is potentially foreshadowing for us, not the old kings literally coming back and attacking, but more who will become the next “Stark Kings\" or those remembered by history (more about that later).</p><p>But reanimated old Kings would be fun to see. </p><hr><figure data-orig-width=\"735\" data-orig-height=\"485\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/945dc33f9539c9fe336fb5f31d8079e1/tumblr_inline_pnlio3FsCW1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"735\" data-orig-height=\"485\"></figure><p>Jon, Arya and Sansa’s meeting or their walk coverging is very nice. It gives the impression of the Starks being a united front and it’s also a nice homage to when Sansa and Arya were first reunited in front of Ned Stark’s statue.<br></p><figure data-orig-width=\"700\" data-orig-height=\"700\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/12e291814a93b3fc554e3b6d980372bf/tumblr_inline_pnljci8EeF1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"700\" data-orig-height=\"700\"></figure><p><br>But really, the meet-up/convergence of these three, is reflecting the past tension between Sansa and Arya in the past season(s) (and when they were young). </p><p>Their past fights and “stand-offs” are no longer important or relevant when the three walks converge as the two sisters have a new mission when Jon enters the scene. They can’t find amongst themselves, when they have Jon to protect.</p><p>But yet, the promo doesn’t end indicating that Sansa and Arya will protect Jon. But instead, that Jon and Arya will protect Sansa.</p><figure data-orig-width=\"1554\" data-orig-height=\"840\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d74e2f21aa68cdaf6458840e618897da/tumblr_inline_pnliq3z7Eo1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"1554\" data-orig-height=\"840\"></figure><p><br>The idea of Sansa potentially being kidnapped is a possibility and Arya and Jon drawing their swords to protect her, could be hinting at this. But this moment could also just be showing that Sansa is more vulnerable to outside threats, but nonetheless is protected by the Stark family.<br></p><p>The two Starks that might be viewed by outsiders as “wild-cards,” the King who bent the knee and the girl who grew up to be a “Faceless assassin,” have no hesitation in standing against the upcoming threat and protecting their own.</p><p>The Starks are a unit or pack. </p><p>Also, while I’ve brought it up, it is important to note that Jon was in the center, but moved to Sansa’s side. This might be a stretch, but this might indicate that Jon is not the key to get the Stark Alliance.</p><p>Daenerys and her camp (as well as Cersei) both focused on Jon being the key to getting the North (which makes sense, he was the King). But Jon moving to the side, putting Sansa center and front, shows the audience who the central figure to the Stark Family is.</p><p>Which leads into the idea, that Sansa is central to the Starks’ Future.</p><p>Multiple times she has been referred to as the Key to the North and has been viewed as the legitimate heir to Winterfell. And both Tywin Lannister and Roose Bolton (and Littlefinger) believed whoever sired a child with Sansa, would be in control of Winterfell as that child would be the future Lord.</p><p>So, Sansa is definitely a key to the future of House Starks in several ways.</p><p>The real interesting thing though, is this promo isn’t about Sansa or even House Stark as a whole.</p><p>It’s all about Jon.</p><p>All the lines pertain to him and it’s about who he really is and his story, and yet Sansa still gets a lot of attention. More so than Arya, as the time between them isn’t split evenly. Hinting that Sansa plays an important part to who Jon currently is, but also where his story and future are going.</p><p>And I know I keep repeating this, but it’s odd to make Sansa the central character in the end – as</p><p>A. The Promo isn’t about her<br>B. Jon is a more central character to the story</p><p>But really a main idea that I think some people are overlooking, is that Jon is heavily connected to the Starks and their present and future. He is an integral part to the Stark Pack. </p><hr><p><b> The Intro Walks of Jon, Sansa and Arya.</b></p><figure data-orig-width=\"600\" data-orig-height=\"425\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/34ad74068ea5014aa491ec6d81da8b55/tumblr_inline_pnlisdQenn1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"600\" data-orig-height=\"425\"></figure><p><b>Jon’s 1<sup>st</sup> walk is 17/18 seconds long<br></b><b>Jon’s 2<sup>nd</sup> walk is 9 seconds long </b></p><p><b>26/27 seconds altogether</b></p><p>He gets the most time and two separate walks to boot.</p><p>This makes sense, as he is the focus of this promo and is one of the biggest focuses of the show’s overall story. </p><p>Jon walks right past Lyanna’s statue. This is a reflection of Jon always wanting to know who his mother was, but was blind (lied to) about the truth. He walks right past the truth and his real mother and later pauses and stares directly at the man (Ned) he based so much on who he is now. </p><p>It is telling that Lyanna’s line is spoken before Ned’s though. </p><p>Indicating, that Jon will learn of his true parentage, falter in his identity, only to be reminded (by Ned’s line) that he’s never been a Stark in name and yet, has always been a Stark in blood.  </p><p>When Ned’s Line is spoken and Jon is looking at Ned’s Statue, it really does come across that Ned is directly talking to Jon in that moment. While Sansa also looks at Catelyn’s statue, it’s different as we don’t get the impression she can hear Catelyn’s words.</p><p>Jon can hear Ned’s words. </p><p>Also Lyanna’s line, while I think is reminding us of who “Jon really is” isn’t the one where she told Ned that Jon was Aegon Targaryen, instead it’s her begging Ned to protect Jon.</p><p>Though Robert, who Lyanna afraid would hurt her child, is now gone. So who is this past plead about now? The Starks? Maybe. Or perhaps, another Targaryen who might see Jon as a threat. </p><p>Lyanna’s line is also interesting, because her pleading is connected to Jon being taken in by Ned and Ned claiming him as his son, which caused a rift in Ned’s marriage and in the Stark family. </p><p>Finally, I think both Lyanna and Ned are indicators of who Jon will choose in the end. Jon is a Stark through Lyanna, but also chooses to be a Stark through the father he chooses. </p><p>This is further emphasized by the statue of Jon in the end. As in the books, the statues are really only reserved for the former Kings and Lords of Winterfell, but will get to that in a bit.</p><p>Jon’s parentage reveal will have a big impact on Jon, as it should. </p><p>A big portion of Jon’s identity is constructed around him thinking Ned is his father and he himself is a bastard. Learning that he’s not Ned’s son is going to shake Jon’s world, no matter what, but also learning that he is a Targaryen and has a claim to the Iron Throne is a whole other thing on top of that. </p><figure data-orig-width=\"1153\" data-orig-height=\"615\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0ce38cf4d47891c56c1a7758556420b2/tumblr_inline_pnliv8hX8G1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"1153\" data-orig-height=\"615\"></figure><p>Before Jon’s first walk ends, he looks back and pauses, almost as though he heard the feather fall, only to turn back to continue forward.<br></p><p>This could be interpreted as many different things, but for me it really comes down to Jon “hearing” Lyanna. Everyone is so focused on Rhaegar being Jon’s father, that they forget Lyanna is the mother Jon never knew he had and has wanted from the very beginning.</p><p>I think there will be a moment where Jon is in front of Lyanna’s statue, perhaps finding a connection to a woman he never noticed all the times he was in the Crypts of Winterfell as a child. Always so focus on the Old Kings of Winterfell and how he would never be one. </p><p>Jon turning back to continue walking leads into Sansa’s walk beginning – at first this makes it seem as though she is just following him down the same corridor, but she is not.</p><p>But nonetheless, the feather falling ends Jon’s walk and begins Sansa’s. </p><figure data-orig-width=\"590\" data-orig-height=\"350\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/6005e8cebeee20f974853bb3c7bbf74d/tumblr_inline_pnlittzooe1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"590\" data-orig-height=\"350\"></figure><p><b>Sansa’s Solo Walk is 6/7 seconds long</b><br></p><p>Her walk is less “dynamic” than Jon’s, less overall shots and plot info being laid out, but she looks back onto her mother’s statue as we begin to hear Catelyn’s voice and the beginning of her quote –</p><p>“All this horror that has come to my family…”</p><p>Catelyn’s full quote is about how all the tragedies that have fallen upon the Starks was because she couldn’t love Jon. </p><p>What has happened to the Starks has nothing to do with the fact that Catelyn ostracized Jon, but it is still an important character moment for Catelyn and one of the few lines she has about Jon. </p><p>It also puts a certain idea into the audience’s head –</p><p>The salvation for the Stark family, the future where they won’t be the victims of countless tragedies, is contingent on them embracing and loving Jon.</p><p>However, unlike Cat, who couldn’t love Jon because she thought he was Ned’s son, the Stark children (Arya and Sansa), might have the opposite problem. </p><p>Finding it difficult to accept Jon when they find out “he’s not one of them.” Though that might be more Arya and less Sansa, but will get into that in a bit. </p><p>I would like to point out that both this teaser and the Tapestry one, bring to the forefront the pain Catelyn felt for Ned bringing Jon home and the rift it caused in their relationship.</p><p>You could easily bring up Jon’s parentage without that aspect, so it’s interesting that idea keeps being mentioned. But back to the walk -</p><p>Jon’s walk ends with him looking back as the feather (Lyanna) fell to the ground.</p><p>Sansa in the show has been associated with both the feather and Lyanna’s statue as well as sporting if not the same hairstyle in the promo, one very similar to Lyanna’s when she was married to Rhaegar. Possibly indicating a bridal future for Sansa, but also -</p><p>That Jon’s connection to the Starks are through his mother and Sansa (possibly his future wife).</p><p>Overall the emphasis on the feather is quite interesting.</p><p>Though it makes sense, since it’s the only iconic item to Lyanna Stark within the active narrative of show, the blue rose is hinted at in the promos, backgrounds, and extra featurettes of the show, but it’s not as prevalent in the show as it is in the books.</p><p>When I first watched the promo, I really thought Sansa was going to pick the feather up from the ground –</p><p>Showing the connection between Lyanna, Jon, and Sansa, as while as telling us that Sansa will carry on Lyanna’s dying wish of protecting Jon. And connecting aunt and niece as connections for Jon to his Stark family.</p><p>The first part of Catelyn’s quote is the end of Sansa’s walk, but the second part is the beginning of Arya’s quote.</p><figure data-orig-width=\"2276\" data-orig-height=\"1242\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/96a2a70d2885010f5da8e0a6f8e4946e/tumblr_inline_pnliwt84Mn1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"2276\" data-orig-height=\"1242\"></figure><p><b>Arya’s Solo Walk is about 4 seconds –</b><br></p><p>Arya’s walk is shorter than both Jon and Sansa’s and she doesn’t look at any statues (past figures). So, you might think there’s less to discuss.</p><p>However, the second part of Catelyn’s voiceover is over Arya’s walk.</p><p>“…it’s all because I couldn’t love a motherless child.”</p><p>Catelyn line being over both Arya and Sansa, connects the two sisters to not only Catelyn, but also Jon and put forth the challenge of them being better than their mother in how they treat him.</p><p>However, the part of how Catelyn couldn’t love Jon, could be hinting at a future struggle for Arya.</p><p>Arya has certainly changed from the girl she used to be.</p><p>In many ways, her world view has become more than a bit severe. And Arya has grown a strong sense of place with her identity as a Stark and seeking revenge for those who’ve wrong the Starks in the past.</p><p>She slaughtered the Freys for the Starks and was more than willing to behead the Northern Lords in order to protect Jon.</p><p>While that last one might indicate Arya would never “turn” on Jon, it also shows that Arya’s loyalty might not be exactly to who Jon is now, but to her memory of him. To her family.</p><p>If she feels he doesn’t have the same loyalty, then….</p><p>Arya is also not exactly the most open person anymore, nor understanding – especially when it comes to political games or shows.</p><p>Sansa might be willing to give Dany Winterfell or at least be willing to say as much and bear and grin it, but Arya might have a harder time swallowing her tongue. </p><p>While Jon and Sansa take after who Ned really was, someone who was quite capable of deceiving those he loved and doing dishonorable things for a greater purpose. Arya (and Robb) seem to take after the image of who their father was, the honorable man who never strayed from the path of what he believed was right (though Arya is a much darker and twisted take on that idea)</p><p>And Arya also has gained some of Catelyn’s less than admirable traits, so…</p><p>Plus, Catelyn’s struggle was that she couldn’t love Jon, because she believed he was Ned’s bastard. So, it would be interesting that Arya might struggle with her relationship with Jon, because he’s not Ned’s bastard.</p><p>Perhaps not that literally, but –</p><p>Arya and Jon always got along, as the two outsider children and Arya found comfort in Jon being different in how she thought she was different (though arguably young Arya was likely projecting onto Jon).</p><p>But Jon being revealed to not being her brother and him possibly playing the political game and showing more loyalty to Dany, even just for show, might not go over well with Arya.</p><p>I’m not saying Arya is going to hurt Jon, but there might be some tense moments. Especially since…</p><p>Jon and Arya’s reunion has been built up so much by the fans and the characters within the show as being this wonderful and sweet reunion to happen - so there being tension between these two wouldn’t surprise me.</p><p>But while I think this might a struggle for Arya and the seed for some tense moments, Arya will protect her family, no matter what. </p><hr><figure data-orig-width=\"644\" data-orig-height=\"410\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d120a1f92dd3f8446b08e509da913c12/tumblr_inline_pnlj0blZIB1qg9ixw_1280.png\" alt=\"image\" data-orig-width=\"644\" data-orig-height=\"410\"></figure><p><br>The Statues in the crypt are great in my opinion. Doing the wonderful surface-level job of hinting at their deaths (like many of the season promos have done). Especially since, Jon and Sansa, walked past fallen characters who now have their own statues.<br></p><p>Perhaps this is telling us these three will die in the upcoming battle, or perhaps the statues are telling us who will be remembered in history. </p><p>You can’t have a legacy until your dead (and you will die in the end).</p><p>Jon, Sansa and Arya will be remembered. The Statues to me don’t really signify their upcoming deaths, but that they are immortalized by their actions and the present for future generations. </p><p>Bran being absent is very telling. Showing us what role, he might play in this story.</p><p>Bran and his story are strongly tied to magic and the Night King, his own absence from the trailer and his lack of statue, indicates that while he might be integral to defeating the Others (him, not dragons), he won’t have a role to play afterwards.</p><p>He might not be remembered as an important figure in history or at least not in the political history. While Jon, Sansa and Arya will be remembered just as Arya remembered Aegon, Visenya and Rhaenys.</p><p>Its also possible, Bran might get his own promo highlighting his importance to the story, but separating him from the Stark narrative.</p><p>Basically, I believe, the statues are telling us who will be important in the history books. Those three will be the ones who future generations remember when they’re playing with each other as kids and who the future songs will be about.</p><p><b>The Torches Going Out</b></p><p>This is far from new. The candles, torches or fireplaces going out representing the Others and Winter coming has been a stable to GOT promos, since pretty much the beginning. But it’s also starting to take on a different meaning, or not different, but clearer.</p><p>Fire may destroy the wights, but we’ve seen within the show itself that even dragon fire is nothing to the Night King. Fire (the dragons) aren’t effective when it comes to White Walkers.</p><p>Actually, and this is random, but when I saw this and when I was thinking about it, I thought of the matching phone game – Empires &amp; Puzzles. In the game,</p><p>Fire is effective against Nature and Nature is effective Ice and Ice is effective against Fire.</p><p>Fire (dragons) can destroy the Weirwood Trees (Winterfell)</p><p>The Weirwood Trees (Bran) can destroy the White Walkers</p><p>The White Walkers can destroy the Dragons</p><p>Similar to the Tapestry Promo, this may be less of a war between two opposing force, but three forces.</p><p>Either way I think promo worked really well and I’m excited to seeing the Starks once more (which is the true goal of a promo). Sorry for the messy writing and analysis. </p></p>",
                "content": "<p><figure class=\"tmblr-embed tmblr-full\"><p><a href=\"#\"><img src=\"https://assets.tumblr.com/images/inline_placeholder.png\" width=\"18\" height=\"14\"/></a></p></figure><p>I&rsquo;ve been wanting to talk about promo since I first saw it, but work has been overwhelming and I needed time to write my thoughts down. So sorry, if no one cares about this promo anymore.<br /></p><p>I&rsquo;m going to be talking about what I think the Crypt promo is hinting or foreshadowing at. But first&hellip;</p><p>It is very interesting Sansa is made to be in the center at the end, especially since Jon is at first in the center - standing between both Arya and Sansa as the three meet up. </p><p>But then as they walk to their statues, he moves around Sansa to be on her side, which puts her in the center. This is a 100% deliberate choice, they could&rsquo;ve easily had them all walk straight towards their own statues with no rearrangements.</p><p>They literally have Jon stay behind Arya and Sansa and then move around Sansa, so he wouldn&rsquo;t be in the center.</p><p>So why? </p><p>One reasoning, is that it might actually be to avoid certain Targaryen imagery &ndash; specifically Aegon the Conqueror who in official art (?) and fan art is often flanked on both sides by his two-sister-wives. </p><p>The second, I imagined Jon being in the center, flanked on either side by his sisters, my mind went to Aegon and his sister-wives&hellip; so perhaps, it&rsquo;s best to avoid that idea altogether. Especially if you don&rsquo;t want your audience to be weirded out by Jon and Sansa (if I think what is happening is happening).</p><p>It could also be that visually Sansa is the tallest one, so it creates more of a symmetrical aesthetic.</p><p>Especially, when both Jon and Arya draw their swords to face the upcoming danger.</p><p>If Sansa was on the side as both Jon and Arya pull out their swords, that would&rsquo;ve sideline her from the action &ndash; keeping her in the center, keeps her in the scene.</p><p>It could also just be to cement the idea that Sansa is a major player to this season and to the end of the story.</p><p>Basically, from just a promo standpoint, it makes sense to put Sansa in the center, though this promo is all about Jon. Either just to avoid certain Targaryen visuals or to reinforce already existing ideas.</p><p>Now let&rsquo;s go into some of the story/plot-driven reasons for this promo and its choices (foreshadowing).</p><hr /><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/9f92f3fb68a8327bdef7cfcaf30fc5fa/tumblr_inline_pnlim8goVd1qg9ixw_1280.png\" class=\"\"/></figure><p><br />One idea (and I&rsquo;ve seen this a lot) is that this promo is hinting at the Winterfell Crypts residents waking up and attacking. Now there are many theories about this, so I&rsquo;m not going to go into all that much. But that seems like a possibility&hellip;</p><p>Winterfell&rsquo;s Crypts are mentioned a great deal and the Big Bad is a being who can raise the dead and we know Winterfell will be a major setting so it &nbsp;all adds up. But in all honestly, I think this a more of red herring idea than actual foreshadowing.</p><p>One of the main reasons is that &ldquo;realistically&rdquo; most of the bodies in the crypts are just ashes and pieces of bone, so what exactly is going to be reanimated?</p><p>Really, I think this season is all about the politics and the Walking Dead is a red herring/false start, so that&rsquo;s what this promo is potentially foreshadowing for us, not the old kings literally coming back and attacking, but more who will become the next &ldquo;Stark Kings\" or those remembered by history (more about that later).</p><p>But reanimated old Kings would be fun to see.&nbsp;</p><hr /><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/945dc33f9539c9fe336fb5f31d8079e1/tumblr_inline_pnlio3FsCW1qg9ixw_1280.png\" class=\"\"/></figure><p>Jon, Arya and Sansa&rsquo;s meeting or their walk coverging is very nice. It gives the impression of the Starks being a united front and it&rsquo;s also a nice homage to when Sansa and Arya were first reunited in front of Ned Stark&rsquo;s statue.<br /></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/12e291814a93b3fc554e3b6d980372bf/tumblr_inline_pnljci8EeF1qg9ixw_1280.png\" class=\"\"/></figure><p><br />But really, the meet-up/convergence of these three, is reflecting the past tension between Sansa and Arya in the past season(s) (and when they were young). </p><p>Their past fights and &ldquo;stand-offs&rdquo; are no longer important or relevant when the three walks converge as the two sisters have a new mission when Jon enters the scene. They can&rsquo;t find amongst themselves, when they have Jon to protect.</p><p>But yet, the promo doesn&rsquo;t end indicating that Sansa and Arya will protect Jon. But instead, that Jon and Arya will protect Sansa.</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d74e2f21aa68cdaf6458840e618897da/tumblr_inline_pnliq3z7Eo1qg9ixw_1280.png\" class=\"\"/></figure><p><br />The idea of Sansa potentially being kidnapped is a possibility and Arya and Jon drawing their swords to protect her, could be hinting at this. But this moment could also just be showing that Sansa is more vulnerable to outside threats, but nonetheless is protected by the Stark family.<br /></p><p>The two Starks that might be viewed by outsiders as &ldquo;wild-cards,&rdquo; the King who bent the knee and the girl who grew up to be a &ldquo;Faceless assassin,&rdquo; have no hesitation in standing against the upcoming threat and protecting their own.</p><p>The Starks are a unit or pack. </p><p>Also, while I&rsquo;ve brought it up, it is important to note that Jon was in the center, but moved to Sansa&rsquo;s side. This might be a stretch, but this might indicate that Jon is not the key to get the Stark Alliance.</p><p>Daenerys and her camp (as well as Cersei) both focused on Jon being the key to getting the North (which makes sense, he was the King). But Jon moving to the side, putting Sansa center and front, shows the audience who the central figure to the Stark Family is.</p><p>Which leads into the idea, that Sansa is central to the Starks&rsquo; Future.</p><p>Multiple times she has been referred to as the Key to the North and has been viewed as the legitimate heir to Winterfell. And both Tywin Lannister and Roose Bolton (and Littlefinger) believed whoever sired a child with Sansa, would be in control of Winterfell as that child would be the future Lord.</p><p>So, Sansa is definitely a key to the future of House Starks in several ways.</p><p>The real interesting thing though, is this promo isn&rsquo;t about Sansa or even House Stark as a whole.</p><p>It&rsquo;s all about Jon.</p><p>All the lines pertain to him and it&rsquo;s about who he really is and his story, and yet Sansa still gets a lot of attention. More so than Arya, as the time between them isn&rsquo;t split evenly. Hinting that Sansa plays an important part to who Jon currently is, but also where his story and future are going.</p><p>And I know I keep repeating this, but it&rsquo;s odd to make Sansa the central character in the end &ndash; as</p><p>A. The Promo isn&rsquo;t about her<br />B. Jon is a more central character to the story</p><p>But really a main idea that I think some people are overlooking, is that Jon is heavily connected to the Starks and their present and future. He is an integral part to the Stark Pack. </p><hr /><p><b> The Intro Walks of Jon, Sansa and Arya.</b></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/34ad74068ea5014aa491ec6d81da8b55/tumblr_inline_pnlisdQenn1qg9ixw_1280.png\" class=\"\"/></figure><p><b>Jon&rsquo;s 1<sup>st</sup> walk is 17/18 seconds long<br /></b><b>Jon&rsquo;s 2<sup>nd</sup> walk is 9 seconds long&nbsp;</b></p><p><b>26/27 seconds altogether</b></p><p>He gets the most time and two separate walks to boot.</p><p>This makes sense, as he is the focus of this promo and is one of the biggest focuses of the show&rsquo;s overall story. </p><p>Jon walks right past Lyanna&rsquo;s statue. This is a reflection of Jon always wanting to know who his mother was, but was blind (lied to) about the truth. He walks right past the truth and his real mother and later pauses and stares directly at the man (Ned) he based so much on who he is now. </p><p>It is telling that Lyanna&rsquo;s line is spoken before Ned&rsquo;s though. </p><p>Indicating, that Jon will learn of his true parentage, falter in his identity, only to be reminded (by Ned&rsquo;s line) that he&rsquo;s never been a Stark in name and yet, has always been a Stark in blood. &nbsp;</p><p>When Ned&rsquo;s Line is spoken and Jon is looking at Ned&rsquo;s Statue, it really does come across that Ned is directly talking to Jon in that moment. While Sansa also looks at Catelyn&rsquo;s statue, it&rsquo;s different as we don&rsquo;t get the impression she can hear Catelyn&rsquo;s words.</p><p>Jon can hear Ned&rsquo;s words. </p><p>Also Lyanna&rsquo;s line, while I think is reminding us of who &ldquo;Jon really is&rdquo; isn&rsquo;t the one where she told Ned that Jon was Aegon Targaryen, instead it&rsquo;s her begging Ned to protect Jon.</p><p>Though Robert, who Lyanna afraid would hurt her child, is now gone. So who is this past plead about now? The Starks? Maybe. Or perhaps, another Targaryen who might see Jon as a threat. </p><p>Lyanna&rsquo;s line is also interesting, because her pleading is connected to Jon being taken in by Ned and Ned claiming him as his son, which caused a rift in Ned&rsquo;s marriage and in the Stark family. </p><p>Finally, I think both Lyanna and Ned are indicators of who Jon will choose in the end. Jon is a Stark through Lyanna, but also chooses to be a Stark through the father he chooses. </p><p>This is further emphasized by the statue of Jon in the end. As in the books, the statues are really only reserved for the former Kings and Lords of Winterfell, but will get to that in a bit.</p><p>Jon&rsquo;s parentage reveal will have a big impact on Jon, as it should. </p><p>A big portion of Jon&rsquo;s identity is constructed around him thinking Ned is his father and he himself is a bastard. Learning that he&rsquo;s not Ned&rsquo;s son is going to shake Jon&rsquo;s world, no matter what, but also learning that he is a Targaryen and has a claim to the Iron Throne is a whole other thing on top of that. </p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0ce38cf4d47891c56c1a7758556420b2/tumblr_inline_pnliv8hX8G1qg9ixw_1280.png\" class=\"\"/></figure><p>Before Jon&rsquo;s first walk ends, he looks back and pauses, almost as though he heard the feather fall, only to turn back to continue forward.<br /></p><p>This could be interpreted as many different things, but for me it really comes down to Jon &ldquo;hearing&rdquo; Lyanna. Everyone is so focused on Rhaegar being Jon&rsquo;s father, that they forget Lyanna is the mother Jon never knew he had and has wanted from the very beginning.</p><p>I think there will be a moment where Jon is in front of Lyanna&rsquo;s statue, perhaps finding a connection to a woman he never noticed all the times he was in the Crypts of Winterfell as a child. Always so focus on the Old Kings of Winterfell and how he would never be one. </p><p>Jon turning back to continue walking leads into Sansa&rsquo;s walk beginning &ndash; at first this makes it seem as though she is just following him down the same corridor, but she is not.</p><p>But nonetheless, the feather falling ends Jon&rsquo;s walk and begins Sansa&rsquo;s.&nbsp;</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/6005e8cebeee20f974853bb3c7bbf74d/tumblr_inline_pnlittzooe1qg9ixw_1280.png\" class=\"\"/></figure><p><b>Sansa&rsquo;s Solo Walk is 6/7 seconds long</b><br /></p><p>Her walk is less &ldquo;dynamic&rdquo; than Jon&rsquo;s, less overall shots and plot info being laid out, but she looks back onto her mother&rsquo;s statue as we begin to hear Catelyn&rsquo;s voice and the beginning of her quote &ndash;</p><p>&ldquo;All this horror that has come to my family&hellip;&rdquo;</p><p>Catelyn&rsquo;s full quote is about how all the tragedies that have fallen upon the Starks was because she couldn&rsquo;t love Jon. </p><p>What has happened to the Starks has nothing to do with the fact that Catelyn ostracized Jon, but it is still an important character moment for Catelyn and one of the few lines she has about Jon. </p><p>It also puts a certain idea into the audience&rsquo;s head &ndash;</p><p>The salvation for the Stark family, the future where they won&rsquo;t be the victims of countless tragedies, is contingent on them embracing and loving Jon.</p><p>However, unlike Cat, who couldn&rsquo;t love Jon because she thought he was Ned&rsquo;s son, the Stark children (Arya and Sansa), might have the opposite problem. </p><p>Finding it difficult to accept Jon when they find out &ldquo;he&rsquo;s not one of them.&rdquo; Though that might be more Arya and less Sansa, but will get into that in a bit. </p><p>I would like to point out that both this teaser and the Tapestry one, bring to the forefront the pain Catelyn felt for Ned bringing Jon home and the rift it caused in their relationship.</p><p>You could easily bring up Jon&rsquo;s parentage without that aspect, so it&rsquo;s interesting that idea keeps being mentioned. But back to the walk -</p><p>Jon&rsquo;s walk ends with him looking back as the feather (Lyanna) fell to the ground.</p><p>Sansa in the show has been associated with both the feather and Lyanna&rsquo;s statue as well as sporting if not the same hairstyle in the promo, one very similar to Lyanna&rsquo;s when she was married to Rhaegar. Possibly indicating a bridal future for Sansa, but also -</p><p>That Jon&rsquo;s connection to the Starks are through his mother and Sansa (possibly his future wife).</p><p>Overall the emphasis on the feather is quite interesting.</p><p>Though it makes sense, since it&rsquo;s the only iconic item to Lyanna Stark within the active narrative of show, the blue rose is hinted at in the promos, backgrounds, and extra featurettes of the show, but it&rsquo;s not as prevalent in the show as it is in the books.</p><p>When I first watched the promo, I really thought Sansa was going to pick the feather up from the ground &ndash;</p><p>Showing the connection between Lyanna, Jon, and Sansa, as while as telling us that Sansa will carry on Lyanna&rsquo;s dying wish of protecting Jon. And connecting aunt and niece as connections for Jon to his Stark family.</p><p>The first part of Catelyn&rsquo;s quote is the end of Sansa&rsquo;s walk, but the second part is the beginning of Arya&rsquo;s quote.</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/96a2a70d2885010f5da8e0a6f8e4946e/tumblr_inline_pnliwt84Mn1qg9ixw_1280.png\" class=\"\"/></figure><p><b>Arya&rsquo;s Solo Walk is about 4 seconds &ndash;</b><br /></p><p>Arya&rsquo;s walk is shorter than both Jon and Sansa&rsquo;s and she doesn&rsquo;t look at any statues (past figures). So, you might think there&rsquo;s less to discuss.</p><p>However, the second part of Catelyn&rsquo;s voiceover is over Arya&rsquo;s walk.</p><p>&ldquo;&hellip;it&rsquo;s all because I couldn&rsquo;t love a motherless child.&rdquo;</p><p>Catelyn line being over both Arya and Sansa, connects the two sisters to not only Catelyn, but also Jon and put forth the challenge of them being better than their mother in how they treat him.</p><p>However, the part of how Catelyn couldn&rsquo;t love Jon, could be hinting at a future struggle for Arya.</p><p>Arya has certainly changed from the girl she used to be.</p><p>In many ways, her world view has become more than a bit severe. And Arya has grown a strong sense of place with her identity as a Stark and seeking revenge for those who&rsquo;ve wrong the Starks in the past.</p><p>She slaughtered the Freys for the Starks and was more than willing to behead the Northern Lords in order to protect Jon.</p><p>While that last one might indicate Arya would never &ldquo;turn&rdquo; on Jon, it also shows that Arya&rsquo;s loyalty might not be exactly to who Jon is now, but to her memory of him. To her family.</p><p>If she feels he doesn&rsquo;t have the same loyalty, then&hellip;.</p><p>Arya is also not exactly the most open person anymore, nor understanding &ndash; especially when it comes to political games or shows.</p><p>Sansa might be willing to give Dany Winterfell or at least be willing to say as much and bear and grin it, but Arya might have a harder time swallowing her tongue. </p><p>While Jon and Sansa take after who Ned really was, someone who was quite capable of deceiving those he loved and doing dishonorable things for a greater purpose. Arya (and Robb) seem to take after the image of who their father was, the honorable man who never strayed from the path of what he believed was right (though Arya is a much darker and twisted take on that idea)</p><p>And Arya also has gained some of Catelyn&rsquo;s less than admirable traits, so&hellip;</p><p>Plus, Catelyn&rsquo;s struggle was that she couldn&rsquo;t love Jon, because she believed he was Ned&rsquo;s bastard. So, it would be interesting that Arya might struggle with her relationship with Jon, because he&rsquo;s not Ned&rsquo;s bastard.</p><p>Perhaps not that literally, but &ndash;</p><p>Arya and Jon always got along, as the two outsider children and Arya found comfort in Jon being different in how she thought she was different (though arguably young Arya was likely projecting onto Jon).</p><p>But Jon being revealed to not being her brother and him possibly playing the political game and showing more loyalty to Dany, even just for show, might not go over well with Arya.</p><p>I&rsquo;m not saying Arya is going to hurt Jon, but there might be some tense moments. Especially since&hellip;</p><p>Jon and Arya&rsquo;s reunion has been built up so much by the fans and the characters within the show as being this wonderful and sweet reunion to happen - so there being tension between these two wouldn&rsquo;t surprise me.</p><p>But while I think this might a struggle for Arya and the seed for some tense moments, Arya will protect her family, no matter what. </p><hr /><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d120a1f92dd3f8446b08e509da913c12/tumblr_inline_pnlj0blZIB1qg9ixw_1280.png\" class=\"\"/></figure><p><br />The Statues in the crypt are great in my opinion. Doing the wonderful surface-level job of hinting at their deaths (like many of the season promos have done). Especially since, Jon and Sansa, walked past fallen characters who now have their own statues.<br /></p><p>Perhaps this is telling us these three will die in the upcoming battle, or perhaps the statues are telling us who will be remembered in history. </p><p>You can&rsquo;t have a legacy until your dead (and you will die in the end).</p><p>Jon, Sansa and Arya will be remembered. The Statues to me don&rsquo;t really signify their upcoming deaths, but that they are immortalized by their actions and the present for future generations.&nbsp;</p><p>Bran being absent is very telling. Showing us what role, he might play in this story.</p><p>Bran and his story are strongly tied to magic and the Night King, his own absence from the trailer and his lack of statue, indicates that while he might be integral to defeating the Others (him, not dragons), he won&rsquo;t have a role to play afterwards.</p><p>He might not be remembered as an important figure in history or at least not in the political history. While Jon, Sansa and Arya will be remembered just as Arya remembered Aegon, Visenya and Rhaenys.</p><p>Its also possible, Bran might get his own promo highlighting his importance to the story, but separating him from the Stark narrative.</p><p>Basically, I believe, the statues are telling us who will be important in the history books. Those three will be the ones who future generations remember when they&rsquo;re playing with each other as kids and who the future songs will be about.</p><p><b>The Torches Going Out</b></p><p>This is far from new. The candles, torches or fireplaces going out representing the Others and Winter coming has been a stable to GOT promos, since pretty much the beginning. But it&rsquo;s also starting to take on a different meaning, or not different, but clearer.</p><p>Fire may destroy the wights, but we&rsquo;ve seen within the show itself that even dragon fire is nothing to the Night King. Fire (the dragons) aren&rsquo;t effective when it comes to White Walkers.</p><p>Actually, and this is random, but when I saw this and when I was thinking about it, I thought of the matching phone game &ndash; Empires &amp; Puzzles. In the game,</p><p>Fire is effective against Nature and Nature is effective Ice and Ice is effective against Fire.</p><p>Fire (dragons) can destroy the Weirwood Trees (Winterfell)</p><p>The Weirwood Trees (Bran) can destroy the White Walkers</p><p>The White Walkers can destroy the Dragons</p><p>Similar to the Tapestry Promo, this may be less of a war between two opposing force, but three forces.</p><p>Either way I think promo worked really well and I&rsquo;m excited to seeing the Starks once more (which is the true goal of a promo). Sorry for the messy writing and analysis.&nbsp;</p></p>",
                "content_abstract": "<p>\n<figure class=\"tmblr-embed tmblr-full\"><p><a href=\"#\"><img src=\"https://assets.tumblr.com/images/inline_placeholder.png\" width=\"18\" height=\"14\"/></a></p></figure>\n<p>I&rsquo;ve been wanting to talk about promo since I first saw it, but work has been overwhelming and I needed time to write my thoughts down. So sorry, if no one cares about this promo anymore.<br /></p>\n<p>I&rsquo;m going to be talking about what I think the Crypt promo is hinting or foreshadowing at. But first&hellip;</p>\n<p>It is very interesting Sansa is made to be in the center at the end, especially since Jon is at first in the center - standing between both Arya and Sansa as the three meet up. </p>\n<p>But then as they walk to their statues, he moves around Sansa to be on her side, which puts her in the center. This is a 100% deliberate choice, they could&rsquo;ve easily had them all walk straight towards their own statues with no rearrangements.</p>\n<p>They literally have Jon stay behind Arya and Sansa and then move around Sansa, so he wouldn&rsquo;t be in the center.</p>\n<p>So why? </p>\n<p>One reasoning, is that it might actually be to avoid certain Targaryen imagery &ndash; specifically Aegon the Conqueror who in official art (?) and fan art is often flanked on both sides by his two-sister-wives. </p>\n<p>The second, I imagined Jon being in the center, flanked on either side by his sisters, my mind went to Aegon and his sister-wives&hellip; so perhaps, it&rsquo;s best to avoid that idea altogether. Especially if you don&rsquo;t want your audience to be weirded out by Jon and Sansa (if I think what is happening is happening).</p>\n<p>It could also be that visually Sansa is the tallest one, so it creates more of a symmetrical aesthetic.</p>\n<p>Especially, when both Jon and Arya draw their swords to face the upcoming danger.</p>\n<p>If Sansa was on the side as both Jon and Arya pull out their swords, that would&rsquo;ve sideline her from the action &ndash; keeping her in the center, keeps her in the scene.</p>\n<p>It could also just be to cement the idea that Sansa is a major player to this season and to the end of the story.</p>\n<p>Basically, from just a promo standpoint, it makes sense to put Sansa in the center, though this promo is all about Jon. Either just to avoid certain Targaryen visuals or to reinforce already existing ideas.</p>\n<p>Now let&rsquo;s go into some of the story/plot-driven reasons for this promo and its choices (foreshadowing).</p>\n<hr />\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "westeroswisdom",
        "blog": {
            "name": "westeroswisdom",
            "title": "Conventional Wisdom Westeros",
            "description": "Conventional wisdom is coming to Westeros (and Essos).\nWe size up who's up, who's down, and who's treading water. ",
            "url": "https://westeroswisdom.tumblr.com/",
            "uuid": "t:8MCmEnVdkE7CjP-UZPYIqw",
            "updated": 1561755932
        },
        "id": 183096937472,
        "post_url": "https://westeroswisdom.tumblr.com/post/183096937472/fan-art-for-s07e07-by-erta%C3%A7-alt%C4%B1n%C3%B6z-in-turkey-see",
        "slug": "fan-art-for-s07e07-by-ertaç-altınöz-in-turkey-see",
        "date": "2019-02-27 17:05:25 GMT",
        "timestamp": 1551287125,
        "state": "published",
        "format": "html",
        "reblog_key": "IrWG6kzi",
        "tags": [
            "game of thrones",
            "ertaç altınöz",
            "fan art",
            "jon snow",
            "daenerys targaryen",
            "s07e07",
            "kit harington",
            "emilia clarke",
            "gra o tron",
            "trône de fer",
            "taht oyunları",
            "juego de tronos",
            "laro ng trono",
            "kampen om järntronen",
            "jogo dos tronos",
            "hra o trůny",
            "trono di spade",
            "trónok harca",
            "ゲームの玉座",
            "игра престолов",
            "صراع العروش",
            "权力的游戏",
            "गेम ऑफ़ थ्रोन्स",
            "왕좌의 게임",
            "เกมล่าบัลลังก์",
            "تخت کے کھیل",
            "சிம்மாசனத்தில் விளையாட்டு",
            "משחקי הכס",
            "гульня тронаў",
            "trò chơi của ngai"
        ],
        "short_url": "https://tmblr.co/Zw5yqk2gXROm0",
        "summary": "Fan art for S07E07 by Ertaç Altınöz in Turkey. See more of Ertaç‘s art here.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "post_author": "gnatswatting",
        "note_count": 0,
        "caption": "<p>Fan art for S07E07 by Ertaç Altınöz in Turkey. <a href=\"https://ertacaltinoz.artstation.com/albums/35314\" target=\"_blank\">See more of Ertaç‘s art <b>here</b></a>. <br/></p>",
        "reblog": {
            "comment": "<p>Fan art for S07E07 by Ertaç Altınöz in Turkey. <a href=\"https://ertacaltinoz.artstation.com/albums/35314\" target=\"_blank\">See more of Ertaç‘s art <b>here</b></a>. <br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "westeroswisdom",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#849482",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/ec1b6114db1bcf9ef9d7138f8cc830ec/ebo3hmj/6wknmkk6k/tumblr_static_e9ym9lji8n40cwkgok00wsk0g.jpg",
                        "header_image_focused": "https://static.tumblr.com/ec1b6114db1bcf9ef9d7138f8cc830ec/ebo3hmj/6wknmkk6k/tumblr_static_e9ym9lji8n40cwkgok00wsk0g_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/ec1b6114db1bcf9ef9d7138f8cc830ec/ebo3hmj/6wknmkk6k/tumblr_static_e9ym9lji8n40cwkgok00wsk0g_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#2e2112",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#320f04",
                        "title_font": "1785 GLC Baskerville",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183096937472"
                },
                "content_raw": "<p>Fan art for S07E07 by Ertaç Altınöz in Turkey. <a href=\"https://ertacaltinoz.artstation.com/albums/35314\" target=\"_blank\">See more of Ertaç‘s art <b>here</b></a>. <br></p>",
                "content": "<p>Fan art for S07E07 by Erta&ccedil; Alt&#305;n&ouml;z in Turkey. <a href=\"https://ertacaltinoz.artstation.com/albums/35314\" target=\"_blank\">See more of Erta&ccedil;&lsquo;s art <b>here</b></a>. <br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://westeroswisdom.tumblr.com/image/183096937472",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/941940692459d4ef3aaae7829411afb9/tumblr_pnl718uFK61uszt1ho1_1280.jpg",
                    "width": 565,
                    "height": 993
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/941940692459d4ef3aaae7829411afb9/tumblr_pnl718uFK61uszt1ho1_1280.jpg",
                        "width": 565,
                        "height": 993
                    },
                    {
                        "url": "https://66.media.tumblr.com/941940692459d4ef3aaae7829411afb9/tumblr_pnl718uFK61uszt1ho1_640.jpg",
                        "width": 546,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/941940692459d4ef3aaae7829411afb9/tumblr_pnl718uFK61uszt1ho1_540.jpg",
                        "width": 461,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/941940692459d4ef3aaae7829411afb9/tumblr_pnl718uFK61uszt1ho1_500.jpg",
                        "width": 427,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/941940692459d4ef3aaae7829411afb9/tumblr_pnl718uFK61uszt1ho1_400.jpg",
                        "width": 341,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/941940692459d4ef3aaae7829411afb9/tumblr_pnl718uFK61uszt1ho1_250.jpg",
                        "width": 228,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/941940692459d4ef3aaae7829411afb9/tumblr_pnl718uFK61uszt1ho1_100.jpg",
                        "width": 100,
                        "height": 176
                    },
                    {
                        "url": "https://66.media.tumblr.com/941940692459d4ef3aaae7829411afb9/tumblr_pnl718uFK61uszt1ho1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "alemoncakelife",
        "blog": {
            "name": "alemoncakelife",
            "title": "the lone wolf dies",
            "description": "but the pack survives",
            "url": "https://alemoncakelife.tumblr.com/",
            "uuid": "t:dUzqI0Cgo0rG_IZulNkCdQ",
            "updated": 1561733715
        },
        "id": 183096770571,
        "post_url": "https://alemoncakelife.tumblr.com/post/183096770571/we-need-to-trust-each-other",
        "slug": "we-need-to-trust-each-other",
        "date": "2019-02-27 16:56:46 GMT",
        "timestamp": 1551286606,
        "state": "published",
        "format": "html",
        "reblog_key": "OIn8QQCw",
        "tags": [
            "sansa stark",
            "gotsansastark",
            "got edit",
            "jonsa",
            "jon snow",
            "jon x sansa",
            "farfarawaysite"
        ],
        "short_url": "https://tmblr.co/ZZHpIb2gXQm0B",
        "summary": "'We need to trust each other.'",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 543,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"761\" data-orig-width=\"571\"><img src=\"https://66.media.tumblr.com/2e5b46af196d3f584b16046d01d97760/tumblr_pnlgel9nsO1v4qthm_540.jpg\" data-orig-height=\"761\" data-orig-width=\"571\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1631\" data-orig-width=\"1223\"><img src=\"https://66.media.tumblr.com/75d74666e0410689ae603cc5c5ef82ec/tumblr_pnlgelteVC1v4qthm_540.jpg\" data-orig-height=\"1631\" data-orig-width=\"1223\"/></figure></div><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>&lsquo;We need to trust each other.&rsquo; </p>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"761\" data-orig-width=\"571\"><img src=\"https://66.media.tumblr.com/2e5b46af196d3f584b16046d01d97760/tumblr_pnlgel9nsO1v4qthm_540.jpg\" data-orig-height=\"761\" data-orig-width=\"571\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1631\" data-orig-width=\"1223\"><img src=\"https://66.media.tumblr.com/75d74666e0410689ae603cc5c5ef82ec/tumblr_pnlgelteVC1v4qthm_540.jpg\" data-orig-height=\"1631\" data-orig-width=\"1223\"></figure></div><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>‘We need to trust each other.’ </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "alemoncakelife",
                    "active": true,
                    "theme": {
                        "header_full_width": 600,
                        "header_full_height": 338,
                        "header_focus_width": 600,
                        "header_focus_height": 337,
                        "avatar_shape": "square",
                        "background_color": "#F7F7F7",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,600,337,0",
                        "header_image": "https://static.tumblr.com/978be5c172299bef69d6415808ce90ec/tstxore/WoHptix6e/tumblr_static_9p4vqrprmi8scwg00084gooks.gif",
                        "header_image_focused": "https://static.tumblr.com/661b2fe1a921072532c3bb5362977707/tstxore/dhsptix6j/tumblr_static_tumblr_static_9p4vqrprmi8scwg00084gooks_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/978be5c172299bef69d6415808ce90ec/tstxore/WoHptix6e/tumblr_static_9p4vqrprmi8scwg00084gooks_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#F7F7F7",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#B6CDEE",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183096770571"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"761\" data-orig-width=\"571\"><img src=\"https://66.media.tumblr.com/2e5b46af196d3f584b16046d01d97760/tumblr_pnlgel9nsO1v4qthm_540.jpg\" data-orig-height=\"761\" data-orig-width=\"571\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1631\" data-orig-width=\"1223\"><img src=\"https://66.media.tumblr.com/75d74666e0410689ae603cc5c5ef82ec/tumblr_pnlgelteVC1v4qthm_540.jpg\" data-orig-height=\"1631\" data-orig-width=\"1223\"></figure></div><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>‘We need to trust each other.’ </p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/2e5b46af196d3f584b16046d01d97760/tumblr_pnlgel9nsO1v4qthm_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/75d74666e0410689ae603cc5c5ef82ec/tumblr_pnlgelteVC1v4qthm_540.jpg\" class=\"\"/></figure><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\">&lsquo;We need to trust each other.&rsquo; </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "sansadanvers",
        "blog": {
            "name": "sansadanvers",
            "title": "Wolves are supposed to be brave, aren’t they?",
            "description": "<p>✨Lauren✨24,Sansa Stark enthusiast. </p>",
            "url": "https://sansadanvers.tumblr.com/",
            "uuid": "t:SpCc499egnEGwIH46O7Dag",
            "updated": 1561758027
        },
        "id": 183096524198,
        "post_url": "https://sansadanvers.tumblr.com/post/183096524198/jon-snow-after-being-named-king-in-the-north-and",
        "slug": "jon-snow-after-being-named-king-in-the-north-and",
        "date": "2019-02-27 16:42:13 GMT",
        "timestamp": 1551285733,
        "state": "published",
        "format": "html",
        "reblog_key": "T1YACSxu",
        "tags": [
            "jon snow",
            "game of thrones",
            "shitpost",
            "the office",
            "quote"
        ],
        "short_url": "https://tmblr.co/ZkNMZs2gXPpsc",
        "summary": "jon snow after being named king in the north: And I knew exactly what to do. But in a much more real sense, I had no idea what...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 76,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>jon snow after being named king in the north:</b> And I knew exactly what to do. But in a much more real sense, I had no idea what to do.</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>jon snow after being named king in the north:</b> And I knew exactly what to do. But in a much more real sense, I had no idea what to do.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "sansadanvers",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 852,
                        "header_focus_width": 1280,
                        "header_focus_height": 720,
                        "avatar_shape": "circle",
                        "background_color": "#080808",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "80,1280,800,0",
                        "header_image": "https://static.tumblr.com/3566bc2ab072aa545d2c192ea58667d5/upukx6t/xMEpsj5tf/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/2ae120d96e6b30767ce7c30f9538d0f4/upukx6t/K1Qpsj5th/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/3566bc2ab072aa545d2c192ea58667d5/upukx6t/xMEpsj5tf/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#bbe4d0",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ffffff",
                        "title_font": "Clearface FS",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183096524198"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>jon snow after being named king in the north:</b> And I knew exactly what to do. But in a much more real sense, I had no idea what to do.</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>jon snow after being named king in the north:</b> And I knew exactly what to do. But in a much more real sense, I had no idea what to do.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "quietpetitegirl",
        "blog": {
            "name": "quietpetitegirl",
            "title": "I Solemnly Swear That I Am Up To No Good",
            "description": "Yazmin. She. UK. Multifandom. Mediocre Gif Maker. Game of Thrones. Marvel. Disney/Animation. Harry Potter. Lord of the Rings. Friends. Brooklyn Nine Nine. Humor. Chilling Adventures of Sabrina. Movies. Shows. Celebrites. And more.",
            "url": "https://quietpetitegirl.tumblr.com/",
            "uuid": "t:e5ztLPcI0rLn2v36TzdVNw",
            "updated": 1561755875
        },
        "id": 183096422392,
        "post_url": "https://quietpetitegirl.tumblr.com/post/183096422392/i-didnt-know-i-was-waiting-to-see-this-reunion",
        "slug": "i-didnt-know-i-was-waiting-to-see-this-reunion",
        "date": "2019-02-27 16:35:55 GMT",
        "timestamp": 1551285355,
        "state": "published",
        "format": "html",
        "reblog_key": "mvAs3jsr",
        "tags": [
            "game of thrones",
            "jonsa",
            "got",
            "jon x sansa",
            "jon snow",
            "sansa stark",
            "TVgif",
            "gotgif",
            "iheartgot",
            "thegotdaily",
            "direwolfdaily",
            "snowsource",
            "yazminedit"
        ],
        "short_url": "https://tmblr.co/ZV80DX2gXPQ-u",
        "summary": "# I didn’t know I was waiting to see this reunion, until i saw it... ",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 227,
        "caption": "<p><i><b># I didn’t know I was waiting to see this reunion, until i saw it&hellip; </b></i></p>",
        "reblog": {
            "comment": "<p><i><b># I didn’t know I was waiting to see this reunion, until i saw it… </b></i></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "quietpetitegirl",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/8b9943ba5427178bbc5236dbf47333cf/l9ah0xw/jXSpqw1yu/tumblr_static_cekq5zj5cbcccgcs04kswckgo.gif",
                        "header_image_focused": "https://static.tumblr.com/8b9943ba5427178bbc5236dbf47333cf/l9ah0xw/jXSpqw1yu/tumblr_static_cekq5zj5cbcccgcs04kswckgo_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/8b9943ba5427178bbc5236dbf47333cf/l9ah0xw/jXSpqw1yu/tumblr_static_cekq5zj5cbcccgcs04kswckgo_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#427ea3",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#427ea3",
                        "title_font": "Streetscript",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183096422392"
                },
                "content_raw": "<p><i><b># I didn’t know I was waiting to see this reunion, until i saw it… </b></i></p>",
                "content": "<p><i><b># I didn&rsquo;t know I was waiting to see this reunion, until i saw it&hellip;&nbsp;</b></i></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "1111",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/de2fd8262ef9029d584e70364393bc30/tumblr_pnlffv2Ziu1y7cx4qo1_540.gif",
                    "width": 540,
                    "height": 360
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/de2fd8262ef9029d584e70364393bc30/tumblr_pnlffv2Ziu1y7cx4qo1_540.gif",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/de2fd8262ef9029d584e70364393bc30/tumblr_pnlffv2Ziu1y7cx4qo1_500.gif",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/de2fd8262ef9029d584e70364393bc30/tumblr_pnlffv2Ziu1y7cx4qo1_400.gif",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/de2fd8262ef9029d584e70364393bc30/tumblr_pnlffv2Ziu1y7cx4qo1_250.gif",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/de2fd8262ef9029d584e70364393bc30/tumblr_pnlffv2Ziu1y7cx4qo1_100.gif",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/de2fd8262ef9029d584e70364393bc30/tumblr_pnlffv2Ziu1y7cx4qo1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/e86c78b981f053bdc8fd04044ef13b93/tumblr_pnlffv2Ziu1y7cx4qo2_540.gif",
                    "width": 540,
                    "height": 360
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/e86c78b981f053bdc8fd04044ef13b93/tumblr_pnlffv2Ziu1y7cx4qo2_540.gif",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/e86c78b981f053bdc8fd04044ef13b93/tumblr_pnlffv2Ziu1y7cx4qo2_500.gif",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/e86c78b981f053bdc8fd04044ef13b93/tumblr_pnlffv2Ziu1y7cx4qo2_400.gif",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/e86c78b981f053bdc8fd04044ef13b93/tumblr_pnlffv2Ziu1y7cx4qo2_250.gif",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/e86c78b981f053bdc8fd04044ef13b93/tumblr_pnlffv2Ziu1y7cx4qo2_100.gif",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/e86c78b981f053bdc8fd04044ef13b93/tumblr_pnlffv2Ziu1y7cx4qo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/b152bb21bf257033320bae35027e5f45/tumblr_pnlffv2Ziu1y7cx4qo3_540.gif",
                    "width": 540,
                    "height": 360
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/b152bb21bf257033320bae35027e5f45/tumblr_pnlffv2Ziu1y7cx4qo3_540.gif",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/b152bb21bf257033320bae35027e5f45/tumblr_pnlffv2Ziu1y7cx4qo3_500.gif",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/b152bb21bf257033320bae35027e5f45/tumblr_pnlffv2Ziu1y7cx4qo3_400.gif",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/b152bb21bf257033320bae35027e5f45/tumblr_pnlffv2Ziu1y7cx4qo3_250.gif",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/b152bb21bf257033320bae35027e5f45/tumblr_pnlffv2Ziu1y7cx4qo3_100.gif",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/b152bb21bf257033320bae35027e5f45/tumblr_pnlffv2Ziu1y7cx4qo3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/2c6332a4416584bc5b345da52a7a0813/tumblr_pnlffv2Ziu1y7cx4qo4_540.gif",
                    "width": 540,
                    "height": 360
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/2c6332a4416584bc5b345da52a7a0813/tumblr_pnlffv2Ziu1y7cx4qo4_540.gif",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/2c6332a4416584bc5b345da52a7a0813/tumblr_pnlffv2Ziu1y7cx4qo4_500.gif",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/2c6332a4416584bc5b345da52a7a0813/tumblr_pnlffv2Ziu1y7cx4qo4_400.gif",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/2c6332a4416584bc5b345da52a7a0813/tumblr_pnlffv2Ziu1y7cx4qo4_250.gif",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/2c6332a4416584bc5b345da52a7a0813/tumblr_pnlffv2Ziu1y7cx4qo4_100.gif",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/2c6332a4416584bc5b345da52a7a0813/tumblr_pnlffv2Ziu1y7cx4qo4_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "adreamofspring",
        "blog": {
            "name": "adreamofspring",
            "title": "the queen we chose",
            "description": "<p>leah. mostly just <a\nhref=\"https://adreamofspring.tumblr.com/tagged/myedit*\">creating</a>, gushing <p>over <a\nhref=\"https://adreamofspring.tumblr.com/tagged/emilia+clarke\">emilia clarke</a> or <a\nhref=\"https://adreamofspring.tumblr.com/tagged/daenerys+targaryen\">daenerys targaryen<p></a><p>then occasionally <a\nhref=\"https://adreamofspring.tumblr.com/tagged/anti+got\">bitching</a> about got</p>\n\n\n<p><a\nhref=\"https://www.sameyou.org/\">emilia’s charity</a> | <a\nhref=\"https://www.justgiving.com/fundraising/justicefordaenerys\">justice for daenerys</a>\n\n<p>mobile header by <a\nhref=\"https://cottaterra.tumblr.com/post/185319740432\">cottaterra</a></p>",
            "url": "https://adreamofspring.tumblr.com/",
            "uuid": "t:4QqG8sBCxJXh3ynjI-nSqQ",
            "updated": 1561640160
        },
        "id": 183094196564,
        "post_url": "https://adreamofspring.tumblr.com/post/183094196564/we-literally-have-a-verified-jonerys-hbo-twitter",
        "slug": "we-literally-have-a-verified-jonerys-hbo-twitter",
        "date": "2019-02-27 14:20:36 GMT",
        "timestamp": 1551277236,
        "state": "published",
        "format": "html",
        "reblog_key": "TNRljq7T",
        "tags": [
            "jonerys",
            "daenerys targaryen",
            "jon snow",
            "game of thrones",
            ":)"
        ],
        "short_url": "https://tmblr.co/ZDiajf2gXGxbK",
        "summary": "we literally have a verified jonerys HBO twitter account.. I love winning",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 109,
        "title": null,
        "body": "<p>we literally have a verified jonerys HBO twitter account.. I love winning</p><figure class=\"tmblr-full\" data-orig-height=\"670\" data-orig-width=\"903\"><img src=\"https://66.media.tumblr.com/f6c3e8f1e6ceb28e2c614f03da1d0542/tumblr_pnl96cDWV11tnjf72_1280.jpg\" data-orig-height=\"670\" data-orig-width=\"903\"/></figure>",
        "reblog": {
            "comment": "<p><p>we literally have a verified jonerys HBO twitter account.. I love winning</p><figure class=\"tmblr-full\" data-orig-height=\"670\" data-orig-width=\"903\"><img src=\"https://66.media.tumblr.com/f6c3e8f1e6ceb28e2c614f03da1d0542/tumblr_pnl96cDWV11tnjf72_1280.jpg\" data-orig-height=\"670\" data-orig-width=\"903\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "adreamofspring",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 373,
                        "header_focus_width": 640,
                        "header_focus_height": 360,
                        "avatar_shape": "square",
                        "background_color": "#ffffff",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "13,640,373,0",
                        "header_image": "https://static.tumblr.com/66e38c2e8d7027a59afcf125df9a10d4/mi8l89i/d7Gpsi8e8/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/d299ab1f9af9c9f91bd18e0697e74404/mi8l89i/hvnpsi8e9/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/66e38c2e8d7027a59afcf125df9a10d4/mi8l89i/d7Gpsi8e8/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#73D7FF",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#8ED3FE",
                        "title_font": "Square Serif",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183094196564"
                },
                "content_raw": "<p><p>we literally have a verified jonerys HBO twitter account.. I love winning</p><figure class=\"tmblr-full\" data-orig-height=\"670\" data-orig-width=\"903\"><img src=\"https://66.media.tumblr.com/f6c3e8f1e6ceb28e2c614f03da1d0542/tumblr_pnl96cDWV11tnjf72_1280.jpg\" data-orig-height=\"670\" data-orig-width=\"903\"></figure></p>",
                "content": "<p><p>we literally have a verified jonerys HBO twitter account.. I love winning</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f6c3e8f1e6ceb28e2c614f03da1d0542/tumblr_pnl96cDWV11tnjf72_1280.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "kit-tastik",
        "blog": {
            "name": "kit-tastik",
            "title": "Kit/Jon/GoT obsessed",
            "description": "\"If you don't have anything nice to say don't say anything at all.\"\nHeader and fantastic art by Leffies art.\ncheck it here on Tumblr or Patreon",
            "url": "https://kit-tastik.tumblr.com/",
            "uuid": "t:XhTRQzsa6W9zp4AmJ1bBFQ",
            "updated": 1561738293
        },
        "id": 183092231878,
        "post_url": "https://kit-tastik.tumblr.com/post/183092231878/jonerys-people",
        "slug": "jonerys-people",
        "date": "2019-02-27 11:53:34 GMT",
        "timestamp": 1551268414,
        "state": "published",
        "format": "html",
        "reblog_key": "3uszLZqT",
        "tags": [
            "jonerys",
            "jon snow",
            "daenerys targaryen",
            "kit harington",
            "emilia clarke"
        ],
        "short_url": "https://tmblr.co/Zgmubc2gX9Rx6",
        "summary": "Jonerys people.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 23,
        "title": null,
        "body": "<h1>Jonerys people.</h1><p>We truly need a Jonerys boatbang dance.</p>",
        "reblog": {
            "comment": "<p><h1>Jonerys people.</h1><p>We truly need a Jonerys boatbang dance.</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "kit-tastik",
                    "active": true,
                    "theme": {
                        "header_full_width": 1080,
                        "header_full_height": 713,
                        "header_focus_width": 1080,
                        "header_focus_height": 607,
                        "avatar_shape": "circle",
                        "background_color": "#45251F",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1080,607,0",
                        "header_image": "https://static.tumblr.com/74a600131fc390f72cea0547f73c45cb/hilpmcl/1sNpo0aw3/tumblr_static_1197108995-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/c432a03fe8c8e38af73a788c969ab33d/hilpmcl/grYpo0aw5/tumblr_static_tumblr_static_1197108995-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/74a600131fc390f72cea0547f73c45cb/hilpmcl/1sNpo0aw3/tumblr_static_1197108995-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#3086BA",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#bb5656",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183092231878"
                },
                "content_raw": "<p><h1>Jonerys people.</h1><p>We truly need a Jonerys boatbang dance.</p></p>",
                "content": "<p><h1>Jonerys people.</h1><p>We truly need a Jonerys boatbang dance.</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "targaryens-restoration",
        "blog": {
            "name": "targaryens-restoration",
            "title": "Mother Of Dragons",
            "description": "",
            "url": "https://targaryens-restoration.tumblr.com/",
            "uuid": "t:0fN_IRkhYCEW3lsfQarqzQ",
            "updated": 1556917388
        },
        "id": 183091437167,
        "post_url": "https://targaryens-restoration.tumblr.com/post/183091437167/guys-what-the-hell-i-am-looking-here-are",
        "slug": "guys-what-the-hell-i-am-looking-here-are",
        "date": "2019-02-27 10:37:09 GMT",
        "timestamp": 1551263829,
        "state": "published",
        "format": "html",
        "reblog_key": "dXwprZBD",
        "tags": [
            "game of thrones",
            "jon snow",
            "jonerys",
            "season 8",
            "daenerys targaryen",
            "daenerys stormborn",
            "house targaryen",
            "jon x dany",
            "jon x daenerys",
            "aegon targaryen",
            "house stark",
            "house stargaryen",
            "daegon",
            "anti jonsa",
            "hbo",
            "hboAsia",
            "hbo asia"
        ],
        "short_url": "https://tmblr.co/ZGHd8b2gX6Pvl",
        "summary": "Guys what the hell I am looking here? 🙄🙄🙄😲😲😲😲😲\nAre you looking Same? 😲😲Tea is so hot 🍵🍵🍵",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 370,
        "title": null,
        "body": "<p>Guys what the hell I am looking here? 🙄🙄🙄😲😲😲😲😲</p><p>Are you looking Same? 😲😲Tea is so hot 🍵🍵🍵</p><figure class=\"tmblr-full\" data-orig-height=\"648\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/861cf6286675382609946fbc06e14eef/tumblr_pnkytw2ffy1vzef6y_540.jpg\" data-orig-height=\"648\" data-orig-width=\"750\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"819\" data-orig-width=\"738\"><img src=\"https://66.media.tumblr.com/d9efb9f91c204ff01e0c34b7976a4195/tumblr_pnkytwrtee1vzef6y_540.jpg\" data-orig-height=\"819\" data-orig-width=\"738\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"894\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/a4ee367d2b6ef04c3d979113a1c0d1e8/tumblr_pnkytx8EA81vzef6y_540.jpg\" data-orig-height=\"894\" data-orig-width=\"750\"/></figure>",
        "reblog": {
            "comment": "<p><p>Guys what the hell I am looking here? 🙄🙄🙄😲😲😲😲😲</p><p>Are you looking Same? 😲😲Tea is so hot 🍵🍵🍵</p><figure class=\"tmblr-full\" data-orig-height=\"648\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/861cf6286675382609946fbc06e14eef/tumblr_pnkytw2ffy1vzef6y_540.jpg\" data-orig-height=\"648\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"819\" data-orig-width=\"738\"><img src=\"https://66.media.tumblr.com/d9efb9f91c204ff01e0c34b7976a4195/tumblr_pnkytwrtee1vzef6y_540.jpg\" data-orig-height=\"819\" data-orig-width=\"738\"></figure><figure class=\"tmblr-full\" data-orig-height=\"894\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/a4ee367d2b6ef04c3d979113a1c0d1e8/tumblr_pnkytx8EA81vzef6y_540.jpg\" data-orig-height=\"894\" data-orig-width=\"750\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "targaryens-restoration",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/c04e84bd283635551a9c60ed130fa82c/bmvgxud/975p5ymhr/tumblr_static_filename.png",
                        "header_image_focused": "https://static.tumblr.com/c04e84bd283635551a9c60ed130fa82c/bmvgxud/975p5ymhr/tumblr_static_filename_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/c04e84bd283635551a9c60ed130fa82c/bmvgxud/975p5ymhr/tumblr_static_filename_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#C0A4D2",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183091437167"
                },
                "content_raw": "<p><p>Guys what the hell I am looking here? 🙄🙄🙄😲😲😲😲😲</p><p>Are you looking Same? 😲😲Tea is so hot 🍵🍵🍵</p><figure class=\"tmblr-full\" data-orig-height=\"648\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/861cf6286675382609946fbc06e14eef/tumblr_pnkytw2ffy1vzef6y_540.jpg\" data-orig-height=\"648\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"819\" data-orig-width=\"738\"><img src=\"https://66.media.tumblr.com/d9efb9f91c204ff01e0c34b7976a4195/tumblr_pnkytwrtee1vzef6y_540.jpg\" data-orig-height=\"819\" data-orig-width=\"738\"></figure><figure class=\"tmblr-full\" data-orig-height=\"894\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/a4ee367d2b6ef04c3d979113a1c0d1e8/tumblr_pnkytx8EA81vzef6y_540.jpg\" data-orig-height=\"894\" data-orig-width=\"750\"></figure></p>",
                "content": "<p><p>Guys what the hell I am looking here? &#128580;&#128580;&#128580;&#128562;&#128562;&#128562;&#128562;&#128562;</p><p>Are you looking Same? &#128562;&#128562;Tea is so hot &#127861;&#127861;&#127861;</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/861cf6286675382609946fbc06e14eef/tumblr_pnkytw2ffy1vzef6y_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d9efb9f91c204ff01e0c34b7976a4195/tumblr_pnkytwrtee1vzef6y_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/a4ee367d2b6ef04c3d979113a1c0d1e8/tumblr_pnkytx8EA81vzef6y_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "an-oranophobic-maniac",
        "blog": {
            "name": "an-oranophobic-maniac",
            "title": "It is better to be ridiculous than boring",
            "description": "",
            "url": "https://an-oranophobic-maniac.tumblr.com/",
            "uuid": "t:JcDddlILpj6x477nGO-rbg",
            "updated": 1560053082
        },
        "id": 183090904050,
        "post_url": "https://an-oranophobic-maniac.tumblr.com/post/183090904050/legacy-seriously",
        "slug": "legacy-seriously",
        "date": "2019-02-27 09:43:01 GMT",
        "timestamp": 1551260581,
        "state": "published",
        "format": "html",
        "reblog_key": "MOmCJD40",
        "tags": [
            "anti daenerys",
            "anti targ restoration",
            "jon snow"
        ],
        "short_url": "https://tmblr.co/Z62dIY2gX4Nlo",
        "summary": "Legacy??? Seriously???",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 29,
        "title": null,
        "body": "<h1>Legacy??? Seriously???</h1><p>Dany stans keep on blabbering that if Dany had to die and Jon gets to rule the 7k after her death then it would be like using her as a sacrificial lamb to finally give a male <b><span style=\"color: #000000\">the power</span></b> over everything she had earned along with her legacy, which is totally misogynistic. But but but, I would like to know more about this supposed &ldquo;legacy&rdquo;. She has two dragons now, but I am very sure that the dragons would die out in the end. Then, she has dragonstone (which was a totally deserted castle before her arrival). She has already lost her navy. Then she made some lords kneel after threatening to burn them alive, so they wouldn&rsquo;t count. Her name wouldn&rsquo;t give any additional power to Jon since he is a Targaryen all by himself. At last the only thing left after all that would be her army. But if she is dead, the Dothraki would have no purpose to stay here. The only remaining thing is the unsullied. But we can&rsquo;t just call them as part of her legacy, because they would serve whom they would like to serve in case of her death. </p><p>Hence it is safe to say that Daenerys&rsquo;s legacy is not worth shit in the end. So there is no need to worry about anyone stealing it from her. </p>",
        "reblog": {
            "comment": "<p><h1>Legacy??? Seriously???</h1><p>Dany stans keep on blabbering that if Dany had to die and Jon gets to rule the 7k after her death then it would be like using her as a sacrificial lamb to finally give a male <b><span style=\"color: #000000\">the power</span></b> over everything she had earned along with her legacy, which is totally misogynistic. But but but, I would like to know more about this supposed “legacy”. She has two dragons now, but I am very sure that the dragons would die out in the end. Then, she has dragonstone (which was a totally deserted castle before her arrival). She has already lost her navy. Then she made some lords kneel after threatening to burn them alive, so they wouldn’t count. Her name wouldn’t give any additional power to Jon since he is a Targaryen all by himself. At last the only thing left after all that would be her army. But if she is dead, the Dothraki would have no purpose to stay here. The only remaining thing is the unsullied. But we can’t just call them as part of her legacy, because they would serve whom they would like to serve in case of her death. </p><p>Hence it is safe to say that Daenerys’s legacy is not worth shit in the end. So there is no need to worry about anyone stealing it from her. </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "an-oranophobic-maniac",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_11.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_11_focused_v3.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_11_focused_v3.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183090904050"
                },
                "content_raw": "<p><h1>Legacy??? Seriously???</h1><p>Dany stans keep on blabbering that if Dany had to die and Jon gets to rule the 7k after her death then it would be like using her as a sacrificial lamb to finally give a male <b><span style=\"color: #000000\">the power</span></b> over everything she had earned along with her legacy, which is totally misogynistic. But but but, I would like to know more about this supposed “legacy”. She has two dragons now, but I am very sure that the dragons would die out in the end. Then, she has dragonstone (which was a totally deserted castle before her arrival). She has already lost her navy. Then she made some lords kneel after threatening to burn them alive, so they wouldn’t count. Her name wouldn’t give any additional power to Jon since he is a Targaryen all by himself. At last the only thing left after all that would be her army. But if she is dead, the Dothraki would have no purpose to stay here. The only remaining thing is the unsullied. But we can’t just call them as part of her legacy, because they would serve whom they would like to serve in case of her death. </p><p>Hence it is safe to say that Daenerys’s legacy is not worth shit in the end. So there is no need to worry about anyone stealing it from her. </p></p>",
                "content": "<p><h1>Legacy??? Seriously???</h1><p>Dany stans keep on blabbering that if Dany had to die and Jon gets to rule the 7k after her death then it would be like using her as a sacrificial lamb to finally give a male <b><span style=\"color: #000000\">the power</span></b> over everything she had earned along with her legacy, which is totally misogynistic. But but but, I would like to know more about this supposed &ldquo;legacy&rdquo;. She has two dragons now, but I am very sure that the dragons would die out in the end. Then, she has dragonstone (which was a totally deserted castle before her arrival). She has already lost her navy. Then she made some lords kneel after threatening to burn them alive, so they wouldn&rsquo;t count. Her name wouldn&rsquo;t give any additional power to Jon since he is a Targaryen all by himself. At last the only thing left after all that would be her army. But if she is dead, the Dothraki would have no purpose to stay here. The only remaining thing is the unsullied. But we can&rsquo;t just call them as part of her legacy, because they would serve whom they would like to serve in case of her death. </p><p>Hence it is safe to say that Daenerys&rsquo;s legacy is not worth shit in the end. So there is no need to worry about anyone stealing it from her. </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "superlokidwholock",
        "blog": {
            "name": "superlokidwholock",
            "title": "thank u for following me\nI have nothing to offer",
            "description": "<p>•I just want Loki to be happy</p><p>#dead character enthusiast</p><p>—look, I’m a simple woman, i just want villains and heroes in love with each other and pissed off about it</p><p>some of you never had to see your</p><p>favourite character being ruined by bad and inconsistent writing and it shows</p><p>⠀⠀⠀⠀⠀</p>",
            "url": "https://superlokidwholock.tumblr.com/",
            "uuid": "t:NBmto8cUkzHabQnp3B8OFA",
            "updated": 1561708434
        },
        "id": 183089243038,
        "post_url": "https://superlokidwholock.tumblr.com/post/183089243038/no-matter-what-jon-snow-is-a-stark",
        "slug": "no-matter-what-jon-snow-is-a-stark",
        "date": "2019-02-27 07:13:10 GMT",
        "timestamp": 1551251590,
        "state": "published",
        "format": "html",
        "reblog_key": "hyoDl0RG",
        "tags": [
            "got",
            "game of thrones",
            "jon snow",
            "jon stark"
        ],
        "short_url": "https://tmblr.co/ZEreoh2gW_2EU",
        "summary": "No matter what, Jon Snow is a Stark",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 13,
        "title": null,
        "body": "<h1>No matter what, Jon Snow is a Stark</h1><p>Reblog if u agree</p>",
        "reblog": {
            "comment": "<p><h1>No matter what, Jon Snow is a Stark</h1><p>Reblog if u agree</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "superlokidwholock",
                    "active": true,
                    "theme": {
                        "header_full_width": 1242,
                        "header_full_height": 761,
                        "header_focus_width": 1242,
                        "header_focus_height": 698,
                        "avatar_shape": "circle",
                        "background_color": "#CCCCCC",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "6,1242,704,0",
                        "header_image": "https://static.tumblr.com/3e41ef30158669d4030d68fab165a2df/xa6r1tl/UHFps3zd0/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/03173165737fb90f46d8857bac40d999/xa6r1tl/aotps3zd1/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/3e41ef30158669d4030d68fab165a2df/xa6r1tl/UHFps3zd0/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#CCCCCC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Arquitecta",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183089243038"
                },
                "content_raw": "<p><h1>No matter what, Jon Snow is a Stark</h1><p>Reblog if u agree</p></p>",
                "content": "<p><h1>No matter what, Jon Snow is a Stark</h1><p>Reblog if u agree</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "looknorth",
        "blog": {
            "name": "looknorth",
            "title": "Look_North",
            "description": "",
            "url": "https://looknorth.tumblr.com/",
            "uuid": "t:w7HpKc0YD7n0BjZTc2AtyQ",
            "updated": 1561040650
        },
        "id": 183088740259,
        "post_url": "https://looknorth.tumblr.com/post/183088740259/a-wish-for-s8",
        "slug": "a-wish-for-s8",
        "date": "2019-02-27 06:36:53 GMT",
        "timestamp": 1551249413,
        "state": "published",
        "format": "html",
        "reblog_key": "2tzcmTh9",
        "tags": [
            "game of thrones",
            "jon snow"
        ],
        "short_url": "https://tmblr.co/ZZFNec2gWy7UZ",
        "summary": "A wish for S8!",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 6,
        "title": "A wish for S8!",
        "body": "<p>I want Jon to ride into winterfell\n\n at the head of the 30 000 men and 2 dragons, extra resources and boatloads of dragonglass with his awesome queen in front of Sansa and the northern lords that told him it was a bad idea, and at the end, mount the head of the night king on kings landings battlement. That’s all</p>",
        "reblog": {
            "comment": "<p>I want Jon to ride into winterfell\n\n at the head of the 30 000 men and 2 dragons, extra resources and boatloads of dragonglass with his awesome queen in front of Sansa and the northern lords that told him it was a bad idea, and at the end, mount the head of the night king on kings landings battlement. That’s all</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "looknorth",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#ffffff",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183088740259"
                },
                "content_raw": "<p>I want Jon to ride into winterfell\n\n at the head of the 30 000 men and 2 dragons, extra resources and boatloads of dragonglass with his awesome queen in front of Sansa and the northern lords that told him it was a bad idea, and at the end, mount the head of the night king on kings landings battlement. That’s all</p>",
                "content": "<p>I want Jon to ride into winterfell\n\n at the head of the 30 000 men and 2 dragons, extra resources and boatloads of dragonglass with his awesome queen in front of Sansa and the northern lords that told him it was a bad idea, and at the end, mount the head of the night king on kings landings battlement. That&rsquo;s all</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "thinbottomedcauldron",
        "blog": {
            "name": "thinbottomedcauldron",
            "title": "Kill Zero Birds With a Great Many Stones",
            "description": "Thinbottomedcauldron - because I am cheap, assless, Harry Potter Trash. \nI strive to fill my blog with things like: Humor, Aesthetics, Geekery and Anything that Strikes Me as Really Important",
            "url": "https://thinbottomedcauldron.tumblr.com/",
            "uuid": "t:nBQ8ul3fa5qqBWNF_VxKQw",
            "updated": 1561758006
        },
        "id": 183088723537,
        "post_url": "https://thinbottomedcauldron.tumblr.com/post/183088723537/authors-this-is-a-quiet-boy-who-holds-anger-and",
        "slug": "authors-this-is-a-quiet-boy-who-holds-anger-and",
        "date": "2019-02-27 06:35:36 GMT",
        "timestamp": 1551249336,
        "state": "published",
        "format": "html",
        "reblog_key": "NklOOAOz",
        "tags": [
            "jon snow",
            "remus lupin",
            "bucky barnes",
            "(in some contexts)",
            "jason todd",
            "edmund pevensie",
            "writing",
            "characters",
            "fiction"
        ],
        "short_url": "https://tmblr.co/ZdA6Fw2gWy3PH",
        "summary": "Authors: this is a quiet boy who holds anger and sadness in his bones, because he believes he is no one’s favorite \nme:...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 299,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Authors:</b> this is a quiet boy who holds anger and sadness in his bones, because he believes he is no one’s favorite </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>me:</b> *instantly stans*</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Authors:</b> this is a quiet boy who holds anger and sadness in his bones, because he believes he is no one’s favorite </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>me:</b> *instantly stans*</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thinbottomedcauldron",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#f7dfd9",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_10.png?_v=eafbfb1726b334d86841955ae7b9221c",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_10.png?_v=eafbfb1726b334d86841955ae7b9221c",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_10.png?_v=eafbfb1726b334d86841955ae7b9221c",
                        "header_stretch": true,
                        "link_color": "#5AC9E1",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "183088723537"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Authors:</b> this is a quiet boy who holds anger and sadness in his bones, because he believes he is no one’s favorite </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>me:</b> *instantly stans*</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Authors:</b> this is a quiet boy who holds anger and sadness in his bones, because he believes he is no one&rsquo;s favorite </p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>me:</b> *instantly stans*</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]