[
    {
        "type": "text",
        "blog_name": "tonystark5ever",
        "blog": {
            "name": "tonystark5ever",
            "title": "Iron Man stuff",
            "description": "follow backs from sunbean72 My Tony Stark side blog. I'm probably gonna call you sweetheart or hun if you talk to me, fair waring",
            "url": "https://tonystark5ever.tumblr.com/",
            "uuid": "t:sZFgtXpLX9p_7Ao2HxaY5Q",
            "updated": 1561763673
        },
        "id": 185619160806,
        "post_url": "https://tonystark5ever.tumblr.com/post/185619160806/an-excerpt-from-my-writing",
        "slug": "an-excerpt-from-my-writing",
        "date": "2019-06-15 23:43:55 GMT",
        "timestamp": 1560642235,
        "state": "published",
        "format": "html",
        "reblog_key": "W7TrKNbl",
        "tags": [
            "excerpt from my writing",
            "tony stark",
            "fan fic",
            "tony stark 5ever"
        ],
        "short_url": "https://tmblr.co/ZBqeVc2itmvxc",
        "summary": "an excerpt from my writing",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 23,
        "title": "an excerpt from my writing",
        "body": "<p><b>Chapter three</b> (<a href=\"https://archiveofourown.org/works/18689929?view_full_work=true\">read the rest)</a><br/></p><p>Morgan Stark feels a little afraid when her front tooth suddenly <i>moves</i>. </p><p>She was eating an apple when it happened; for a moment all she could \ndo was freeze, unsure exactly what she&rsquo;d felt. Thinking it might have \nbeen a weird fluke, she took another bite of her apple only to feel <i>it </i>again! This time with a small twinge of discomfort!</p><p>&ldquo;Dad!&rdquo; she shrieked, not sure how big of an emergency this was and not taking any chances. &ldquo;Dad, help! Help me dad!&rdquo;</p><p>As anticipated, her father&rsquo;s worried face appeared around the corner \nfrom the kitchen where he&rsquo;d been cleaning the dishes. &ldquo;What&rsquo;s wrong \nMorguna?&rdquo;</p><p>&ldquo;Something&rsquo;s wrong in my mouth!&rdquo; she said worriedly, turning her big brown eyes on her dad.</p><!-- more --><p>&ldquo;Did you bite your tongue?&rdquo; Dad asked as he knelt in front of her \nchair. Morgan shook her head, not knowing what was wrong and not knowing\n how afraid to be. She contemplated her options. Seemed safest to be<i> very afraid</i>, maybe enough to cry even. On the other hand, she was a <i>very brave girl</i>,\n Dad had told her that lots of times. She pushed gently on her tooth \nwith her tongue and it happened&hellip; the twinge and the movement. Tears \nfilled her eyes, and Dad looked alarmed, only confirming her fears. </p><p>&ldquo;Okay, okay,&rdquo; Dad said, calm now. &ldquo;Just show me, okay?&rdquo;</p><p>Morgan nodded and opened her mouth. Dad took a careful look then \nfrowned. &ldquo;I don&rsquo;t see anything, babe, can you tell daddy what&rsquo;s wrong?&rdquo;</p><p>Morgan didn&rsquo;t dare speak. She pointed to her treacherous front tooth \nand to her confusion and consternation, Dad suddenly smiled. &ldquo;Is it your\n tooth, honey? Did you tooth wiggle?&rdquo;</p><p>Wiggle&hellip; didn&rsquo;t sound so bad. Tentatively, she nodded and Dad seemed to relax even more. </p><p>&ldquo;That&rsquo;s okay, sweetie, it&rsquo;s okay!&rdquo; he said, smiling more widely now. </p><p>&ldquo;It&rsquo;s okay?&rdquo; she asked pensively.</p><p>&ldquo;Yeah, it is, it&rsquo;s actually good! It shows what a big girl you&rsquo;re \nbecoming, did you know that?&rdquo; She shook her head. &ldquo;That&rsquo;s right! When \nlittle kids get to be big kids, their teeth get a little wiggly, and \nthey even come out so that new, big girl teeth can grow in!&rdquo; Daddy \nseemed happy and relaxed about it, though she felt a little bit \nsuspicious about teeth <i>falling out.</i> She looked at him doubtfully. </p><p>&ldquo;Can I see?&rdquo;</p><p>Obligingly he picked her up and carried her to the bathroom mirror, \nlifting her close so she could examine the tooth as it moved. It didn&rsquo;t seem to be too bad. &ldquo;It hurts a little.&rdquo;</p><p>&ldquo;Hmmm&hellip; sometimes growing can hurt a little bit. But not very bad. I\n remember when you scraped your knee? Remember? Riding your bike for the\n first time? And you didn&rsquo;t even cry.&rdquo; She climbed up so she was \nstanding on the sink, turning around and putting her arms around Dad&rsquo;s \nneck.</p><p>&ldquo;&lsquo;Cause you put a bandaid on it,&rdquo; she reminded him. &ldquo;And kissed it.&rdquo;</p><p>For some reason this made Dad laugh. She never understood why Mom and\n Dad always thought everything was so funny. &ldquo;Well, we can&rsquo;t put a \nbandaid on this sweetie. But I can kiss it, here.&rdquo;</p><p>Relieved, she leaned forward, scrunching her face to bare her teeth, \nmaking him laugh again as he carefully kissed her tooth. &ldquo;There. \nBetter?&rdquo;</p><p>She wiggled the tooth with her tongue again then nodded. He hugged \nher tightly and lifted her down. &ldquo;When does it come out?&rdquo; she demanded, \nover her fear now and excited for the adventure of it.</p><p>&ldquo;Can&rsquo;t say for sure. It depends on how much you wiggle it and how \nclose the other tooth is to growing in. Sometimes a long time sometimes \nonly a few days.&rdquo;</p><p>&ldquo;How long is a 'few days?&rsquo;&rdquo;</p><p>Dad picked up her plate for her to put away and handed her back her apple. &ldquo;Three sleeps,&rdquo; he clarified.</p><p>&ldquo;That&rsquo;s forever! Then what happens?&rdquo;</p><p>Dad twisted his mouth then got a little frown. He did that sometimes.\n Mom said Dad has <i>been through a lot</i> and sometimes he gets sad when he \nremembers it, and when his mouth did that, it usually meant he was sad \nfrom remembering something. Morgan didn&rsquo;t understand it, but she knew \nwhat to do. &ldquo;Can we go to the garage later, Dad?&rdquo;</p><p>His sad face cleared as he smiled down at her. &ldquo;If you&rsquo;re good and clean your room.&rdquo;</p><p>&ldquo;And will you wrestle me?&rdquo;</p><p>&ldquo;We&rsquo;ll see,&rdquo; he said evasively but in her experience that always meant yes! </p><p>&ldquo;Yay!&rdquo; she cheered, going to him to hug him. &ldquo;Thanks Dad! I love you.&rdquo;</p><p>&ldquo;I love&ndash;&rdquo; she looked up at him when he paused, but she couldn&rsquo;t \ndecide if he was upset. There were tears in his eyes but there were big \nwrinkles from his smile so big. Dad did that sometimes. &ldquo;I love you \ntoo.&rdquo;</p><p>Trotting off to her room to clean it, apple in hand, Morgan felt \npleased that she could clean her room and make Dad happy so they could \nplay in the garage later.</p><p>&hellip;</p><p>Pepper came in from relaxing by the lake a bit later. Tony came and \ntook some of the things from her hands, greeting her with a kiss. &ldquo;How&rsquo;s\n the lake today?&rdquo;</p><p>&ldquo;Pretty! The flowers are blooming. Oh! And the duck eggs hatched! We should show Morg in a couple of days.&rdquo;</p><p>&ldquo;They did? How many?&rdquo;</p><p>&ldquo;Three hatched, three more to go.&rdquo;</p><p>&ldquo;Cute,&rdquo; Tony commented, setting Pepper&rsquo;s book on the table. &ldquo;She&rsquo;ll love that.&rdquo;</p><p>Pepper took off her sunhat, immediately realizing that something was \non Tony&rsquo;s mind. She knew him perfectly; all of their years together had \ngiven them an unbreakable bond of not only friendship and love but also \nan almost intuitive sense of the other&rsquo;s thoughts and feelings. </p><p>&ldquo;How was your day? Did Morgan eat lunch? She didn&rsquo;t finish her breakfast.&rdquo;</p><p>&ldquo;Yep, she did, even the crust,&rdquo; Tony said with a smile. His eyes \nsparkled with amusement. &ldquo;She scared herself though. Morgan, come here!&rdquo;</p><p>Morgan came running, a doll in hand. &ldquo;Yeah?&rdquo;</p><p>&ldquo;Momma&rsquo;s home.&rdquo;</p><p>&ldquo;Momma!&rdquo; Morgan ran and hugged Pepper around the waist. &ldquo;Hi!&rdquo;</p><p>&ldquo;Want to tell mom what a big girl you are?&rdquo;</p><p>Morgan&rsquo;s brow furrowed for a brief moment before she remembered what Tony was referring to. &ldquo;Mom! I have a wiggly tooth!&rdquo;</p><p>&ldquo;What?&rdquo; Pepper lifted Morgan up and sat her on the kitchen table so \nshe could get a look at the tooth in question. &ldquo;Oh wow!! You are <i>such </i>a big girl!&rdquo; Morgan was so proud she hugged Pepper tightly, then went back to play.</p><p>\n &ldquo;I can&rsquo;t believe how big she&rsquo;s getting,&rdquo; Pepper marveled hesitantly, \nwondering if that&rsquo;s what was bothering Tony. One unexpected side-effect \nof parenting. You always lose the child you have for a new iteration. \nWhile this was good and beautiful and exciting, it could be at times \nachingly sad.\n</p><p>\n &ldquo;Right?&rdquo; He glanced at Pepper and saw that she saw through him. He blew out a breath through pursed lips. \n</p><p>\n  &quot;For some reason, it just made me really question&hellip; It&rsquo;s stupid. But I\n wanted to tell her about the tooth fairy and I was suddenly questioning\n my entire competency as a father. My entire existence as a father. I know we talked about it&hellip; when we decided to get pregnant. I felt so sure, then. But now that she&rsquo;s here,\n I love her so much. More than I thought possible, and we brought her \ninto this broken world that I failed to protect, what if I fail to \nprotect her too? I suddenly thought how stupid it was to tell her about \nthe tooth fairy when&hellip; I mean. All the&hellip; so much death, Pepper. We try\n to ignore it, but there&rsquo;s so much death. And it just seemed so foolish \nto teach her about the tooth fairy, I&rsquo;m aware that it doesn&rsquo;t make any \nsense.&ldquo;\n</p><p>\n  Pepper listened, her expression soft and sad and understanding. She \nknew that Tony was not only questioning what was best for Morgan, \nreality or imagination, truth or whimsy, but also, always, he pushed \nagainst happiness as it came to him. He never felt like he deserved it.\n</p><p>\nShe thought back to a time, long ago, when Tony had accused her of \nstaying by his side while he reaped the benefits of destruction only to \nabandon him now. When she&rsquo;d questioned him he&rsquo;d told her he had found a \npurpose that he knew in his heart was right. She&rsquo;d trusted him in that \npurpose, then and still. But she&rsquo;d also found her own purpose, that she \nknew in her heart was right. And that was giving Tony Stark permission \nto live a beautiful life, permission to live and love and have laughter \nand kindness and all the forgiveness he needed. There were probably a \nlot of people in the world that would find fault with that, she knew; \nbut she didn&rsquo;t care. In fact, nothing on the planet and the opinion of \nexactly no one bothered her. It was her single-minded focus and task, \nlaser locked as Tony&rsquo;s had been all that time ago, to fight against \ndarkness and despair by loving Tony Stark and Morgan Stark with all her \nheart all her life.\n</p><p>\nSo she wrapped her arms around Tony&rsquo;s waist and let him kiss her head. &quot;Let&rsquo;s tell her <i>all about</i> the tooth fairy,&rdquo; she said softly, amusement and anticipation in her tone. &ldquo;It will make her so happy. She&rsquo;ll be so excited.&rdquo;\n</p><p>\nTony&rsquo;s arms tightened around her to just the point before painfulness. \nHe often held her like that, as tight as he could without hurting her, \nas if he was afraid she&rsquo;d float away. &ldquo;Okay.&rdquo;\n</p><p>Six days and two dollars in dollar coins later, Morgan woke Dad up \nbefore the sun rose, demanding a trip to the dollar store. Pepper \nlaughed at him, getting up to make pancakes and leaving Morgan to spill \nher excitement and happiness all over Dad.\n</p>",
        "body_abstract": "\n<p><b>Chapter three</b> (<a href=\"https://archiveofourown.org/works/18689929?view_full_work=true\">read the rest)</a><br></p>\n<p>Morgan Stark feels a little afraid when her front tooth suddenly <i>moves</i>. </p>\n<p>She was eating an apple when it happened; for a moment all she could \ndo was freeze, unsure exactly what she&rsquo;d felt. Thinking it might have \nbeen a weird fluke, she took another bite of her apple only to feel <i>it </i>again! This time with a small twinge of discomfort!</p>\n<p>&ldquo;Dad!&rdquo; she shrieked, not sure how big of an emergency this was and not taking any chances. &ldquo;Dad, help! Help me dad!&rdquo;</p>\n<p>As anticipated, her father&rsquo;s worried face appeared around the corner \nfrom the kitchen where he&rsquo;d been cleaning the dishes. &ldquo;What&rsquo;s wrong \nMorguna?&rdquo;</p>\n<p>&ldquo;Something&rsquo;s wrong in my mouth!&rdquo; she said worriedly, turning her big brown eyes on her dad.</p>\n",
        "reblog": {
            "comment": "<p><b>Chapter three</b> (<a href=\"https://archiveofourown.org/works/18689929?view_full_work=true\">read the rest)</a><br></p><p>Morgan Stark feels a little afraid when her front tooth suddenly <i>moves</i>. </p><p>She was eating an apple when it happened; for a moment all she could \ndo was freeze, unsure exactly what she’d felt. Thinking it might have \nbeen a weird fluke, she took another bite of her apple only to feel <i>it </i>again! This time with a small twinge of discomfort!</p><p>“Dad!” she shrieked, not sure how big of an emergency this was and not taking any chances. “Dad, help! Help me dad!”</p><p>As anticipated, her father’s worried face appeared around the corner \nfrom the kitchen where he’d been cleaning the dishes. “What’s wrong \nMorguna?”</p><p>“Something’s wrong in my mouth!” she said worriedly, turning her big brown eyes on her dad.</p>[[MORE]]<p>“Did you bite your tongue?” Dad asked as he knelt in front of her \nchair. Morgan shook her head, not knowing what was wrong and not knowing\n how afraid to be. She contemplated her options. Seemed safest to be<i> very afraid</i>, maybe enough to cry even. On the other hand, she was a <i>very brave girl</i>,\n Dad had told her that lots of times. She pushed gently on her tooth \nwith her tongue and it happened… the twinge and the movement. Tears \nfilled her eyes, and Dad looked alarmed, only confirming her fears. </p><p>“Okay, okay,” Dad said, calm now. “Just show me, okay?”</p><p>Morgan nodded and opened her mouth. Dad took a careful look then \nfrowned. “I don’t see anything, babe, can you tell daddy what’s wrong?”</p><p>Morgan didn’t dare speak. She pointed to her treacherous front tooth \nand to her confusion and consternation, Dad suddenly smiled. “Is it your\n tooth, honey? Did you tooth wiggle?”</p><p>Wiggle… didn’t sound so bad. Tentatively, she nodded and Dad seemed to relax even more. </p><p>“That’s okay, sweetie, it’s okay!” he said, smiling more widely now. </p><p>“It’s okay?” she asked pensively.</p><p>“Yeah, it is, it’s actually good! It shows what a big girl you’re \nbecoming, did you know that?” She shook her head. “That’s right! When \nlittle kids get to be big kids, their teeth get a little wiggly, and \nthey even come out so that new, big girl teeth can grow in!” Daddy \nseemed happy and relaxed about it, though she felt a little bit \nsuspicious about teeth <i>falling out.</i> She looked at him doubtfully. </p><p>“Can I see?”</p><p>Obligingly he picked her up and carried her to the bathroom mirror, \nlifting her close so she could examine the tooth as it moved. It didn’t seem to be too bad. “It hurts a little.”</p><p>“Hmmm… sometimes growing can hurt a little bit. But not very bad. I\n remember when you scraped your knee? Remember? Riding your bike for the\n first time? And you didn’t even cry.” She climbed up so she was \nstanding on the sink, turning around and putting her arms around Dad’s \nneck.</p><p>“‘Cause you put a bandaid on it,” she reminded him. “And kissed it.”</p><p>For some reason this made Dad laugh. She never understood why Mom and\n Dad always thought everything was so funny. “Well, we can’t put a \nbandaid on this sweetie. But I can kiss it, here.”</p><p>Relieved, she leaned forward, scrunching her face to bare her teeth, \nmaking him laugh again as he carefully kissed her tooth. “There. \nBetter?”</p><p>She wiggled the tooth with her tongue again then nodded. He hugged \nher tightly and lifted her down. “When does it come out?” she demanded, \nover her fear now and excited for the adventure of it.</p><p>“Can’t say for sure. It depends on how much you wiggle it and how \nclose the other tooth is to growing in. Sometimes a long time sometimes \nonly a few days.”</p><p>“How long is a 'few days?’”</p><p>Dad picked up her plate for her to put away and handed her back her apple. “Three sleeps,” he clarified.</p><p>“That’s forever! Then what happens?”</p><p>Dad twisted his mouth then got a little frown. He did that sometimes.\n Mom said Dad has <i>been through a lot</i> and sometimes he gets sad when he \nremembers it, and when his mouth did that, it usually meant he was sad \nfrom remembering something. Morgan didn’t understand it, but she knew \nwhat to do. “Can we go to the garage later, Dad?”</p><p>His sad face cleared as he smiled down at her. “If you’re good and clean your room.”</p><p>“And will you wrestle me?”</p><p>“We’ll see,” he said evasively but in her experience that always meant yes! </p><p>“Yay!” she cheered, going to him to hug him. “Thanks Dad! I love you.”</p><p>“I love–” she looked up at him when he paused, but she couldn’t \ndecide if he was upset. There were tears in his eyes but there were big \nwrinkles from his smile so big. Dad did that sometimes. “I love you \ntoo.”</p><p>Trotting off to her room to clean it, apple in hand, Morgan felt \npleased that she could clean her room and make Dad happy so they could \nplay in the garage later.</p><p>…</p><p>Pepper came in from relaxing by the lake a bit later. Tony came and \ntook some of the things from her hands, greeting her with a kiss. “How’s\n the lake today?”</p><p>“Pretty! The flowers are blooming. Oh! And the duck eggs hatched! We should show Morg in a couple of days.”</p><p>“They did? How many?”</p><p>“Three hatched, three more to go.”</p><p>“Cute,” Tony commented, setting Pepper’s book on the table. “She’ll love that.”</p><p>Pepper took off her sunhat, immediately realizing that something was \non Tony’s mind. She knew him perfectly; all of their years together had \ngiven them an unbreakable bond of not only friendship and love but also \nan almost intuitive sense of the other’s thoughts and feelings. </p><p>“How was your day? Did Morgan eat lunch? She didn’t finish her breakfast.”</p><p>“Yep, she did, even the crust,” Tony said with a smile. His eyes \nsparkled with amusement. “She scared herself though. Morgan, come here!”</p><p>Morgan came running, a doll in hand. “Yeah?”</p><p>“Momma’s home.”</p><p>“Momma!” Morgan ran and hugged Pepper around the waist. “Hi!”</p><p>“Want to tell mom what a big girl you are?”</p><p>Morgan’s brow furrowed for a brief moment before she remembered what Tony was referring to. “Mom! I have a wiggly tooth!”</p><p>“What?” Pepper lifted Morgan up and sat her on the kitchen table so \nshe could get a look at the tooth in question. “Oh wow!! You are <i>such </i>a big girl!” Morgan was so proud she hugged Pepper tightly, then went back to play.</p><p>\n “I can’t believe how big she’s getting,” Pepper marveled hesitantly, \nwondering if that’s what was bothering Tony. One unexpected side-effect \nof parenting. You always lose the child you have for a new iteration. \nWhile this was good and beautiful and exciting, it could be at times \nachingly sad.\n</p><p>\n “Right?” He glanced at Pepper and saw that she saw through him. He blew out a breath through pursed lips. \n</p><p>\n  \"For some reason, it just made me really question… It’s stupid. But I\n wanted to tell her about the tooth fairy and I was suddenly questioning\n my entire competency as a father. My entire existence as a father. I know we talked about it… when we decided to get pregnant. I felt so sure, then. But now that she’s here,\n I love her so much. More than I thought possible, and we brought her \ninto this broken world that I failed to protect, what if I fail to \nprotect her too? I suddenly thought how stupid it was to tell her about \nthe tooth fairy when… I mean. All the… so much death, Pepper. We try\n to ignore it, but there’s so much death. And it just seemed so foolish \nto teach her about the tooth fairy, I’m aware that it doesn’t make any \nsense.“\n</p><p>\n  Pepper listened, her expression soft and sad and understanding. She \nknew that Tony was not only questioning what was best for Morgan, \nreality or imagination, truth or whimsy, but also, always, he pushed \nagainst happiness as it came to him. He never felt like he deserved it.\n</p><p>\nShe thought back to a time, long ago, when Tony had accused her of \nstaying by his side while he reaped the benefits of destruction only to \nabandon him now. When she’d questioned him he’d told her he had found a \npurpose that he knew in his heart was right. She’d trusted him in that \npurpose, then and still. But she’d also found her own purpose, that she \nknew in her heart was right. And that was giving Tony Stark permission \nto live a beautiful life, permission to live and love and have laughter \nand kindness and all the forgiveness he needed. There were probably a \nlot of people in the world that would find fault with that, she knew; \nbut she didn’t care. In fact, nothing on the planet and the opinion of \nexactly no one bothered her. It was her single-minded focus and task, \nlaser locked as Tony’s had been all that time ago, to fight against \ndarkness and despair by loving Tony Stark and Morgan Stark with all her \nheart all her life.\n</p><p>\nSo she wrapped her arms around Tony’s waist and let him kiss her head. \"Let’s tell her <i>all about</i> the tooth fairy,” she said softly, amusement and anticipation in her tone. “It will make her so happy. She’ll be so excited.”\n</p><p>\nTony’s arms tightened around her to just the point before painfulness. \nHe often held her like that, as tight as he could without hurting her, \nas if he was afraid she’d float away. “Okay.”\n</p><p>Six days and two dollars in dollar coins later, Morgan woke Dad up \nbefore the sun rose, demanding a trip to the dollar store. Pepper \nlaughed at him, getting up to make pancakes and leaving Morgan to spill \nher excitement and happiness all over Dad.\n</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "tonystark5ever",
                    "active": true,
                    "theme": {
                        "header_full_width": 598,
                        "header_full_height": 709,
                        "header_focus_width": 497,
                        "header_focus_height": 279,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "218,497,497,0",
                        "header_image": "https://static.tumblr.com/1bcc6cac9b300921e64aa10e7cdf1056/guqprdh/lUQpqwuoj/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/cd07fa23dc452de7aebac312de409ffe/guqprdh/blZpqwuok/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/1bcc6cac9b300921e64aa10e7cdf1056/guqprdh/lUQpqwuoj/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185619160806"
                },
                "content_raw": "<p><b>Chapter three</b> (<a href=\"https://archiveofourown.org/works/18689929?view_full_work=true\">read the rest)</a><br></p><p>Morgan Stark feels a little afraid when her front tooth suddenly <i>moves</i>. </p><p>She was eating an apple when it happened; for a moment all she could \ndo was freeze, unsure exactly what she’d felt. Thinking it might have \nbeen a weird fluke, she took another bite of her apple only to feel <i>it </i>again! This time with a small twinge of discomfort!</p><p>“Dad!” she shrieked, not sure how big of an emergency this was and not taking any chances. “Dad, help! Help me dad!”</p><p>As anticipated, her father’s worried face appeared around the corner \nfrom the kitchen where he’d been cleaning the dishes. “What’s wrong \nMorguna?”</p><p>“Something’s wrong in my mouth!” she said worriedly, turning her big brown eyes on her dad.</p>[[MORE]]<p>“Did you bite your tongue?” Dad asked as he knelt in front of her \nchair. Morgan shook her head, not knowing what was wrong and not knowing\n how afraid to be. She contemplated her options. Seemed safest to be<i> very afraid</i>, maybe enough to cry even. On the other hand, she was a <i>very brave girl</i>,\n Dad had told her that lots of times. She pushed gently on her tooth \nwith her tongue and it happened… the twinge and the movement. Tears \nfilled her eyes, and Dad looked alarmed, only confirming her fears. </p><p>“Okay, okay,” Dad said, calm now. “Just show me, okay?”</p><p>Morgan nodded and opened her mouth. Dad took a careful look then \nfrowned. “I don’t see anything, babe, can you tell daddy what’s wrong?”</p><p>Morgan didn’t dare speak. She pointed to her treacherous front tooth \nand to her confusion and consternation, Dad suddenly smiled. “Is it your\n tooth, honey? Did you tooth wiggle?”</p><p>Wiggle… didn’t sound so bad. Tentatively, she nodded and Dad seemed to relax even more. </p><p>“That’s okay, sweetie, it’s okay!” he said, smiling more widely now. </p><p>“It’s okay?” she asked pensively.</p><p>“Yeah, it is, it’s actually good! It shows what a big girl you’re \nbecoming, did you know that?” She shook her head. “That’s right! When \nlittle kids get to be big kids, their teeth get a little wiggly, and \nthey even come out so that new, big girl teeth can grow in!” Daddy \nseemed happy and relaxed about it, though she felt a little bit \nsuspicious about teeth <i>falling out.</i> She looked at him doubtfully. </p><p>“Can I see?”</p><p>Obligingly he picked her up and carried her to the bathroom mirror, \nlifting her close so she could examine the tooth as it moved. It didn’t seem to be too bad. “It hurts a little.”</p><p>“Hmmm… sometimes growing can hurt a little bit. But not very bad. I\n remember when you scraped your knee? Remember? Riding your bike for the\n first time? And you didn’t even cry.” She climbed up so she was \nstanding on the sink, turning around and putting her arms around Dad’s \nneck.</p><p>“‘Cause you put a bandaid on it,” she reminded him. “And kissed it.”</p><p>For some reason this made Dad laugh. She never understood why Mom and\n Dad always thought everything was so funny. “Well, we can’t put a \nbandaid on this sweetie. But I can kiss it, here.”</p><p>Relieved, she leaned forward, scrunching her face to bare her teeth, \nmaking him laugh again as he carefully kissed her tooth. “There. \nBetter?”</p><p>She wiggled the tooth with her tongue again then nodded. He hugged \nher tightly and lifted her down. “When does it come out?” she demanded, \nover her fear now and excited for the adventure of it.</p><p>“Can’t say for sure. It depends on how much you wiggle it and how \nclose the other tooth is to growing in. Sometimes a long time sometimes \nonly a few days.”</p><p>“How long is a 'few days?’”</p><p>Dad picked up her plate for her to put away and handed her back her apple. “Three sleeps,” he clarified.</p><p>“That’s forever! Then what happens?”</p><p>Dad twisted his mouth then got a little frown. He did that sometimes.\n Mom said Dad has <i>been through a lot</i> and sometimes he gets sad when he \nremembers it, and when his mouth did that, it usually meant he was sad \nfrom remembering something. Morgan didn’t understand it, but she knew \nwhat to do. “Can we go to the garage later, Dad?”</p><p>His sad face cleared as he smiled down at her. “If you’re good and clean your room.”</p><p>“And will you wrestle me?”</p><p>“We’ll see,” he said evasively but in her experience that always meant yes! </p><p>“Yay!” she cheered, going to him to hug him. “Thanks Dad! I love you.”</p><p>“I love–” she looked up at him when he paused, but she couldn’t \ndecide if he was upset. There were tears in his eyes but there were big \nwrinkles from his smile so big. Dad did that sometimes. “I love you \ntoo.”</p><p>Trotting off to her room to clean it, apple in hand, Morgan felt \npleased that she could clean her room and make Dad happy so they could \nplay in the garage later.</p><p>…</p><p>Pepper came in from relaxing by the lake a bit later. Tony came and \ntook some of the things from her hands, greeting her with a kiss. “How’s\n the lake today?”</p><p>“Pretty! The flowers are blooming. Oh! And the duck eggs hatched! We should show Morg in a couple of days.”</p><p>“They did? How many?”</p><p>“Three hatched, three more to go.”</p><p>“Cute,” Tony commented, setting Pepper’s book on the table. “She’ll love that.”</p><p>Pepper took off her sunhat, immediately realizing that something was \non Tony’s mind. She knew him perfectly; all of their years together had \ngiven them an unbreakable bond of not only friendship and love but also \nan almost intuitive sense of the other’s thoughts and feelings. </p><p>“How was your day? Did Morgan eat lunch? She didn’t finish her breakfast.”</p><p>“Yep, she did, even the crust,” Tony said with a smile. His eyes \nsparkled with amusement. “She scared herself though. Morgan, come here!”</p><p>Morgan came running, a doll in hand. “Yeah?”</p><p>“Momma’s home.”</p><p>“Momma!” Morgan ran and hugged Pepper around the waist. “Hi!”</p><p>“Want to tell mom what a big girl you are?”</p><p>Morgan’s brow furrowed for a brief moment before she remembered what Tony was referring to. “Mom! I have a wiggly tooth!”</p><p>“What?” Pepper lifted Morgan up and sat her on the kitchen table so \nshe could get a look at the tooth in question. “Oh wow!! You are <i>such </i>a big girl!” Morgan was so proud she hugged Pepper tightly, then went back to play.</p><p>\n “I can’t believe how big she’s getting,” Pepper marveled hesitantly, \nwondering if that’s what was bothering Tony. One unexpected side-effect \nof parenting. You always lose the child you have for a new iteration. \nWhile this was good and beautiful and exciting, it could be at times \nachingly sad.\n</p><p>\n “Right?” He glanced at Pepper and saw that she saw through him. He blew out a breath through pursed lips. \n</p><p>\n  \"For some reason, it just made me really question… It’s stupid. But I\n wanted to tell her about the tooth fairy and I was suddenly questioning\n my entire competency as a father. My entire existence as a father. I know we talked about it… when we decided to get pregnant. I felt so sure, then. But now that she’s here,\n I love her so much. More than I thought possible, and we brought her \ninto this broken world that I failed to protect, what if I fail to \nprotect her too? I suddenly thought how stupid it was to tell her about \nthe tooth fairy when… I mean. All the… so much death, Pepper. We try\n to ignore it, but there’s so much death. And it just seemed so foolish \nto teach her about the tooth fairy, I’m aware that it doesn’t make any \nsense.“\n</p><p>\n  Pepper listened, her expression soft and sad and understanding. She \nknew that Tony was not only questioning what was best for Morgan, \nreality or imagination, truth or whimsy, but also, always, he pushed \nagainst happiness as it came to him. He never felt like he deserved it.\n</p><p>\nShe thought back to a time, long ago, when Tony had accused her of \nstaying by his side while he reaped the benefits of destruction only to \nabandon him now. When she’d questioned him he’d told her he had found a \npurpose that he knew in his heart was right. She’d trusted him in that \npurpose, then and still. But she’d also found her own purpose, that she \nknew in her heart was right. And that was giving Tony Stark permission \nto live a beautiful life, permission to live and love and have laughter \nand kindness and all the forgiveness he needed. There were probably a \nlot of people in the world that would find fault with that, she knew; \nbut she didn’t care. In fact, nothing on the planet and the opinion of \nexactly no one bothered her. It was her single-minded focus and task, \nlaser locked as Tony’s had been all that time ago, to fight against \ndarkness and despair by loving Tony Stark and Morgan Stark with all her \nheart all her life.\n</p><p>\nSo she wrapped her arms around Tony’s waist and let him kiss her head. \"Let’s tell her <i>all about</i> the tooth fairy,” she said softly, amusement and anticipation in her tone. “It will make her so happy. She’ll be so excited.”\n</p><p>\nTony’s arms tightened around her to just the point before painfulness. \nHe often held her like that, as tight as he could without hurting her, \nas if he was afraid she’d float away. “Okay.”\n</p><p>Six days and two dollars in dollar coins later, Morgan woke Dad up \nbefore the sun rose, demanding a trip to the dollar store. Pepper \nlaughed at him, getting up to make pancakes and leaving Morgan to spill \nher excitement and happiness all over Dad.\n</p>",
                "content": "<p><b>Chapter three</b> (<a href=\"https://archiveofourown.org/works/18689929?view_full_work=true\">read the rest)</a><br /></p><p>Morgan Stark feels a little afraid when her front tooth suddenly <i>moves</i>. </p><p>She was eating an apple when it happened; for a moment all she could \ndo was freeze, unsure exactly what she&rsquo;d felt. Thinking it might have \nbeen a weird fluke, she took another bite of her apple only to feel <i>it </i>again! This time with a small twinge of discomfort!</p><p>&ldquo;Dad!&rdquo; she shrieked, not sure how big of an emergency this was and not taking any chances. &ldquo;Dad, help! Help me dad!&rdquo;</p><p>As anticipated, her father&rsquo;s worried face appeared around the corner \nfrom the kitchen where he&rsquo;d been cleaning the dishes. &ldquo;What&rsquo;s wrong \nMorguna?&rdquo;</p><p>&ldquo;Something&rsquo;s wrong in my mouth!&rdquo; she said worriedly, turning her big brown eyes on her dad.</p><p>&ldquo;Did you bite your tongue?&rdquo; Dad asked as he knelt in front of her \nchair. Morgan shook her head, not knowing what was wrong and not knowing\n how afraid to be. She contemplated her options. Seemed safest to be<i> very afraid</i>, maybe enough to cry even. On the other hand, she was a <i>very brave girl</i>,\n Dad had told her that lots of times. She pushed gently on her tooth \nwith her tongue and it happened&hellip; the twinge and the movement. Tears \nfilled her eyes, and Dad looked alarmed, only confirming her fears. </p><p>&ldquo;Okay, okay,&rdquo; Dad said, calm now. &ldquo;Just show me, okay?&rdquo;</p><p>Morgan nodded and opened her mouth. Dad took a careful look then \nfrowned. &ldquo;I don&rsquo;t see anything, babe, can you tell daddy what&rsquo;s wrong?&rdquo;</p><p>Morgan didn&rsquo;t dare speak. She pointed to her treacherous front tooth \nand to her confusion and consternation, Dad suddenly smiled. &ldquo;Is it your\n tooth, honey? Did you tooth wiggle?&rdquo;</p><p>Wiggle&hellip; didn&rsquo;t sound so bad. Tentatively, she nodded and Dad seemed to relax even more. </p><p>&ldquo;That&rsquo;s okay, sweetie, it&rsquo;s okay!&rdquo; he said, smiling more widely now. </p><p>&ldquo;It&rsquo;s okay?&rdquo; she asked pensively.</p><p>&ldquo;Yeah, it is, it&rsquo;s actually good! It shows what a big girl you&rsquo;re \nbecoming, did you know that?&rdquo; She shook her head. &ldquo;That&rsquo;s right! When \nlittle kids get to be big kids, their teeth get a little wiggly, and \nthey even come out so that new, big girl teeth can grow in!&rdquo; Daddy \nseemed happy and relaxed about it, though she felt a little bit \nsuspicious about teeth <i>falling out.</i> She looked at him doubtfully. </p><p>&ldquo;Can I see?&rdquo;</p><p>Obligingly he picked her up and carried her to the bathroom mirror, \nlifting her close so she could examine the tooth as it moved. It didn&rsquo;t seem to be too bad. &ldquo;It hurts a little.&rdquo;</p><p>&ldquo;Hmmm&hellip; sometimes growing can hurt a little bit. But not very bad. I\n remember when you scraped your knee? Remember? Riding your bike for the\n first time? And you didn&rsquo;t even cry.&rdquo; She climbed up so she was \nstanding on the sink, turning around and putting her arms around Dad&rsquo;s \nneck.</p><p>&ldquo;&lsquo;Cause you put a bandaid on it,&rdquo; she reminded him. &ldquo;And kissed it.&rdquo;</p><p>For some reason this made Dad laugh. She never understood why Mom and\n Dad always thought everything was so funny. &ldquo;Well, we can&rsquo;t put a \nbandaid on this sweetie. But I can kiss it, here.&rdquo;</p><p>Relieved, she leaned forward, scrunching her face to bare her teeth, \nmaking him laugh again as he carefully kissed her tooth. &ldquo;There. \nBetter?&rdquo;</p><p>She wiggled the tooth with her tongue again then nodded. He hugged \nher tightly and lifted her down. &ldquo;When does it come out?&rdquo; she demanded, \nover her fear now and excited for the adventure of it.</p><p>&ldquo;Can&rsquo;t say for sure. It depends on how much you wiggle it and how \nclose the other tooth is to growing in. Sometimes a long time sometimes \nonly a few days.&rdquo;</p><p>&ldquo;How long is a 'few days?&rsquo;&rdquo;</p><p>Dad picked up her plate for her to put away and handed her back her apple. &ldquo;Three sleeps,&rdquo; he clarified.</p><p>&ldquo;That&rsquo;s forever! Then what happens?&rdquo;</p><p>Dad twisted his mouth then got a little frown. He did that sometimes.\n Mom said Dad has <i>been through a lot</i> and sometimes he gets sad when he \nremembers it, and when his mouth did that, it usually meant he was sad \nfrom remembering something. Morgan didn&rsquo;t understand it, but she knew \nwhat to do. &ldquo;Can we go to the garage later, Dad?&rdquo;</p><p>His sad face cleared as he smiled down at her. &ldquo;If you&rsquo;re good and clean your room.&rdquo;</p><p>&ldquo;And will you wrestle me?&rdquo;</p><p>&ldquo;We&rsquo;ll see,&rdquo; he said evasively but in her experience that always meant yes! </p><p>&ldquo;Yay!&rdquo; she cheered, going to him to hug him. &ldquo;Thanks Dad! I love you.&rdquo;</p><p>&ldquo;I love&ndash;&rdquo; she looked up at him when he paused, but she couldn&rsquo;t \ndecide if he was upset. There were tears in his eyes but there were big \nwrinkles from his smile so big. Dad did that sometimes. &ldquo;I love you \ntoo.&rdquo;</p><p>Trotting off to her room to clean it, apple in hand, Morgan felt \npleased that she could clean her room and make Dad happy so they could \nplay in the garage later.</p><p>&hellip;</p><p>Pepper came in from relaxing by the lake a bit later. Tony came and \ntook some of the things from her hands, greeting her with a kiss. &ldquo;How&rsquo;s\n the lake today?&rdquo;</p><p>&ldquo;Pretty! The flowers are blooming. Oh! And the duck eggs hatched! We should show Morg in a couple of days.&rdquo;</p><p>&ldquo;They did? How many?&rdquo;</p><p>&ldquo;Three hatched, three more to go.&rdquo;</p><p>&ldquo;Cute,&rdquo; Tony commented, setting Pepper&rsquo;s book on the table. &ldquo;She&rsquo;ll love that.&rdquo;</p><p>Pepper took off her sunhat, immediately realizing that something was \non Tony&rsquo;s mind. She knew him perfectly; all of their years together had \ngiven them an unbreakable bond of not only friendship and love but also \nan almost intuitive sense of the other&rsquo;s thoughts and feelings. </p><p>&ldquo;How was your day? Did Morgan eat lunch? She didn&rsquo;t finish her breakfast.&rdquo;</p><p>&ldquo;Yep, she did, even the crust,&rdquo; Tony said with a smile. His eyes \nsparkled with amusement. &ldquo;She scared herself though. Morgan, come here!&rdquo;</p><p>Morgan came running, a doll in hand. &ldquo;Yeah?&rdquo;</p><p>&ldquo;Momma&rsquo;s home.&rdquo;</p><p>&ldquo;Momma!&rdquo; Morgan ran and hugged Pepper around the waist. &ldquo;Hi!&rdquo;</p><p>&ldquo;Want to tell mom what a big girl you are?&rdquo;</p><p>Morgan&rsquo;s brow furrowed for a brief moment before she remembered what Tony was referring to. &ldquo;Mom! I have a wiggly tooth!&rdquo;</p><p>&ldquo;What?&rdquo; Pepper lifted Morgan up and sat her on the kitchen table so \nshe could get a look at the tooth in question. &ldquo;Oh wow!! You are <i>such </i>a big girl!&rdquo; Morgan was so proud she hugged Pepper tightly, then went back to play.</p><p>\n &ldquo;I can&rsquo;t believe how big she&rsquo;s getting,&rdquo; Pepper marveled hesitantly, \nwondering if that&rsquo;s what was bothering Tony. One unexpected side-effect \nof parenting. You always lose the child you have for a new iteration. \nWhile this was good and beautiful and exciting, it could be at times \nachingly sad.\n</p><p>\n &ldquo;Right?&rdquo; He glanced at Pepper and saw that she saw through him. He blew out a breath through pursed lips. \n</p><p>\n &nbsp;\"For some reason, it just made me really question&hellip; It&rsquo;s stupid. But I\n wanted to tell her about the tooth fairy and I was suddenly questioning\n my entire competency as a father. My entire existence as a father. I know we talked about it&hellip; when we decided to get pregnant. I felt so sure, then. But now that she&rsquo;s here,\n I love her so much. More than I thought possible, and we brought her \ninto this broken world that I failed to protect, what if I fail to \nprotect her too? I suddenly thought how stupid it was to tell her about \nthe tooth fairy when&hellip; I mean. All the&hellip; so much death, Pepper. We try\n to ignore it, but there&rsquo;s so much death. And it just seemed so foolish \nto teach her about the tooth fairy, I&rsquo;m aware that it doesn&rsquo;t make any \nsense.&ldquo;\n</p><p>\n &nbsp;Pepper listened, her expression soft and sad and understanding. She \nknew that Tony was not only questioning what was best for Morgan, \nreality or imagination, truth or whimsy, but also, always, he pushed \nagainst happiness as it came to him. He never felt like he deserved it.\n</p><p>\nShe thought back to a time, long ago, when Tony had accused her of \nstaying by his side while he reaped the benefits of destruction only to \nabandon him now. When she&rsquo;d questioned him he&rsquo;d told her he had found a \npurpose that he knew in his heart was right. She&rsquo;d trusted him in that \npurpose, then and still. But she&rsquo;d also found her own purpose, that she \nknew in her heart was right. And that was giving Tony Stark permission \nto live a beautiful life, permission to live and love and have laughter \nand kindness and all the forgiveness he needed. There were probably a \nlot of people in the world that would find fault with that, she knew; \nbut she didn&rsquo;t care. In fact, nothing on the planet and the opinion of \nexactly no one bothered her. It was her single-minded focus and task, \nlaser locked as Tony&rsquo;s had been all that time ago, to fight against \ndarkness and despair by loving Tony Stark and Morgan Stark with all her \nheart all her life.\n</p><p>\nSo she wrapped her arms around Tony&rsquo;s waist and let him kiss her head. \"Let&rsquo;s tell her <i>all about</i> the tooth fairy,&rdquo; she said softly, amusement and anticipation in her tone. &ldquo;It will make her so happy. She&rsquo;ll be so excited.&rdquo;\n</p><p>\nTony&rsquo;s arms tightened around her to just the point before painfulness. \nHe often held her like that, as tight as he could without hurting her, \nas if he was afraid she&rsquo;d float away. &ldquo;Okay.&rdquo;\n</p><p>Six days and two dollars in dollar coins later, Morgan woke Dad up \nbefore the sun rose, demanding a trip to the dollar store. Pepper \nlaughed at him, getting up to make pancakes and leaving Morgan to spill \nher excitement and happiness all over Dad.\n</p>",
                "content_abstract": "<p>\n<p><b>Chapter three</b> (<a href=\"https://archiveofourown.org/works/18689929?view_full_work=true\">read the rest)</a><br /></p>\n<p>Morgan Stark feels a little afraid when her front tooth suddenly <i>moves</i>. </p>\n<p>She was eating an apple when it happened; for a moment all she could \ndo was freeze, unsure exactly what she&rsquo;d felt. Thinking it might have \nbeen a weird fluke, she took another bite of her apple only to feel <i>it </i>again! This time with a small twinge of discomfort!</p>\n<p>&ldquo;Dad!&rdquo; she shrieked, not sure how big of an emergency this was and not taking any chances. &ldquo;Dad, help! Help me dad!&rdquo;</p>\n<p>As anticipated, her father&rsquo;s worried face appeared around the corner \nfrom the kitchen where he&rsquo;d been cleaning the dishes. &ldquo;What&rsquo;s wrong \nMorguna?&rdquo;</p>\n<p>&ldquo;Something&rsquo;s wrong in my mouth!&rdquo; she said worriedly, turning her big brown eyes on her dad.</p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "avenformerswhore",
        "blog": {
            "name": "avenformerswhore",
            "title": "✨your friendly neighbourhood marvel whore✨",
            "description": "<p>লাবীবাহ | She/Her | Multi-fandom but mostly Marvel and Transformers | Forever a Stark family stan | Formula 1 | Nicki Minaj | Netflix Enthusiast | Muslim | Writer | American-Canadian <a href=\"https://www.wattpad.com/user/avenformerswhore\">Wattpad</a> | <a href=\"https://archiveofourown.org/users/avenformerswhore\">AO3</a></p>",
            "url": "https://avenformerswhore.tumblr.com/",
            "uuid": "t:7qXQKFPw2cIXlTbxuWNYpQ",
            "updated": 1561680333
        },
        "id": 185619095814,
        "post_url": "https://avenformerswhore.tumblr.com/post/185619095814",
        "slug": "",
        "date": "2019-06-15 23:39:56 GMT",
        "timestamp": 1560641996,
        "state": "published",
        "format": "html",
        "reblog_key": "GOiKA0Hy",
        "tags": [
            "mcu",
            "marvel",
            "tony stark",
            "avengers",
            "avengers endgame",
            "iron man",
            "i love you 3000"
        ],
        "short_url": "https://tmblr.co/ZYbPdf2itmg46",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 6,
        "title": null,
        "body": "<p><figure class=\"tmblr-full\" data-orig-height=\"1138\" data-orig-width=\"837\"><img src=\"https://66.media.tumblr.com/46758884ed0fde0ad33e374e4f6a4beb/tumblr_pt5z2kezVL1uxzvy0_540.jpg\" data-orig-height=\"1138\" data-orig-width=\"837\"/></figure></p><h1>y’all </h1>",
        "reblog": {
            "comment": "<p><p><figure class=\"tmblr-full\" data-orig-height=\"1138\" data-orig-width=\"837\"><img src=\"https://66.media.tumblr.com/46758884ed0fde0ad33e374e4f6a4beb/tumblr_pt5z2kezVL1uxzvy0_540.jpg\" data-orig-height=\"1138\" data-orig-width=\"837\"></figure></p><h1>y’all </h1></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "avenformerswhore",
                    "active": true,
                    "theme": {
                        "header_full_width": 400,
                        "header_full_height": 168,
                        "header_focus_width": 299,
                        "header_focus_height": 168,
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,310,168,11",
                        "header_image": "https://static.tumblr.com/e2e2df250159a7650bfe59ab22f2f55d/hxmqyp4/hC4pnehbg/tumblr_static_.gif",
                        "header_image_focused": "https://static.tumblr.com/e2e2df250159a7650bfe59ab22f2f55d/hxmqyp4/aH7pnehbi/tumblr_static_tumblr_static__focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/e2e2df250159a7650bfe59ab22f2f55d/hxmqyp4/hC4pnehbg/tumblr_static__2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#FFE182",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFE182",
                        "title_font": "Streetscript",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185619095814"
                },
                "content_raw": "<p><p><figure class=\"tmblr-full\" data-orig-height=\"1138\" data-orig-width=\"837\"><img src=\"https://66.media.tumblr.com/46758884ed0fde0ad33e374e4f6a4beb/tumblr_pt5z2kezVL1uxzvy0_540.jpg\" data-orig-height=\"1138\" data-orig-width=\"837\"></figure></p><h1>y’all </h1></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/46758884ed0fde0ad33e374e4f6a4beb/tumblr_pt5z2kezVL1uxzvy0_540.jpg\" class=\"\"/></figure><h1>y&rsquo;all </h1></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "ao3feed-tonystark",
        "blog": {
            "name": "ao3feed-tonystark",
            "title": "Ao3-Feed: Tony Stark",
            "description": "This blog is an automated list of the stories posted on Archive Of Our Own under the Tony Stark tag. The stories are automatically posted here from the AO3 RSS feed.",
            "url": "https://ao3feed-tonystark.tumblr.com/",
            "uuid": "t:O3wJf2GJebW4NoTEp7bxNg",
            "updated": 1561764808
        },
        "id": 185619084707,
        "post_url": "https://ao3feed-tonystark.tumblr.com/post/185619084707/resized",
        "slug": "resized",
        "date": "2019-06-15 23:39:22 GMT",
        "timestamp": 1560641962,
        "state": "published",
        "format": "html",
        "reblog_key": "SDFCsgd4",
        "tags": [
            "IFTTT",
            "tony stark",
            "iron man",
            "the avengers",
            "marvel",
            "ao3",
            "ao3feed"
        ],
        "short_url": "https://tmblr.co/ZX12gl2itmdMZ",
        "summary": "Resized",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": "Resized",
        "body": "read it on the AO3 at <strong><a href=\"http://bit.ly/2IkoD87\" target=\"_blank\">http://bit.ly/2IkoD87</a></strong><br/><p>by <a rel=\"author\" href=\"/users/Konoto/pseuds/Konoto\" target=\"_blank\">Konoto</a></p><p>And that&rsquo;s why trainees don&rsquo;t take on bad guys on their own.</p><p>Words: 1960, Chapters: 1/1, Language: English</p><p>Series: Part 4 of <a href=\"http://archiveofourown.org/series/1372834\" target=\"_blank\">Tony Stark as a dad</a></p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel)%20-%20All%20Media%20Types/works\" target=\"_blank\">The Avengers (Marvel) - All Media Types</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/General%20Audiences/works\" target=\"_blank\">General Audiences</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Choose%20Not%20To%20Use%20Archive%20Warnings/works\" target=\"_blank\">Creator Chose Not To Use Archive Warnings</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Gen/works\" target=\"_blank\">Gen</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/James%20%22Rhodey%22%20Rhodes/works\" target=\"_blank\">James &ldquo;Rhodey&rdquo; Rhodes</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Kamala%20Khan/works\" target=\"_blank\">Kamala Khan</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Maria%20Hill/works\" target=\"_blank\">Maria Hill</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Fluff/works\" target=\"_blank\">Fluff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tooth-Rotting%20Fluff/works\" target=\"_blank\">Tooth-Rotting Fluff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Age%20Regression*s*De-Aging/works\" target=\"_blank\">Age Regression/De-Aging</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark%20actual%20A+%20dad/works\" target=\"_blank\">Tony Stark actual A+ dad</a></li></ul><br/><br/>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2IkoD87\" target=\"_blank\">http://bit.ly/2IkoD87</a></strong>",
        "reblog": {
            "comment": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2IkoD87\" target=\"_blank\">http://bit.ly/2IkoD87</a></strong><br><p>by <a rel=\"author\" href=\"/users/Konoto/pseuds/Konoto\" target=\"_blank\">Konoto</a></p><p>And that’s why trainees don’t take on bad guys on their own.</p><p>Words: 1960, Chapters: 1/1, Language: English</p><p>Series: Part 4 of <a href=\"http://archiveofourown.org/series/1372834\" target=\"_blank\">Tony Stark as a dad</a></p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel)%20-%20All%20Media%20Types/works\" target=\"_blank\">The Avengers (Marvel) - All Media Types</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/General%20Audiences/works\" target=\"_blank\">General Audiences</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Choose%20Not%20To%20Use%20Archive%20Warnings/works\" target=\"_blank\">Creator Chose Not To Use Archive Warnings</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Gen/works\" target=\"_blank\">Gen</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/James%20%22Rhodey%22%20Rhodes/works\" target=\"_blank\">James “Rhodey” Rhodes</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Kamala%20Khan/works\" target=\"_blank\">Kamala Khan</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Maria%20Hill/works\" target=\"_blank\">Maria Hill</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Fluff/works\" target=\"_blank\">Fluff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tooth-Rotting%20Fluff/works\" target=\"_blank\">Tooth-Rotting Fluff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Age%20Regression*s*De-Aging/works\" target=\"_blank\">Age Regression/De-Aging</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark%20actual%20A+%20dad/works\" target=\"_blank\">Tony Stark actual A+ dad</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2IkoD87\" target=\"_blank\">http://bit.ly/2IkoD87</a></strong></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ao3feed-tonystark",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Avalon",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185619084707"
                },
                "content_raw": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2IkoD87\" target=\"_blank\">http://bit.ly/2IkoD87</a></strong><br><p>by <a rel=\"author\" href=\"/users/Konoto/pseuds/Konoto\" target=\"_blank\">Konoto</a></p><p>And that’s why trainees don’t take on bad guys on their own.</p><p>Words: 1960, Chapters: 1/1, Language: English</p><p>Series: Part 4 of <a href=\"http://archiveofourown.org/series/1372834\" target=\"_blank\">Tony Stark as a dad</a></p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel)%20-%20All%20Media%20Types/works\" target=\"_blank\">The Avengers (Marvel) - All Media Types</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/General%20Audiences/works\" target=\"_blank\">General Audiences</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Choose%20Not%20To%20Use%20Archive%20Warnings/works\" target=\"_blank\">Creator Chose Not To Use Archive Warnings</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Gen/works\" target=\"_blank\">Gen</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/James%20%22Rhodey%22%20Rhodes/works\" target=\"_blank\">James “Rhodey” Rhodes</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Kamala%20Khan/works\" target=\"_blank\">Kamala Khan</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Maria%20Hill/works\" target=\"_blank\">Maria Hill</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Fluff/works\" target=\"_blank\">Fluff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tooth-Rotting%20Fluff/works\" target=\"_blank\">Tooth-Rotting Fluff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Age%20Regression*s*De-Aging/works\" target=\"_blank\">Age Regression/De-Aging</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark%20actual%20A+%20dad/works\" target=\"_blank\">Tony Stark actual A+ dad</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2IkoD87\" target=\"_blank\">http://bit.ly/2IkoD87</a></strong></p>",
                "content": "<p><p>read it on the AO3 at <strong><a href=\"http://bit.ly/2IkoD87\" target=\"_blank\">http://bit.ly/2IkoD87</a></strong><br /></p><p>by <a href=\"/users/Konoto/pseuds/Konoto\" target=\"_blank\">Konoto</a></p><p>And that&rsquo;s why trainees don&rsquo;t take on bad guys on their own.</p><p>Words: 1960, Chapters: 1/1, Language: English</p><p>Series: Part 4 of <a href=\"http://archiveofourown.org/series/1372834\" target=\"_blank\">Tony Stark as a dad</a></p><ul><li>Fandoms: <a href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel)%20-%20All%20Media%20Types/works\" target=\"_blank\">The Avengers (Marvel) - All Media Types</a></li><li>Rating: <a href=\"http://archiveofourown.org/tags/General%20Audiences/works\" target=\"_blank\">General Audiences</a></li><li>Warnings: <a href=\"http://archiveofourown.org/tags/Choose%20Not%20To%20Use%20Archive%20Warnings/works\" target=\"_blank\">Creator Chose Not To Use Archive Warnings</a></li><li>Categories: <a href=\"http://archiveofourown.org/tags/Gen/works\" target=\"_blank\">Gen</a></li><li>Characters: <a href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/James%20%22Rhodey%22%20Rhodes/works\" target=\"_blank\">James &ldquo;Rhodey&rdquo; Rhodes</a>, <a href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a href=\"http://archiveofourown.org/tags/Kamala%20Khan/works\" target=\"_blank\">Kamala Khan</a>, <a href=\"http://archiveofourown.org/tags/Maria%20Hill/works\" target=\"_blank\">Maria Hill</a></li><li>Additional Tags: <a href=\"http://archiveofourown.org/tags/Fluff/works\" target=\"_blank\">Fluff</a>, <a href=\"http://archiveofourown.org/tags/Tooth-Rotting%20Fluff/works\" target=\"_blank\">Tooth-Rotting Fluff</a>, <a href=\"http://archiveofourown.org/tags/Age%20Regression*s*De-Aging/works\" target=\"_blank\">Age Regression/De-Aging</a>, <a href=\"http://archiveofourown.org/tags/Tony%20Stark%20actual%20A+%20dad/works\" target=\"_blank\">Tony Stark actual A+ dad</a></li></ul><br /><br />\nread it on the AO3 at <strong><a href=\"http://bit.ly/2IkoD87\" target=\"_blank\">http://bit.ly/2IkoD87</a></strong></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "lady-tortilla-chip",
        "blog": {
            "name": "lady-tortilla-chip",
            "title": "Multi-Shipper",
            "description": "Endgame Fucked me up and I’ll never be the same. (I write/draw and I cry over fictional people. That’s it. That’s all this blog is, just my love for them barfed all over the damn place)",
            "url": "https://lady-tortilla-chip.tumblr.com/",
            "uuid": "t:uK4Ep6KlpNmQ4dpZfg5xHw",
            "updated": 1561764203
        },
        "id": 185619059098,
        "post_url": "https://lady-tortilla-chip.tumblr.com/post/185619059098/im-a-hardcore-tony-x-happiness-fan-and-endgame",
        "slug": "im-a-hardcore-tony-x-happiness-fan-and-endgame",
        "date": "2019-06-15 23:37:42 GMT",
        "timestamp": 1560641862,
        "state": "published",
        "format": "html",
        "reblog_key": "7YM5vtwN",
        "tags": [
            "Endgame spoilers",
            "Tony Stark",
            "I’m still so upset",
            "so so upset",
            "endgame",
            "mcu",
            "marvel",
            "RUSSOS YOU BASTARDS",
            "and Natasha got no happiness",
            "nada",
            "zip",
            "none",
            "I’m still so mad about it",
            "it’s been a minute but I’m still so mad",
            "tony stark deserved so much better"
        ],
        "short_url": "https://tmblr.co/ZvZoOX2itmX6Q",
        "summary": "I’m a hardcore Tony x Happiness fan and endgame gave me a handful of minutes of that lovely ship then fucking murdered him.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 3,
        "title": null,
        "body": "<p>I’m a hardcore Tony x Happiness fan and endgame gave me a handful of minutes of that lovely ship then fucking murdered him.</p>",
        "reblog": {
            "comment": "<p>I’m a hardcore Tony x Happiness fan and endgame gave me a handful of minutes of that lovely ship then fucking murdered him.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "lady-tortilla-chip",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 258,
                        "header_focus_width": 202,
                        "header_focus_height": 114,
                        "avatar_shape": "circle",
                        "background_color": "#6a5d80",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "7,294,121,92",
                        "header_image": "https://static.tumblr.com/e099aff613c8ff1c2c24c3897578e40f/nn6uhhb/ILWplymw4/tumblr_static_778tbo3jzzks4og8kggs8kkg8.jpg",
                        "header_image_focused": "https://static.tumblr.com/38a9515db39461efecd19815fc47497f/nn6uhhb/v91plymw5/tumblr_static_tumblr_static_778tbo3jzzks4og8kggs8kkg8_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e099aff613c8ff1c2c24c3897578e40f/nn6uhhb/ILWplymw4/tumblr_static_778tbo3jzzks4og8kggs8kkg8_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#222222",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#222222",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185619059098"
                },
                "content_raw": "<p>I’m a hardcore Tony x Happiness fan and endgame gave me a handful of minutes of that lovely ship then fucking murdered him.</p>",
                "content": "<p>I&rsquo;m a hardcore Tony x Happiness fan and endgame gave me a handful of minutes of that lovely ship then fucking murdered him.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "laireshi",
        "blog": {
            "name": "laireshi",
            "title": "",
            "description": "I write <a href=\"http://archiveofourown.org/users/laireshi\">fics</a>.",
            "url": "https://laireshi.tumblr.com/",
            "uuid": "t:OVnu49h12ecjeY-B-9Qh9Q",
            "updated": 1561765420
        },
        "id": 185618778457,
        "post_url": "https://laireshi.tumblr.com/post/185618778457/improvement",
        "slug": "improvement",
        "date": "2019-06-15 23:20:38 GMT",
        "timestamp": 1560640838,
        "state": "published",
        "format": "html",
        "reblog_key": "YutL6GE7",
        "tags": [
            "comicsohwhyohwhy",
            "tony stark",
            "morgan stark",
            "dad tony",
            "mentions of howard and child abuse",
            "my fic"
        ],
        "short_url": "https://tmblr.co/ZNkzUr2itlSbP",
        "summary": "Improvement",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 41,
        "title": "Improvement",
        "body": "<p><a href=\"https://archiveofourown.org/works/19230409\">Tony Stark &amp; Morgan Stark</a></p><p>Summary:</p><blockquote><p>The first time Tony holds Morgan, he’s absolutely terrified.</p></blockquote><p>Happy birthday, <a class=\"tumblelog\" href=\"https://tmblr.co/mo9jbFSPuC9lJJ1u8Evvp5g\">@comicsohwhyohwhy</a>!</p><p><a href=\"https://archiveofourown.org/works/19230409\"><b>read on ao3</b></a><br/></p>",
        "reblog": {
            "comment": "<p><a href=\"https://archiveofourown.org/works/19230409\">Tony Stark &amp; Morgan Stark</a></p><p>Summary:</p><blockquote><p>The first time Tony holds Morgan, he’s absolutely terrified.</p></blockquote><p>Happy birthday, <a class=\"tumblelog\" href=\"https://tmblr.co/mo9jbFSPuC9lJJ1u8Evvp5g\">@comicsohwhyohwhy</a>!</p><p><a href=\"https://archiveofourown.org/works/19230409\"><b>read on ao3</b></a><br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "laireshi",
                    "active": true,
                    "theme": {
                        "header_full_width": 791,
                        "header_full_height": 1200,
                        "header_focus_width": 710,
                        "header_focus_height": 399,
                        "avatar_shape": "square",
                        "background_color": "#F7F7F7",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "270,736,669,26",
                        "header_image": "https://static.tumblr.com/384d70d8200e721a2c7ce6d59ccf45f9/tgzzrnx/ouHo9yz1f/tumblr_static_74zcgl0ldi80o8g0o00sksw8w.jpg",
                        "header_image_focused": "https://static.tumblr.com/384d70d8200e721a2c7ce6d59ccf45f9/tgzzrnx/vcio9yz1h/tumblr_static_tumblr_static_74zcgl0ldi80o8g0o00sksw8w_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/384d70d8200e721a2c7ce6d59ccf45f9/tgzzrnx/ouHo9yz1f/tumblr_static_74zcgl0ldi80o8g0o00sksw8w_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#B6D6E8",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618778457"
                },
                "content_raw": "<p><a href=\"https://archiveofourown.org/works/19230409\">Tony Stark &amp; Morgan Stark</a></p><p>Summary:</p><blockquote><p>The first time Tony holds Morgan, he’s absolutely terrified.</p></blockquote><p>Happy birthday, <a class=\"tumblelog\" href=\"https://tmblr.co/mo9jbFSPuC9lJJ1u8Evvp5g\">@comicsohwhyohwhy</a>!</p><p><a href=\"https://archiveofourown.org/works/19230409\"><b>read on ao3</b></a><br></p>",
                "content": "<p><a href=\"https://archiveofourown.org/works/19230409\">Tony Stark &amp; Morgan Stark</a></p><p>Summary:</p><blockquote><p>The first time Tony holds Morgan, he&rsquo;s absolutely terrified.</p></blockquote><p>Happy birthday, <a href=\"https://tmblr.co/mo9jbFSPuC9lJJ1u8Evvp5g\">@comicsohwhyohwhy</a>!</p><p><a href=\"https://archiveofourown.org/works/19230409\"><b>read on ao3</b></a><br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "link",
        "blog_name": "pineapplebread",
        "blog": {
            "name": "pineapplebread",
            "title": "p i n e a p p l e bread",
            "description": "<a href=\"https://pineapplebread.tumblr.com/tagged/my%20art\">art</a> • <a href=\"https://archiveofourown.org/users/pineapplebreads\">fic</a> • <a href=\"https://twitter.com/pineapplebreads\">tweet</a> • <a href=\"https://www.instagram.com/pineapplebreads/\">insta</a> • <a href=\"https://pineapplebread.tumblr.com/ask\">ask</a>",
            "url": "https://pineapplebread.tumblr.com/",
            "uuid": "t:Z3d6-M-Otlh1UrwUmQIj_w",
            "updated": 1561754900
        },
        "id": 185618773883,
        "post_url": "https://pineapplebread.tumblr.com/post/185618773883/show-chapter-archive",
        "slug": "show-chapter-archive",
        "date": "2019-06-15 23:20:20 GMT",
        "timestamp": 1560640820,
        "state": "published",
        "format": "html",
        "reblog_key": "eyVg0cXz",
        "tags": [
            "dear mr fantasy",
            "steve rogers",
            "tony stark",
            "stony",
            "superhusbands",
            "stevetony",
            "my fic",
            "high school au"
        ],
        "short_url": "https://tmblr.co/ZiBvUx2itlRTx",
        "summary": "Show\n          Chapter\n        |\n        Archive of Our Own",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 28,
        "title": "Show\n          Chapter\n        |\n        Archive of Our Own",
        "url": "https://archiveofourown.org/works/19048960/chapters/45727084",
        "link_author": "Organization for Transformative Works",
        "excerpt": "An Archive of Our Own, a project of the Organization for Transformative Works",
        "publisher": "archiveofourown.org",
        "description": "<p>The new chapter of <a href=\"https://pineapplebread.tumblr.com/post/185302330841/dear-mr-fantasy-explicit-tony-writes-letters-to\" target=\"_blank\">Dear Mr. Fantasy</a> is up!</p>",
        "reblog": {
            "comment": "<p>The new chapter of <a href=\"https://pineapplebread.tumblr.com/post/185302330841/dear-mr-fantasy-explicit-tony-writes-letters-to\" target=\"_blank\">Dear Mr. Fantasy</a> is up!</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "pineapplebread",
                    "active": true,
                    "theme": {
                        "header_full_width": 1470,
                        "header_full_height": 1600,
                        "header_focus_width": 1470,
                        "header_focus_height": 827,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "160,1470,987,0",
                        "header_image": "https://static.tumblr.com/e2c138250183e9fb92efe5b68a15f815/x2sosvp/fa2paws5k/tumblr_static_4v2clhuw7s00c4oc0okcgwc0s.jpg",
                        "header_image_focused": "https://static.tumblr.com/e2c138250183e9fb92efe5b68a15f815/x2sosvp/GnXpaws7x/tumblr_static_tumblr_static_4v2clhuw7s00c4oc0okcgwc0s_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e2c138250183e9fb92efe5b68a15f815/x2sosvp/fa2paws5k/tumblr_static_4v2clhuw7s00c4oc0okcgwc0s_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#37b5eb",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ff00d4",
                        "title_font": "Grumpy Black 48",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618773883"
                },
                "content_raw": "<p>The new chapter of <a href=\"https://pineapplebread.tumblr.com/post/185302330841/dear-mr-fantasy-explicit-tony-writes-letters-to\" target=\"_blank\">Dear Mr. Fantasy</a> is up!</p>",
                "content": "<p>The new chapter of <a href=\"https://pineapplebread.tumblr.com/post/185302330841/dear-mr-fantasy-explicit-tony-writes-letters-to\" target=\"_blank\">Dear Mr. Fantasy</a> is up!</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "ao3feed-tonystark",
        "blog": {
            "name": "ao3feed-tonystark",
            "title": "Ao3-Feed: Tony Stark",
            "description": "This blog is an automated list of the stories posted on Archive Of Our Own under the Tony Stark tag. The stories are automatically posted here from the AO3 RSS feed.",
            "url": "https://ao3feed-tonystark.tumblr.com/",
            "uuid": "t:O3wJf2GJebW4NoTEp7bxNg",
            "updated": 1561764808
        },
        "id": 185618761977,
        "post_url": "https://ao3feed-tonystark.tumblr.com/post/185618761977/biochemistry-for-dummies",
        "slug": "biochemistry-for-dummies",
        "date": "2019-06-15 23:19:35 GMT",
        "timestamp": 1560640775,
        "state": "published",
        "format": "html",
        "reblog_key": "NbY2FfQF",
        "tags": [
            "IFTTT",
            "tony stark",
            "iron man",
            "the avengers",
            "marvel",
            "ao3",
            "ao3feed"
        ],
        "short_url": "https://tmblr.co/ZX12gl2itlOZv",
        "summary": "Biochemistry for Dummies",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": "Biochemistry for Dummies",
        "body": "read it on the AO3 at <strong><a href=\"http://bit.ly/2IKMzk1\" target=\"_blank\">http://bit.ly/2IKMzk1</a></strong><br/><p>by <a rel=\"author\" href=\"/users/Corey5268/pseuds/Corey5268\" target=\"_blank\">Corey5268</a></p><p>Wade Wilson, single father, veteran, and darling of the gender studies department, really didn&rsquo;t expect to be one of the most gossiped-about professors on campus, but here he is. Guess that&rsquo;s what he gets for falling in love with Dr. Peter Parker, human disaster extraordinaire. Shame he doesn&rsquo;t have the benefits of, you know, an actual relationship yet.</p><p>Words: 652, Chapters: 1/?, Language: English</p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spider-Man%20-%20All%20Media%20Types/works\" target=\"_blank\">Spider-Man - All Media Types</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Deadpool%20-%20All%20Media%20Types/works\" target=\"_blank\">Deadpool - All Media Types</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel/works\" target=\"_blank\">Marvel</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Teen%20And%20Up%20Audiences/works\" target=\"_blank\">Teen And Up Audiences</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\" target=\"_blank\">No Archive Warnings Apply</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/M*s*M/works\" target=\"_blank\">M/M</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wade%20Wilson/works\" target=\"_blank\">Wade Wilson</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Mary%20Jane%20Watson/works\" target=\"_blank\">Mary Jane Watson</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Ellie%20Camacho/works\" target=\"_blank\">Ellie Camacho</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Sam%20Wilson%20(Marvel)/works\" target=\"_blank\">Sam Wilson (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/James%20%22Bucky%22%20Barnes/works\" target=\"_blank\">James &ldquo;Bucky&rdquo; Barnes</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Steve%20Rogers/works\" target=\"_blank\">Steve Rogers</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker*s*Wade%20Wilson/works\" target=\"_blank\">Peter Parker/Wade Wilson</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20College*s*University/works\" target=\"_blank\">Alternate Universe - College/University</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20Professors/works\" target=\"_blank\">Alternate Universe - Professors</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wade%20teaches%20gender%20studies/works\" target=\"_blank\">Wade teaches gender studies</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20teaches%20ALL%20the%20sciences/works\" target=\"_blank\">Peter teaches ALL the sciences</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20No%20Powers/works\" target=\"_blank\">Alternate Universe - No Powers</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Idiots%20in%20Love/works\" target=\"_blank\">Idiots in Love</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pining/works\" target=\"_blank\">Pining</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wade%20is%20playing%20the%20long%20game%20here/works\" target=\"_blank\">Wade is playing the long game here</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Dadpool/works\" target=\"_blank\">Dadpool</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20history%20department%20is%20having%20a%20civil%20war/works\" target=\"_blank\">The history department is having a civil war</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/over%20the%20byzantine%20empire/works\" target=\"_blank\">over the byzantine empire</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Oblivious%20Peter%20Parker/works\" target=\"_blank\">Oblivious Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Colleagues%20to%20Lovers/works\" target=\"_blank\">Colleagues to Lovers</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/I%20have%20the%20spideypool%20discord%20server%20to%20thank%20for%20this%20universe/works\" target=\"_blank\">I have the spideypool discord server to thank for this universe</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/like%2010%20different%20people%20created%20it%20with%20me/works\" target=\"_blank\">like 10 different people created it with me</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/is%20Dr*d*%20Parker%20okay*q*/works\" target=\"_blank\">is Dr. Parker okay?</a></li></ul><br/><br/>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2IKMzk1\" target=\"_blank\">http://bit.ly/2IKMzk1</a></strong>",
        "reblog": {
            "comment": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2IKMzk1\" target=\"_blank\">http://bit.ly/2IKMzk1</a></strong><br><p>by <a rel=\"author\" href=\"/users/Corey5268/pseuds/Corey5268\" target=\"_blank\">Corey5268</a></p><p>Wade Wilson, single father, veteran, and darling of the gender studies department, really didn’t expect to be one of the most gossiped-about professors on campus, but here he is. Guess that’s what he gets for falling in love with Dr. Peter Parker, human disaster extraordinaire. Shame he doesn’t have the benefits of, you know, an actual relationship yet.</p><p>Words: 652, Chapters: 1/?, Language: English</p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spider-Man%20-%20All%20Media%20Types/works\" target=\"_blank\">Spider-Man - All Media Types</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Deadpool%20-%20All%20Media%20Types/works\" target=\"_blank\">Deadpool - All Media Types</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel/works\" target=\"_blank\">Marvel</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Teen%20And%20Up%20Audiences/works\" target=\"_blank\">Teen And Up Audiences</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\" target=\"_blank\">No Archive Warnings Apply</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/M*s*M/works\" target=\"_blank\">M/M</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wade%20Wilson/works\" target=\"_blank\">Wade Wilson</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Mary%20Jane%20Watson/works\" target=\"_blank\">Mary Jane Watson</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Ellie%20Camacho/works\" target=\"_blank\">Ellie Camacho</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Sam%20Wilson%20(Marvel)/works\" target=\"_blank\">Sam Wilson (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/James%20%22Bucky%22%20Barnes/works\" target=\"_blank\">James “Bucky” Barnes</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Steve%20Rogers/works\" target=\"_blank\">Steve Rogers</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker*s*Wade%20Wilson/works\" target=\"_blank\">Peter Parker/Wade Wilson</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20College*s*University/works\" target=\"_blank\">Alternate Universe - College/University</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20Professors/works\" target=\"_blank\">Alternate Universe - Professors</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wade%20teaches%20gender%20studies/works\" target=\"_blank\">Wade teaches gender studies</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20teaches%20ALL%20the%20sciences/works\" target=\"_blank\">Peter teaches ALL the sciences</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20No%20Powers/works\" target=\"_blank\">Alternate Universe - No Powers</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Idiots%20in%20Love/works\" target=\"_blank\">Idiots in Love</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pining/works\" target=\"_blank\">Pining</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wade%20is%20playing%20the%20long%20game%20here/works\" target=\"_blank\">Wade is playing the long game here</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Dadpool/works\" target=\"_blank\">Dadpool</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20history%20department%20is%20having%20a%20civil%20war/works\" target=\"_blank\">The history department is having a civil war</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/over%20the%20byzantine%20empire/works\" target=\"_blank\">over the byzantine empire</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Oblivious%20Peter%20Parker/works\" target=\"_blank\">Oblivious Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Colleagues%20to%20Lovers/works\" target=\"_blank\">Colleagues to Lovers</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/I%20have%20the%20spideypool%20discord%20server%20to%20thank%20for%20this%20universe/works\" target=\"_blank\">I have the spideypool discord server to thank for this universe</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/like%2010%20different%20people%20created%20it%20with%20me/works\" target=\"_blank\">like 10 different people created it with me</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/is%20Dr*d*%20Parker%20okay*q*/works\" target=\"_blank\">is Dr. Parker okay?</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2IKMzk1\" target=\"_blank\">http://bit.ly/2IKMzk1</a></strong></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ao3feed-tonystark",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Avalon",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618761977"
                },
                "content_raw": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2IKMzk1\" target=\"_blank\">http://bit.ly/2IKMzk1</a></strong><br><p>by <a rel=\"author\" href=\"/users/Corey5268/pseuds/Corey5268\" target=\"_blank\">Corey5268</a></p><p>Wade Wilson, single father, veteran, and darling of the gender studies department, really didn’t expect to be one of the most gossiped-about professors on campus, but here he is. Guess that’s what he gets for falling in love with Dr. Peter Parker, human disaster extraordinaire. Shame he doesn’t have the benefits of, you know, an actual relationship yet.</p><p>Words: 652, Chapters: 1/?, Language: English</p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spider-Man%20-%20All%20Media%20Types/works\" target=\"_blank\">Spider-Man - All Media Types</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Deadpool%20-%20All%20Media%20Types/works\" target=\"_blank\">Deadpool - All Media Types</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel/works\" target=\"_blank\">Marvel</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Teen%20And%20Up%20Audiences/works\" target=\"_blank\">Teen And Up Audiences</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\" target=\"_blank\">No Archive Warnings Apply</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/M*s*M/works\" target=\"_blank\">M/M</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wade%20Wilson/works\" target=\"_blank\">Wade Wilson</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Mary%20Jane%20Watson/works\" target=\"_blank\">Mary Jane Watson</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Ellie%20Camacho/works\" target=\"_blank\">Ellie Camacho</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Sam%20Wilson%20(Marvel)/works\" target=\"_blank\">Sam Wilson (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/James%20%22Bucky%22%20Barnes/works\" target=\"_blank\">James “Bucky” Barnes</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Steve%20Rogers/works\" target=\"_blank\">Steve Rogers</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker*s*Wade%20Wilson/works\" target=\"_blank\">Peter Parker/Wade Wilson</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20College*s*University/works\" target=\"_blank\">Alternate Universe - College/University</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20Professors/works\" target=\"_blank\">Alternate Universe - Professors</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wade%20teaches%20gender%20studies/works\" target=\"_blank\">Wade teaches gender studies</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20teaches%20ALL%20the%20sciences/works\" target=\"_blank\">Peter teaches ALL the sciences</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20No%20Powers/works\" target=\"_blank\">Alternate Universe - No Powers</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Idiots%20in%20Love/works\" target=\"_blank\">Idiots in Love</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pining/works\" target=\"_blank\">Pining</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wade%20is%20playing%20the%20long%20game%20here/works\" target=\"_blank\">Wade is playing the long game here</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Dadpool/works\" target=\"_blank\">Dadpool</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20history%20department%20is%20having%20a%20civil%20war/works\" target=\"_blank\">The history department is having a civil war</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/over%20the%20byzantine%20empire/works\" target=\"_blank\">over the byzantine empire</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Oblivious%20Peter%20Parker/works\" target=\"_blank\">Oblivious Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Colleagues%20to%20Lovers/works\" target=\"_blank\">Colleagues to Lovers</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/I%20have%20the%20spideypool%20discord%20server%20to%20thank%20for%20this%20universe/works\" target=\"_blank\">I have the spideypool discord server to thank for this universe</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/like%2010%20different%20people%20created%20it%20with%20me/works\" target=\"_blank\">like 10 different people created it with me</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/is%20Dr*d*%20Parker%20okay*q*/works\" target=\"_blank\">is Dr. Parker okay?</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2IKMzk1\" target=\"_blank\">http://bit.ly/2IKMzk1</a></strong></p>",
                "content": "<p><p>read it on the AO3 at <strong><a href=\"http://bit.ly/2IKMzk1\" target=\"_blank\">http://bit.ly/2IKMzk1</a></strong><br /></p><p>by <a href=\"/users/Corey5268/pseuds/Corey5268\" target=\"_blank\">Corey5268</a></p><p>Wade Wilson, single father, veteran, and darling of the gender studies department, really didn&rsquo;t expect to be one of the most gossiped-about professors on campus, but here he is. Guess that&rsquo;s what he gets for falling in love with Dr. Peter Parker, human disaster extraordinaire. Shame he doesn&rsquo;t have the benefits of, you know, an actual relationship yet.</p><p>Words: 652, Chapters: 1/?, Language: English</p><ul><li>Fandoms: <a href=\"http://archiveofourown.org/tags/Spider-Man%20-%20All%20Media%20Types/works\" target=\"_blank\">Spider-Man - All Media Types</a>, <a href=\"http://archiveofourown.org/tags/Deadpool%20-%20All%20Media%20Types/works\" target=\"_blank\">Deadpool - All Media Types</a>, <a href=\"http://archiveofourown.org/tags/Marvel/works\" target=\"_blank\">Marvel</a></li><li>Rating: <a href=\"http://archiveofourown.org/tags/Teen%20And%20Up%20Audiences/works\" target=\"_blank\">Teen And Up Audiences</a></li><li>Warnings: <a href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\" target=\"_blank\">No Archive Warnings Apply</a></li><li>Categories: <a href=\"http://archiveofourown.org/tags/M*s*M/works\" target=\"_blank\">M/M</a></li><li>Characters: <a href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a href=\"http://archiveofourown.org/tags/Wade%20Wilson/works\" target=\"_blank\">Wade Wilson</a>, <a href=\"http://archiveofourown.org/tags/Mary%20Jane%20Watson/works\" target=\"_blank\">Mary Jane Watson</a>, <a href=\"http://archiveofourown.org/tags/Ellie%20Camacho/works\" target=\"_blank\">Ellie Camacho</a>, <a href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/Sam%20Wilson%20(Marvel)/works\" target=\"_blank\">Sam Wilson (Marvel)</a>, <a href=\"http://archiveofourown.org/tags/James%20%22Bucky%22%20Barnes/works\" target=\"_blank\">James &ldquo;Bucky&rdquo; Barnes</a>, <a href=\"http://archiveofourown.org/tags/Steve%20Rogers/works\" target=\"_blank\">Steve Rogers</a></li><li>Relationships: <a href=\"http://archiveofourown.org/tags/Peter%20Parker*s*Wade%20Wilson/works\" target=\"_blank\">Peter Parker/Wade Wilson</a></li><li>Additional Tags: <a href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20College*s*University/works\" target=\"_blank\">Alternate Universe - College/University</a>, <a href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20Professors/works\" target=\"_blank\">Alternate Universe - Professors</a>, <a href=\"http://archiveofourown.org/tags/Wade%20teaches%20gender%20studies/works\" target=\"_blank\">Wade teaches gender studies</a>, <a href=\"http://archiveofourown.org/tags/Peter%20teaches%20ALL%20the%20sciences/works\" target=\"_blank\">Peter teaches ALL the sciences</a>, <a href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20No%20Powers/works\" target=\"_blank\">Alternate Universe - No Powers</a>, <a href=\"http://archiveofourown.org/tags/Idiots%20in%20Love/works\" target=\"_blank\">Idiots in Love</a>, <a href=\"http://archiveofourown.org/tags/Pining/works\" target=\"_blank\">Pining</a>, <a href=\"http://archiveofourown.org/tags/Wade%20is%20playing%20the%20long%20game%20here/works\" target=\"_blank\">Wade is playing the long game here</a>, <a href=\"http://archiveofourown.org/tags/Dadpool/works\" target=\"_blank\">Dadpool</a>, <a href=\"http://archiveofourown.org/tags/The%20history%20department%20is%20having%20a%20civil%20war/works\" target=\"_blank\">The history department is having a civil war</a>, <a href=\"http://archiveofourown.org/tags/over%20the%20byzantine%20empire/works\" target=\"_blank\">over the byzantine empire</a>, <a href=\"http://archiveofourown.org/tags/Oblivious%20Peter%20Parker/works\" target=\"_blank\">Oblivious Peter Parker</a>, <a href=\"http://archiveofourown.org/tags/Colleagues%20to%20Lovers/works\" target=\"_blank\">Colleagues to Lovers</a>, <a href=\"http://archiveofourown.org/tags/I%20have%20the%20spideypool%20discord%20server%20to%20thank%20for%20this%20universe/works\" target=\"_blank\">I have the spideypool discord server to thank for this universe</a>, <a href=\"http://archiveofourown.org/tags/like%2010%20different%20people%20created%20it%20with%20me/works\" target=\"_blank\">like 10 different people created it with me</a>, <a href=\"http://archiveofourown.org/tags/is%20Dr*d*%20Parker%20okay*q*/works\" target=\"_blank\">is Dr. Parker okay?</a></li></ul><br /><br />\nread it on the AO3 at <strong><a href=\"http://bit.ly/2IKMzk1\" target=\"_blank\">http://bit.ly/2IKMzk1</a></strong></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "littlemsstark3000",
        "blog": {
            "name": "littlemsstark3000",
            "title": "LittleMsStark3000",
            "description": "I love Tony Stark / Iron Man / Natasha Romanoff / Black Widow / IronWidow / IronSpyder Family",
            "url": "https://littlemsstark3000.tumblr.com/",
            "uuid": "t:sYVJu8fijE-pgyjphkU7ng",
            "updated": 1561765760
        },
        "id": 185618728031,
        "post_url": "https://littlemsstark3000.tumblr.com/post/185618728031/natasha-goes-in-to-the-penthouse-and-sees-anya",
        "slug": "natasha-goes-in-to-the-penthouse-and-sees-anya",
        "date": "2019-06-15 23:17:41 GMT",
        "timestamp": 1560640661,
        "state": "published",
        "format": "html",
        "reblog_key": "glNJFOf7",
        "tags": [
            "black widow",
            "iron man",
            "tony stark",
            "ironwidow",
            "natasha romanoff",
            "iron dad",
            "tony x natasha",
            "tonynat",
            "marriage",
            "anya stark",
            "fluff",
            "parenting",
            "avengers",
            "peter parker",
            "spider son",
            "spiderman"
        ],
        "short_url": "https://tmblr.co/ZGlHiW2itlGHV",
        "summary": "Natasha, goes in to the penthouse and sees Anya and Tony waiting for her: Baby! I'm home!\nAnya, runs to Nat: Mama! I missed you...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 86,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Natasha, goes in to the penthouse and sees Anya and Tony waiting for her:</b> Baby! I&rsquo;m home!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Anya, runs to Nat:</b> Mama! I missed you so much!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Natasha, kneels and hugs Anya:</b> I missed you, too! Were you a good girl?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Anya, nods:</b> Yes!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony, crosses his arms to his chest:</b> A bit.</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Natasha, looks at Tony, questioning:</b> A bit? Why? What happened?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony, sighs: </b>I was called to her school. She had a fight with her classmate. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Natasha, eyebrows furrowed:</b> Anastasia? </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Anya, pouts:</b> Because I said Spider-Man is my brother and she said I was lying&hellip; </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony and Natasha, looking at each other:</b></p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Anya, tugs at their shirts:</b> Peter is Spider-Man, right? </p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Natasha, goes in to the penthouse and sees Anya and Tony waiting for her:</b> Baby! I’m home!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Anya, runs to Nat:</b> Mama! I missed you so much!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Natasha, kneels and hugs Anya:</b> I missed you, too! Were you a good girl?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Anya, nods:</b> Yes!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony, crosses his arms to his chest:</b> A bit.</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Natasha, looks at Tony, questioning:</b> A bit? Why? What happened?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony, sighs: </b>I was called to her school. She had a fight with her classmate. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Natasha, eyebrows furrowed:</b> Anastasia? </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Anya, pouts:</b> Because I said Spider-Man is my brother and she said I was lying… </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony and Natasha, looking at each other:</b></p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Anya, tugs at their shirts:</b> Peter is Spider-Man, right? </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "littlemsstark3000",
                    "active": true,
                    "theme": {
                        "header_full_width": 1136,
                        "header_full_height": 640,
                        "header_focus_width": 1136,
                        "header_focus_height": 638,
                        "avatar_shape": "circle",
                        "background_color": "#F92A2A",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1136,638,0",
                        "header_image": "https://static.tumblr.com/4fe18a171312451840db59e225ce0c6b/fabiemb/TsYpt3ohy/tumblr_static_1108246004-content.png",
                        "header_image_focused": "https://static.tumblr.com/00f68abd1260daa3fb672e440b57fa76/fabiemb/xS0pt3oi1/tumblr_static_tumblr_static_1108246004-content_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/4fe18a171312451840db59e225ce0c6b/fabiemb/TsYpt3ohy/tumblr_static_1108246004-content_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#E0B93A",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#E8D73A",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618728031"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Natasha, goes in to the penthouse and sees Anya and Tony waiting for her:</b> Baby! I’m home!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Anya, runs to Nat:</b> Mama! I missed you so much!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Natasha, kneels and hugs Anya:</b> I missed you, too! Were you a good girl?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Anya, nods:</b> Yes!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony, crosses his arms to his chest:</b> A bit.</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Natasha, looks at Tony, questioning:</b> A bit? Why? What happened?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony, sighs: </b>I was called to her school. She had a fight with her classmate. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Natasha, eyebrows furrowed:</b> Anastasia? </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Anya, pouts:</b> Because I said Spider-Man is my brother and she said I was lying… </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony and Natasha, looking at each other:</b></p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Anya, tugs at their shirts:</b> Peter is Spider-Man, right? </p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Natasha, goes in to the penthouse and sees Anya and Tony waiting for her:</b> Baby! I&rsquo;m home!</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Anya, runs to Nat:</b> Mama! I missed you so much!</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Natasha, kneels and hugs Anya:</b> I missed you, too! Were you a good girl?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Anya, nods:</b> Yes!</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Tony, crosses his arms to his chest:</b> A bit.</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Natasha, looks at Tony, questioning:</b> A bit? Why? What happened?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Tony, sighs: </b>I was called to her school. She had a fight with her classmate. </p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Natasha, eyebrows furrowed:</b> Anastasia? </p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Anya, pouts:</b> Because I said Spider-Man is my brother and she said I was lying&hellip; </p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Tony and Natasha, looking at each other:</b></p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Anya, tugs at their shirts:</b> Peter is Spider-Man, right? </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "jesimahcah",
        "blog": {
            "name": "jesimahcah",
            "title": "Insecure Mess",
            "description": "**I DON'T CLAIM ANY ART POSTED**\nJessica Marie English \n| Taken | 10-07-16 | 25 | Bi | USA |",
            "url": "https://jesimahcah.tumblr.com/",
            "uuid": "t:sRX067ioCWGXlvcmoqQGIQ",
            "updated": 1561763541
        },
        "id": 185618646430,
        "post_url": "https://jesimahcah.tumblr.com/post/185618646430",
        "slug": "",
        "date": "2019-06-15 23:12:33 GMT",
        "timestamp": 1560640353,
        "state": "published",
        "format": "html",
        "reblog_key": "vbLkI1j7",
        "tags": [
            "iron man",
            "tony stark",
            "spiderman",
            "far from home",
            "we love you",
            "love you 3000"
        ],
        "short_url": "https://tmblr.co/ZV4iGu2itkyMU",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 5,
        "source_url": "https://t.umblr.com/redirect?z=https%3A%2F%2Fweheartit.com%2Fentry%2F330477155%2Fvia%2Fgoldyroxan&t=NmJkNDAyMDllODhhZDA4MzhjZjllNDQ2ODg5ZDg5ZGM0MWE5ZThkNiwxODU2MTg2NDY0MzA%3D&b=t%3AsRX067ioCWGXlvcmoqQGIQ&p=https%3A%2F%2Fjesimahcah.tumblr.com%2Fpost%2F185618646430&m=1",
        "source_title": "weheartit.com",
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "image_permalink": "https://jesimahcah.tumblr.com/image/185618646430",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/16d8b11e675cd1bd14b0a65349528fa1/tumblr_prqj06pwGY1rgr6a1o1_640.jpg",
                    "width": 563,
                    "height": 675
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/16d8b11e675cd1bd14b0a65349528fa1/tumblr_prqj06pwGY1rgr6a1o1_640.jpg",
                        "width": 563,
                        "height": 675
                    },
                    {
                        "url": "https://66.media.tumblr.com/16d8b11e675cd1bd14b0a65349528fa1/tumblr_prqj06pwGY1rgr6a1o1_540.jpg",
                        "width": 540,
                        "height": 647
                    },
                    {
                        "url": "https://66.media.tumblr.com/16d8b11e675cd1bd14b0a65349528fa1/tumblr_prqj06pwGY1rgr6a1o1_500.jpg",
                        "width": 500,
                        "height": 599
                    },
                    {
                        "url": "https://66.media.tumblr.com/16d8b11e675cd1bd14b0a65349528fa1/tumblr_prqj06pwGY1rgr6a1o1_400.jpg",
                        "width": 400,
                        "height": 480
                    },
                    {
                        "url": "https://66.media.tumblr.com/16d8b11e675cd1bd14b0a65349528fa1/tumblr_prqj06pwGY1rgr6a1o1_250.jpg",
                        "width": 250,
                        "height": 300
                    },
                    {
                        "url": "https://66.media.tumblr.com/16d8b11e675cd1bd14b0a65349528fa1/tumblr_prqj06pwGY1rgr6a1o1_100.jpg",
                        "width": 100,
                        "height": 120
                    },
                    {
                        "url": "https://66.media.tumblr.com/16d8b11e675cd1bd14b0a65349528fa1/tumblr_prqj06pwGY1rgr6a1o1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "ao3feed-tonystark",
        "blog": {
            "name": "ao3feed-tonystark",
            "title": "Ao3-Feed: Tony Stark",
            "description": "This blog is an automated list of the stories posted on Archive Of Our Own under the Tony Stark tag. The stories are automatically posted here from the AO3 RSS feed.",
            "url": "https://ao3feed-tonystark.tumblr.com/",
            "uuid": "t:O3wJf2GJebW4NoTEp7bxNg",
            "updated": 1561764808
        },
        "id": 185618591562,
        "post_url": "https://ao3feed-tonystark.tumblr.com/post/185618591562/mr-president",
        "slug": "mr-president",
        "date": "2019-06-15 23:09:31 GMT",
        "timestamp": 1560640171,
        "state": "published",
        "format": "html",
        "reblog_key": "u8pF6Y7I",
        "tags": [
            "IFTTT",
            "tony stark",
            "iron man",
            "the avengers",
            "marvel",
            "ao3",
            "ao3feed"
        ],
        "short_url": "https://tmblr.co/ZX12gl2itkkzA",
        "summary": "Mr. President",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": "Mr. President",
        "body": "read it on the AO3 at <strong><a href=\"http://bit.ly/2MOkM7v\" target=\"_blank\">http://bit.ly/2MOkM7v</a></strong><br/><p>by <a rel=\"author\" href=\"/users/Shadow27/pseuds/Shadow27\" target=\"_blank\">Shadow27</a></p><p>Peter gets a call from the President in class. It goes downhill from there.</p><p>Words: 5681, Chapters: 1/1, Language: English</p><p>Series: Part 8 of <a href=\"http://archiveofourown.org/series/1388557\" target=\"_blank\">Spider-Man one-shots</a></p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spider-Man:%20Homecoming%20(2017)/works\" target=\"_blank\">Spider-Man: Homecoming (2017)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\" target=\"_blank\">Marvel Cinematic Universe</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Iron%20Man%20(Movies)/works\" target=\"_blank\">Iron Man (Movies)</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\" target=\"_blank\">Not Rated</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\" target=\"_blank\">Graphic Depictions Of Violence</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Nick%20Fury/works\" target=\"_blank\">Nick Fury</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Steve%20Rogers/works\" target=\"_blank\">Steve Rogers</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Matthew%20Ellis/works\" target=\"_blank\">Matthew Ellis</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wade%20Wilson/works\" target=\"_blank\">Wade Wilson</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Thaddeus%20Ross/works\" target=\"_blank\">Thaddeus Ross</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Leeds/works\" target=\"_blank\">Ned Leeds</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Michelle%20Jones/works\" target=\"_blank\">Michelle Jones</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Flash%20Thompson/works\" target=\"_blank\">Flash Thompson</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Mention%20of%20torture/works\" target=\"_blank\">Mention of torture</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/but%20we're%20all%20used%20to%20that%20now%20because%20of%20endgame/works\" target=\"_blank\">but we&rsquo;re all used to that now because of endgame</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Irondad/works\" target=\"_blank\">Irondad</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/spiderson/works\" target=\"_blank\">spiderson</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/flash%20gets%20scolded%20by%20the%20president/works\" target=\"_blank\">flash gets scolded by the president</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/peter%20works%20for%20shield/works\" target=\"_blank\">peter works for shield</a></li></ul><br/><br/>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2MOkM7v\" target=\"_blank\">http://bit.ly/2MOkM7v</a></strong>",
        "reblog": {
            "comment": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2MOkM7v\" target=\"_blank\">http://bit.ly/2MOkM7v</a></strong><br><p>by <a rel=\"author\" href=\"/users/Shadow27/pseuds/Shadow27\" target=\"_blank\">Shadow27</a></p><p>Peter gets a call from the President in class. It goes downhill from there.</p><p>Words: 5681, Chapters: 1/1, Language: English</p><p>Series: Part 8 of <a href=\"http://archiveofourown.org/series/1388557\" target=\"_blank\">Spider-Man one-shots</a></p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spider-Man:%20Homecoming%20(2017)/works\" target=\"_blank\">Spider-Man: Homecoming (2017)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\" target=\"_blank\">Marvel Cinematic Universe</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Iron%20Man%20(Movies)/works\" target=\"_blank\">Iron Man (Movies)</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\" target=\"_blank\">Not Rated</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\" target=\"_blank\">Graphic Depictions Of Violence</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Nick%20Fury/works\" target=\"_blank\">Nick Fury</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Steve%20Rogers/works\" target=\"_blank\">Steve Rogers</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Matthew%20Ellis/works\" target=\"_blank\">Matthew Ellis</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wade%20Wilson/works\" target=\"_blank\">Wade Wilson</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Thaddeus%20Ross/works\" target=\"_blank\">Thaddeus Ross</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Leeds/works\" target=\"_blank\">Ned Leeds</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Michelle%20Jones/works\" target=\"_blank\">Michelle Jones</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Flash%20Thompson/works\" target=\"_blank\">Flash Thompson</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Mention%20of%20torture/works\" target=\"_blank\">Mention of torture</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/but%20we're%20all%20used%20to%20that%20now%20because%20of%20endgame/works\" target=\"_blank\">but we’re all used to that now because of endgame</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Irondad/works\" target=\"_blank\">Irondad</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/spiderson/works\" target=\"_blank\">spiderson</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/flash%20gets%20scolded%20by%20the%20president/works\" target=\"_blank\">flash gets scolded by the president</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/peter%20works%20for%20shield/works\" target=\"_blank\">peter works for shield</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2MOkM7v\" target=\"_blank\">http://bit.ly/2MOkM7v</a></strong></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ao3feed-tonystark",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Avalon",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618591562"
                },
                "content_raw": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2MOkM7v\" target=\"_blank\">http://bit.ly/2MOkM7v</a></strong><br><p>by <a rel=\"author\" href=\"/users/Shadow27/pseuds/Shadow27\" target=\"_blank\">Shadow27</a></p><p>Peter gets a call from the President in class. It goes downhill from there.</p><p>Words: 5681, Chapters: 1/1, Language: English</p><p>Series: Part 8 of <a href=\"http://archiveofourown.org/series/1388557\" target=\"_blank\">Spider-Man one-shots</a></p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spider-Man:%20Homecoming%20(2017)/works\" target=\"_blank\">Spider-Man: Homecoming (2017)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\" target=\"_blank\">Marvel Cinematic Universe</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Iron%20Man%20(Movies)/works\" target=\"_blank\">Iron Man (Movies)</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\" target=\"_blank\">Not Rated</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\" target=\"_blank\">Graphic Depictions Of Violence</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Nick%20Fury/works\" target=\"_blank\">Nick Fury</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Steve%20Rogers/works\" target=\"_blank\">Steve Rogers</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Matthew%20Ellis/works\" target=\"_blank\">Matthew Ellis</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wade%20Wilson/works\" target=\"_blank\">Wade Wilson</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Thaddeus%20Ross/works\" target=\"_blank\">Thaddeus Ross</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Leeds/works\" target=\"_blank\">Ned Leeds</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Michelle%20Jones/works\" target=\"_blank\">Michelle Jones</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Flash%20Thompson/works\" target=\"_blank\">Flash Thompson</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Mention%20of%20torture/works\" target=\"_blank\">Mention of torture</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/but%20we're%20all%20used%20to%20that%20now%20because%20of%20endgame/works\" target=\"_blank\">but we’re all used to that now because of endgame</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Irondad/works\" target=\"_blank\">Irondad</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/spiderson/works\" target=\"_blank\">spiderson</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/flash%20gets%20scolded%20by%20the%20president/works\" target=\"_blank\">flash gets scolded by the president</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/peter%20works%20for%20shield/works\" target=\"_blank\">peter works for shield</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2MOkM7v\" target=\"_blank\">http://bit.ly/2MOkM7v</a></strong></p>",
                "content": "<p><p>read it on the AO3 at <strong><a href=\"http://bit.ly/2MOkM7v\" target=\"_blank\">http://bit.ly/2MOkM7v</a></strong><br /></p><p>by <a href=\"/users/Shadow27/pseuds/Shadow27\" target=\"_blank\">Shadow27</a></p><p>Peter gets a call from the President in class. It goes downhill from there.</p><p>Words: 5681, Chapters: 1/1, Language: English</p><p>Series: Part 8 of <a href=\"http://archiveofourown.org/series/1388557\" target=\"_blank\">Spider-Man one-shots</a></p><ul><li>Fandoms: <a href=\"http://archiveofourown.org/tags/Spider-Man:%20Homecoming%20(2017)/works\" target=\"_blank\">Spider-Man: Homecoming (2017)</a>, <a href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\" target=\"_blank\">Marvel Cinematic Universe</a>, <a href=\"http://archiveofourown.org/tags/Iron%20Man%20(Movies)/works\" target=\"_blank\">Iron Man (Movies)</a></li><li>Rating: <a href=\"http://archiveofourown.org/tags/Not%20Rated/works\" target=\"_blank\">Not Rated</a></li><li>Warnings: <a href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\" target=\"_blank\">Graphic Depictions Of Violence</a></li><li>Characters: <a href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a href=\"http://archiveofourown.org/tags/Nick%20Fury/works\" target=\"_blank\">Nick Fury</a>, <a href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/Steve%20Rogers/works\" target=\"_blank\">Steve Rogers</a>, <a href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a href=\"http://archiveofourown.org/tags/Matthew%20Ellis/works\" target=\"_blank\">Matthew Ellis</a>, <a href=\"http://archiveofourown.org/tags/Wade%20Wilson/works\" target=\"_blank\">Wade Wilson</a>, <a href=\"http://archiveofourown.org/tags/Thaddeus%20Ross/works\" target=\"_blank\">Thaddeus Ross</a>, <a href=\"http://archiveofourown.org/tags/Ned%20Leeds/works\" target=\"_blank\">Ned Leeds</a>, <a href=\"http://archiveofourown.org/tags/Michelle%20Jones/works\" target=\"_blank\">Michelle Jones</a>, <a href=\"http://archiveofourown.org/tags/Flash%20Thompson/works\" target=\"_blank\">Flash Thompson</a></li><li>Additional Tags: <a href=\"http://archiveofourown.org/tags/Mention%20of%20torture/works\" target=\"_blank\">Mention of torture</a>, <a href=\"http://archiveofourown.org/tags/but%20we're%20all%20used%20to%20that%20now%20because%20of%20endgame/works\" target=\"_blank\">but we&rsquo;re all used to that now because of endgame</a>, <a href=\"http://archiveofourown.org/tags/Irondad/works\" target=\"_blank\">Irondad</a>, <a href=\"http://archiveofourown.org/tags/spiderson/works\" target=\"_blank\">spiderson</a>, <a href=\"http://archiveofourown.org/tags/flash%20gets%20scolded%20by%20the%20president/works\" target=\"_blank\">flash gets scolded by the president</a>, <a href=\"http://archiveofourown.org/tags/peter%20works%20for%20shield/works\" target=\"_blank\">peter works for shield</a></li></ul><br /><br />\nread it on the AO3 at <strong><a href=\"http://bit.ly/2MOkM7v\" target=\"_blank\">http://bit.ly/2MOkM7v</a></strong></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "kitsunexwerewolves",
        "blog": {
            "name": "kitsunexwerewolves",
            "title": "” I Love You 3000”",
            "description": "<p>I’m 17 years old. </p><p>I live in Strange Towns. </p><p>I like blue and violent. </p><p>Drawing ❤️</p>",
            "url": "https://kitsunexwerewolves.tumblr.com/",
            "uuid": "t:e7J_msFIzfc2BxFv0-tRGQ",
            "updated": 1560653350
        },
        "id": 185618495388,
        "post_url": "https://kitsunexwerewolves.tumblr.com/post/185618495388/holy-shit-why-didnt-i-realize-this-we",
        "slug": "holy-shit-why-didnt-i-realize-this-we",
        "date": "2019-06-15 23:03:34 GMT",
        "timestamp": 1560639814,
        "state": "published",
        "format": "html",
        "reblog_key": "R5bw7bJT",
        "tags": [
            "avengers endgame",
            "tony stark",
            "steve rogers",
            "iron man",
            "captain marvel",
            "marvel",
            "i love you 3000",
            "im not ready to say goodbye",
            "we miss you 3000"
        ],
        "short_url": "https://tmblr.co/ZUes4X2itkNUS",
        "summary": "Holy shit!! Why didn’t I realize this?!?! 😭 we miss you 3000!! 😭😭💔💔💔",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1152\" data-orig-width=\"828\"><img src=\"https://66.media.tumblr.com/0122b38080efa2649b80e1cc21ca2953/tumblr_pt5xdxyjC91waiic2_540.jpg\" data-orig-height=\"1152\" data-orig-width=\"828\"/></figure><p>Holy shit!! Why didn’t I realize this?!?! 😭 we miss you 3000!! 😭😭💔💔💔</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1152\" data-orig-width=\"828\"><img src=\"https://66.media.tumblr.com/0122b38080efa2649b80e1cc21ca2953/tumblr_pt5xdxyjC91waiic2_540.jpg\" data-orig-height=\"1152\" data-orig-width=\"828\"></figure><p>Holy shit!! Why didn’t I realize this?!?! 😭 we miss you 3000!! 😭😭💔💔💔</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "kitsunexwerewolves",
                    "active": true,
                    "theme": {
                        "header_full_width": 960,
                        "header_full_height": 1280,
                        "header_focus_width": 834,
                        "header_focus_height": 469,
                        "avatar_shape": "circle",
                        "background_color": "#8FE5F7",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "305,854,774,20",
                        "header_image": "https://static.tumblr.com/797e7cf1829e20e43885844a635659f3/itjrkvn/J2Lprek55/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/264926c49c78d29bb2b55a76ec2a8020/itjrkvn/2gqprek56/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/797e7cf1829e20e43885844a635659f3/itjrkvn/J2Lprek55/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#9A65FF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#1A404E",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618495388"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1152\" data-orig-width=\"828\"><img src=\"https://66.media.tumblr.com/0122b38080efa2649b80e1cc21ca2953/tumblr_pt5xdxyjC91waiic2_540.jpg\" data-orig-height=\"1152\" data-orig-width=\"828\"></figure><p>Holy shit!! Why didn’t I realize this?!?! 😭 we miss you 3000!! 😭😭💔💔💔</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0122b38080efa2649b80e1cc21ca2953/tumblr_pt5xdxyjC91waiic2_540.jpg\" class=\"\"/></figure><p>Holy shit!! Why didn&rsquo;t I realize this?!?! &#128557; we miss you 3000!! &#128557;&#128557;&#128148;&#128148;&#128148;</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "buckybearsblog",
        "blog": {
            "name": "buckybearsblog",
            "title": "Parker :))",
            "description": "🖤 Ben and Bucky 🖤\n<a href=\"https://buckybearsblog.tumblr.com/post/181475737354/marvel-masterlist/\">Marvel Masterlist</a>   \n<a href=\"https://buckybearsblog.tumblr.com/post/184404280314/tua-masterlist/\">Umbrella Academy Masterlist</a>",
            "url": "https://buckybearsblog.tumblr.com/",
            "uuid": "t:R9gSk--YE2gpe-jeHXGIQg",
            "updated": 1561672729
        },
        "id": 185618447489,
        "post_url": "https://buckybearsblog.tumblr.com/post/185618447489/3000",
        "slug": "3000",
        "date": "2019-06-15 23:00:45 GMT",
        "timestamp": 1560639645,
        "state": "published",
        "format": "html",
        "reblog_key": "WBxXxRAx",
        "tags": [
            "harley keener",
            "tony stark",
            "endgame spoilers",
            "avengers endgame",
            "peter parker",
            "morgan stark",
            "pepper potts",
            "james rhodes",
            "happy hogan",
            "may parker",
            "Steve Rogers",
            "bruce banner",
            "Thor Odinson",
            "angst imagine",
            "endgame imagine",
            "avengers imagines",
            "marvel imagines",
            "marvel imagine",
            "avengers imagine",
            "marvel x reader",
            "avengers x reader",
            "avengers x y/n",
            "marvel x y/n",
            "avengers x you",
            "marvel x you",
            "tony stark imagine",
            "peter parker imagine",
            "pepper potts imagine",
            "best friends au",
            "harley keener imagine"
        ],
        "short_url": "https://tmblr.co/ZQFJtY2itkBo1",
        "summary": "3000",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 233,
        "title": "3000",
        "body": "<p>Pairing; Tony Stark x Stark!Reader</p><p>Warnings; ANGST &amp; Sadness. Endgame Spoilers!</p><p>A/n; Don&rsquo;t worry I&rsquo;ll make it up to you with Beautiful things.</p><figure data-orig-width=\"500\" data-orig-height=\"206\" data-tumblr-attribution=\"unecarabineadescartes:28kxBuAsBmd_-n4E9QYNUw:Z-5YdtmiN_on\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/dbfeb996bd8170f96548fc76cf6bf172/tumblr_mnyjwpVeoX1rmgso1o1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"206\"/></figure><p>You saw the small interaction between your dad and Dr. Strange, seeing him put a finger up. You looked at your dad&rsquo;s face seeing the sad look and the guilt in his eyes. You knew what he was thinking and you were determined to do it before him. You turned invisible, running towards Thanos before he could. You stopped in front of him, figuring out how you could do this. You gripped the gauntlet, looking at his confused face. You grabbed all the stones without him knowing, turning visible. </p><p>He pushed you off of him, holding up the gauntlet. &ldquo;You thought you could defeat me?&rdquo; He scoffed. &ldquo;I am inevitable.&rdquo; You knew some were watching, you knew Tony was on his way, you knew what was going to happen. He snapped his fingers and nothing happened. </p><p>He looked at the gauntlet with confusion, turning it to see that the stones weren&rsquo;t there. He looked at you with wide eyes, seeing you holding up your hand while panting, tears falling. </p><p>&ldquo;And I,&rdquo; you panted looking over at your dad, smiling at him. You looked back at Thanos, a determined look on your face. &ldquo;Am a Stark.&rdquo; With that you snapped, hearing your father scream no. A bright flash illuminated around you and you stumbled to a big rock after seeing Thanos vanish. </p><p>Rhodey came over to you, cupping your cheek and nodding to you. &ldquo;You did good kid, you did good.&rdquo; You smiled weakly hearing someone else. You felt eyes on you from every direction, hearing the gasps of people. </p><p>Peter landed in front of you. &ldquo;Y/n?&rdquo; He shakily said looking in your eyes. You lazily turned your head, &ldquo;Hey, Y/n we won. We won Y/n. You did it Y/n.&rdquo; He was crying, scared because he was losing the girl who was like a sister to him. </p><p>Pepper lifted him from you, as he cried into his hands next to Rhodey. Tony and Pepper squatted in front of you, tears in both of their eyes. </p><p>&ldquo;No.&rdquo; Tony whimpered, scanning his eyes over your charred skin, holding his hand against your arc reactor. He took a deep breath, casting his eyes away from you as you put your hand over his.</p><p>&ldquo;Friday,&rdquo; Pepper said, looking at you with teary eyes. </p><p>&ldquo;All life functions critical,&rdquo; Friday replied. She looked down, letting the tears trickle down her cheeks as she knew her daughter wasn&rsquo;t going to make it out of this.</p><p>&ldquo;Dad.&rdquo; You whispered lightly, sounding only like a released breath. He looked at your eyes, seeing them crinkle as you smiled weakly. &ldquo;I love you 3000.&rdquo; You said.</p><p>He let out a choked sob, shaking his head. &ldquo;No, please.&rdquo;</p><p>Pepper put her hand over yours and Tony&rsquo;s &ldquo;We&rsquo;ll be okay.&rdquo; She said, looking at you. &ldquo;You can rest.&rdquo; The arc reactor dimmed and Pepper sobbed while looking at the ground.</p><p>&ldquo;Please.&rdquo; Tony whispered, &ldquo;God.&rdquo; He choked out, holding onto Pepper. &ldquo;How are we going to tell her?&rdquo; </p><p>Pepper took a deep breath as she looked up to the dark sky. &ldquo;I don&rsquo;t know.&rdquo;</p><p>-</p><p>The dark sky reflected across the lake, a small sprinkle of rain dusting the grass and fell into the lake, a soft drip drop sound resonating on this day of mourning. Tony and Pepper held onto each of Morgan&rsquo;s hands, a floral float on the other hand of each. Tony held a small float for you while Pepper held one for Natasha. Each replicated your superhero persona but still captured your essence as yourselves.  </p><p>Peter stood directly behind the three, May next to him for support. Harley stood behind them looking down at his feet, staring at the tears that dripped down his face and hit the wooden boards. Rhodey and Happy&rsquo;s eyes fell onto the six in front of them, hugging each other for support. Steve and Thor stood next to each other, Bruce behind them, all having solemn faces as they watched them float down the lake. Many other people stood behind, from people you had known for most of your life, to a person you&rsquo;ve only met only a day ago. Carol, Nick, and Maria stood the farthest, already missing your bright sarcastic humor they had gotten accustomed to. </p><p>-</p><p>&ldquo;She left this for you,&rdquo; Tony said as he handed Harley a black velvet box. He opened it as Tony turned to Peter, lifting out a necklace that had a heart pendant attached. He opened it seeing a picture of you and him from his graduation. He let out a sad chuckle as he hooked it around his neck looking at it in his palm.</p><p>Peter opened his box, a spider charm and a thunderbolt hanging on a necklace. He smiled softly at it, turning to Harley who had the same expression as him. He looped it around his neck, looking up to the sky and smiling.</p><p>The closest to you sat in the living room of the lakehouse, Pepper, Peter, Harley, Tony, and Morgan sat on the couch, everyone else spread across the other loveseats and benches. </p><p>“Um, is this thing on? I hope it is because if it isn’t this is going to be really awkward to find out it wasn’t,” you paused resting your head on the back of the chair. “Well, the only reason you would see this is because I’m gone. Whether it be an untimely death, my stark sacrificing genes or something completely natural and out of fixing.” You hid your face in your arms for a moment. “Oh god. So as you guys know, I’m terrible at talking so I’ll end up ranting or something. But um, yeah part of the journey is the end y’ know? All just a part of the hero gig.” you repositioned yourself on the chair. “I know my journey came up a little short but I know I was going to do it for someone. Maybe, in this case, it was for everyone who’s watching this.” You sat on the ground cross-legged, Morgan sitting across from your hologram. “Morgan, I’m sorry I won’t be there for you. But you have some pretty cool aunts and uncles and mom and dad who would be happy to help you with anything, well except first-degree murder cause that’s a no-no. You also have some pretty cool brothers, no I am not admitting that you two are cool you guys are absolute dorks,” they chuckled giving each other a high five. “and you also have me. Cause I will always be right here.” You pointed to her heart giving a smile. “I love you all 3000.” your hologram reached behind Morgan, stopping the recording. </p><p>There was a heavy feeling in the room, some had tears, some had small smiles, some didn’t know what to feel. Morgan climbed back onto her dad&rsquo;s lap, tearing up. Steve had walked out, the other slowly dispersing so they could be alone together. All was silent until Harley spoke.</p><p>&ldquo;Do you guys remember at my graduation when she tackled me and ended up breaking her arm?&rdquo; He smiled, looking at the picture in the locket. They laughed softly, smiling at the memory.</p><p>&ldquo;What about when she first tried calamari?&rdquo; They laughed, remembering how you ate most of the plate.</p><p>The rest of the day wasn&rsquo;t spent mourning you. It was spent remembering you.</p><p>Xxx xxX</p><p>A/n; honestly could have ended it better. I’m sorry if I broke your heart, I’m gonna break it again in the next part beautiful things. :(:</p>",
        "reblog": {
            "comment": "<p>Pairing; Tony Stark x Stark!Reader</p><p>Warnings; ANGST &amp; Sadness. Endgame Spoilers!</p><p>A/n; Don’t worry I’ll make it up to you with Beautiful things.</p><figure data-orig-width=\"500\" data-orig-height=\"206\" data-tumblr-attribution=\"unecarabineadescartes:28kxBuAsBmd_-n4E9QYNUw:Z-5YdtmiN_on\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/dbfeb996bd8170f96548fc76cf6bf172/tumblr_mnyjwpVeoX1rmgso1o1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"206\"></figure><p>You saw the small interaction between your dad and Dr. Strange, seeing him put a finger up. You looked at your dad’s face seeing the sad look and the guilt in his eyes. You knew what he was thinking and you were determined to do it before him. You turned invisible, running towards Thanos before he could. You stopped in front of him, figuring out how you could do this. You gripped the gauntlet, looking at his confused face. You grabbed all the stones without him knowing, turning visible. </p><p>He pushed you off of him, holding up the gauntlet. “You thought you could defeat me?” He scoffed. “I am inevitable.” You knew some were watching, you knew Tony was on his way, you knew what was going to happen. He snapped his fingers and nothing happened. </p><p>He looked at the gauntlet with confusion, turning it to see that the stones weren’t there. He looked at you with wide eyes, seeing you holding up your hand while panting, tears falling. </p><p>“And I,” you panted looking over at your dad, smiling at him. You looked back at Thanos, a determined look on your face. “Am a Stark.” With that you snapped, hearing your father scream no. A bright flash illuminated around you and you stumbled to a big rock after seeing Thanos vanish. </p><p>Rhodey came over to you, cupping your cheek and nodding to you. “You did good kid, you did good.” You smiled weakly hearing someone else. You felt eyes on you from every direction, hearing the gasps of people. </p><p>Peter landed in front of you. “Y/n?” He shakily said looking in your eyes. You lazily turned your head, “Hey, Y/n we won. We won Y/n. You did it Y/n.” He was crying, scared because he was losing the girl who was like a sister to him. </p><p>Pepper lifted him from you, as he cried into his hands next to Rhodey. Tony and Pepper squatted in front of you, tears in both of their eyes. </p><p>“No.” Tony whimpered, scanning his eyes over your charred skin, holding his hand against your arc reactor. He took a deep breath, casting his eyes away from you as you put your hand over his.</p><p>“Friday,” Pepper said, looking at you with teary eyes. </p><p>“All life functions critical,” Friday replied. She looked down, letting the tears trickle down her cheeks as she knew her daughter wasn’t going to make it out of this.</p><p>“Dad.” You whispered lightly, sounding only like a released breath. He looked at your eyes, seeing them crinkle as you smiled weakly. “I love you 3000.” You said.</p><p>He let out a choked sob, shaking his head. “No, please.”</p><p>Pepper put her hand over yours and Tony’s “We’ll be okay.” She said, looking at you. “You can rest.” The arc reactor dimmed and Pepper sobbed while looking at the ground.</p><p>“Please.” Tony whispered, “God.” He choked out, holding onto Pepper. “How are we going to tell her?” </p><p>Pepper took a deep breath as she looked up to the dark sky. “I don’t know.”</p><p>-</p><p>The dark sky reflected across the lake, a small sprinkle of rain dusting the grass and fell into the lake, a soft drip drop sound resonating on this day of mourning. Tony and Pepper held onto each of Morgan’s hands, a floral float on the other hand of each. Tony held a small float for you while Pepper held one for Natasha. Each replicated your superhero persona but still captured your essence as yourselves.  </p><p>Peter stood directly behind the three, May next to him for support. Harley stood behind them looking down at his feet, staring at the tears that dripped down his face and hit the wooden boards. Rhodey and Happy’s eyes fell onto the six in front of them, hugging each other for support. Steve and Thor stood next to each other, Bruce behind them, all having solemn faces as they watched them float down the lake. Many other people stood behind, from people you had known for most of your life, to a person you’ve only met only a day ago. Carol, Nick, and Maria stood the farthest, already missing your bright sarcastic humor they had gotten accustomed to. </p><p>-</p><p>“She left this for you,” Tony said as he handed Harley a black velvet box. He opened it as Tony turned to Peter, lifting out a necklace that had a heart pendant attached. He opened it seeing a picture of you and him from his graduation. He let out a sad chuckle as he hooked it around his neck looking at it in his palm.</p><p>Peter opened his box, a spider charm and a thunderbolt hanging on a necklace. He smiled softly at it, turning to Harley who had the same expression as him. He looped it around his neck, looking up to the sky and smiling.</p><p>The closest to you sat in the living room of the lakehouse, Pepper, Peter, Harley, Tony, and Morgan sat on the couch, everyone else spread across the other loveseats and benches. </p><p>“Um, is this thing on? I hope it is because if it isn’t this is going to be really awkward to find out it wasn’t,” you paused resting your head on the back of the chair. “Well, the only reason you would see this is because I’m gone. Whether it be an untimely death, my stark sacrificing genes or something completely natural and out of fixing.” You hid your face in your arms for a moment. “Oh god. So as you guys know, I’m terrible at talking so I’ll end up ranting or something. But um, yeah part of the journey is the end y’ know? All just a part of the hero gig.” you repositioned yourself on the chair. “I know my journey came up a little short but I know I was going to do it for someone. Maybe, in this case, it was for everyone who’s watching this.” You sat on the ground cross-legged, Morgan sitting across from your hologram. “Morgan, I’m sorry I won’t be there for you. But you have some pretty cool aunts and uncles and mom and dad who would be happy to help you with anything, well except first-degree murder cause that’s a no-no. You also have some pretty cool brothers, no I am not admitting that you two are cool you guys are absolute dorks,” they chuckled giving each other a high five. “and you also have me. Cause I will always be right here.” You pointed to her heart giving a smile. “I love you all 3000.” your hologram reached behind Morgan, stopping the recording. </p><p>There was a heavy feeling in the room, some had tears, some had small smiles, some didn’t know what to feel. Morgan climbed back onto her dad’s lap, tearing up. Steve had walked out, the other slowly dispersing so they could be alone together. All was silent until Harley spoke.</p><p>“Do you guys remember at my graduation when she tackled me and ended up breaking her arm?” He smiled, looking at the picture in the locket. They laughed softly, smiling at the memory.</p><p>“What about when she first tried calamari?” They laughed, remembering how you ate most of the plate.</p><p>The rest of the day wasn’t spent mourning you. It was spent remembering you.</p><p>Xxx xxX</p><p>A/n; honestly could have ended it better. I’m sorry if I broke your heart, I’m gonna break it again in the next part beautiful things. :(:</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "buckybearsblog",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#071A3E",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/0f2f8dd9fe64e63a59e6e8cd66b2a55f/kfbqcjg/MtPpqe2hp/tumblr_static_1116501157-content.gif",
                        "header_image_focused": "https://static.tumblr.com/0f2f8dd9fe64e63a59e6e8cd66b2a55f/kfbqcjg/MtPpqe2hp/tumblr_static_1116501157-content_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/0f2f8dd9fe64e63a59e6e8cd66b2a55f/kfbqcjg/MtPpqe2hp/tumblr_static_1116501157-content_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618447489"
                },
                "content_raw": "<p>Pairing; Tony Stark x Stark!Reader</p><p>Warnings; ANGST &amp; Sadness. Endgame Spoilers!</p><p>A/n; Don’t worry I’ll make it up to you with Beautiful things.</p><figure data-orig-width=\"500\" data-orig-height=\"206\" data-tumblr-attribution=\"unecarabineadescartes:28kxBuAsBmd_-n4E9QYNUw:Z-5YdtmiN_on\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/dbfeb996bd8170f96548fc76cf6bf172/tumblr_mnyjwpVeoX1rmgso1o1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"206\"></figure><p>You saw the small interaction between your dad and Dr. Strange, seeing him put a finger up. You looked at your dad’s face seeing the sad look and the guilt in his eyes. You knew what he was thinking and you were determined to do it before him. You turned invisible, running towards Thanos before he could. You stopped in front of him, figuring out how you could do this. You gripped the gauntlet, looking at his confused face. You grabbed all the stones without him knowing, turning visible. </p><p>He pushed you off of him, holding up the gauntlet. “You thought you could defeat me?” He scoffed. “I am inevitable.” You knew some were watching, you knew Tony was on his way, you knew what was going to happen. He snapped his fingers and nothing happened. </p><p>He looked at the gauntlet with confusion, turning it to see that the stones weren’t there. He looked at you with wide eyes, seeing you holding up your hand while panting, tears falling. </p><p>“And I,” you panted looking over at your dad, smiling at him. You looked back at Thanos, a determined look on your face. “Am a Stark.” With that you snapped, hearing your father scream no. A bright flash illuminated around you and you stumbled to a big rock after seeing Thanos vanish. </p><p>Rhodey came over to you, cupping your cheek and nodding to you. “You did good kid, you did good.” You smiled weakly hearing someone else. You felt eyes on you from every direction, hearing the gasps of people. </p><p>Peter landed in front of you. “Y/n?” He shakily said looking in your eyes. You lazily turned your head, “Hey, Y/n we won. We won Y/n. You did it Y/n.” He was crying, scared because he was losing the girl who was like a sister to him. </p><p>Pepper lifted him from you, as he cried into his hands next to Rhodey. Tony and Pepper squatted in front of you, tears in both of their eyes. </p><p>“No.” Tony whimpered, scanning his eyes over your charred skin, holding his hand against your arc reactor. He took a deep breath, casting his eyes away from you as you put your hand over his.</p><p>“Friday,” Pepper said, looking at you with teary eyes. </p><p>“All life functions critical,” Friday replied. She looked down, letting the tears trickle down her cheeks as she knew her daughter wasn’t going to make it out of this.</p><p>“Dad.” You whispered lightly, sounding only like a released breath. He looked at your eyes, seeing them crinkle as you smiled weakly. “I love you 3000.” You said.</p><p>He let out a choked sob, shaking his head. “No, please.”</p><p>Pepper put her hand over yours and Tony’s “We’ll be okay.” She said, looking at you. “You can rest.” The arc reactor dimmed and Pepper sobbed while looking at the ground.</p><p>“Please.” Tony whispered, “God.” He choked out, holding onto Pepper. “How are we going to tell her?” </p><p>Pepper took a deep breath as she looked up to the dark sky. “I don’t know.”</p><p>-</p><p>The dark sky reflected across the lake, a small sprinkle of rain dusting the grass and fell into the lake, a soft drip drop sound resonating on this day of mourning. Tony and Pepper held onto each of Morgan’s hands, a floral float on the other hand of each. Tony held a small float for you while Pepper held one for Natasha. Each replicated your superhero persona but still captured your essence as yourselves.  </p><p>Peter stood directly behind the three, May next to him for support. Harley stood behind them looking down at his feet, staring at the tears that dripped down his face and hit the wooden boards. Rhodey and Happy’s eyes fell onto the six in front of them, hugging each other for support. Steve and Thor stood next to each other, Bruce behind them, all having solemn faces as they watched them float down the lake. Many other people stood behind, from people you had known for most of your life, to a person you’ve only met only a day ago. Carol, Nick, and Maria stood the farthest, already missing your bright sarcastic humor they had gotten accustomed to. </p><p>-</p><p>“She left this for you,” Tony said as he handed Harley a black velvet box. He opened it as Tony turned to Peter, lifting out a necklace that had a heart pendant attached. He opened it seeing a picture of you and him from his graduation. He let out a sad chuckle as he hooked it around his neck looking at it in his palm.</p><p>Peter opened his box, a spider charm and a thunderbolt hanging on a necklace. He smiled softly at it, turning to Harley who had the same expression as him. He looped it around his neck, looking up to the sky and smiling.</p><p>The closest to you sat in the living room of the lakehouse, Pepper, Peter, Harley, Tony, and Morgan sat on the couch, everyone else spread across the other loveseats and benches. </p><p>“Um, is this thing on? I hope it is because if it isn’t this is going to be really awkward to find out it wasn’t,” you paused resting your head on the back of the chair. “Well, the only reason you would see this is because I’m gone. Whether it be an untimely death, my stark sacrificing genes or something completely natural and out of fixing.” You hid your face in your arms for a moment. “Oh god. So as you guys know, I’m terrible at talking so I’ll end up ranting or something. But um, yeah part of the journey is the end y’ know? All just a part of the hero gig.” you repositioned yourself on the chair. “I know my journey came up a little short but I know I was going to do it for someone. Maybe, in this case, it was for everyone who’s watching this.” You sat on the ground cross-legged, Morgan sitting across from your hologram. “Morgan, I’m sorry I won’t be there for you. But you have some pretty cool aunts and uncles and mom and dad who would be happy to help you with anything, well except first-degree murder cause that’s a no-no. You also have some pretty cool brothers, no I am not admitting that you two are cool you guys are absolute dorks,” they chuckled giving each other a high five. “and you also have me. Cause I will always be right here.” You pointed to her heart giving a smile. “I love you all 3000.” your hologram reached behind Morgan, stopping the recording. </p><p>There was a heavy feeling in the room, some had tears, some had small smiles, some didn’t know what to feel. Morgan climbed back onto her dad’s lap, tearing up. Steve had walked out, the other slowly dispersing so they could be alone together. All was silent until Harley spoke.</p><p>“Do you guys remember at my graduation when she tackled me and ended up breaking her arm?” He smiled, looking at the picture in the locket. They laughed softly, smiling at the memory.</p><p>“What about when she first tried calamari?” They laughed, remembering how you ate most of the plate.</p><p>The rest of the day wasn’t spent mourning you. It was spent remembering you.</p><p>Xxx xxX</p><p>A/n; honestly could have ended it better. I’m sorry if I broke your heart, I’m gonna break it again in the next part beautiful things. :(:</p>",
                "content": "<p>Pairing; Tony Stark x Stark!Reader</p><p>Warnings; ANGST &amp; Sadness. Endgame Spoilers!</p><p>A/n; Don&rsquo;t worry I&rsquo;ll make it up to you with Beautiful things.</p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><p>You saw the small interaction between your dad and Dr. Strange, seeing him put a finger up. You looked at your dad&rsquo;s face seeing the sad look and the guilt in his eyes. You knew what he was thinking and you were determined to do it before him. You turned invisible, running towards Thanos before he could. You stopped in front of him, figuring out how you could do this. You gripped the gauntlet, looking at his confused face. You grabbed all the stones without him knowing, turning visible. </p><p>He pushed you off of him, holding up the gauntlet. &ldquo;You thought you could defeat me?&rdquo; He scoffed. &ldquo;I am inevitable.&rdquo; You knew some were watching, you knew Tony was on his way, you knew what was going to happen. He snapped his fingers and nothing happened. </p><p>He looked at the gauntlet with confusion, turning it to see that the stones weren&rsquo;t there. He looked at you with wide eyes, seeing you holding up your hand while panting, tears falling. </p><p>&ldquo;And I,&rdquo; you panted looking over at your dad, smiling at him. You looked back at Thanos, a determined look on your face. &ldquo;Am a Stark.&rdquo; With that you snapped, hearing your father scream no. A bright flash illuminated around you and you stumbled to a big rock after seeing Thanos vanish. </p><p>Rhodey came over to you, cupping your cheek and nodding to you. &ldquo;You did good kid, you did good.&rdquo; You smiled weakly hearing someone else. You felt eyes on you from every direction, hearing the gasps of people. </p><p>Peter landed in front of you. &ldquo;Y/n?&rdquo; He shakily said looking in your eyes. You lazily turned your head, &ldquo;Hey, Y/n we won. We won Y/n. You did it Y/n.&rdquo; He was crying, scared because he was losing the girl who was like a sister to him. </p><p>Pepper lifted him from you, as he cried into his hands next to Rhodey. Tony and Pepper squatted in front of you, tears in both of their eyes. </p><p>&ldquo;No.&rdquo; Tony whimpered, scanning his eyes over your charred skin, holding his hand against your arc reactor. He took a deep breath, casting his eyes away from you as you put your hand over his.</p><p>&ldquo;Friday,&rdquo; Pepper said, looking at you with teary eyes. </p><p>&ldquo;All life functions critical,&rdquo; Friday replied. She looked down, letting the tears trickle down her cheeks as she knew her daughter wasn&rsquo;t going to make it out of this.</p><p>&ldquo;Dad.&rdquo; You whispered lightly, sounding only like a released breath. He looked at your eyes, seeing them crinkle as you smiled weakly. &ldquo;I love you 3000.&rdquo; You said.</p><p>He let out a choked sob, shaking his head. &ldquo;No, please.&rdquo;</p><p>Pepper put her hand over yours and Tony&rsquo;s &ldquo;We&rsquo;ll be okay.&rdquo; She said, looking at you. &ldquo;You can rest.&rdquo; The arc reactor dimmed and Pepper sobbed while looking at the ground.</p><p>&ldquo;Please.&rdquo; Tony whispered, &ldquo;God.&rdquo; He choked out, holding onto Pepper. &ldquo;How are we going to tell her?&rdquo; </p><p>Pepper took a deep breath as she looked up to the dark sky. &ldquo;I don&rsquo;t know.&rdquo;</p><p>-</p><p>The dark sky reflected across the lake, a small sprinkle of rain dusting the grass and fell into the lake, a soft drip drop sound resonating on this day of mourning. Tony and Pepper held onto each of Morgan&rsquo;s hands, a floral float on the other hand of each. Tony held a small float for you while Pepper held one for Natasha. Each replicated your superhero persona but still captured your essence as yourselves.  </p><p>Peter stood directly behind the three, May next to him for support. Harley stood behind them looking down at his feet, staring at the tears that dripped down his face and hit the wooden boards. Rhodey and Happy&rsquo;s eyes fell onto the six in front of them, hugging each other for support. Steve and Thor stood next to each other, Bruce behind them, all having solemn faces as they watched them float down the lake. Many other people stood behind, from people you had known for most of your life, to a person you&rsquo;ve only met only a day ago. Carol, Nick, and Maria stood the farthest, already missing your bright sarcastic humor they had gotten accustomed to. </p><p>-</p><p>&ldquo;She left this for you,&rdquo; Tony said as he handed Harley a black velvet box. He opened it as Tony turned to Peter, lifting out a necklace that had a heart pendant attached. He opened it seeing a picture of you and him from his graduation. He let out a sad chuckle as he hooked it around his neck looking at it in his palm.</p><p>Peter opened his box, a spider charm and a thunderbolt hanging on a necklace. He smiled softly at it, turning to Harley who had the same expression as him. He looped it around his neck, looking up to the sky and smiling.</p><p>The closest to you sat in the living room of the lakehouse, Pepper, Peter, Harley, Tony, and Morgan sat on the couch, everyone else spread across the other loveseats and benches. </p><p>&ldquo;Um, is this thing on? I hope it is because if it isn&rsquo;t this is going to be really awkward to find out it wasn&rsquo;t,&rdquo; you paused resting your head on the back of the chair.&nbsp;&ldquo;Well, the only reason you would see this is because I&rsquo;m gone. Whether it be an untimely death, my stark sacrificing genes or something completely natural and out of fixing.&rdquo; You hid your face in your arms for a moment.&nbsp;&ldquo;Oh god. So as you guys know, I&rsquo;m terrible at talking so I&rsquo;ll end up ranting or something. But um, yeah part of the journey is the end y&rsquo; know? All just a part of the hero gig.&rdquo; you repositioned yourself on the chair.&nbsp;&ldquo;I know my journey came up a little short but I know I was going to do it for someone. Maybe, in this case, it was for everyone who&rsquo;s watching this.&rdquo; You sat on the ground cross-legged, Morgan sitting across from your hologram.&nbsp;&ldquo;Morgan, I&rsquo;m sorry I won&rsquo;t be there for you. But you have some pretty cool aunts and uncles and mom and dad who would be happy to help you with anything, well except first-degree murder cause that&rsquo;s a no-no. You also have some pretty cool brothers, no I am not admitting that you two are cool you guys are absolute dorks,&rdquo; they chuckled giving each other a high five.&nbsp;&ldquo;and you also have me. Cause I will always be right here.&rdquo; You pointed to her heart giving a smile.&nbsp;&ldquo;I love you all 3000.&rdquo; your hologram reached behind Morgan, stopping the recording.&nbsp;</p><p>There was a heavy feeling in the room, some had tears, some had small smiles, some didn&rsquo;t know what to feel.&nbsp;Morgan climbed back onto her dad&rsquo;s lap, tearing up. Steve had walked out, the other slowly dispersing so they could be alone together. All was silent until Harley spoke.</p><p>&ldquo;Do you guys remember at my graduation when she tackled me and ended up breaking her arm?&rdquo; He smiled, looking at the picture in the locket. They laughed softly, smiling at the memory.</p><p>&ldquo;What about when she first tried calamari?&rdquo; They laughed, remembering how you ate most of the plate.</p><p>The rest of the day wasn&rsquo;t spent mourning you. It was spent remembering you.</p><p>Xxx xxX</p><p>A/n; honestly could have ended it better. I&rsquo;m sorry if I broke your heart, I&rsquo;m gonna break it again in the next part beautiful things. :(:</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "link",
        "blog_name": "flange5",
        "blog": {
            "name": "flange5",
            "title": "Flange's Incoherent Flailing",
            "description": "Just a place where I post polish pictures and indulge my time-sucking enthusiasms, of which there are way too many.  You can expect nail polish and nail art, Arashi, The Avengers (MCU and 616 in particular), Japanese statues and action figures,...",
            "url": "https://flange5.tumblr.com/",
            "uuid": "t:MpqbsAEXQL74dyB8TDGAQg",
            "updated": 1561765223
        },
        "id": 185618442339,
        "post_url": "https://flange5.tumblr.com/post/185618442339/tony-cat-enamel-pin2",
        "slug": "tony-cat-enamel-pin2",
        "date": "2019-06-15 23:00:35 GMT",
        "timestamp": 1560639635,
        "state": "published",
        "format": "html",
        "reblog_key": "eS55jS2i",
        "tags": [
            "enabling",
            "tony stark",
            "pins"
        ],
        "short_url": "https://tmblr.co/Zjtkwv2itkAXZ",
        "summary": "tony-cat enamel pin2",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 9,
        "title": "tony-cat enamel pin2",
        "url": "https://www.etsy.com/listing/689053264/tony-cat-enamel-pin2?ref=user_profile&frs=1",
        "link_image": "https://66.media.tumblr.com/5a5ec2cc530fb9568707cfa48146f080/tumblr_psx05weTXX1rphpmm_og_540.jpg",
        "link_image_dimensions": {
            "width": 540,
            "height": 360
        },
        "link_author": null,
        "excerpt": "tony-cat enamel pin2 Measures 2.5 cm Ships with card backing ©tuna",
        "publisher": "etsy.com",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/5a5ec2cc530fb9568707cfa48146f080/tumblr_psx05weTXX1rphpmm_og_1280.jpg",
                    "width": 570,
                    "height": 380
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/5a5ec2cc530fb9568707cfa48146f080/tumblr_psx05weTXX1rphpmm_og_640.jpg",
                        "width": 570,
                        "height": 380
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a5ec2cc530fb9568707cfa48146f080/tumblr_psx05weTXX1rphpmm_og_540.jpg",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a5ec2cc530fb9568707cfa48146f080/tumblr_psx05weTXX1rphpmm_og_500.jpg",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a5ec2cc530fb9568707cfa48146f080/tumblr_psx05weTXX1rphpmm_og_400.jpg",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a5ec2cc530fb9568707cfa48146f080/tumblr_psx05weTXX1rphpmm_og_250.jpg",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a5ec2cc530fb9568707cfa48146f080/tumblr_psx05weTXX1rphpmm_og_100.jpg",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a5ec2cc530fb9568707cfa48146f080/tumblr_psx05weTXX1rphpmm_og_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "description": "<p>noooooooo</p>",
        "reblog": {
            "comment": "<p>noooooooo</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "flange5",
                    "active": true,
                    "theme": {
                        "header_full_width": 339,
                        "header_full_height": 365,
                        "header_focus_width": 339,
                        "header_focus_height": 190,
                        "avatar_shape": "square",
                        "background_color": "#aed0e9",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "87,339,277,0",
                        "header_image": "https://static.tumblr.com/b5fc6f4a948608adb54f5f78c7deca06/ytqowlw/Xqho4m67f/tumblr_static_4845kyzh0s2sgww40w4scs8ss.png",
                        "header_image_focused": "https://static.tumblr.com/b5fc6f4a948608adb54f5f78c7deca06/ytqowlw/fqso4m67h/tumblr_static_tumblr_static_4845kyzh0s2sgww40w4scs8ss_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/b5fc6f4a948608adb54f5f78c7deca06/ytqowlw/Xqho4m67f/tumblr_static_4845kyzh0s2sgww40w4scs8ss_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618442339"
                },
                "content_raw": "<p>noooooooo</p>",
                "content": "<p>noooooooo</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "jn-wolf",
        "blog": {
            "name": "jn-wolf",
            "title": "Jane Wolf",
            "description": "She. 21 years old. \nIron Dad, Marvel, Loki, Ben Barnes, Harry Potter, Greek mithology and all the nerdy stuff.\n- AMORE PER L'ARTE -\nPS: I apologise for eventual grammar mistakes.",
            "url": "https://jn-wolf.tumblr.com/",
            "uuid": "t:HcfVXP1MkE7ISTLArTotOg",
            "updated": 1561740031
        },
        "id": 185618436709,
        "post_url": "https://jn-wolf.tumblr.com/post/185618436709/i-shouldnt-laugh-this-much",
        "slug": "i-shouldnt-laugh-this-much",
        "date": "2019-06-15 23:00:20 GMT",
        "timestamp": 1560639620,
        "state": "published",
        "format": "html",
        "reblog_key": "IIQIEIok",
        "tags": [
            "marvel",
            "avengers",
            "avengers endgame",
            "iron man",
            "tony stark",
            "spiderman",
            "captain marvel",
            "captain america",
            "loki",
            "thor",
            "matt murdock",
            "voldemort",
            "lord voldemord",
            "harry potter",
            "nick fury",
            "marvel memes",
            "daredevil"
        ],
        "short_url": "https://tmblr.co/Zk1JPe2itk99b",
        "summary": "I shouldn't laugh this much ...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 153,
        "title": null,
        "body": "<h2><i><b>I shouldn&rsquo;t laugh this much &hellip; </b></i></h2><figure class=\"tmblr-full\" data-orig-height=\"603\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/5d0915d3112d8d2ca2b0e8d7a1c19dda/tumblr_pt5x8kfIpZ1uhwhwp_540.jpg\" data-orig-height=\"603\" data-orig-width=\"500\"/></figure>",
        "reblog": {
            "comment": "<p><h2><i><b>I shouldn’t laugh this much … </b></i></h2><figure class=\"tmblr-full\" data-orig-height=\"603\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/5d0915d3112d8d2ca2b0e8d7a1c19dda/tumblr_pt5x8kfIpZ1uhwhwp_540.jpg\" data-orig-height=\"603\" data-orig-width=\"500\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jn-wolf",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#587654",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/50cc86a5b7f986d5ca29c5ab4fc0e9a3/kjndy2i/6Qqpqiz28/tumblr_static_-511885498-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/50cc86a5b7f986d5ca29c5ab4fc0e9a3/kjndy2i/6Qqpqiz28/tumblr_static_-511885498-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/50cc86a5b7f986d5ca29c5ab4fc0e9a3/kjndy2i/6Qqpqiz28/tumblr_static_-511885498-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#6F8954",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#B69923",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618436709"
                },
                "content_raw": "<p><h2><i><b>I shouldn’t laugh this much … </b></i></h2><figure class=\"tmblr-full\" data-orig-height=\"603\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/5d0915d3112d8d2ca2b0e8d7a1c19dda/tumblr_pt5x8kfIpZ1uhwhwp_540.jpg\" data-orig-height=\"603\" data-orig-width=\"500\"></figure></p>",
                "content": "<p><h2><i><b>I shouldn&rsquo;t laugh this much &hellip; </b></i></h2><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/5d0915d3112d8d2ca2b0e8d7a1c19dda/tumblr_pt5x8kfIpZ1uhwhwp_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "tonystarkisaslut",
        "blog": {
            "name": "tonystarkisaslut",
            "title": "Love You 3000",
            "description": "<p>Grace, 18, American, queer af</p><p>My icon was made by the lovely d-inchiostro, and my header is by the marvelous marvelocks.</p><p>I ship almost everything, no hate allowed. </p><p>If you want me to tag something ask nicely and ofc I will. </p><p>Requests and prompts are always open!</p>",
            "url": "https://tonystarkisaslut.tumblr.com/",
            "uuid": "t:SYAu23OBBNOabbGcpQpjyw",
            "updated": 1561764225
        },
        "id": 185618435739,
        "post_url": "https://tonystarkisaslut.tumblr.com/post/185618435739/i-will-marry-the-princess-chapter-five",
        "slug": "i-will-marry-the-princess-chapter-five",
        "date": "2019-06-15 23:00:16 GMT",
        "timestamp": 1560639616,
        "state": "published",
        "format": "html",
        "reblog_key": "B2VO1Unu",
        "tags": [
            "tony stark",
            "peter parker",
            "May Parker",
            "starker",
            "fanfic",
            "My writing",
            "prompt"
        ],
        "short_url": "https://tmblr.co/ZG4EqW2itk8wR",
        "summary": "I Will Marry The Princess: Chapter Five",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 24,
        "title": "I Will Marry The Princess: Chapter Five",
        "body": "<p><a class=\"tumblelog\" href=\"https://tmblr.co/m3jREOau0CkbFme5hiyEJEw\">@saffirah666</a></p><!-- more --><p>One week. Peter has to survive one more week of this torture, and he can make May the Queen. She&rsquo;ll marry the prince, and she&rsquo;ll stay here with Peter, and Peter&hellip;</p><p>It won&rsquo;t be over, Peter realizes. He&rsquo;ll watch his love, watch him love his sister. Watch him have babies with his sister. Watch him forget Peter. </p><p>&ldquo;I stand before you today, the people of my court, to make a wonderful and joyous announcement.&rdquo; Peter starts. May looks at him curiously, pausing her conversation with the prince. &ldquo;Today, I bring the news that my sister is to be married before her 25th birthday, despite my meddling.&rdquo; That earns him several laughs. He looks at his sister, who is now beaming excitedly. &ldquo;Prince Anthony, from the kingdom of Stark, is to take my sister&rsquo;s hand in marriage.&rdquo; He refuses to look at the prince. If he did, he would see only sadness and regret. &ldquo;The wedding is to be after my birthday, and I invite the entire kingdom to bear witness of this beautiful matrimony. Please spread my word to the common people who are not here. That is all.&quot; </p><p>Peter hears people start talking excitedly, but he turns his back on them. He hears Tony walking up to him, shouting about thanking the King himself to May. He doesn&rsquo;t stop, he goes to his gardens. </p><p>&quot;My King,&rdquo; Tony says softly. </p><p>Peter pauses, eyes filling with tears. He turns to Tony, forcing a smile on his face. &ldquo;Prince Tony.&rdquo; he says back.</p><p>&ldquo;You can&rsquo;t&ndash;this can&rsquo;t be serious,&rdquo; he whispers, stepping closer.</p><p>Peter takes a step back. &ldquo;I have to do this. She loves you, and I know you can love her back. If you just try,&rdquo; he says softly.</p><p>&ldquo;My heart and soul belong to you, my King,&rdquo; Tony says firmly, stepping closer.</p><p>Peter backs into the wall, breath hitching. &ldquo;I can&rsquo;t. I can&rsquo;t, I can&rsquo;t steal you from her.&rdquo;</p><p>&ldquo;I never belonged to her!&rdquo; Tony says, voice rising. He takes another step closer, arms on either side of his head. &ldquo;You can not steal something of which has no owner.&rdquo;</p><p>Peter feels more tears fall down his face. &ldquo;Please, don&rsquo;t make this so hard.&rdquo; He whispers. &ldquo;You&rsquo;re hurting me.&rdquo;</p><p>Tony tilts Peter&rsquo;s chin up. &ldquo;Don&rsquo;t hurt. Just say yes to me, just let me love you.&rdquo;</p><p>Peter closes his eyes, breath hiccupping. &ldquo;I can&rsquo;t. It&rsquo;s too late now. I can&rsquo;t take it back, I told the entire kingdom.&rdquo;</p><p>Tony pulls back, his own tears falling. &ldquo;But I love you&hellip;&rdquo; He whispers. &ldquo;I don&rsquo;t love her. She&rsquo;s wonderful and kind and sweet and beautiful, but she isn&rsquo;t you.&rdquo;</p><p>Peter swallows thickly, shaking his head. &ldquo;You must try to love her. You must move on from me. You cannot hurt her.&rdquo;</p><p>Tony leans forward, pulling Peter&rsquo;s face towards his own and resting their foreheads together, noses touching. &ldquo;Please don&rsquo;t do this.&rdquo;</p><p>Peter holds Tony&rsquo;s hands to his face, letting himself feel it, for just a moment. It&rsquo;s only a moment. &ldquo;It&rsquo;s already done.&rdquo; He opens his eyes, pushing Tony&rsquo;s hands away and to Tony&rsquo;s chest. &ldquo;You will own my heart until the end of time, my prince, but you must give yours to my sister. She deserves to be happy. More than anyone, she deserves to be happy.&rdquo;</p><p>&ldquo;Why did you chase her suitors away then? Until now? Why will you let me take her away, but no one else?&rdquo; He asks. </p><p>Peter smiles sadly. Because she won&rsquo;t be leaving. She&rsquo;ll be here, and so will you. &quot;She loves you, like I said. She has never loved anyone before you,&ldquo; he steps around Tony, wiping his tears. &quot;Come, Prince Tony. The part awaits our presence.&rdquo;</p><p>Tony dances with May. May smiles and laughs and blushes. She is happier than Peter can ever remember her being. He cannot, will not, take this away from her. </p><p>He retires early, tossing and turning in his chambers. He sneaks out of his room, stalking out into his gardens once again. He goes to his favorite spot; a grassy area under his tree. It&rsquo;s secluded, invisible to anyone who isn&rsquo;t ten feet in front of him. He doesn&rsquo;t expect the prince to be there. &ldquo;Tony?&rdquo;</p><p>Tony startles and looks up, holding up a bottle of wine. &ldquo;I was hoping you would come.&rdquo;</p><p>&ldquo;You can&rsquo;t be here anymore. What are you-&rdquo;</p><p>&ldquo;Please. I&rsquo;m getting married soon, I want your company for as long as I can have it.&rdquo;</p><p>Peter reluctantly sits, taking a sip from the bottle. He hums happily. &ldquo;That&rsquo;s the good wine. How did you sneak that out?&rdquo;</p><p>&ldquo;I told them the truth. I was going to give it to you.&rdquo; He takes his own sip, sighing softly. </p><p>Peter leans into Tony&rsquo;s chest. As they finish the bottle together, they talk endlessly. About everything they can think of. Peter completely regrets it. He&rsquo;s fallen even harder for the prince. He hangs onto every word, every battle story. Every whisper of breath against his ear. His stories are making the young king full of lust. Peter stands when the sun rises, helping the prince up as well. &ldquo;I will see you at breakfast.&rdquo; He whispers, almost as if he doesn&rsquo;t want to disrupt the moment. </p><p>Tony leans forward, kissing Peter&rsquo;s cheek softly. &ldquo;Until then, my king.&rdquo; He whispers. </p><p>He meets the prince there the next night, and the next, and the next. </p><p>On Peter&rsquo;s 18th birthday, he is coronated as the official King, able to make his own decisions for the kingdom. He sets to work on changing laws to get his sister in his place. He has to start small, work his way up. First, he must pass a law citing women have the right to any job a man has the right to. Then he must force his council to listen to reason, to open them up to the idea of women leaders. </p><p>It&rsquo;s a long road ahead, and he has much work to do. </p><p>He&rsquo;s exhausted, and emotional, and the wedding is set for a month&rsquo;s time.</p><p>Peter starts to go to his chambers. &ldquo;Guards, I want to be left alone. I don&rsquo;t want anyone even in this hall.&rdquo; He says. &ldquo;I don&rsquo;t want you to hear.&rdquo; He says. His guards nod and leave the hall. Peter opens his door, falling to his bed. He wants to cry. King&rsquo;s don&rsquo;t cry, he always heard his father said. He misses his father. </p><p>He almost screams when a figure comes through his window, but he relaxes when he sees it&rsquo;s just Tony. &ldquo;What on earth-&rdquo;</p><p>&ldquo;I saw you come here and not the gardens.&rdquo; He whispers. </p><p>&ldquo;So you decided to come here?&rdquo; Peter asks, eyes wide.</p><p>Tony nods, walking over. &ldquo;I did not want to sleep without you.&rdquo; He whispers. They&rsquo;ve been sleeping together in the gardens these past few nights. </p><p>&ldquo;You must get used to it, my prince. In one month&rsquo;s time, you will be sharing your bed with the princess.&rdquo; Hopefully queen by then. </p><p>Tony tears up at the thought. &ldquo;Tonight is your birthday.&rdquo; He says. </p><p>Peter swallows thickly and nods. &ldquo;It is.&rdquo;</p><p>&ldquo;I want to give you a present.&rdquo; Tony whispers. </p><p>Peter sits on the bed. &ldquo;I need no presents, I have everything money can buy.&rdquo;</p><p>Tony sits next to him, kissing his forehead. &ldquo;Money can&rsquo;t buy my present for you.&rdquo; He whispers, kissing Peter&rsquo;s nose. He moves his lips to Peter&rsquo;s cheek.</p><p>Peter&rsquo;s breath hitches, feeling himself grow aroused. &ldquo;Tony, my love-&rdquo;</p><p>Tony kisses him. &ldquo;Please.&rdquo; He whispers against Peter&rsquo;s lips. &ldquo;Just once. Let me make love to you just once, please. Please, for your birthday. Just the one time.&rdquo;</p><p>Peter cups Tony&rsquo;s cheeks, leaning their foreheads together. &ldquo;It won&rsquo;t be just once.&rdquo; He whispers, already knowing.</p><p>Tony kisses him again. &ldquo;Please.&rdquo; He whispers so softly against Peter&rsquo;s lips.</p><p>Peter feels like he&rsquo;s on fire. </p><p>Tony kisses him every where after disrobing them both. He kisses him and touches him all over and Peter is a trembling, sweaty, crying mess before Tony even pushes inside him. </p><p>It hurts at first, but Tony goes slow and he uses so much olive oil Peter will have to come up with a reason as to why his bed sheets are so wet. </p><p>Tony makes love to him so sweet and slow, whispering about how much he loves Peter. How he wants to spend the rest of his life with Peter, how he&rsquo;ll never let Peter go. </p><p>Peter kisses him, wrapping his legs around Tony&rsquo;s hips. He pants into his mouth, holding Tony close by his cheeks. &ldquo;I love you so much, my prince. I love you, I-&rdquo; He swallows thickly, closing his eyes. &ldquo;Make me finish, I am so aroused it hurts.&rdquo;</p><p>Tony had reached between them, grabbing Peter by his manhood and stroking quickly. Peter had keened, arcing his back and crying as he finished over his stomach. </p><p>Tony had finished inside Peter, kissing Peter lovingly. </p><p>Peter fell asleep in Tony&rsquo;s arms, and woke up there too. </p><p>He also woke with soreness and guilt and regret. How will he possibly watch his sister marry Tony, knowing what it feels like to have Tony inside him? How will he be able to look his sister in the eye, knowing she&rsquo;ll be making love to the prince he loves so much? How will he be able to ever be happy again, knowing Tony will never be his?</p><p>He makes Tony leave through the window like he came in, then washes himself and cries. He is so irreversibly in love with the prince, and the prince loves him just as much. But he&rsquo;ll be marrying his sister, not him. </p><p>He gets dressed, and skips breakfast. He has much work to do before the wedding in a month, if he wants to keep his sister here. </p>",
        "body_abstract": "<p><a class=\"tumblelog\" href=\"https://tmblr.co/m3jREOau0CkbFme5hiyEJEw\">@saffirah666</a></p>",
        "reblog": {
            "comment": "<p><a class=\"tumblelog\" href=\"https://tmblr.co/m3jREOau0CkbFme5hiyEJEw\">@saffirah666</a></p>[[MORE]]<p>One week. Peter has to survive one more week of this torture, and he can make May the Queen. She’ll marry the prince, and she’ll stay here with Peter, and Peter…</p><p>It won’t be over, Peter realizes. He’ll watch his love, watch him love his sister. Watch him have babies with his sister. Watch him forget Peter. </p><p>“I stand before you today, the people of my court, to make a wonderful and joyous announcement.” Peter starts. May looks at him curiously, pausing her conversation with the prince. “Today, I bring the news that my sister is to be married before her 25th birthday, despite my meddling.” That earns him several laughs. He looks at his sister, who is now beaming excitedly. “Prince Anthony, from the kingdom of Stark, is to take my sister’s hand in marriage.” He refuses to look at the prince. If he did, he would see only sadness and regret. “The wedding is to be after my birthday, and I invite the entire kingdom to bear witness of this beautiful matrimony. Please spread my word to the common people who are not here. That is all.\" </p><p>Peter hears people start talking excitedly, but he turns his back on them. He hears Tony walking up to him, shouting about thanking the King himself to May. He doesn’t stop, he goes to his gardens. </p><p>\"My King,” Tony says softly. </p><p>Peter pauses, eyes filling with tears. He turns to Tony, forcing a smile on his face. “Prince Tony.” he says back.</p><p>“You can’t–this can’t be serious,” he whispers, stepping closer.</p><p>Peter takes a step back. “I have to do this. She loves you, and I know you can love her back. If you just try,” he says softly.</p><p>“My heart and soul belong to you, my King,” Tony says firmly, stepping closer.</p><p>Peter backs into the wall, breath hitching. “I can’t. I can’t, I can’t steal you from her.”</p><p>“I never belonged to her!” Tony says, voice rising. He takes another step closer, arms on either side of his head. “You can not steal something of which has no owner.”</p><p>Peter feels more tears fall down his face. “Please, don’t make this so hard.” He whispers. “You’re hurting me.”</p><p>Tony tilts Peter’s chin up. “Don’t hurt. Just say yes to me, just let me love you.”</p><p>Peter closes his eyes, breath hiccupping. “I can’t. It’s too late now. I can’t take it back, I told the entire kingdom.”</p><p>Tony pulls back, his own tears falling. “But I love you…” He whispers. “I don’t love her. She’s wonderful and kind and sweet and beautiful, but she isn’t you.”</p><p>Peter swallows thickly, shaking his head. “You must try to love her. You must move on from me. You cannot hurt her.”</p><p>Tony leans forward, pulling Peter’s face towards his own and resting their foreheads together, noses touching. “Please don’t do this.”</p><p>Peter holds Tony’s hands to his face, letting himself feel it, for just a moment. It’s only a moment. “It’s already done.” He opens his eyes, pushing Tony’s hands away and to Tony’s chest. “You will own my heart until the end of time, my prince, but you must give yours to my sister. She deserves to be happy. More than anyone, she deserves to be happy.”</p><p>“Why did you chase her suitors away then? Until now? Why will you let me take her away, but no one else?” He asks. </p><p>Peter smiles sadly. Because she won’t be leaving. She’ll be here, and so will you. \"She loves you, like I said. She has never loved anyone before you,“ he steps around Tony, wiping his tears. \"Come, Prince Tony. The part awaits our presence.”</p><p>Tony dances with May. May smiles and laughs and blushes. She is happier than Peter can ever remember her being. He cannot, will not, take this away from her. </p><p>He retires early, tossing and turning in his chambers. He sneaks out of his room, stalking out into his gardens once again. He goes to his favorite spot; a grassy area under his tree. It’s secluded, invisible to anyone who isn’t ten feet in front of him. He doesn’t expect the prince to be there. “Tony?”</p><p>Tony startles and looks up, holding up a bottle of wine. “I was hoping you would come.”</p><p>“You can’t be here anymore. What are you-”</p><p>“Please. I’m getting married soon, I want your company for as long as I can have it.”</p><p>Peter reluctantly sits, taking a sip from the bottle. He hums happily. “That’s the good wine. How did you sneak that out?”</p><p>“I told them the truth. I was going to give it to you.” He takes his own sip, sighing softly. </p><p>Peter leans into Tony’s chest. As they finish the bottle together, they talk endlessly. About everything they can think of. Peter completely regrets it. He’s fallen even harder for the prince. He hangs onto every word, every battle story. Every whisper of breath against his ear. His stories are making the young king full of lust. Peter stands when the sun rises, helping the prince up as well. “I will see you at breakfast.” He whispers, almost as if he doesn’t want to disrupt the moment. </p><p>Tony leans forward, kissing Peter’s cheek softly. “Until then, my king.” He whispers. </p><p>He meets the prince there the next night, and the next, and the next. </p><p>On Peter’s 18th birthday, he is coronated as the official King, able to make his own decisions for the kingdom. He sets to work on changing laws to get his sister in his place. He has to start small, work his way up. First, he must pass a law citing women have the right to any job a man has the right to. Then he must force his council to listen to reason, to open them up to the idea of women leaders. </p><p>It’s a long road ahead, and he has much work to do. </p><p>He’s exhausted, and emotional, and the wedding is set for a month’s time.</p><p>Peter starts to go to his chambers. “Guards, I want to be left alone. I don’t want anyone even in this hall.” He says. “I don’t want you to hear.” He says. His guards nod and leave the hall. Peter opens his door, falling to his bed. He wants to cry. King’s don’t cry, he always heard his father said. He misses his father. </p><p>He almost screams when a figure comes through his window, but he relaxes when he sees it’s just Tony. “What on earth-”</p><p>“I saw you come here and not the gardens.” He whispers. </p><p>“So you decided to come here?” Peter asks, eyes wide.</p><p>Tony nods, walking over. “I did not want to sleep without you.” He whispers. They’ve been sleeping together in the gardens these past few nights. </p><p>“You must get used to it, my prince. In one month’s time, you will be sharing your bed with the princess.” Hopefully queen by then. </p><p>Tony tears up at the thought. “Tonight is your birthday.” He says. </p><p>Peter swallows thickly and nods. “It is.”</p><p>“I want to give you a present.” Tony whispers. </p><p>Peter sits on the bed. “I need no presents, I have everything money can buy.”</p><p>Tony sits next to him, kissing his forehead. “Money can’t buy my present for you.” He whispers, kissing Peter’s nose. He moves his lips to Peter’s cheek.</p><p>Peter’s breath hitches, feeling himself grow aroused. “Tony, my love-”</p><p>Tony kisses him. “Please.” He whispers against Peter’s lips. “Just once. Let me make love to you just once, please. Please, for your birthday. Just the one time.”</p><p>Peter cups Tony’s cheeks, leaning their foreheads together. “It won’t be just once.” He whispers, already knowing.</p><p>Tony kisses him again. “Please.” He whispers so softly against Peter’s lips.</p><p>Peter feels like he’s on fire. </p><p>Tony kisses him every where after disrobing them both. He kisses him and touches him all over and Peter is a trembling, sweaty, crying mess before Tony even pushes inside him. </p><p>It hurts at first, but Tony goes slow and he uses so much olive oil Peter will have to come up with a reason as to why his bed sheets are so wet. </p><p>Tony makes love to him so sweet and slow, whispering about how much he loves Peter. How he wants to spend the rest of his life with Peter, how he’ll never let Peter go. </p><p>Peter kisses him, wrapping his legs around Tony’s hips. He pants into his mouth, holding Tony close by his cheeks. “I love you so much, my prince. I love you, I-” He swallows thickly, closing his eyes. “Make me finish, I am so aroused it hurts.”</p><p>Tony had reached between them, grabbing Peter by his manhood and stroking quickly. Peter had keened, arcing his back and crying as he finished over his stomach. </p><p>Tony had finished inside Peter, kissing Peter lovingly. </p><p>Peter fell asleep in Tony’s arms, and woke up there too. </p><p>He also woke with soreness and guilt and regret. How will he possibly watch his sister marry Tony, knowing what it feels like to have Tony inside him? How will he be able to look his sister in the eye, knowing she’ll be making love to the prince he loves so much? How will he be able to ever be happy again, knowing Tony will never be his?</p><p>He makes Tony leave through the window like he came in, then washes himself and cries. He is so irreversibly in love with the prince, and the prince loves him just as much. But he’ll be marrying his sister, not him. </p><p>He gets dressed, and skips breakfast. He has much work to do before the wedding in a month, if he wants to keep his sister here. </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "tonystarkisaslut",
                    "active": true,
                    "theme": {
                        "header_full_width": 719,
                        "header_full_height": 1280,
                        "header_focus_width": 409,
                        "header_focus_height": 229,
                        "avatar_shape": "circle",
                        "background_color": "#9A2020",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "554,571,783,162",
                        "header_image": "https://static.tumblr.com/23250e85b70a375db709f95569a1061a/jubgzsx/6nUpsqytu/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/795f64abbf2257c6a0c4fdcc8b69b320/jubgzsx/7LXpsqytw/tumblr_static_tumblr_static__focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/23250e85b70a375db709f95569a1061a/jubgzsx/6nUpsqytu/tumblr_static__2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#E8D73A",
                        "title_font": "Sofia Pro",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618435739"
                },
                "content_raw": "<p><a class=\"tumblelog\" href=\"https://tmblr.co/m3jREOau0CkbFme5hiyEJEw\">@saffirah666</a></p>[[MORE]]<p>One week. Peter has to survive one more week of this torture, and he can make May the Queen. She’ll marry the prince, and she’ll stay here with Peter, and Peter…</p><p>It won’t be over, Peter realizes. He’ll watch his love, watch him love his sister. Watch him have babies with his sister. Watch him forget Peter. </p><p>“I stand before you today, the people of my court, to make a wonderful and joyous announcement.” Peter starts. May looks at him curiously, pausing her conversation with the prince. “Today, I bring the news that my sister is to be married before her 25th birthday, despite my meddling.” That earns him several laughs. He looks at his sister, who is now beaming excitedly. “Prince Anthony, from the kingdom of Stark, is to take my sister’s hand in marriage.” He refuses to look at the prince. If he did, he would see only sadness and regret. “The wedding is to be after my birthday, and I invite the entire kingdom to bear witness of this beautiful matrimony. Please spread my word to the common people who are not here. That is all.\" </p><p>Peter hears people start talking excitedly, but he turns his back on them. He hears Tony walking up to him, shouting about thanking the King himself to May. He doesn’t stop, he goes to his gardens. </p><p>\"My King,” Tony says softly. </p><p>Peter pauses, eyes filling with tears. He turns to Tony, forcing a smile on his face. “Prince Tony.” he says back.</p><p>“You can’t–this can’t be serious,” he whispers, stepping closer.</p><p>Peter takes a step back. “I have to do this. She loves you, and I know you can love her back. If you just try,” he says softly.</p><p>“My heart and soul belong to you, my King,” Tony says firmly, stepping closer.</p><p>Peter backs into the wall, breath hitching. “I can’t. I can’t, I can’t steal you from her.”</p><p>“I never belonged to her!” Tony says, voice rising. He takes another step closer, arms on either side of his head. “You can not steal something of which has no owner.”</p><p>Peter feels more tears fall down his face. “Please, don’t make this so hard.” He whispers. “You’re hurting me.”</p><p>Tony tilts Peter’s chin up. “Don’t hurt. Just say yes to me, just let me love you.”</p><p>Peter closes his eyes, breath hiccupping. “I can’t. It’s too late now. I can’t take it back, I told the entire kingdom.”</p><p>Tony pulls back, his own tears falling. “But I love you…” He whispers. “I don’t love her. She’s wonderful and kind and sweet and beautiful, but she isn’t you.”</p><p>Peter swallows thickly, shaking his head. “You must try to love her. You must move on from me. You cannot hurt her.”</p><p>Tony leans forward, pulling Peter’s face towards his own and resting their foreheads together, noses touching. “Please don’t do this.”</p><p>Peter holds Tony’s hands to his face, letting himself feel it, for just a moment. It’s only a moment. “It’s already done.” He opens his eyes, pushing Tony’s hands away and to Tony’s chest. “You will own my heart until the end of time, my prince, but you must give yours to my sister. She deserves to be happy. More than anyone, she deserves to be happy.”</p><p>“Why did you chase her suitors away then? Until now? Why will you let me take her away, but no one else?” He asks. </p><p>Peter smiles sadly. Because she won’t be leaving. She’ll be here, and so will you. \"She loves you, like I said. She has never loved anyone before you,“ he steps around Tony, wiping his tears. \"Come, Prince Tony. The part awaits our presence.”</p><p>Tony dances with May. May smiles and laughs and blushes. She is happier than Peter can ever remember her being. He cannot, will not, take this away from her. </p><p>He retires early, tossing and turning in his chambers. He sneaks out of his room, stalking out into his gardens once again. He goes to his favorite spot; a grassy area under his tree. It’s secluded, invisible to anyone who isn’t ten feet in front of him. He doesn’t expect the prince to be there. “Tony?”</p><p>Tony startles and looks up, holding up a bottle of wine. “I was hoping you would come.”</p><p>“You can’t be here anymore. What are you-”</p><p>“Please. I’m getting married soon, I want your company for as long as I can have it.”</p><p>Peter reluctantly sits, taking a sip from the bottle. He hums happily. “That’s the good wine. How did you sneak that out?”</p><p>“I told them the truth. I was going to give it to you.” He takes his own sip, sighing softly. </p><p>Peter leans into Tony’s chest. As they finish the bottle together, they talk endlessly. About everything they can think of. Peter completely regrets it. He’s fallen even harder for the prince. He hangs onto every word, every battle story. Every whisper of breath against his ear. His stories are making the young king full of lust. Peter stands when the sun rises, helping the prince up as well. “I will see you at breakfast.” He whispers, almost as if he doesn’t want to disrupt the moment. </p><p>Tony leans forward, kissing Peter’s cheek softly. “Until then, my king.” He whispers. </p><p>He meets the prince there the next night, and the next, and the next. </p><p>On Peter’s 18th birthday, he is coronated as the official King, able to make his own decisions for the kingdom. He sets to work on changing laws to get his sister in his place. He has to start small, work his way up. First, he must pass a law citing women have the right to any job a man has the right to. Then he must force his council to listen to reason, to open them up to the idea of women leaders. </p><p>It’s a long road ahead, and he has much work to do. </p><p>He’s exhausted, and emotional, and the wedding is set for a month’s time.</p><p>Peter starts to go to his chambers. “Guards, I want to be left alone. I don’t want anyone even in this hall.” He says. “I don’t want you to hear.” He says. His guards nod and leave the hall. Peter opens his door, falling to his bed. He wants to cry. King’s don’t cry, he always heard his father said. He misses his father. </p><p>He almost screams when a figure comes through his window, but he relaxes when he sees it’s just Tony. “What on earth-”</p><p>“I saw you come here and not the gardens.” He whispers. </p><p>“So you decided to come here?” Peter asks, eyes wide.</p><p>Tony nods, walking over. “I did not want to sleep without you.” He whispers. They’ve been sleeping together in the gardens these past few nights. </p><p>“You must get used to it, my prince. In one month’s time, you will be sharing your bed with the princess.” Hopefully queen by then. </p><p>Tony tears up at the thought. “Tonight is your birthday.” He says. </p><p>Peter swallows thickly and nods. “It is.”</p><p>“I want to give you a present.” Tony whispers. </p><p>Peter sits on the bed. “I need no presents, I have everything money can buy.”</p><p>Tony sits next to him, kissing his forehead. “Money can’t buy my present for you.” He whispers, kissing Peter’s nose. He moves his lips to Peter’s cheek.</p><p>Peter’s breath hitches, feeling himself grow aroused. “Tony, my love-”</p><p>Tony kisses him. “Please.” He whispers against Peter’s lips. “Just once. Let me make love to you just once, please. Please, for your birthday. Just the one time.”</p><p>Peter cups Tony’s cheeks, leaning their foreheads together. “It won’t be just once.” He whispers, already knowing.</p><p>Tony kisses him again. “Please.” He whispers so softly against Peter’s lips.</p><p>Peter feels like he’s on fire. </p><p>Tony kisses him every where after disrobing them both. He kisses him and touches him all over and Peter is a trembling, sweaty, crying mess before Tony even pushes inside him. </p><p>It hurts at first, but Tony goes slow and he uses so much olive oil Peter will have to come up with a reason as to why his bed sheets are so wet. </p><p>Tony makes love to him so sweet and slow, whispering about how much he loves Peter. How he wants to spend the rest of his life with Peter, how he’ll never let Peter go. </p><p>Peter kisses him, wrapping his legs around Tony’s hips. He pants into his mouth, holding Tony close by his cheeks. “I love you so much, my prince. I love you, I-” He swallows thickly, closing his eyes. “Make me finish, I am so aroused it hurts.”</p><p>Tony had reached between them, grabbing Peter by his manhood and stroking quickly. Peter had keened, arcing his back and crying as he finished over his stomach. </p><p>Tony had finished inside Peter, kissing Peter lovingly. </p><p>Peter fell asleep in Tony’s arms, and woke up there too. </p><p>He also woke with soreness and guilt and regret. How will he possibly watch his sister marry Tony, knowing what it feels like to have Tony inside him? How will he be able to look his sister in the eye, knowing she’ll be making love to the prince he loves so much? How will he be able to ever be happy again, knowing Tony will never be his?</p><p>He makes Tony leave through the window like he came in, then washes himself and cries. He is so irreversibly in love with the prince, and the prince loves him just as much. But he’ll be marrying his sister, not him. </p><p>He gets dressed, and skips breakfast. He has much work to do before the wedding in a month, if he wants to keep his sister here. </p>",
                "content": "<p><a href=\"https://tmblr.co/m3jREOau0CkbFme5hiyEJEw\">@saffirah666</a></p><p>One week. Peter has to survive one more week of this torture, and he can make May the Queen. She&rsquo;ll marry the prince, and she&rsquo;ll stay here with Peter, and Peter&hellip;</p><p>It won&rsquo;t be over, Peter realizes. He&rsquo;ll watch his love, watch him love his sister. Watch him have babies with his sister. Watch him forget Peter.&nbsp;</p><p>&ldquo;I stand before you today, the people of my court, to make a wonderful and joyous announcement.&rdquo; Peter starts. May looks at him curiously, pausing her conversation with the prince. &ldquo;Today, I bring the news that my sister is to be married before her 25th birthday, despite my meddling.&rdquo; That earns him several laughs. He looks at his sister, who is now beaming excitedly. &ldquo;Prince Anthony, from the kingdom of Stark, is to take my sister&rsquo;s hand in marriage.&rdquo; He refuses to look at the prince. If he did, he would see only sadness and regret. &ldquo;The wedding is to be after my birthday, and I invite the entire kingdom to bear witness of this beautiful matrimony. Please spread my word to the common people who are not here. That is all.\"&nbsp;</p><p>Peter hears people start talking excitedly, but he turns his back on them. He hears Tony walking up to him, shouting about thanking the King himself to May. He doesn&rsquo;t stop, he goes to his gardens.&nbsp;</p><p>\"My King,&rdquo; Tony says softly.&nbsp;</p><p>Peter pauses, eyes filling with tears. He turns to Tony, forcing a smile on his face. &ldquo;Prince Tony.&rdquo; he says back.</p><p>&ldquo;You can&rsquo;t&ndash;this can&rsquo;t be serious,&rdquo; he whispers, stepping closer.</p><p>Peter takes a step back. &ldquo;I have to do this. She loves you, and I know you can love her back. If you just try,&rdquo; he says softly.</p><p>&ldquo;My heart and soul belong to you, my King,&rdquo; Tony says firmly, stepping closer.</p><p>Peter backs into the wall, breath hitching. &ldquo;I can&rsquo;t. I can&rsquo;t, I can&rsquo;t steal you from her.&rdquo;</p><p>&ldquo;I never belonged to her!&rdquo; Tony says, voice rising. He takes another step closer, arms on either side of his head. &ldquo;You can not steal something of which has no owner.&rdquo;</p><p>Peter feels more tears fall down his face. &ldquo;Please, don&rsquo;t make this so hard.&rdquo; He whispers. &ldquo;You&rsquo;re hurting me.&rdquo;</p><p>Tony tilts Peter&rsquo;s chin up. &ldquo;Don&rsquo;t hurt. Just say yes to me, just let me love you.&rdquo;</p><p>Peter closes his eyes, breath hiccupping. &ldquo;I can&rsquo;t. It&rsquo;s too late now. I can&rsquo;t take it back, I told the entire kingdom.&rdquo;</p><p>Tony pulls back, his own tears falling. &ldquo;But I love you&hellip;&rdquo; He whispers. &ldquo;I don&rsquo;t love her. She&rsquo;s wonderful and kind and sweet and beautiful, but she isn&rsquo;t you.&rdquo;</p><p>Peter swallows thickly, shaking his head. &ldquo;You must try to love her. You must move on from me. You cannot hurt her.&rdquo;</p><p>Tony leans forward, pulling Peter&rsquo;s face towards his own and resting their foreheads together, noses touching. &ldquo;Please don&rsquo;t do this.&rdquo;</p><p>Peter holds Tony&rsquo;s hands to his face, letting himself feel it, for just a moment. It&rsquo;s only a moment. &ldquo;It&rsquo;s already done.&rdquo; He opens his eyes, pushing Tony&rsquo;s hands away and to Tony&rsquo;s chest. &ldquo;You will own my heart until the end of time, my prince, but you must give yours to my sister. She deserves to be happy. More than anyone, she deserves to be happy.&rdquo;</p><p>&ldquo;Why did you chase her suitors away then? Until now? Why will you let me take her away, but no one else?&rdquo; He asks.&nbsp;</p><p>Peter smiles sadly.&nbsp;Because she won&rsquo;t be leaving. She&rsquo;ll be here, and so will you.&nbsp;\"She loves you, like I said. She has never loved anyone before you,&ldquo; he steps around Tony, wiping his tears. \"Come, Prince Tony. The part awaits our presence.&rdquo;</p><p>Tony dances with May. May smiles and laughs and blushes. She is happier than Peter can ever remember her being. He cannot, will not, take this away from her.&nbsp;</p><p>He retires early, tossing and turning in his chambers. He sneaks out of his room, stalking out into his gardens once again. He goes to his favorite spot; a grassy area under his tree. It&rsquo;s secluded, invisible to anyone who isn&rsquo;t ten feet in front of him. He doesn&rsquo;t expect the prince to be there. &ldquo;Tony?&rdquo;</p><p>Tony startles and looks up, holding up a bottle of wine. &ldquo;I was hoping you would come.&rdquo;</p><p>&ldquo;You can&rsquo;t be here anymore. What are you-&rdquo;</p><p>&ldquo;Please. I&rsquo;m getting married soon, I want your company for as long as I can have it.&rdquo;</p><p>Peter reluctantly sits, taking a sip from the bottle. He hums happily. &ldquo;That&rsquo;s the good wine. How did you sneak that out?&rdquo;</p><p>&ldquo;I told them the truth. I was going to give it to you.&rdquo; He takes his own sip, sighing softly.&nbsp;</p><p>Peter leans into Tony&rsquo;s chest. As they finish the bottle together, they talk endlessly. About everything they can think of. Peter completely regrets it. He&rsquo;s fallen even harder for the prince. He hangs onto every word, every battle story. Every whisper of breath against his ear. His stories are making the young king full of lust. Peter stands when the sun rises, helping the prince up as well. &ldquo;I will see you at breakfast.&rdquo; He whispers, almost as if he doesn&rsquo;t want to disrupt the moment.&nbsp;</p><p>Tony leans forward, kissing Peter&rsquo;s cheek softly. &ldquo;Until then, my king.&rdquo; He whispers.&nbsp;</p><p>He meets the prince there the next night, and the next, and the next.&nbsp;</p><p>On Peter&rsquo;s 18th birthday, he is coronated as the official King, able to make his own decisions for the kingdom. He sets to work on changing laws to get his sister in his place. He has to start small, work his way up. First, he must pass a law citing women have the right to any job a man has the right to. Then he must force his council to listen to reason, to open them up to the idea of women leaders.&nbsp;</p><p>It&rsquo;s a long road ahead, and he has much work to do.&nbsp;</p><p>He&rsquo;s exhausted, and emotional, and the wedding is set for a month&rsquo;s time.</p><p>Peter starts to go to his chambers. &ldquo;Guards, I want to be left alone. I don&rsquo;t want anyone even in this hall.&rdquo; He says. &ldquo;I don&rsquo;t want you to hear.&rdquo; He says. His guards nod and leave the hall. Peter opens his door, falling to his bed. He wants to cry. King&rsquo;s don&rsquo;t cry, he always heard his father said. He misses his father.&nbsp;</p><p>He almost screams when a figure comes through his window, but he relaxes when he sees it&rsquo;s just Tony. &ldquo;What on earth-&rdquo;</p><p>&ldquo;I saw you come here and not the gardens.&rdquo; He whispers.&nbsp;</p><p>&ldquo;So you decided to come here?&rdquo; Peter asks, eyes wide.</p><p>Tony nods, walking over. &ldquo;I did not want to sleep without you.&rdquo; He whispers. They&rsquo;ve been sleeping together in the gardens these past few nights.&nbsp;</p><p>&ldquo;You must get used to it, my prince. In one month&rsquo;s time, you will be sharing your bed with the princess.&rdquo; Hopefully queen by then.&nbsp;</p><p>Tony tears up at the thought. &ldquo;Tonight is your birthday.&rdquo; He says.&nbsp;</p><p>Peter swallows thickly and nods. &ldquo;It is.&rdquo;</p><p>&ldquo;I want to give you a present.&rdquo; Tony whispers.&nbsp;</p><p>Peter sits on the bed. &ldquo;I need no presents, I have everything money can buy.&rdquo;</p><p>Tony sits next to him, kissing his forehead. &ldquo;Money can&rsquo;t buy my present for you.&rdquo; He whispers, kissing Peter&rsquo;s nose. He moves his lips to Peter&rsquo;s cheek.</p><p>Peter&rsquo;s breath hitches, feeling himself grow aroused. &ldquo;Tony, my love-&rdquo;</p><p>Tony kisses him. &ldquo;Please.&rdquo; He whispers against Peter&rsquo;s lips. &ldquo;Just once. Let me make love to you just once, please. Please, for your birthday. Just the one time.&rdquo;</p><p>Peter cups Tony&rsquo;s cheeks, leaning their foreheads together. &ldquo;It won&rsquo;t be just once.&rdquo; He whispers, already knowing.</p><p>Tony kisses him again. &ldquo;Please.&rdquo; He whispers so softly against Peter&rsquo;s lips.</p><p>Peter feels like he&rsquo;s on fire.&nbsp;</p><p>Tony kisses him every where after disrobing them both. He kisses him and touches him all over and Peter is a trembling, sweaty, crying mess before Tony even pushes inside him.&nbsp;</p><p>It hurts at first, but Tony goes slow and he uses so much olive oil Peter will have to come up with a reason as to why his bed sheets are so wet.&nbsp;</p><p>Tony makes love to him so sweet and slow, whispering about how much he loves Peter. How he wants to spend the rest of his life with Peter, how he&rsquo;ll never let Peter go.&nbsp;</p><p>Peter kisses him, wrapping his legs around Tony&rsquo;s hips. He pants into his mouth, holding Tony close by his cheeks. &ldquo;I love you so much, my prince. I love you, I-&rdquo; He swallows thickly, closing his eyes. &ldquo;Make me finish, I am so aroused it hurts.&rdquo;</p><p>Tony had reached between them, grabbing Peter by his manhood and stroking quickly. Peter had keened, arcing his back and crying as he finished over his stomach.&nbsp;</p><p>Tony had finished inside Peter, kissing Peter lovingly.&nbsp;</p><p>Peter fell asleep in Tony&rsquo;s arms, and woke up there too.&nbsp;</p><p>He also woke with soreness and guilt and regret. How will he possibly watch his sister marry Tony, knowing what it feels like to have Tony inside him? How will he be able to look his sister in the eye, knowing she&rsquo;ll be making love to the prince he loves so much? How will he be able to ever be happy again, knowing Tony will never be his?</p><p>He makes Tony leave through the window like he came in, then washes himself and cries. He is so irreversibly in love with the prince, and the prince loves him just as much. But he&rsquo;ll be marrying his sister, not him.&nbsp;</p><p>He gets dressed, and skips breakfast. He has much work to do before the wedding in a month, if he wants to keep his sister here.&nbsp;</p>",
                "content_abstract": "<p><a href=\"https://tmblr.co/m3jREOau0CkbFme5hiyEJEw\">@saffirah666</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "marsmay",
        "blog": {
            "name": "marsmay",
            "title": "Always here",
            "description": "Eli, 20, F, [FR]\n|also capmrvel| \n_____________\nI don't bite so feel free to send an ask if you want something from me! :)",
            "url": "https://marsmay.tumblr.com/",
            "uuid": "t:MdEhDqm5xiraqmg9hFadEQ",
            "updated": 1561575184
        },
        "id": 185618391834,
        "post_url": "https://marsmay.tumblr.com/post/185618391834/square-enix-knows-how-to-break-my-heart",
        "slug": "square-enix-knows-how-to-break-my-heart",
        "date": "2019-06-15 22:57:47 GMT",
        "timestamp": 1560639467,
        "state": "published",
        "format": "html",
        "reblog_key": "RB8rWAVU",
        "tags": [
            "stony",
            "tony stark",
            "marvel's avengers",
            "fanart",
            "i kinda like the design of the game??",
            "nat should have a shorter hair and thor have a strange armor but hey i'll grow to it",
            "and by the way we will have new costume for that",
            "and we have nolan north!!!",
            "mmayart"
        ],
        "short_url": "https://tmblr.co/ZsP4tZ2itj_CQ",
        "summary": "Square Enix knows how to break my heart",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 7,
        "title": null,
        "body": "<p>Square Enix knows how to break my heart</p><figure class=\"tmblr-full\" data-orig-height=\"1501\" data-orig-width=\"1209\"><img src=\"https://66.media.tumblr.com/3052601898009e32f6af743b34476eda/tumblr_pt5x4ah0pT1sbaya9_540.png\" data-orig-height=\"1501\" data-orig-width=\"1209\"/></figure>",
        "reblog": {
            "comment": "<p><p>Square Enix knows how to break my heart</p><figure class=\"tmblr-full\" data-orig-height=\"1501\" data-orig-width=\"1209\"><img src=\"https://66.media.tumblr.com/3052601898009e32f6af743b34476eda/tumblr_pt5x4ah0pT1sbaya9_540.png\" data-orig-height=\"1501\" data-orig-width=\"1209\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "marsmay",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 1165,
                        "header_focus_width": 1280,
                        "header_focus_height": 719,
                        "avatar_shape": "circle",
                        "background_color": "#A2B4BB",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "13,1280,732,0",
                        "header_image": "https://static.tumblr.com/6faade6069648a74a65a1e3b59e5c7cf/wh87fd2/Gxrpqzzxb/tumblr_static_1143284221-content.png",
                        "header_image_focused": "https://static.tumblr.com/63fcaad65ba85e8da37bfc94dfb29223/wh87fd2/d2wpqzzxf/tumblr_static_tumblr_static_1143284221-content_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/6faade6069648a74a65a1e3b59e5c7cf/wh87fd2/Gxrpqzzxb/tumblr_static_1143284221-content_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#060606",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#295660",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618391834"
                },
                "content_raw": "<p><p>Square Enix knows how to break my heart</p><figure class=\"tmblr-full\" data-orig-height=\"1501\" data-orig-width=\"1209\"><img src=\"https://66.media.tumblr.com/3052601898009e32f6af743b34476eda/tumblr_pt5x4ah0pT1sbaya9_540.png\" data-orig-height=\"1501\" data-orig-width=\"1209\"></figure></p>",
                "content": "<p><p>Square Enix knows how to break my heart</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/3052601898009e32f6af743b34476eda/tumblr_pt5x4ah0pT1sbaya9_540.png\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "jesiecastro",
        "blog": {
            "name": "jesiecastro",
            "title": "Jesie Castro",
            "description": "Hi! I'm Jesie. I draw stuff at Overheard Comics | MNL 🇵🇭  Art Prints available at society6.com/jesiecastro",
            "url": "https://jesiecastro.tumblr.com/",
            "uuid": "t:Jin9WA5qvic8ptIjoGvPtQ",
            "updated": 1560639458
        },
        "id": 185618391663,
        "post_url": "https://jesiecastro.tumblr.com/post/185618391663/happy-fathers-day",
        "slug": "happy-fathers-day",
        "date": "2019-06-15 22:57:37 GMT",
        "timestamp": 1560639457,
        "state": "published",
        "format": "html",
        "reblog_key": "OjUH5bnw",
        "tags": [
            "iron man",
            "tony stark",
            "arya stark",
            "marvel",
            "game of thrones",
            "Illustration",
            "illustrations",
            "art"
        ],
        "short_url": "https://tmblr.co/Z_ZiOx2itj_9l",
        "summary": "Happy Father’s Day",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 47,
        "caption": "<p>Happy Father’s Day<br/></p>",
        "reblog": {
            "comment": "<p>Happy Father’s Day<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jesiecastro",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 1280,
                        "header_focus_width": 1280,
                        "header_focus_height": 720,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "120,1280,840,0",
                        "header_image": "https://static.tumblr.com/47f21cdacb5bbdd75a5af60bcfe2cb13/3pdpukt/TP4ovkqu1/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/47f21cdacb5bbdd75a5af60bcfe2cb13/3pdpukt/QxMpix76m/tumblr_static_tumblr_static_filename_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/47f21cdacb5bbdd75a5af60bcfe2cb13/3pdpukt/TP4ovkqu1/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618391663"
                },
                "content_raw": "<p>Happy Father’s Day<br></p>",
                "content": "<p>Happy Father&rsquo;s Day<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://jesiecastro.tumblr.com/image/185618391663",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/dcfda4817e0a5185bccf2b51eed0149b/tumblr_pt5x419XVG1ql6revo1_1280.jpg",
                    "width": 1280,
                    "height": 1280
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/dcfda4817e0a5185bccf2b51eed0149b/tumblr_pt5x419XVG1ql6revo1_1280.jpg",
                        "width": 1280,
                        "height": 1280
                    },
                    {
                        "url": "https://66.media.tumblr.com/dcfda4817e0a5185bccf2b51eed0149b/tumblr_pt5x419XVG1ql6revo1_640.jpg",
                        "width": 640,
                        "height": 640
                    },
                    {
                        "url": "https://66.media.tumblr.com/dcfda4817e0a5185bccf2b51eed0149b/tumblr_pt5x419XVG1ql6revo1_540.jpg",
                        "width": 540,
                        "height": 540
                    },
                    {
                        "url": "https://66.media.tumblr.com/dcfda4817e0a5185bccf2b51eed0149b/tumblr_pt5x419XVG1ql6revo1_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/dcfda4817e0a5185bccf2b51eed0149b/tumblr_pt5x419XVG1ql6revo1_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/dcfda4817e0a5185bccf2b51eed0149b/tumblr_pt5x419XVG1ql6revo1_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/dcfda4817e0a5185bccf2b51eed0149b/tumblr_pt5x419XVG1ql6revo1_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/dcfda4817e0a5185bccf2b51eed0149b/tumblr_pt5x419XVG1ql6revo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "ao3feed-pepperony",
        "blog": {
            "name": "ao3feed-pepperony",
            "title": "Pepperony",
            "description": "Marvel comic and movie verse fan works from AO3.\n_____\nao3feedmonster@gmail.com",
            "url": "https://ao3feed-pepperony.tumblr.com/",
            "uuid": "t:-YHs_8fGH71IvgHne2CJyQ",
            "updated": 1561746205
        },
        "id": 185618275111,
        "post_url": "https://ao3feed-pepperony.tumblr.com/post/185618275111/five-times-tony-saved-peter-and-one-time-he",
        "slug": "five-times-tony-saved-peter-and-one-time-he",
        "date": "2019-06-15 22:50:44 GMT",
        "timestamp": 1560639044,
        "state": "published",
        "format": "html",
        "reblog_key": "ICHPIgIw",
        "tags": [
            "ao3feed",
            "fanfic",
            "tony stark",
            "pepper potts",
            "pepperony",
            "iron man"
        ],
        "short_url": "https://tmblr.co/ZD-iUs2itjXid",
        "summary": "Five Times Tony Saved Peter, and One Time He Didn’t Need To",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": "Five Times Tony Saved Peter, and One Time He Didn’t Need To",
        "body": "read it on the AO3 at <strong><a href=\"http://bit.ly/2WNFokM\">http://bit.ly/2WNFokM</a></strong><br/><p>by <a rel=\"author\" href=\"/users/TooTiredToTry/pseuds/TooTiredToTry\">TooTiredToTry</a></p><p>“You help me like, literally every second of everyday. I think it’s about time you start taking care of yourself.”</p><p>Words: 5580, Chapters: 1/1, Language: English</p><p>Series: Part 1 of <a href=\"http://archiveofourown.org/series/1392538\">The Irondad-Spiderson Content We Demand</a></p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\">Marvel Cinematic Universe</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\">No Archive Warnings Apply</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Gen/works\">Gen</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Shuri%20(Marvel)/works\">Shuri (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pepper%20Potts/works\">Pepper Potts</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/some%20random%20dude%20at%20the%20club/works\">some random dude at the club</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Friday%20(Marvel)/works\">Friday (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Happy%20Hogan/works\">Happy Hogan</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Michelle%20Jones/works\">Michelle Jones</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Aunt%20May/works\">Aunt May</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Leeds/works\">Ned Leeds</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Tony%20Stark/works\">Peter Parker &amp; Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/previous%20Tony%20Stark*s*Pepper%20Potts/works\">previous Tony Stark/Pepper Potts</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spiderson%20*a*%20irondad/works\">Spiderson &amp; irondad</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Hurt%20Peter%20Parker/works\">Hurt Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/these%20two%20give%20me%20life/works\">these two give me life</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20-%20Freeform/works\">Marvel - Freeform</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/ruined%20me/works\">ruined me</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/i%20hate%20this%20more%20than%20you%20do/works\">i hate this more than you do</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tags%20Are%20Hard/works\">Tags Are Hard</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/5+1%20Things/works\">5+1 Things</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/because%20im%20relevant/works\">because im relevant</a></li></ul><br/><br/>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2WNFokM\">http://bit.ly/2WNFokM</a></strong>",
        "reblog": {
            "comment": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2WNFokM\">http://bit.ly/2WNFokM</a></strong><br><p>by <a rel=\"author\" href=\"/users/TooTiredToTry/pseuds/TooTiredToTry\">TooTiredToTry</a></p><p>“You help me like, literally every second of everyday. I think it’s about time you start taking care of yourself.”</p><p>Words: 5580, Chapters: 1/1, Language: English</p><p>Series: Part 1 of <a href=\"http://archiveofourown.org/series/1392538\">The Irondad-Spiderson Content We Demand</a></p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\">Marvel Cinematic Universe</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\">No Archive Warnings Apply</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Gen/works\">Gen</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Shuri%20(Marvel)/works\">Shuri (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pepper%20Potts/works\">Pepper Potts</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/some%20random%20dude%20at%20the%20club/works\">some random dude at the club</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Friday%20(Marvel)/works\">Friday (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Happy%20Hogan/works\">Happy Hogan</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Michelle%20Jones/works\">Michelle Jones</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Aunt%20May/works\">Aunt May</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Leeds/works\">Ned Leeds</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Tony%20Stark/works\">Peter Parker &amp; Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/previous%20Tony%20Stark*s*Pepper%20Potts/works\">previous Tony Stark/Pepper Potts</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spiderson%20*a*%20irondad/works\">Spiderson &amp; irondad</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Hurt%20Peter%20Parker/works\">Hurt Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/these%20two%20give%20me%20life/works\">these two give me life</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20-%20Freeform/works\">Marvel - Freeform</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/ruined%20me/works\">ruined me</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/i%20hate%20this%20more%20than%20you%20do/works\">i hate this more than you do</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tags%20Are%20Hard/works\">Tags Are Hard</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/5+1%20Things/works\">5+1 Things</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/because%20im%20relevant/works\">because im relevant</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2WNFokM\">http://bit.ly/2WNFokM</a></strong></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ao3feed-pepperony",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_04.png?_v=7c4e5e82cf797042596e2e64af1c383f",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_04_focused_v3.png?_v=7c4e5e82cf797042596e2e64af1c383f",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_04_focused_v3.png?_v=7c4e5e82cf797042596e2e64af1c383f",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618275111"
                },
                "content_raw": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2WNFokM\">http://bit.ly/2WNFokM</a></strong><br><p>by <a rel=\"author\" href=\"/users/TooTiredToTry/pseuds/TooTiredToTry\">TooTiredToTry</a></p><p>“You help me like, literally every second of everyday. I think it’s about time you start taking care of yourself.”</p><p>Words: 5580, Chapters: 1/1, Language: English</p><p>Series: Part 1 of <a href=\"http://archiveofourown.org/series/1392538\">The Irondad-Spiderson Content We Demand</a></p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\">Marvel Cinematic Universe</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\">No Archive Warnings Apply</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Gen/works\">Gen</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Shuri%20(Marvel)/works\">Shuri (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pepper%20Potts/works\">Pepper Potts</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/some%20random%20dude%20at%20the%20club/works\">some random dude at the club</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Friday%20(Marvel)/works\">Friday (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Happy%20Hogan/works\">Happy Hogan</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Michelle%20Jones/works\">Michelle Jones</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Aunt%20May/works\">Aunt May</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Ned%20Leeds/works\">Ned Leeds</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Tony%20Stark/works\">Peter Parker &amp; Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/previous%20Tony%20Stark*s*Pepper%20Potts/works\">previous Tony Stark/Pepper Potts</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spiderson%20*a*%20irondad/works\">Spiderson &amp; irondad</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Hurt%20Peter%20Parker/works\">Hurt Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/these%20two%20give%20me%20life/works\">these two give me life</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20-%20Freeform/works\">Marvel - Freeform</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/ruined%20me/works\">ruined me</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/i%20hate%20this%20more%20than%20you%20do/works\">i hate this more than you do</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tags%20Are%20Hard/works\">Tags Are Hard</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/5+1%20Things/works\">5+1 Things</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/because%20im%20relevant/works\">because im relevant</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2WNFokM\">http://bit.ly/2WNFokM</a></strong></p>",
                "content": "<p><p>read it on the AO3 at <strong><a href=\"http://bit.ly/2WNFokM\">http://bit.ly/2WNFokM</a></strong><br /></p><p>by <a href=\"/users/TooTiredToTry/pseuds/TooTiredToTry\">TooTiredToTry</a></p><p>&ldquo;You help me like, literally every second of everyday. I think it&rsquo;s about time you start taking care of yourself.&rdquo;</p><p>Words: 5580, Chapters: 1/1, Language: English</p><p>Series: Part 1 of <a href=\"http://archiveofourown.org/series/1392538\">The Irondad-Spiderson Content We Demand</a></p><ul><li>Fandoms: <a href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\">Marvel Cinematic Universe</a></li><li>Rating: <a href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a></li><li>Warnings: <a href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\">No Archive Warnings Apply</a></li><li>Categories: <a href=\"http://archiveofourown.org/tags/Gen/works\">Gen</a></li><li>Characters: <a href=\"http://archiveofourown.org/tags/Peter%20Parker/works\">Peter Parker</a>, <a href=\"http://archiveofourown.org/tags/Tony%20Stark/works\">Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/Shuri%20(Marvel)/works\">Shuri (Marvel)</a>, <a href=\"http://archiveofourown.org/tags/Pepper%20Potts/works\">Pepper Potts</a>, <a href=\"http://archiveofourown.org/tags/some%20random%20dude%20at%20the%20club/works\">some random dude at the club</a>, <a href=\"http://archiveofourown.org/tags/Friday%20(Marvel)/works\">Friday (Marvel)</a>, <a href=\"http://archiveofourown.org/tags/Happy%20Hogan/works\">Happy Hogan</a>, <a href=\"http://archiveofourown.org/tags/Michelle%20Jones/works\">Michelle Jones</a>, <a href=\"http://archiveofourown.org/tags/Aunt%20May/works\">Aunt May</a>, <a href=\"http://archiveofourown.org/tags/Ned%20Leeds/works\">Ned Leeds</a></li><li>Relationships: <a href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Tony%20Stark/works\">Peter Parker &amp; Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/previous%20Tony%20Stark*s*Pepper%20Potts/works\">previous Tony Stark/Pepper Potts</a></li><li>Additional Tags: <a href=\"http://archiveofourown.org/tags/Spiderson%20*a*%20irondad/works\">Spiderson &amp; irondad</a>, <a href=\"http://archiveofourown.org/tags/Hurt%20Peter%20Parker/works\">Hurt Peter Parker</a>, <a href=\"http://archiveofourown.org/tags/these%20two%20give%20me%20life/works\">these two give me life</a>, <a href=\"http://archiveofourown.org/tags/Marvel%20-%20Freeform/works\">Marvel - Freeform</a>, <a href=\"http://archiveofourown.org/tags/ruined%20me/works\">ruined me</a>, <a href=\"http://archiveofourown.org/tags/i%20hate%20this%20more%20than%20you%20do/works\">i hate this more than you do</a>, <a href=\"http://archiveofourown.org/tags/Tags%20Are%20Hard/works\">Tags Are Hard</a>, <a href=\"http://archiveofourown.org/tags/5+1%20Things/works\">5+1 Things</a>, <a href=\"http://archiveofourown.org/tags/because%20im%20relevant/works\">because im relevant</a></li></ul><br /><br />\nread it on the AO3 at <strong><a href=\"http://bit.ly/2WNFokM\">http://bit.ly/2WNFokM</a></strong></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "cis-jester",
        "blog": {
            "name": "cis-jester",
            "title": "penis",
            "description": "*Cha Cha slides off roof*",
            "url": "https://cis-jester.tumblr.com/",
            "uuid": "t:h3bum85B4hTI3s6PDMrwTg",
            "updated": 1561581006
        },
        "id": 185618246334,
        "post_url": "https://cis-jester.tumblr.com/post/185618246334/help",
        "slug": "help",
        "date": "2019-06-15 22:48:57 GMT",
        "timestamp": 1560638937,
        "state": "published",
        "format": "html",
        "reblog_key": "K1EklYSL",
        "tags": [
            "marvel",
            "spiderman",
            "tom holland",
            "spider man",
            "tony stark",
            "iron man",
            "captain marvel",
            "captain america",
            "idk",
            "wtf",
            "wtf is wrong with me",
            "wtf is this",
            "help",
            "meme",
            "marvel meme",
            "help me please"
        ],
        "short_url": "https://tmblr.co/ZrVnUZ2itjQg_",
        "summary": "Help",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 97,
        "title": null,
        "body": "<p>Help</p><figure class=\"tmblr-full\" data-orig-height=\"864\" data-orig-width=\"853\"><img src=\"https://66.media.tumblr.com/7a3715ef43788c736213b7d2ccc4109e/tumblr_pt5wplYRmn1w211x4_540.jpg\" data-orig-height=\"864\" data-orig-width=\"853\"/></figure>",
        "reblog": {
            "comment": "<p><p>Help</p><figure class=\"tmblr-full\" data-orig-height=\"864\" data-orig-width=\"853\"><img src=\"https://66.media.tumblr.com/7a3715ef43788c736213b7d2ccc4109e/tumblr_pt5wplYRmn1w211x4_540.jpg\" data-orig-height=\"864\" data-orig-width=\"853\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "cis-jester",
                    "active": true,
                    "theme": {
                        "header_full_width": 480,
                        "header_full_height": 480,
                        "header_focus_width": 480,
                        "header_focus_height": 270,
                        "avatar_shape": "square",
                        "background_color": "#FFDC4E",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "84,480,354,0",
                        "header_image": "https://static.tumblr.com/d4bff7a509d1ca8dbbffac3248ed4b92/xdapcak/7Vkppew3h/tumblr_static_1114888568-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/716a9d65ab91a4aa262a3351d4543423/xdapcak/dEnppew3i/tumblr_static_tumblr_static_1114888568-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/d4bff7a509d1ca8dbbffac3248ed4b92/xdapcak/7Vkppew3h/tumblr_static_1114888568-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#27503C",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618246334"
                },
                "content_raw": "<p><p>Help</p><figure class=\"tmblr-full\" data-orig-height=\"864\" data-orig-width=\"853\"><img src=\"https://66.media.tumblr.com/7a3715ef43788c736213b7d2ccc4109e/tumblr_pt5wplYRmn1w211x4_540.jpg\" data-orig-height=\"864\" data-orig-width=\"853\"></figure></p>",
                "content": "<p><p>Help</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/7a3715ef43788c736213b7d2ccc4109e/tumblr_pt5wplYRmn1w211x4_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "nanime13",
        "blog": {
            "name": "nanime13",
            "title": "NaniMe",
            "description": "I like to draw for my favorite ships <3 so I keep trying to get better",
            "url": "https://nanime13.tumblr.com/",
            "uuid": "t:1m3dCK0jBcaOzH5-aZox_w",
            "updated": 1561646265
        },
        "id": 185618217441,
        "post_url": "https://nanime13.tumblr.com/post/185618217441/i-was-happy-watching-gameplays-of-avengers",
        "slug": "i-was-happy-watching-gameplays-of-avengers",
        "date": "2019-06-15 22:47:11 GMT",
        "timestamp": 1560638831,
        "state": "published",
        "format": "html",
        "reblog_key": "A0AuBq2t",
        "tags": [
            "stony",
            "hydra steve",
            "avac tony",
            "tony stark",
            "Steve Rogers",
            "Avengers Academy",
            "captain america",
            "Iron Man",
            "tony stark x steve rogers"
        ],
        "short_url": "https://tmblr.co/ZvPKiq2itjJdX",
        "summary": "I was happy watching gameplays of Avengers Academy, and suddenly this came to my head and I couldn’t stop thinking about it so I...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 154,
        "caption": "<p>I was happy watching gameplays of Avengers Academy, and suddenly this came to my head and I couldn’t stop thinking about it so I just drew it.</p><p>AvAc!Tony x Hydra!Steve !! or maybe without the “x” I’m not sure how this could be.</p>",
        "reblog": {
            "comment": "<p>I was happy watching gameplays of Avengers Academy, and suddenly this came to my head and I couldn’t stop thinking about it so I just drew it.</p><p>AvAc!Tony x Hydra!Steve !! or maybe without the “x” I’m not sure how this could be.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "nanime13",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#a9e4d6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_14.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_14_focused_v3.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_14_focused_v3.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#613d12",
                        "title_font": "Typewriter FS",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185618217441"
                },
                "content_raw": "<p>I was happy watching gameplays of Avengers Academy, and suddenly this came to my head and I couldn’t stop thinking about it so I just drew it.</p><p>AvAc!Tony x Hydra!Steve !! or maybe without the “x” I’m not sure how this could be.</p>",
                "content": "<p>I was happy watching gameplays of Avengers Academy, and suddenly this came to my head and I couldn&rsquo;t stop thinking about it so I just drew it.</p><p>AvAc!Tony x Hydra!Steve !! or maybe without the&nbsp;&ldquo;x&rdquo; I&rsquo;m not sure how this could be.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://nanime13.tumblr.com/image/185618217441",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/799cd664c62fb20f5160cdd5ad0d072d/tumblr_pt5wmn7a8b1sg1opmo1_1280.jpg",
                    "width": 1280,
                    "height": 1280
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/799cd664c62fb20f5160cdd5ad0d072d/tumblr_pt5wmn7a8b1sg1opmo1_1280.jpg",
                        "width": 1280,
                        "height": 1280
                    },
                    {
                        "url": "https://66.media.tumblr.com/799cd664c62fb20f5160cdd5ad0d072d/tumblr_pt5wmn7a8b1sg1opmo1_640.jpg",
                        "width": 640,
                        "height": 640
                    },
                    {
                        "url": "https://66.media.tumblr.com/799cd664c62fb20f5160cdd5ad0d072d/tumblr_pt5wmn7a8b1sg1opmo1_540.jpg",
                        "width": 540,
                        "height": 540
                    },
                    {
                        "url": "https://66.media.tumblr.com/799cd664c62fb20f5160cdd5ad0d072d/tumblr_pt5wmn7a8b1sg1opmo1_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/799cd664c62fb20f5160cdd5ad0d072d/tumblr_pt5wmn7a8b1sg1opmo1_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/799cd664c62fb20f5160cdd5ad0d072d/tumblr_pt5wmn7a8b1sg1opmo1_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/799cd664c62fb20f5160cdd5ad0d072d/tumblr_pt5wmn7a8b1sg1opmo1_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/799cd664c62fb20f5160cdd5ad0d072d/tumblr_pt5wmn7a8b1sg1opmo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]