[
    {
        "type": "text",
        "blog_name": "luniellar",
        "blog": {
            "name": "luniellar",
            "title": "luniellar",
            "description": "[ hopeless romantic ] multi-fandom: kpop, marvel, kdrama and anime || special love for: chris evans, jeon jungkook, gong yoo, & yamada ryosuke",
            "url": "https://luniellar.tumblr.com/",
            "uuid": "t:AjgURzGrP8JanXxNI8OW6A",
            "updated": 1561759947
        },
        "id": 185689786338,
        "post_url": "https://luniellar.tumblr.com/post/185689786338/deal-chris-evans-x-reader-one-shot",
        "slug": "deal-chris-evans-x-reader-one-shot",
        "date": "2019-06-18 23:45:58 GMT",
        "timestamp": 1560901558,
        "state": "published",
        "format": "html",
        "reblog_key": "bvchpGX6",
        "tags": [
            "Chris Evans",
            "chris evans x reader",
            "chris evans imagine",
            "chrisevans",
            "fluff",
            "fanfic",
            "fanfiction",
            "smut",
            "some smut",
            "beach",
            "child",
            "baby",
            "dodger",
            "oneshot",
            "one shot",
            "turtle",
            "kiss",
            "lips",
            "love",
            "romance",
            "slice of life",
            "daughter",
            "luniellar",
            "luniellar fiction",
            "reader"
        ],
        "short_url": "https://tmblr.co/Zph7ra2ix_KVY",
        "summary": "Deal - Chris Evans x Reader (One Shot)",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 346,
        "title": "Deal - Chris Evans x Reader (One Shot)",
        "body": "<p><b>A/N:</b> I wanted to take a short break from all the seriousness of my running fic <a href=\"https://luniellar.tumblr.com/post/185689925743/masterlist-its-you-chris-evans-sebastian\">“It’s You”</a> to write a cute and fluffy one shot. I was itching to write cute scenarios, <i>gah</i>. I know it’s a one-shot, but the idea of exploring a random life moments with Chris and kids is everything so I might do a series style that requires no context, just fluff moments.<br/></p><p><b>Summary:</b> Just a slice of life featuring your husband, daughter, and dog. Oh, did I mention that your husband is Chris Evans? <i>Yup, I got your attention now</i>. </p><p><b>Warnings: </b>Not full on smut, but we get pretty close.</p><p><b>Word Count: </b>1.6K</p><figure data-orig-width=\"500\" data-orig-height=\"281\" data-tumblr-attribution=\"gajo1987:Yq4B3gLSPJ00tqmTdEMtqg:ZxK2El2d-CQ4K\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/19dd66c6b4939ee42103e8fe2beb7cbe/tumblr_pigzu2YgXS1uocsx1o1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"281\"/></figure><!-- more --><p>The warm sunlight embraced my skin as a mix of soft blades of grass and sand tickled my feet. I threw the worn blanket on the field and dropped the picnic basket. As if that was his cue, Dodger casually walked over and sat on the edge of the blanket. I turned around and crouched down to Emily’s level.</p><p>“Okay, what did we promise?” I asked.<br/></p><p>Her brilliant blue eyes stared back at me. “No cookies after eight.”<br/></p><p>I tried so hard to not smile. She had her father’s humor. “Emily Lisa Evans,” I said back sternly, narrowing my eyebrows.<br/></p><p>“I know, mommy. I won’t go off too far.”<br/></p><p>“You promised,” I sighed. “I’m going to tattle on you if you break your promise.”<br/></p><p>After Emily hastily nodded in understanding, I watched as she ran across the sand leaving tiny footprints behind her. Her soft blonde hair blew freely in the salty breeze. She went about six steps before turning around to wave at me with her little hand. I waved back with a smile.<br/></p><p>Emily plopped down on the sand close to the water and Dodger got up from his seat and ran over to her. He sat next to her protectively as she dug her hands in the sand.<br/></p><p>“Good boy,” I whispered. </p><p>I turned around and sat down on the blanket. I took off the towel I had wrapped around my shoulder and placed it next to the basket. I felt the warmth against my bare shoulders and back. Adjusting my bikini top, I reached around for the phone I stuck in the basket.</p><p>I had one text message from him.<br/></p><p><br/></p><p><b>I’ll see you soon.</b></p><p><br/></p><p>I put the phone down and looked over at Emily who already had a pile of sand half of her sitting height. Dodger was just lying on the sand watching her. Occasionally, she would take some of the sand and place it on top of Dodger’s paw giggling. Dodger watched her unimpressed.</p><p>It was moments like this that helped me forget about everything else going on in the world. The moments that made me wonder if I had been a superhero in my past life and I was enjoying all the good karma I built up now.<br/></p><p><i>Emily, Dodger, and Chris. I couldn’t have asked for a better daughter, dog, and husband.</i><br/></p><p><br/></p><p>“We did well.”<br/></p><p><br/></p><p>I immediately turned at the sound of his familiar voice. Chris was wearing simple khaki shorts with a tight-fitting white t-shirt. He knew I loved the way the fabric tugged over his broad shoulders and chest. In his right hand, he was carrying a small ice box. Smiling, I immediately got up from my seat and ran over. I jumped into his arms wrapping my arms around his neck. His familiar scent of home greeted me and his beard tickled my face.</p><p>“Hey,” he whispered into my ear. I heard a small thud as the icebox dropped from his hand to the soft sandy surface. His arms wrapped around my waist and lifted my feet off the floor. He held my body close to him.<br/></p><p>“I missed you,” I said back and I felt his head burrow in my neck. His warm breath passed through my skin and my heart started to thump in my ears. How badly I wanted to just claw through his shirt right here.<br/></p><p>“<i>Y/N</i>,” he said as he slowly placed me down. His crystal blue eyes looked even clearer and bluer in the direct sunlight shining down his face. As he leaned in for a kiss, I heard Emily’s cheerful voice.<br/></p><p>“Daddy!”<br/></p><p>Keeping one arm around my waist, he easily picked up Emily with other arm and pulled her into a family hug. Emily’s arms barely wrapped around Chris’ neck. The sand from her hands brushed up against his porcelain skin.<br/></p><p>“Hey princess,” he laughed as he kissed her forehead.<br/></p><p>“Mommy never told me that you were coming!” She exclaimed. Dodger barked and circled around us wagging his tail.<br/></p><p>“Because,” he said after a short pause. “I wanted to surprise <i>you</i>.”<br/></p><p>Emily grinned and rested her head on his shoulders. I softly pat her back like she was our newborn baby again. This moment took me right back to the hospital when Chris held our girl for the first time. I was speechless when I first saw Emily, but I sobbed the first time I saw Chris hold her tiny fragile body in his arms. We stayed like that until Emily lifted her head and looked up at Chris.<br/></p><p>“Are you going to help me build my castle?” She asked.<br/></p><p>He had a permanent smile on his face whenever he looked at her. “Of course, princess. But, can you give me 10 minutes with the queen first?” He nudged in my direction. <br/></p><p>Emily nodded granting him permission and Chris set her back down. Dodger was sitting by Chris patiently with his tail wagging, lifting the sand off the ground. Chris gave him a scratch on his head. “Hey, Bubba.”<br/></p><p>When Emily ran off again and Dodger followed after her. When she was back at the pile of sand she was gathering, he pulled me closer to him with the same arm already around my waist and kissed my forehead with a series of pecks, one after another.<br/></p><p>“Your queen?” I jokingly laughed at his adorableness as his beard tickled my forehead with each peck. Eventually, when he stopped I wrapped my arms around his waist. “Does that make you my king?”<br/></p><p>He grinned proudly. “Yes, my queen.”<br/></p><p>“I thought of you more like a knight in shining armor kind of deal.”<br/></p><p>His eyebrows furrowed. “That’s our Dodger, <i>Y/N</i>.”<br/></p><p>I contemplated it for a second and nodded giving in. “Fine. But, I honestly thought the secret love story between the queen and the knight would be more <i>sexually charged</i>.”<br/></p><p>He laughed out loud. “Damn, is that what you’ve been up to when your king is not around?”<br/></p><p>I shrugged and in one fluid motion, Chris swept me off my feet effortlessly. He had one arm holding my back and the other behind my knees as he walked us over to the blanket. After softly placing me down, he walked back to grab his small ice box.<br/></p><p>“What is that?” I asked.<br/></p><p>“I’ll tell you if you pledge your allegiance back to me,” he joked.<br/></p><p>I lifted my right hand up and held it in the air. Then, I placed it over my heart and bowed my head. “My king.”<br/></p><p>When I didn’t hear a response, I looked up and peeked to find out that Chris had his back turned against me.<br/></p><p>“I can’t believe this, Chris!” I shouted and I heard him chuckle.<br/></p><p>“Hold on.”<br/></p><p>When he turned back around he had his two hands together as if he was holding something fragile. I glanced down to find a baby turtle in his hands. It was barely the size of my fingernail.<br/></p><p>“Oh my gosh,” I whispered trying to stay quiet as possible. I was scared of blowing it away with an exhale.<br/></p><p>“The little guy was out by the asphalt. I don’t think he realized that he was heading in the wrong direction.”<br/></p><p>“What do we do with it?”<br/></p><p>“The lifeguard suggested that I should either place back in the waters or take it home. I was going to ask Emily what she wanted to do.”<br/></p><p>“Okay,” I said back as I leaned in closer to his hands. “It’s so tiny, Look at its little feet.”</p><p>I didn’t realize how close I leaned in until I looked away and saw Chris’ face inches away from mine. “Just a second,” he said. He moved fast as he placed the turtle back. When he turned back to me, he immediately grabbed me without any hesitation. He leaned in and our lips touched. Our kiss started out cute like a quick “miss you” text and very quickly progressed to our tongues begging for each other.</p><p>When our lips pulled apart, our forehead remained touching. Our staggered breathing clashed with each other as I held back the urge to pin him down on this blanket. When I closed my eyes, I felt his head move. His lips grazed against mine.</p><p>“Baby,” he cooed in his deep voice. “I want you so bad right now, <i>Y/N</i>”</p><p>I moved my hands on top of his chest. I felt his warmth against my hands as I playfully tugged at his shirt. “I want you even more,” I whispered back.</p><p>He leaned closer, placed a hand on my back for support and lowered me down until my back touched the floor. He quickly adjusted his body on top of mine, digging each knee by my hips. His palms were by my shoulders holding himself up from crushing me. I lifted my hands and caressed his face, feeling his scruffy beard. His blue eyes matched the picture-perfect blue sky backdrop behind him.</p><p>I grabbed the collar of his t-shirt and tugged it down closer to me. Our lips slow danced together, each one taking turns leading the dance. I felt his fingers trace my collarbone.</p><p>“Daddy!” Emily called out.</p><p>Chris reluctantly pulled away and turned to face in her direction. “Okay, I’m coming!’</p><p>I giggled when he turned back to me. “To be fair, you know she sat there and counted 10 minutes. She counted to thirty the other day.”</p><p>He raised his eyebrows in surprise. “She’s got your brains,” he said defeatedly. He got up first and reached out a hand and helped me up.</p><p>“We’re not done. Don’t leave me hanging,” I replied and he grinned.</p><p>“So, I was thinking,” he said as he took a step on the sand. “How about another son&hellip; a little Chris since we already have a little <i>Y/N</i>?”</p><p>“Chris… you can’t just say things like that.”</p><p>“You know, I was serious about a big family when we were getting married. One could be the president, one could be an athlete, one could be a doctor…” His voice faded as he walked further away.</p><p>I sighed as I got up and ran over to him. Before I passed him, I stopped to look over. “President, athlete, and doctor that’s it. I’m maxing out at three kids.”</p><p>I heard his laughter as he caught up in two full steps and lifted me off the floor with one arm.</p><p>“Deal.”</p>",
        "body_abstract": "\n<p><b>A/N:</b> I wanted to take a short break from all the seriousness of my running fic <a href=\"https://luniellar.tumblr.com/post/185689925743/masterlist-its-you-chris-evans-sebastian\">&ldquo;It&rsquo;s You&rdquo;</a> to write a cute and fluffy one shot. I was itching to write cute scenarios, <i>gah</i>. I know it&rsquo;s a one-shot, but the idea of exploring a random life moments with Chris and kids is everything so I might do a series style that requires no context, just fluff moments.<br></p>\n<p><b>Summary:</b> Just a slice of life featuring your husband, daughter, and dog. Oh, did I mention that your husband is Chris Evans? <i>Yup, I got your attention now</i>.&nbsp;</p>\n<p><b>Warnings: </b>Not full on smut, but we get pretty close.</p>\n<p><b>Word Count: </b>1.6K</p>\n<figure data-orig-width=\"500\" data-orig-height=\"281\" data-tumblr-attribution=\"gajo1987:Yq4B3gLSPJ00tqmTdEMtqg:ZxK2El2d-CQ4K\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/19dd66c6b4939ee42103e8fe2beb7cbe/tumblr_pigzu2YgXS1uocsx1o1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"281\"></figure>\n",
        "reblog": {
            "comment": "<p><b>A/N:</b> I wanted to take a short break from all the seriousness of my running fic <a href=\"https://luniellar.tumblr.com/post/185689925743/masterlist-its-you-chris-evans-sebastian\">“It’s You”</a> to write a cute and fluffy one shot. I was itching to write cute scenarios, <i>gah</i>. I know it’s a one-shot, but the idea of exploring a random life moments with Chris and kids is everything so I might do a series style that requires no context, just fluff moments.<br></p><p><b>Summary:</b> Just a slice of life featuring your husband, daughter, and dog. Oh, did I mention that your husband is Chris Evans? <i>Yup, I got your attention now</i>. </p><p><b>Warnings: </b>Not full on smut, but we get pretty close.</p><p><b>Word Count: </b>1.6K</p><figure data-orig-width=\"500\" data-orig-height=\"281\" data-tumblr-attribution=\"gajo1987:Yq4B3gLSPJ00tqmTdEMtqg:ZxK2El2d-CQ4K\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/19dd66c6b4939ee42103e8fe2beb7cbe/tumblr_pigzu2YgXS1uocsx1o1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"281\"></figure>[[MORE]]<p>The warm sunlight embraced my skin as a mix of soft blades of grass and sand tickled my feet. I threw the worn blanket on the field and dropped the picnic basket. As if that was his cue, Dodger casually walked over and sat on the edge of the blanket. I turned around and crouched down to Emily’s level.</p><p>“Okay, what did we promise?” I asked.<br></p><p>Her brilliant blue eyes stared back at me. “No cookies after eight.”<br></p><p>I tried so hard to not smile. She had her father’s humor. “Emily Lisa Evans,” I said back sternly, narrowing my eyebrows.<br></p><p>“I know, mommy. I won’t go off too far.”<br></p><p>“You promised,” I sighed. “I’m going to tattle on you if you break your promise.”<br></p><p>After Emily hastily nodded in understanding, I watched as she ran across the sand leaving tiny footprints behind her. Her soft blonde hair blew freely in the salty breeze. She went about six steps before turning around to wave at me with her little hand. I waved back with a smile.<br></p><p>Emily plopped down on the sand close to the water and Dodger got up from his seat and ran over to her. He sat next to her protectively as she dug her hands in the sand.<br></p><p>“Good boy,” I whispered. </p><p>I turned around and sat down on the blanket. I took off the towel I had wrapped around my shoulder and placed it next to the basket. I felt the warmth against my bare shoulders and back. Adjusting my bikini top, I reached around for the phone I stuck in the basket.</p><p>I had one text message from him.<br></p><p><br></p><p><b>I’ll see you soon.</b></p><p><br></p><p>I put the phone down and looked over at Emily who already had a pile of sand half of her sitting height. Dodger was just lying on the sand watching her. Occasionally, she would take some of the sand and place it on top of Dodger’s paw giggling. Dodger watched her unimpressed.</p><p>It was moments like this that helped me forget about everything else going on in the world. The moments that made me wonder if I had been a superhero in my past life and I was enjoying all the good karma I built up now.<br></p><p><i>Emily, Dodger, and Chris. I couldn’t have asked for a better daughter, dog, and husband.</i><br></p><p><br></p><p>“We did well.”<br></p><p><br></p><p>I immediately turned at the sound of his familiar voice. Chris was wearing simple khaki shorts with a tight-fitting white t-shirt. He knew I loved the way the fabric tugged over his broad shoulders and chest. In his right hand, he was carrying a small ice box. Smiling, I immediately got up from my seat and ran over. I jumped into his arms wrapping my arms around his neck. His familiar scent of home greeted me and his beard tickled my face.</p><p>“Hey,” he whispered into my ear. I heard a small thud as the icebox dropped from his hand to the soft sandy surface. His arms wrapped around my waist and lifted my feet off the floor. He held my body close to him.<br></p><p>“I missed you,” I said back and I felt his head burrow in my neck. His warm breath passed through my skin and my heart started to thump in my ears. How badly I wanted to just claw through his shirt right here.<br></p><p>“<i>Y/N</i>,” he said as he slowly placed me down. His crystal blue eyes looked even clearer and bluer in the direct sunlight shining down his face. As he leaned in for a kiss, I heard Emily’s cheerful voice.<br></p><p>“Daddy!”<br></p><p>Keeping one arm around my waist, he easily picked up Emily with other arm and pulled her into a family hug. Emily’s arms barely wrapped around Chris’ neck. The sand from her hands brushed up against his porcelain skin.<br></p><p>“Hey princess,” he laughed as he kissed her forehead.<br></p><p>“Mommy never told me that you were coming!” She exclaimed. Dodger barked and circled around us wagging his tail.<br></p><p>“Because,” he said after a short pause. “I wanted to surprise <i>you</i>.”<br></p><p>Emily grinned and rested her head on his shoulders. I softly pat her back like she was our newborn baby again. This moment took me right back to the hospital when Chris held our girl for the first time. I was speechless when I first saw Emily, but I sobbed the first time I saw Chris hold her tiny fragile body in his arms. We stayed like that until Emily lifted her head and looked up at Chris.<br></p><p>“Are you going to help me build my castle?” She asked.<br></p><p>He had a permanent smile on his face whenever he looked at her. “Of course, princess. But, can you give me 10 minutes with the queen first?” He nudged in my direction. <br></p><p>Emily nodded granting him permission and Chris set her back down. Dodger was sitting by Chris patiently with his tail wagging, lifting the sand off the ground. Chris gave him a scratch on his head. “Hey, Bubba.”<br></p><p>When Emily ran off again and Dodger followed after her. When she was back at the pile of sand she was gathering, he pulled me closer to him with the same arm already around my waist and kissed my forehead with a series of pecks, one after another.<br></p><p>“Your queen?” I jokingly laughed at his adorableness as his beard tickled my forehead with each peck. Eventually, when he stopped I wrapped my arms around his waist. “Does that make you my king?”<br></p><p>He grinned proudly. “Yes, my queen.”<br></p><p>“I thought of you more like a knight in shining armor kind of deal.”<br></p><p>His eyebrows furrowed. “That’s our Dodger, <i>Y/N</i>.”<br></p><p>I contemplated it for a second and nodded giving in. “Fine. But, I honestly thought the secret love story between the queen and the knight would be more <i>sexually charged</i>.”<br></p><p>He laughed out loud. “Damn, is that what you’ve been up to when your king is not around?”<br></p><p>I shrugged and in one fluid motion, Chris swept me off my feet effortlessly. He had one arm holding my back and the other behind my knees as he walked us over to the blanket. After softly placing me down, he walked back to grab his small ice box.<br></p><p>“What is that?” I asked.<br></p><p>“I’ll tell you if you pledge your allegiance back to me,” he joked.<br></p><p>I lifted my right hand up and held it in the air. Then, I placed it over my heart and bowed my head. “My king.”<br></p><p>When I didn’t hear a response, I looked up and peeked to find out that Chris had his back turned against me.<br></p><p>“I can’t believe this, Chris!” I shouted and I heard him chuckle.<br></p><p>“Hold on.”<br></p><p>When he turned back around he had his two hands together as if he was holding something fragile. I glanced down to find a baby turtle in his hands. It was barely the size of my fingernail.<br></p><p>“Oh my gosh,” I whispered trying to stay quiet as possible. I was scared of blowing it away with an exhale.<br></p><p>“The little guy was out by the asphalt. I don’t think he realized that he was heading in the wrong direction.”<br></p><p>“What do we do with it?”<br></p><p>“The lifeguard suggested that I should either place back in the waters or take it home. I was going to ask Emily what she wanted to do.”<br></p><p>“Okay,” I said back as I leaned in closer to his hands. “It’s so tiny, Look at its little feet.”</p><p>I didn’t realize how close I leaned in until I looked away and saw Chris’ face inches away from mine. “Just a second,” he said. He moved fast as he placed the turtle back. When he turned back to me, he immediately grabbed me without any hesitation. He leaned in and our lips touched. Our kiss started out cute like a quick “miss you” text and very quickly progressed to our tongues begging for each other.</p><p>When our lips pulled apart, our forehead remained touching. Our staggered breathing clashed with each other as I held back the urge to pin him down on this blanket. When I closed my eyes, I felt his head move. His lips grazed against mine.</p><p>“Baby,” he cooed in his deep voice. “I want you so bad right now, <i>Y/N</i>”</p><p>I moved my hands on top of his chest. I felt his warmth against my hands as I playfully tugged at his shirt. “I want you even more,” I whispered back.</p><p>He leaned closer, placed a hand on my back for support and lowered me down until my back touched the floor. He quickly adjusted his body on top of mine, digging each knee by my hips. His palms were by my shoulders holding himself up from crushing me. I lifted my hands and caressed his face, feeling his scruffy beard. His blue eyes matched the picture-perfect blue sky backdrop behind him.</p><p>I grabbed the collar of his t-shirt and tugged it down closer to me. Our lips slow danced together, each one taking turns leading the dance. I felt his fingers trace my collarbone.</p><p>“Daddy!” Emily called out.</p><p>Chris reluctantly pulled away and turned to face in her direction. “Okay, I’m coming!’</p><p>I giggled when he turned back to me. “To be fair, you know she sat there and counted 10 minutes. She counted to thirty the other day.”</p><p>He raised his eyebrows in surprise. “She’s got your brains,” he said defeatedly. He got up first and reached out a hand and helped me up.</p><p>“We’re not done. Don’t leave me hanging,” I replied and he grinned.</p><p>“So, I was thinking,” he said as he took a step on the sand. “How about another son… a little Chris since we already have a little <i>Y/N</i>?”</p><p>“Chris… you can’t just say things like that.”</p><p>“You know, I was serious about a big family when we were getting married. One could be the president, one could be an athlete, one could be a doctor…” His voice faded as he walked further away.</p><p>I sighed as I got up and ran over to him. Before I passed him, I stopped to look over. “President, athlete, and doctor that’s it. I’m maxing out at three kids.”</p><p>I heard his laughter as he caught up in two full steps and lifted me off the floor with one arm.</p><p>“Deal.”</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "luniellar",
                    "active": true,
                    "theme": {
                        "header_full_width": 540,
                        "header_full_height": 270,
                        "header_focus_width": 480,
                        "header_focus_height": 270,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,510,270,30",
                        "header_image": "https://static.tumblr.com/9a2ec9d8fd167a943f5d38c15cb42cfc/gva8f1z/GwJpts2s3/tumblr_static_192t6gw967esko4ww4cssso0c.gif",
                        "header_image_focused": "https://static.tumblr.com/9a2ec9d8fd167a943f5d38c15cb42cfc/gva8f1z/aOwpts2s6/tumblr_static_tumblr_static_192t6gw967esko4ww4cssso0c_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/9a2ec9d8fd167a943f5d38c15cb42cfc/gva8f1z/GwJpts2s3/tumblr_static_192t6gw967esko4ww4cssso0c_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#EEEEEE",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185689786338"
                },
                "content_raw": "<p><b>A/N:</b> I wanted to take a short break from all the seriousness of my running fic <a href=\"https://luniellar.tumblr.com/post/185689925743/masterlist-its-you-chris-evans-sebastian\">“It’s You”</a> to write a cute and fluffy one shot. I was itching to write cute scenarios, <i>gah</i>. I know it’s a one-shot, but the idea of exploring a random life moments with Chris and kids is everything so I might do a series style that requires no context, just fluff moments.<br></p><p><b>Summary:</b> Just a slice of life featuring your husband, daughter, and dog. Oh, did I mention that your husband is Chris Evans? <i>Yup, I got your attention now</i>. </p><p><b>Warnings: </b>Not full on smut, but we get pretty close.</p><p><b>Word Count: </b>1.6K</p><figure data-orig-width=\"500\" data-orig-height=\"281\" data-tumblr-attribution=\"gajo1987:Yq4B3gLSPJ00tqmTdEMtqg:ZxK2El2d-CQ4K\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/19dd66c6b4939ee42103e8fe2beb7cbe/tumblr_pigzu2YgXS1uocsx1o1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"281\"></figure>[[MORE]]<p>The warm sunlight embraced my skin as a mix of soft blades of grass and sand tickled my feet. I threw the worn blanket on the field and dropped the picnic basket. As if that was his cue, Dodger casually walked over and sat on the edge of the blanket. I turned around and crouched down to Emily’s level.</p><p>“Okay, what did we promise?” I asked.<br></p><p>Her brilliant blue eyes stared back at me. “No cookies after eight.”<br></p><p>I tried so hard to not smile. She had her father’s humor. “Emily Lisa Evans,” I said back sternly, narrowing my eyebrows.<br></p><p>“I know, mommy. I won’t go off too far.”<br></p><p>“You promised,” I sighed. “I’m going to tattle on you if you break your promise.”<br></p><p>After Emily hastily nodded in understanding, I watched as she ran across the sand leaving tiny footprints behind her. Her soft blonde hair blew freely in the salty breeze. She went about six steps before turning around to wave at me with her little hand. I waved back with a smile.<br></p><p>Emily plopped down on the sand close to the water and Dodger got up from his seat and ran over to her. He sat next to her protectively as she dug her hands in the sand.<br></p><p>“Good boy,” I whispered. </p><p>I turned around and sat down on the blanket. I took off the towel I had wrapped around my shoulder and placed it next to the basket. I felt the warmth against my bare shoulders and back. Adjusting my bikini top, I reached around for the phone I stuck in the basket.</p><p>I had one text message from him.<br></p><p><br></p><p><b>I’ll see you soon.</b></p><p><br></p><p>I put the phone down and looked over at Emily who already had a pile of sand half of her sitting height. Dodger was just lying on the sand watching her. Occasionally, she would take some of the sand and place it on top of Dodger’s paw giggling. Dodger watched her unimpressed.</p><p>It was moments like this that helped me forget about everything else going on in the world. The moments that made me wonder if I had been a superhero in my past life and I was enjoying all the good karma I built up now.<br></p><p><i>Emily, Dodger, and Chris. I couldn’t have asked for a better daughter, dog, and husband.</i><br></p><p><br></p><p>“We did well.”<br></p><p><br></p><p>I immediately turned at the sound of his familiar voice. Chris was wearing simple khaki shorts with a tight-fitting white t-shirt. He knew I loved the way the fabric tugged over his broad shoulders and chest. In his right hand, he was carrying a small ice box. Smiling, I immediately got up from my seat and ran over. I jumped into his arms wrapping my arms around his neck. His familiar scent of home greeted me and his beard tickled my face.</p><p>“Hey,” he whispered into my ear. I heard a small thud as the icebox dropped from his hand to the soft sandy surface. His arms wrapped around my waist and lifted my feet off the floor. He held my body close to him.<br></p><p>“I missed you,” I said back and I felt his head burrow in my neck. His warm breath passed through my skin and my heart started to thump in my ears. How badly I wanted to just claw through his shirt right here.<br></p><p>“<i>Y/N</i>,” he said as he slowly placed me down. His crystal blue eyes looked even clearer and bluer in the direct sunlight shining down his face. As he leaned in for a kiss, I heard Emily’s cheerful voice.<br></p><p>“Daddy!”<br></p><p>Keeping one arm around my waist, he easily picked up Emily with other arm and pulled her into a family hug. Emily’s arms barely wrapped around Chris’ neck. The sand from her hands brushed up against his porcelain skin.<br></p><p>“Hey princess,” he laughed as he kissed her forehead.<br></p><p>“Mommy never told me that you were coming!” She exclaimed. Dodger barked and circled around us wagging his tail.<br></p><p>“Because,” he said after a short pause. “I wanted to surprise <i>you</i>.”<br></p><p>Emily grinned and rested her head on his shoulders. I softly pat her back like she was our newborn baby again. This moment took me right back to the hospital when Chris held our girl for the first time. I was speechless when I first saw Emily, but I sobbed the first time I saw Chris hold her tiny fragile body in his arms. We stayed like that until Emily lifted her head and looked up at Chris.<br></p><p>“Are you going to help me build my castle?” She asked.<br></p><p>He had a permanent smile on his face whenever he looked at her. “Of course, princess. But, can you give me 10 minutes with the queen first?” He nudged in my direction. <br></p><p>Emily nodded granting him permission and Chris set her back down. Dodger was sitting by Chris patiently with his tail wagging, lifting the sand off the ground. Chris gave him a scratch on his head. “Hey, Bubba.”<br></p><p>When Emily ran off again and Dodger followed after her. When she was back at the pile of sand she was gathering, he pulled me closer to him with the same arm already around my waist and kissed my forehead with a series of pecks, one after another.<br></p><p>“Your queen?” I jokingly laughed at his adorableness as his beard tickled my forehead with each peck. Eventually, when he stopped I wrapped my arms around his waist. “Does that make you my king?”<br></p><p>He grinned proudly. “Yes, my queen.”<br></p><p>“I thought of you more like a knight in shining armor kind of deal.”<br></p><p>His eyebrows furrowed. “That’s our Dodger, <i>Y/N</i>.”<br></p><p>I contemplated it for a second and nodded giving in. “Fine. But, I honestly thought the secret love story between the queen and the knight would be more <i>sexually charged</i>.”<br></p><p>He laughed out loud. “Damn, is that what you’ve been up to when your king is not around?”<br></p><p>I shrugged and in one fluid motion, Chris swept me off my feet effortlessly. He had one arm holding my back and the other behind my knees as he walked us over to the blanket. After softly placing me down, he walked back to grab his small ice box.<br></p><p>“What is that?” I asked.<br></p><p>“I’ll tell you if you pledge your allegiance back to me,” he joked.<br></p><p>I lifted my right hand up and held it in the air. Then, I placed it over my heart and bowed my head. “My king.”<br></p><p>When I didn’t hear a response, I looked up and peeked to find out that Chris had his back turned against me.<br></p><p>“I can’t believe this, Chris!” I shouted and I heard him chuckle.<br></p><p>“Hold on.”<br></p><p>When he turned back around he had his two hands together as if he was holding something fragile. I glanced down to find a baby turtle in his hands. It was barely the size of my fingernail.<br></p><p>“Oh my gosh,” I whispered trying to stay quiet as possible. I was scared of blowing it away with an exhale.<br></p><p>“The little guy was out by the asphalt. I don’t think he realized that he was heading in the wrong direction.”<br></p><p>“What do we do with it?”<br></p><p>“The lifeguard suggested that I should either place back in the waters or take it home. I was going to ask Emily what she wanted to do.”<br></p><p>“Okay,” I said back as I leaned in closer to his hands. “It’s so tiny, Look at its little feet.”</p><p>I didn’t realize how close I leaned in until I looked away and saw Chris’ face inches away from mine. “Just a second,” he said. He moved fast as he placed the turtle back. When he turned back to me, he immediately grabbed me without any hesitation. He leaned in and our lips touched. Our kiss started out cute like a quick “miss you” text and very quickly progressed to our tongues begging for each other.</p><p>When our lips pulled apart, our forehead remained touching. Our staggered breathing clashed with each other as I held back the urge to pin him down on this blanket. When I closed my eyes, I felt his head move. His lips grazed against mine.</p><p>“Baby,” he cooed in his deep voice. “I want you so bad right now, <i>Y/N</i>”</p><p>I moved my hands on top of his chest. I felt his warmth against my hands as I playfully tugged at his shirt. “I want you even more,” I whispered back.</p><p>He leaned closer, placed a hand on my back for support and lowered me down until my back touched the floor. He quickly adjusted his body on top of mine, digging each knee by my hips. His palms were by my shoulders holding himself up from crushing me. I lifted my hands and caressed his face, feeling his scruffy beard. His blue eyes matched the picture-perfect blue sky backdrop behind him.</p><p>I grabbed the collar of his t-shirt and tugged it down closer to me. Our lips slow danced together, each one taking turns leading the dance. I felt his fingers trace my collarbone.</p><p>“Daddy!” Emily called out.</p><p>Chris reluctantly pulled away and turned to face in her direction. “Okay, I’m coming!’</p><p>I giggled when he turned back to me. “To be fair, you know she sat there and counted 10 minutes. She counted to thirty the other day.”</p><p>He raised his eyebrows in surprise. “She’s got your brains,” he said defeatedly. He got up first and reached out a hand and helped me up.</p><p>“We’re not done. Don’t leave me hanging,” I replied and he grinned.</p><p>“So, I was thinking,” he said as he took a step on the sand. “How about another son… a little Chris since we already have a little <i>Y/N</i>?”</p><p>“Chris… you can’t just say things like that.”</p><p>“You know, I was serious about a big family when we were getting married. One could be the president, one could be an athlete, one could be a doctor…” His voice faded as he walked further away.</p><p>I sighed as I got up and ran over to him. Before I passed him, I stopped to look over. “President, athlete, and doctor that’s it. I’m maxing out at three kids.”</p><p>I heard his laughter as he caught up in two full steps and lifted me off the floor with one arm.</p><p>“Deal.”</p>",
                "content": "<p><b>A/N:</b> I wanted to take a short break from all the seriousness of my running fic <a href=\"https://luniellar.tumblr.com/post/185689925743/masterlist-its-you-chris-evans-sebastian\">&ldquo;It&rsquo;s You&rdquo;</a> to write a cute and fluffy one shot. I was itching to write cute scenarios, <i>gah</i>. I know it&rsquo;s a one-shot, but the idea of exploring a random life moments with Chris and kids is everything so I might do a series style that requires no context, just fluff moments.<br /></p><p><b>Summary:</b> Just a slice of life featuring your husband, daughter, and dog. Oh, did I mention that your husband is Chris Evans? <i>Yup, I got your attention now</i>.&nbsp;</p><p><b>Warnings: </b>Not full on smut, but we get pretty close.</p><p><b>Word Count: </b>1.6K</p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><p>The warm sunlight embraced my skin as a mix of soft blades of grass and sand tickled my feet. I threw the worn blanket on the field and dropped the picnic basket. As if that was his cue, Dodger casually walked over and sat on the edge of the blanket. I turned around and crouched down to Emily&rsquo;s level.</p><p>&ldquo;Okay, what did we promise?&rdquo; I asked.<br /></p><p>Her brilliant blue eyes stared back at me. &ldquo;No cookies after eight.&rdquo;<br /></p><p>I tried so hard to not smile. She had her father&rsquo;s humor. &ldquo;Emily Lisa Evans,&rdquo; I said back sternly, narrowing my eyebrows.<br /></p><p>&ldquo;I know, mommy. I won&rsquo;t go off too far.&rdquo;<br /></p><p>&ldquo;You promised,&rdquo; I sighed. &ldquo;I&rsquo;m going to tattle on you if you break your promise.&rdquo;<br /></p><p>After Emily hastily nodded in understanding, I watched as she ran across the sand leaving tiny footprints behind her. Her soft blonde hair blew freely in the salty breeze. She went about six steps before turning around to wave at me with her little hand. I waved back with a smile.<br /></p><p>Emily plopped down on the sand close to the water and Dodger got up from his seat and ran over to her. He sat next to her protectively as she dug her hands in the sand.<br /></p><p>&ldquo;Good boy,&rdquo; I whispered.&nbsp;</p><p>I turned around and sat down on the blanket. I took off the towel I had wrapped around my shoulder and placed it next to the basket. I felt the warmth against my bare shoulders and back. Adjusting my bikini top, I reached around for the phone I stuck in the basket.</p><p>I had one text message from him.<br /></p><p><br /></p><p><b>I&rsquo;ll see you soon.</b></p><p><br /></p><p>I put the phone down and looked over at Emily who already had a pile of sand half of her sitting height. Dodger was just lying on the sand watching her. Occasionally, she would take some of the sand and place it on top of Dodger&rsquo;s paw giggling. Dodger watched her unimpressed.</p><p>It was moments like this that helped me forget about everything else going on in the world. The moments that made me wonder if I had been a superhero in my past life and I was enjoying all the good karma I built up now.<br /></p><p><i>Emily, Dodger, and Chris. I couldn&rsquo;t have asked for a better daughter, dog, and husband.</i><br /></p><p><br /></p><p>&ldquo;We did well.&rdquo;<br /></p><p><br /></p><p>I immediately turned at the sound of his familiar voice. Chris was wearing simple khaki shorts with a tight-fitting white t-shirt. He knew I loved the way the fabric tugged over his broad shoulders and chest. In his right hand, he was carrying a small ice box. Smiling, I immediately got up from my seat and ran over. I jumped into his arms wrapping my arms around his neck. His familiar scent of home greeted me and his beard tickled my face.</p><p>&ldquo;Hey,&rdquo; he whispered into my ear. I heard a small thud as the icebox dropped from his hand to the soft sandy surface. His arms wrapped around my waist and lifted my feet off the floor. He held my body close to him.<br /></p><p>&ldquo;I missed you,&rdquo; I said back and I felt his head burrow in my neck. His warm breath passed through my skin and my heart started to thump in my ears. How badly I wanted to just claw through his shirt right here.<br /></p><p>&ldquo;<i>Y/N</i>,&rdquo; he said as he slowly placed me down. His crystal blue eyes looked even clearer and bluer in the direct sunlight shining down his face. As he leaned in for a kiss, I heard Emily&rsquo;s cheerful voice.<br /></p><p>&ldquo;Daddy!&rdquo;<br /></p><p>Keeping one arm around my waist, he easily picked up Emily with other arm and pulled her into a family hug. Emily&rsquo;s arms barely wrapped around Chris&rsquo; neck. The sand from her hands brushed up against his porcelain skin.<br /></p><p>&ldquo;Hey princess,&rdquo; he laughed as he kissed her forehead.<br /></p><p>&ldquo;Mommy never told me that you were coming!&rdquo; She exclaimed. Dodger barked and circled around us wagging his tail.<br /></p><p>&ldquo;Because,&rdquo; he said after a short pause. &ldquo;I wanted to surprise <i>you</i>.&rdquo;<br /></p><p>Emily grinned and rested her head on his shoulders. I softly pat her back like she was our newborn baby again. This moment took me right back to the hospital when Chris held our girl for the first time. I was speechless when I first saw Emily, but I sobbed the first time I saw Chris hold her tiny fragile body in his arms. We stayed like that until Emily lifted her head and looked up at Chris.<br /></p><p>&ldquo;Are you going to help me build my castle?&rdquo; She asked.<br /></p><p>He had a permanent smile on his face whenever he looked at her. &ldquo;Of course, princess. But, can you give me 10 minutes with the queen first?&rdquo; He nudged in my direction.&nbsp;<br /></p><p>Emily nodded granting him permission and Chris set her back down. Dodger was sitting by Chris patiently with his tail wagging, lifting the sand off the ground. Chris gave him a scratch on his head. &ldquo;Hey, Bubba.&rdquo;<br /></p><p>When Emily ran off again and Dodger followed after her. When she was back at the pile of sand she was gathering, he pulled me closer to him with the same arm already around my waist and kissed my forehead with a series of pecks, one after another.<br /></p><p>&ldquo;Your queen?&rdquo; I jokingly laughed at his adorableness as his beard tickled my forehead with each peck. Eventually, when he stopped I wrapped my arms around his waist. &ldquo;Does that make you my king?&rdquo;<br /></p><p>He grinned proudly. &ldquo;Yes, my queen.&rdquo;<br /></p><p>&ldquo;I thought of you more like a knight in shining armor kind of deal.&rdquo;<br /></p><p>His eyebrows furrowed. &ldquo;That&rsquo;s our Dodger, <i>Y/N</i>.&rdquo;<br /></p><p>I contemplated it for a second and nodded giving in. &ldquo;Fine. But, I honestly thought the secret love story between the queen and the knight would be more <i>sexually charged</i>.&rdquo;<br /></p><p>He laughed out loud. &ldquo;Damn, is that what you&rsquo;ve been up to when your king is not around?&rdquo;<br /></p><p>I shrugged and in one fluid motion, Chris swept me off my feet effortlessly. He had one arm holding my back and the other behind my knees as he walked us over to the blanket. After softly placing me down, he walked back to grab his small ice box.<br /></p><p>&ldquo;What is that?&rdquo; I asked.<br /></p><p>&ldquo;I&rsquo;ll tell you if you pledge your allegiance back to me,&rdquo; he joked.<br /></p><p>I lifted my right hand up and held it in the air. Then, I placed it over my heart and bowed my head. &ldquo;My king.&rdquo;<br /></p><p>When I didn&rsquo;t hear a response, I looked up and peeked to find out that Chris had his back turned against me.<br /></p><p>&ldquo;I can&rsquo;t believe this, Chris!&rdquo; I shouted and I heard him chuckle.<br /></p><p>&ldquo;Hold on.&rdquo;<br /></p><p>When he turned back around he had his two hands together as if he was holding something fragile. I glanced down to find a baby turtle in his hands. It was barely the size of my fingernail.<br /></p><p>&ldquo;Oh my gosh,&rdquo; I whispered trying to stay quiet as possible. I was scared of blowing it away with an exhale.<br /></p><p>&ldquo;The little guy was out by the asphalt. I don&rsquo;t think he realized that he was heading in the wrong direction.&rdquo;<br /></p><p>&ldquo;What do we do with it?&rdquo;<br /></p><p>&ldquo;The lifeguard suggested that I should either place back in the waters or take it home. I was going to ask Emily what she wanted to do.&rdquo;<br /></p><p>&ldquo;Okay,&rdquo; I said back as I leaned in closer to his hands. &ldquo;It&rsquo;s so tiny, Look at its little feet.&rdquo;</p><p>I didn&rsquo;t realize how close I leaned in until I looked away and saw Chris&rsquo; face inches away from mine. &ldquo;Just a second,&rdquo; he said. He moved fast as he placed the turtle back. When he turned back to me, he immediately grabbed me without any hesitation. He leaned in and our lips touched. Our kiss started out cute like a quick &ldquo;miss you&rdquo; text and very quickly progressed to our tongues begging for each other.</p><p>When our lips pulled apart, our forehead remained touching. Our staggered breathing clashed with each other as I held back the urge to pin him down on this blanket. When I closed my eyes, I felt his head move. His lips grazed against mine.</p><p>&ldquo;Baby,&rdquo; he cooed in his deep voice. &ldquo;I want you so bad right now, <i>Y/N</i>&rdquo;</p><p>I moved my hands on top of his chest. I felt his warmth against my hands as I playfully tugged at his shirt. &ldquo;I want you even more,&rdquo; I whispered back.</p><p>He leaned closer, placed a hand on my back for support and lowered me down until my back touched the floor. He quickly adjusted his body on top of mine, digging each knee by my hips. His palms were by my shoulders holding himself up from crushing me. I lifted my hands and caressed his face, feeling his scruffy beard. His blue eyes matched the picture-perfect blue sky backdrop behind him.</p><p>I grabbed the collar of his t-shirt and tugged it down closer to me. Our lips slow danced together, each one taking turns leading the dance. I felt his fingers trace my collarbone.</p><p>&ldquo;Daddy!&rdquo; Emily called out.</p><p>Chris reluctantly pulled away and turned to face in her direction. &ldquo;Okay, I&rsquo;m coming!&rsquo;</p><p>I giggled when he turned back to me. &ldquo;To be fair, you know she sat there and counted 10 minutes. She counted to thirty the other day.&rdquo;</p><p>He raised his eyebrows in surprise. &ldquo;She&rsquo;s got your brains,&rdquo; he said defeatedly. He got up first and reached out a hand and helped me up.</p><p>&ldquo;We&rsquo;re not done. Don&rsquo;t leave me hanging,&rdquo; I replied and he grinned.</p><p>&ldquo;So, I was thinking,&rdquo; he said as he took a step on the sand. &ldquo;How about another son&hellip; a little Chris since we already have a little <i>Y/N</i>?&rdquo;</p><p>&ldquo;Chris&hellip; you can&rsquo;t just say things like that.&rdquo;</p><p>&ldquo;You know, I was serious about a big family when we were getting married. One could be the president, one could be an athlete, one could be a doctor&hellip;&rdquo; His voice faded as he walked further away.</p><p>I sighed as I got up and ran over to him. Before I passed him, I stopped to look over. &ldquo;President, athlete, and doctor that&rsquo;s it. I&rsquo;m maxing out at three kids.&rdquo;</p><p>I heard his laughter as he caught up in two full steps and lifted me off the floor with one arm.</p><p>&ldquo;Deal.&rdquo;</p>",
                "content_abstract": "<p>\n<p><b>A/N:</b> I wanted to take a short break from all the seriousness of my running fic <a href=\"https://luniellar.tumblr.com/post/185689925743/masterlist-its-you-chris-evans-sebastian\">&ldquo;It&rsquo;s You&rdquo;</a> to write a cute and fluffy one shot. I was itching to write cute scenarios, <i>gah</i>. I know it&rsquo;s a one-shot, but the idea of exploring a random life moments with Chris and kids is everything so I might do a series style that requires no context, just fluff moments.<br /></p>\n<p><b>Summary:</b> Just a slice of life featuring your husband, daughter, and dog. Oh, did I mention that your husband is Chris Evans? <i>Yup, I got your attention now</i>.&nbsp;</p>\n<p><b>Warnings: </b>Not full on smut, but we get pretty close.</p>\n<p><b>Word Count: </b>1.6K</p>\n<figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "ayanemoonlight",
        "blog": {
            "name": "ayanemoonlight",
            "title": "Ayane Moon",
            "description": "Algerian,28. Slytherine, Photoshop edit maker,Massive Stucky fan\nsebastian stan,Tom Hiddelston,Jensen Ackels, Thorky,SPN Family, sherlock, HELP!AM IN TOOO MANY FANDOMS http://ko-fi.com/ayanemoon",
            "url": "https://ayanemoonlight.tumblr.com/",
            "uuid": "t:kI4dzxmxh4q0wiuDHV1_FQ",
            "updated": 1561734485
        },
        "id": 185689189758,
        "post_url": "https://ayanemoonlight.tumblr.com/post/185689189758/another-long-hair-stevie-what-do-you-think",
        "slug": "another-long-hair-stevie-what-do-you-think",
        "date": "2019-06-18 23:14:27 GMT",
        "timestamp": 1560899667,
        "state": "published",
        "format": "html",
        "reblog_key": "b2EyomkQ",
        "tags": [
            "Steve Rogers",
            "Chris Evans",
            "long hair stevie",
            "ficthispicchallenge",
            "The Avengers",
            "avengers endgame"
        ],
        "short_url": "https://tmblr.co/ZtU64o2ixy2r_",
        "summary": "Another long hair stevie!  what do you think?",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 8,
        "caption": "<h2>Another long hair stevie!</h2><p> what do you think?<br/></p>",
        "reblog": {
            "comment": "<p><h2>Another long hair stevie!</h2><p> what do you think?<br></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ayanemoonlight",
                    "active": true,
                    "theme": {
                        "header_full_width": 2212,
                        "header_full_height": 918,
                        "header_focus_width": 1586,
                        "header_focus_height": 892,
                        "avatar_shape": "circle",
                        "background_color": "#1F0000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "25,1708,917,122",
                        "header_image": "https://static.tumblr.com/eaba355d2e28f84ef22fb7b27cd300ac/rusekgi/qnSovxdz7/tumblr_static_855ji8kvhrk8scwo0gggo8so.jpg",
                        "header_image_focused": "https://static.tumblr.com/eaba355d2e28f84ef22fb7b27cd300ac/rusekgi/moEovxdzd/tumblr_static_tumblr_static_855ji8kvhrk8scwo0gggo8so_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/eaba355d2e28f84ef22fb7b27cd300ac/rusekgi/qnSovxdz7/tumblr_static_855ji8kvhrk8scwo0gggo8so_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FF4141",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185689189758"
                },
                "content_raw": "<p><h2>Another long hair stevie!</h2><p> what do you think?<br></p></p>",
                "content": "<p><h2>Another long hair stevie!</h2><p>&nbsp;what do you think?<br /></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://ayanemoonlight.tumblr.com/image/185689189758",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/fb4ef2c21211bc876c34a2bfa13973e9/tumblr_ptbhw3Ku7w1twntmco1_640.jpg",
                    "width": 564,
                    "height": 752
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/fb4ef2c21211bc876c34a2bfa13973e9/tumblr_ptbhw3Ku7w1twntmco1_640.jpg",
                        "width": 564,
                        "height": 752
                    },
                    {
                        "url": "https://66.media.tumblr.com/fb4ef2c21211bc876c34a2bfa13973e9/tumblr_ptbhw3Ku7w1twntmco1_540.jpg",
                        "width": 540,
                        "height": 720
                    },
                    {
                        "url": "https://66.media.tumblr.com/fb4ef2c21211bc876c34a2bfa13973e9/tumblr_ptbhw3Ku7w1twntmco1_500.jpg",
                        "width": 500,
                        "height": 667
                    },
                    {
                        "url": "https://66.media.tumblr.com/fb4ef2c21211bc876c34a2bfa13973e9/tumblr_ptbhw3Ku7w1twntmco1_400.jpg",
                        "width": 400,
                        "height": 533
                    },
                    {
                        "url": "https://66.media.tumblr.com/fb4ef2c21211bc876c34a2bfa13973e9/tumblr_ptbhw3Ku7w1twntmco1_250.jpg",
                        "width": 250,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/fb4ef2c21211bc876c34a2bfa13973e9/tumblr_ptbhw3Ku7w1twntmco1_100.jpg",
                        "width": 100,
                        "height": 133
                    },
                    {
                        "url": "https://66.media.tumblr.com/fb4ef2c21211bc876c34a2bfa13973e9/tumblr_ptbhw3Ku7w1twntmco1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "evansensations",
        "blog": {
            "name": "evansensations",
            "title": "I'm just an asshole",
            "description": "✶ Chris Evans ✶",
            "url": "https://evansensations.tumblr.com/",
            "uuid": "t:4zAaRyTdl0aGRoGlM_SHmA",
            "updated": 1561764800
        },
        "id": 185688875110,
        "post_url": "https://evansensations.tumblr.com/post/185688875110/chris-evans-as-frank-adler-in-gifted-2017",
        "slug": "chris-evans-as-frank-adler-in-gifted-2017",
        "date": "2019-06-18 22:57:55 GMT",
        "timestamp": 1560898675,
        "state": "published",
        "format": "html",
        "reblog_key": "7f7SpqSv",
        "tags": [
            "evansedit",
            "cevansedit",
            "chris evans",
            "frank adler",
            "gifted",
            "filmgifs",
            "gifs",
            "*"
        ],
        "short_url": "https://tmblr.co/Z_USmX2ixws1c",
        "summary": "Chris Evans as Frank Adler in Gifted (2017)",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1990,
        "caption": "<p><small><b>Chris Evans</b> as Frank Adler in Gifted (2017)</small></p>",
        "reblog": {
            "comment": "<p><small><b>Chris Evans</b> as Frank Adler in Gifted (2017)</small></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "evansensations",
                    "active": true,
                    "theme": {
                        "header_full_width": 540,
                        "header_full_height": 304,
                        "header_focus_width": 540,
                        "header_focus_height": 303,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,540,303,0",
                        "header_image": "https://static.tumblr.com/b3f384b69b6be7667c4318aba97ef237/7qu3nr2/d7gpp70b1/tumblr_static_e5nh4vbjk000skk8kwskcw0so.gif",
                        "header_image_focused": "https://static.tumblr.com/b3f384b69b6be7667c4318aba97ef237/7qu3nr2/oGcpp70b4/tumblr_static_tumblr_static_e5nh4vbjk000skk8kwskcw0so_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/b3f384b69b6be7667c4318aba97ef237/7qu3nr2/d7gpp70b1/tumblr_static_e5nh4vbjk000skk8kwskcw0so_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185688875110"
                },
                "content_raw": "<p><small><b>Chris Evans</b> as Frank Adler in Gifted (2017)</small></p>",
                "content": "<p><small><b>Chris Evans</b> as Frank Adler in Gifted (2017)</small></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "222",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/d01a98daa0267dff33837815509828a2/tumblr_ptbh09hbc61y26s0ro1_400.gif",
                    "width": 300,
                    "height": 300
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/d01a98daa0267dff33837815509828a2/tumblr_ptbh09hbc61y26s0ro1_400.gif",
                        "width": 300,
                        "height": 300
                    },
                    {
                        "url": "https://66.media.tumblr.com/d01a98daa0267dff33837815509828a2/tumblr_ptbh09hbc61y26s0ro1_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/d01a98daa0267dff33837815509828a2/tumblr_ptbh09hbc61y26s0ro1_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/d01a98daa0267dff33837815509828a2/tumblr_ptbh09hbc61y26s0ro1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/a84f640ea2590305bfbcaf47ca302710/tumblr_ptbh09hbc61y26s0ro2_400.gif",
                    "width": 300,
                    "height": 300
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/a84f640ea2590305bfbcaf47ca302710/tumblr_ptbh09hbc61y26s0ro2_400.gif",
                        "width": 300,
                        "height": 300
                    },
                    {
                        "url": "https://66.media.tumblr.com/a84f640ea2590305bfbcaf47ca302710/tumblr_ptbh09hbc61y26s0ro2_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/a84f640ea2590305bfbcaf47ca302710/tumblr_ptbh09hbc61y26s0ro2_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/a84f640ea2590305bfbcaf47ca302710/tumblr_ptbh09hbc61y26s0ro2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/cbfb1590577d4e6dfdbe0321489cacab/tumblr_ptbh09hbc61y26s0ro5_400.gif",
                    "width": 300,
                    "height": 300
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/cbfb1590577d4e6dfdbe0321489cacab/tumblr_ptbh09hbc61y26s0ro5_400.gif",
                        "width": 300,
                        "height": 300
                    },
                    {
                        "url": "https://66.media.tumblr.com/cbfb1590577d4e6dfdbe0321489cacab/tumblr_ptbh09hbc61y26s0ro5_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/cbfb1590577d4e6dfdbe0321489cacab/tumblr_ptbh09hbc61y26s0ro5_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/cbfb1590577d4e6dfdbe0321489cacab/tumblr_ptbh09hbc61y26s0ro5_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/04f409244a830e1dfd0a131d099b7c68/tumblr_ptbh09hbc61y26s0ro4_400.gif",
                    "width": 300,
                    "height": 300
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/04f409244a830e1dfd0a131d099b7c68/tumblr_ptbh09hbc61y26s0ro4_400.gif",
                        "width": 300,
                        "height": 300
                    },
                    {
                        "url": "https://66.media.tumblr.com/04f409244a830e1dfd0a131d099b7c68/tumblr_ptbh09hbc61y26s0ro4_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/04f409244a830e1dfd0a131d099b7c68/tumblr_ptbh09hbc61y26s0ro4_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/04f409244a830e1dfd0a131d099b7c68/tumblr_ptbh09hbc61y26s0ro4_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/339e6ee8435bb5802987b5f258a7157b/tumblr_ptbh09hbc61y26s0ro3_400.gif",
                    "width": 300,
                    "height": 300
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/339e6ee8435bb5802987b5f258a7157b/tumblr_ptbh09hbc61y26s0ro3_400.gif",
                        "width": 300,
                        "height": 300
                    },
                    {
                        "url": "https://66.media.tumblr.com/339e6ee8435bb5802987b5f258a7157b/tumblr_ptbh09hbc61y26s0ro3_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/339e6ee8435bb5802987b5f258a7157b/tumblr_ptbh09hbc61y26s0ro3_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/339e6ee8435bb5802987b5f258a7157b/tumblr_ptbh09hbc61y26s0ro3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/f2a8f0bd080874b200bc5e0059309695/tumblr_ptbh09hbc61y26s0ro6_400.gif",
                    "width": 300,
                    "height": 300
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/f2a8f0bd080874b200bc5e0059309695/tumblr_ptbh09hbc61y26s0ro6_400.gif",
                        "width": 300,
                        "height": 300
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2a8f0bd080874b200bc5e0059309695/tumblr_ptbh09hbc61y26s0ro6_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2a8f0bd080874b200bc5e0059309695/tumblr_ptbh09hbc61y26s0ro6_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2a8f0bd080874b200bc5e0059309695/tumblr_ptbh09hbc61y26s0ro6_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "chrisquartet",
        "blog": {
            "name": "chrisquartet",
            "title": "Feeling Chris-tian?",
            "description": "This blog is in dedication to the 4 Chris of: Evans, Hemsworth, Pine and Pratt\n\nAn affiliation with this blog and <b>Fan Forum</b> has begun. \nCheck out the following Chris forums to find other fans to discuss them with\n\n<a href=\"http://www.fanforum.com/f453/\">Chris Evans</a>, <a href=\"http://www.fanforum.com/f451/\">Chris Hemsworth</a> . <a href=\"http://www.fanforum.com/f499/\">Chris Pine</a> , <a href=\"http://www.fanforum.com/f500/\">Chris Pratt</a>\n<a href=\"http://www.fanforum.com/f497/\">DC Universe Extended</a> , <a href=\"http://www.fanforum.com/f507/\">Guardians of the Galaxy</a> , <a href=\"http://www.fanforum.com/f89/\">Star Trek</a> , <a href=\"http://www.fanforum.com/f392/\">The Avengers</a>",
            "url": "https://chrisquartet.tumblr.com/",
            "uuid": "t:xK7xoxOq6dkG7vf3g2rokA",
            "updated": 1561765310
        },
        "id": 185687550691,
        "post_url": "https://chrisquartet.tumblr.com/post/185687550691/sdcc-2014",
        "slug": "sdcc-2014",
        "date": "2019-06-18 21:52:05 GMT",
        "timestamp": 1560894725,
        "state": "published",
        "format": "html",
        "reblog_key": "x71KqyVa",
        "tags": [
            "chris evans",
            "chris hemsworth",
            "so sad and sweet",
            "comic con",
            "sdcc",
            "thor",
            "captain america"
        ],
        "short_url": "https://tmblr.co/ZKBjQZ2ixrohZ",
        "summary": "SDCC 2014",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 84,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"993\" data-orig-width=\"828\"><img src=\"https://66.media.tumblr.com/06ae89747e5329b567423887bdcd439a/tumblr_ptbe2smX1L1tb1kgx_1280.jpg\" data-orig-height=\"993\" data-orig-width=\"828\"/></figure><p>SDCC 2014</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"993\" data-orig-width=\"828\"><img src=\"https://66.media.tumblr.com/06ae89747e5329b567423887bdcd439a/tumblr_ptbe2smX1L1tb1kgx_1280.jpg\" data-orig-height=\"993\" data-orig-width=\"828\"></figure><p>SDCC 2014</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "chrisquartet",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#310512",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/71600a4addbceb21338c0c53e6d95f50/7xssveo/WRtpb3g6n/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/71600a4addbceb21338c0c53e6d95f50/7xssveo/WRtpb3g6n/tumblr_static__2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/71600a4addbceb21338c0c53e6d95f50/7xssveo/WRtpb3g6n/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Quadrat",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185687550691"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"993\" data-orig-width=\"828\"><img src=\"https://66.media.tumblr.com/06ae89747e5329b567423887bdcd439a/tumblr_ptbe2smX1L1tb1kgx_1280.jpg\" data-orig-height=\"993\" data-orig-width=\"828\"></figure><p>SDCC 2014</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/06ae89747e5329b567423887bdcd439a/tumblr_ptbe2smX1L1tb1kgx_1280.jpg\" class=\"\"/></figure><p>SDCC 2014</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "video",
        "blog_name": "thinkxlovexloud",
        "blog": {
            "name": "thinkxlovexloud",
            "title": "Thinking Out Loud",
            "description": "A twenty somethings’ everyday thoughts and feelings... so mainly Chris Evans. I’m writing one shots too so send me some prompts. \n\nMASTERLIST     ",
            "url": "https://thinkxlovexloud.tumblr.com/",
            "uuid": "t:9IzNeOkFfMbTmXoQX4ykRQ",
            "updated": 1561674278
        },
        "id": 185686750035,
        "post_url": "https://thinkxlovexloud.tumblr.com/post/185686750035/tb-interview-of-chris-with-e-online-2011",
        "slug": "tb-interview-of-chris-with-e-online-2011",
        "date": "2019-06-18 21:11:48 GMT",
        "timestamp": 1560892308,
        "state": "published",
        "format": "html",
        "reblog_key": "2ScwDg6q",
        "tags": [
            "chris evans",
            "tbinterview",
            "balancedsoul",
            "I love how hayley swoons over him",
            "that’d be me"
        ],
        "short_url": "https://tmblr.co/Zd7eXX2ixolDJ",
        "summary": "#tb interview of Chris with E Online (2011)",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 153,
        "caption": "<p>#tb interview of Chris with E Online (2011)</p>",
        "reblog": {
            "comment": "<p>#tb interview of Chris with E Online (2011)</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thinkxlovexloud",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_14.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_14.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_14.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185686750035"
                },
                "content_raw": "<p>#tb interview of Chris with E Online (2011)</p>",
                "content": "<p>#tb interview of Chris with E Online (2011)</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "permalink_url": "https://vimeo.com/314237372",
        "html5_capable": true,
        "thumbnail_url": "https://i.vimeocdn.com/video/755746752_295x166.jpg",
        "thumbnail_width": 295,
        "thumbnail_height": 166,
        "player": [
            {
                "width": 250,
                "embed_code": "<iframe src=\"https://player.vimeo.com/video/314237372?title=0&byline=0&portrait=0&app_id=122963\" width=\"250\" height=\"141\" frameborder=\"0\" title=\"E! Close Up - Chris Evans Gets Into _Captain_ Mode (2011)\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe>"
            },
            {
                "width": 400,
                "embed_code": "<iframe src=\"https://player.vimeo.com/video/314237372?title=0&byline=0&portrait=0&app_id=122963\" width=\"400\" height=\"225\" frameborder=\"0\" title=\"E! Close Up - Chris Evans Gets Into _Captain_ Mode (2011)\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe>"
            },
            {
                "width": 500,
                "embed_code": "<iframe src=\"https://player.vimeo.com/video/314237372?title=0&byline=0&portrait=0&app_id=122963\" width=\"500\" height=\"281\" frameborder=\"0\" title=\"E! Close Up - Chris Evans Gets Into _Captain_ Mode (2011)\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe>"
            }
        ],
        "video_type": "vimeo",
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "oneshots-heaven",
        "blog": {
            "name": "oneshots-heaven",
            "title": "One Shots Heaven",
            "description": "constantly writing angsty fics about ur favs\n<br>\n<a href=\"https://oneshots-heaven.tumblr.com/post/161323191363/masterlist\">Masterlist</a>\n<br>\n<a href=\"https://oneshots-heaven.tumblr.com/faq\">FAQ</a>",
            "url": "https://oneshots-heaven.tumblr.com/",
            "uuid": "t:BVnI1TzAgp4IfpvgoTJjpw",
            "updated": 1561573733
        },
        "id": 185686619668,
        "post_url": "https://oneshots-heaven.tumblr.com/post/185686619668/time-out-for-a-movie-star-part-2",
        "slug": "time-out-for-a-movie-star-part-2",
        "date": "2019-06-18 21:05:01 GMT",
        "timestamp": 1560891901,
        "state": "published",
        "format": "html",
        "reblog_key": "dTAAGScB",
        "tags": [
            "Chris Evans",
            "chris evans fan fiction",
            "chris evans imagines",
            "chris evans imagine",
            "chris evans x reader",
            "chris evans x you",
            "chris evans x y/n",
            "chris evans ff",
            "chris evans fanfiction",
            "chris evans fanfic",
            "tofamsseries"
        ],
        "short_url": "https://tmblr.co/ZDmLro2ixoFOK",
        "summary": "“Time Out For A Movie Star“ — Part 2",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 81,
        "title": "“Time Out For A Movie Star“ — Part 2",
        "body": "<figure data-orig-width=\"500\" data-orig-height=\"250\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/3f4adac4da4120b2a84bb9d020052188/tumblr_inline_pt97wt11gx1rjchpf_540.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"250\"/></figure><p><i>A movie star who doesn’t want to be trapped in a small town and a small town girl who absolutely doesn’t want to have him there—they should get along, right?</i></p><b>Warning: </b>tiniest bit of swearing<br/><b>Chris Evans x Reader<br/></b><b style=\"font-size: 14px;\">Part TWO of “Time Out For A Movie Star“ </b><!-- more --><p><i>He was kidding, right? </i></p><p>You couldn’t believe your eyes as you watched from a far how Christopher Evans was carrying the bucket for the fresh eggs while looking like a scared chicken himself. Beginner’s work at its best. </p><p>Hesitatingly, you sat in your dad’s car parked on the yard. There was still the possibility for you to drive away unnoticed by anyone and forget about this stupid idea. You should’ve stood by your word and not drive here instead to keep an eye on your Aunt’s movie star, yet you had no argument to deny the fact that he was intriguing you. Just as much as the fact that he was another one of those pretty Hollywood guys made you furious. And you had no idea which part overweighted the other. </p><p>To do your father the favor, you told yourself that you need to keep your promise and keep helping your granny like you had planned it for the summer and the bonus was only that you would have your fun with teasing a movie star around. </p><p>Still keeping your eyes on him, you watched him standing slightly anxious in front of the chicken coop as if he wasn’t sure if he should just enter it or if he will hunted down by a dozen of chickens. Your mouth twitched and you hated it. Why was this amusing to you? </p><p><i>A celebrity hunted down by angry chickens</i>, yeah, that would be a title story. </p><p>You sighed, knowing that you didn’t have to kiss ass, but also didn’t have to be an asshole to him. Maybe he could use a little help from you to not completely be a failure. Telling yourself this over and over again, you hopped out of the truck, closing the car door with a slam as you walked straight over to him. </p><p>Chris looked away from the coop straight to your direction, still standing there, not sure what he should actually do. “I thought you wanted to leave,“ he said with a nod to you. </p><p><i>Don’t push it</i>. </p><p>“I did,“ you replied, stepping closer, “and I actually had no desire to come back as long as you were here.“ </p><p>He put his free hand on his heart, crutching pretendedly, saying, “Ouch, that hurt.“ </p><p>You rolled your eyes. His sarcasm was the only thing hurting here, but maybe you deserved that one. You glanced over to the coop. “You do know the chickens won’t eat you, do you? You’d be a little too much for them.“ </p><p>Chris shrugged. “I know that, but they are still scary.“ </p><p>You snorted, taking the bucket from him that he was immediately willing to let go off. At least, he was being honest. “Chickens? Scary? No, they’re not. Here, I’ll show you. The ones from Granny are actually very quiet and old, so don’t worry.“ </p><p>Before opening the fence gate to the coop, you took a short glance at him. He was this tall-standing guy with the sun-kissed Cali skin, a handsome face and some real muscles, yet he was scared of some chickens? This could potentially turn into some fun then. </p><p>Opening the short gate, you hold it open for Chris to follow you. He closed the gate behind you two without having you even ask him to do so. It didn’t go unnoticed by you, however, you chose not to say anything. It wasn’t worth it to praise him for these little simple things. </p><p>“They can go in and out of the coop as they choose to because my dad fenced it completely around, but they usually come outside in the mornings after they laid their eggs. It’s fairly easy to get the eggs without getting your hands picked all over.“ you explained as you opened the large door to the coop itself. </p><p>You looked around quickly, checking where eggs were laying and then you gathered them together in one swift movement, having Chris watch you do it. “You check the little nets as I like to call them and then you carefully collect them.“ you said, handing him the small, filled basket. </p><p>With a grin on your lips, you added, “There you go.“ </p><p>Chris starred wordlessly at the basket, taking it out of your hand. His gaze went up from the basket meeting your eyes. “What made you come back?“ </p><p>His question struck you like thunder—quick but powerful. This simple question would’ve sounded simple out of anyone else’s mouth, but he made those words sound like you had been gone for a long time without any hope of ever returning, and it was breaking his heart to see you back. Reminding yourself that he was an actor who should easily awoke feelings like this, which instantly made you not be impressed by it anymore. </p><p>“I couldn’t let my aunt’s favorite client fail at simple tasks like this. Imagine what it would do to his ego.“ you replied, trying to sound carelessly, but failing embarrassingly at it. You were no actress, you had no idea how to overplay a situation like this and not make it awkward. </p><p>Chris’s mouth twitched to a smile. “Guess you can be nice after all, even with the sass.“ </p><p>“Guess you don’t know me at all,“</p><p>“Maybe I’ll have some time to change that.“ </p><p>And as simple as that, he walked out of the coop, leaving you speechlessly behind. You wanted to curse yourself for feeling anything from this faked meanings. This was the damned magic of actors, they were able to make anything sound so beautiful that you were left wondering how beautiful his lies must sound like. </p><p>You followed him back to your grandma’s house, stepping inside it without announcing yourself, walking past Max to pet him quickly before going to the dining room where you grandma had just finished everything for the breakfast. </p><p>“Y/N, my dear. I thought you didn’t want to come back.“ she said playfully surprised, obviously teasing you with a big grin on her face. Chris sat next to her at the table and to your dismiss, he sat right on your favorite spot where you had sat all your life. </p><p><i>That was an argument more to hate him. </i></p><p>Ignoring your Granny’s words, you grabbed a plate set and sat down opposite to him, smiling falsely at him as your eyes met. Your grandma chuckled into her glass of orange juice, overplaying the situation with asking Chris about the chickens. </p><p>“It went good,“ he answered, catching your now angry looking gaze. “Y/N was lovely enough to help me out. Admittedly, I was a tiny bit scared of the chickens.“ </p><p>Your grandma laughed lovingly. “That happens to the best, don’t worry. Y/N used to be scared too when she was little. She hated going to the coop.“ </p><p><i>How dare she?</i></p><p>Chris was still not breaking your stare off, instead he raised an eyebrow. “Oh, did she? Well, she was a brave one today.“ </p><p>Looking away from him over to your grandma, she smiled at you with her typical smile that your heart give in and forget any anger. She grabbed your free hand, rubbing her thumb over the back of it. “I’m glad you’re here to stay. I wanted to show Chris the town but I don’t think I’m ready to drive the truck just yet again. Will you be so kind?“ </p><p>There it was again, the part where you struggled. Christopher Evans was probably going to be the reason why you will feel the need to rip your hair out by the end of the week, and still be a darling in your grandma’s eyes, which was why you were doing her this favor. </p><p>“Alright Superstar, ready to see the bright side of this town?“ you said with a grin. </p><p>You had never seen him more confused before.</p><p>— — — — — </p><p>Panic was written all over his face. If he had believed that the roads you took after you had picked him up from the landing place were rough and broken down, he hadn’t seen most roads around here. The country never put their money toward towns like this, which truly needed it to repair simple things like the streets or update the cell service. Living in this small town was like living two decades behind, but you were so used to it that you didn’t mind it when your friends from college couldn’t reach you over the summer. It was freeing in some way. </p><p>Perhaps that was the exact reason why Aunt Susan had sent Chris here. This was undeniably a good place to get away from toxic places or people. </p><p>You didn’t have to play his babysitter. He was fifteen years older than you, he should be able to do simple tasks but time altered differently around here. In fact, you were the true adult here, instead of him.</p><p>Parking your granny’s old truck in the small parking lot close-by the market, you got out of the car, telling Chris, “Come on,“ </p><p>The market in the town was every single day. Farmers around here sold their fresh vegetables and fruits and bringing the people together. All in all, the community in this town was great, where everyone kind of looked after one another, however which also meant that there were all sorts of rumors and talks between the neighbors.</p><p>The general age around here wasn’t truly the age of Hollywood, or the ones who kept with the glamorous lives of people like Chris. Most people in this town had no clue who Chris was, and now you were walking around with for them, this tall, handsome stranger. You were already seeing the wildfire spread of rumors. </p><p>Granny was right when it came to your little dates with Brandon, you weren’t really into him and especially this summer, you couldn’t handle to be around him. Your dates over the past summers had been all sorts of friendly fun, however, this summer everything seemed different. He was eager, and probably believing that the two of you would end up marrying each other. </p><p>He would definitely hear about you walking around with Chris. It was silly but if you were already doomed to hang out with Chris, why not cause for some drama? </p><p>“Welcome to our humble little town. The market is great, it’s every day and everything’s fresh. Granny likes to come here most days, so you might go with her the other days. Our town is small, we only have a population of three thousand. Unlike Los Angeles.“ you explained, walking ahead while he kept up with you with big steps. The market was in the middle of the small pedestrian zone in the middle of the town. </p><p>“I see,“ he mumbled, looking over the filled market. </p><p>You grinned. Everyone came around for the market in the mornings to get the best vegetables for dinner. You gave him a moment to oversee it, before you nudged his side and nodded to the mass of locals. “Look, I know you don’t want to be here, and I don’t want you to be here either, but let’s get it over with and find something for Granny to cook for tonight.“</p><p>Chris sighed, yet he followed you closely. Perhaps he knew that he didn’t really have another choice. </p><p>“Did you grew up in Los Angeles?“ you questioned him out of nowhere as you looked around the different stands. You knew he didn’t. His birthplace and hometown came immediately up as you had googled his name the night before, but he didn’t need to know that. </p><p>“No,“ he replied. “I grew up in Boston, Massachusetts.“ </p><p>“A Massachusetts guy, I see.“ </p><p>“What about you? Did you grew up here?“ </p><p>You stopped at a stand, hesitating for a moment but then you answered his question truthfully, “I wasn’t born here, but my dad came back here with me when I was two. So technically, I grew up here.“ </p><p>You greeted Gray, the owner of the stand, who made the usual order of your Granny ready as you handed his wife the money. Before you were able to take the filled plastic bag, Chris came forward taking it, leaving you a little stunned. The bright smile of Gary’s wife made it clear to you that you miserably failed to hide it. She looked with wonder from you over to Chris, who noticed it much later and continued to make it even worse as he interrupted the stare with Gary’s wife to look down to you. </p><p><i>Little drama, yes. Wedding bells ringing drama, hell no!</i></p><p>Barely trying to hide your reddened cheeks, you said goodbye quickly, turning on your heels to walk away. After being far enough away from Gary’s stand, you dared to shoot another question. “Did you always wanted to become an actor?“ </p><p>“Looking back, I think it always has been only acting for me. I’m sure I wanted to be a firefighter at some point in my life, but I can’t imagine doing another job than acting now.“ </p><p>“I could never imagine myself acting,“ you mumbled more to yourself than admitting it to him, but your luck was a son of a bitch. </p><p>“Don’t knock it till you try it, I’d say.“</p><p>You shook your head. “No, never in my life.“ </p><p>Catching him nodding in your direction, you raised a brow. “Then tell me, what are you doing with your life?“ </p><p>This wasn’t the way you wanted this conversation to go. Actually, you didn’t even want to exchange any information about your life with him, but you dumbass had started such conversation that is based on exchanging, and now you had to deal with it. “I’m studying psychology at the University of Tennessee,“ you said, stopping in the middle of the market. </p><p>Chris eyed you for a moment, stopping too. “You study psychology? Why?“ </p><p>You shrugged. “I don’t know, it seemed fitting for me.“ </p><p>That was a bland lie. The wish to study psychology had struck you very early in your life, however, this part of your life story you’d never tell him, not even if he wasn’t a Hollywood douche that you had only known for a day. You had no idea if he was buying your lie, or simply having the feeling not to dig any deeper, but you were glad he chose to say nothing.</p><p>You stopped asking him any questions and instead, the two of you walked silently over the market as you placed the orders and Chris taking one bag after the other. Walking back to your Granny’s truck, a wave of misery overcame you. Somehow you were angry at Chris for asking what you were studying. In fact, you were behaving like an asshole, although it wasn’t his fault. You had started the conversation and it naturally went there. It was your own fault. </p><p>You pulled out the keys for the truck out of your pockets as you looked over to the truck. Your luck truly had left you today. Leaning against it was no other than Brandon. </p><p>“Oh fuck,“ you let out. </p><p>You didn’t care if Brandon was a nice guy or not, you truly didn’t want to speak to him right now. No matter if it was about dating this summer again or the battery of the truck. The misery inside you was yelling at the top of its lungs, trying to prove to yourself that you wanted to be alone. </p><p>Chris’s confused gaze moved from you to Brandon. Suddenly, his hand reached out, grabbing your wrist, making you look at him as you both stopped. A bitter shiver ran down your spine because you knew that Brandon was watching you standing there. </p><p>“What’s wrong?“ Chris asked quietly enough that Brandon couldn’t possibly hear a word. </p><p>“Nothing,“ you said, but this time Chris was taking this as an answer enough. “It’s just this guy that I used to go out with when I’m around. He’s not a bad guy, I just—“</p><p>“You just don’t fancy him?“ </p><p>You sighed, looking away. “Yes, kind of. I just want to go—“ </p><p>You cut yourself off as you felt Chris let go of your wrist. A sudden swift movement brought you closer to him. His hands touched your cheek lightly as he brushed your hair behind your ear. The smile on his lips lightened his entire face up, and in this breath of a moment, he looked irresistible. </p><p>“Let’s see how good you can act,“ he said, taking your hand in his, finger intwining. </p><p>Your head was spinning. His smile was addicting, and you couldn’t help but smile back at him. You were short of breath, your heart was racing against your thoughts, but instead of having the feeling that you were about to die, you felt more alive than ever before. </p><p>Chris turned back to the truck, still holding your hand while you walked toward it. Brandon’s gaze was burning on your skin, yet nothing changed from the overwhelming confidence you felt out of nowhere. </p><p>“Hey Brandon, what’s up?“ you said, almost not being able to get out the words.</p><p>Brandon pushed himself away from your Granny’s truck, and you expected him to say something along the lines about the battery, but he was fixed at Chris, who kept up his friendly smile, offering Brandon his hand the next second. </p><p>“Hey man, I’m Chris.“ he introduced himself so bluntly that you immediately stiffed next to him. </p><p>Although he looked as struck as you probably did, Brandon shook his head, followed by a quiet greeting. Chris must have noticed your struggle as his hips nudged yours subtly, almost as if he was reminding you that you were on cue. </p><p>Loosing up a little, you pressed your lips to a smile, making it visible for Brandon that you were waiting. “I just—I just wanted to ask about the,“ he stuttered, pointing to the truck, “um, the battery. Does your Granny want me to order her a new one?“ </p><p><i>That was totally not what he actually wanted to talk about. </i></p><p>“Yeah, that’d great. The truck won’t take her anywhere if she doesn’t get it changed soon.“ </p><p>You couldn’t even believe yourself. The tone of your voice suddenly had changed to a way too positive sounding one, almost squeaking, the way models always talked like. </p><p>Brandon nodded, still seeming not to wrap his head around seeing you with a guy like Chris, before he walked off without saying another word. Your entire body relaxed from the tension, however, you didn’t feel a bit better. </p><p>“Give me the keys, I’ll drive.“ Chris said. No, he more likely demanded, but you weren’t in the mood to put up a fight with him. As well as you gave up the chance of teasing him that he didn’t even know the way back to your Granny’s house. You just let it be and handed over the keys to him, climbing onto the passenger seat the second later. </p><p>In your head, you tried to rewinded the last minutes, trying to find the moment where Chris started acting. From his notice that something was wrong over to his quick response to play something in front of Brandon to scare him away—you were thankful for that. You couldn’t have one of those conversations with Brandon right now, but this action left you more confused than you were before. </p><p>You didn’t like Hollywood guys like Chris, and in these last few minutes, he had reminded you why exactly. </p><p><br/></p><p><br/></p><p><a href=\"https://oneshots-heaven.tumblr.com/post/178829793713/time-out-for-a-movie-star\" target=\"_blank\">&lt;&lt; Last Part</a> –– Next Part &gt;&gt;</p>",
        "body_abstract": "\n<figure data-orig-width=\"500\" data-orig-height=\"250\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/3f4adac4da4120b2a84bb9d020052188/tumblr_inline_pt97wt11gx1rjchpf_540.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"250\"></figure><p><i>A movie star who doesn&rsquo;t want to be trapped in a small town and a small town girl who absolutely doesn&rsquo;t want to have him there&mdash;they should get along, right?</i></p>\n<b>Warning: </b>tiniest bit of swearing<br><b>Chris Evans x Reader<br></b><b style=\"font-size: 14px;\">Part TWO of &ldquo;Time Out For A Movie Star&ldquo;&nbsp;</b>\n",
        "reblog": {
            "comment": "<p><figure data-orig-width=\"500\" data-orig-height=\"250\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/3f4adac4da4120b2a84bb9d020052188/tumblr_inline_pt97wt11gx1rjchpf_540.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"250\"></figure><p><i>A movie star who doesn’t want to be trapped in a small town and a small town girl who absolutely doesn’t want to have him there—they should get along, right?</i></p><b>Warning: </b>tiniest bit of swearing<br><b>Chris Evans x Reader<br></b><b style=\"font-size: 14px;\">Part TWO of “Time Out For A Movie Star“ </b>[[MORE]]<p><i>He was kidding, right? </i></p><p>You couldn’t believe your eyes as you watched from a far how Christopher Evans was carrying the bucket for the fresh eggs while looking like a scared chicken himself. Beginner’s work at its best. </p><p>Hesitatingly, you sat in your dad’s car parked on the yard. There was still the possibility for you to drive away unnoticed by anyone and forget about this stupid idea. You should’ve stood by your word and not drive here instead to keep an eye on your Aunt’s movie star, yet you had no argument to deny the fact that he was intriguing you. Just as much as the fact that he was another one of those pretty Hollywood guys made you furious. And you had no idea which part overweighted the other. </p><p>To do your father the favor, you told yourself that you need to keep your promise and keep helping your granny like you had planned it for the summer and the bonus was only that you would have your fun with teasing a movie star around. </p><p>Still keeping your eyes on him, you watched him standing slightly anxious in front of the chicken coop as if he wasn’t sure if he should just enter it or if he will hunted down by a dozen of chickens. Your mouth twitched and you hated it. Why was this amusing to you? </p><p><i>A celebrity hunted down by angry chickens</i>, yeah, that would be a title story. </p><p>You sighed, knowing that you didn’t have to kiss ass, but also didn’t have to be an asshole to him. Maybe he could use a little help from you to not completely be a failure. Telling yourself this over and over again, you hopped out of the truck, closing the car door with a slam as you walked straight over to him. </p><p>Chris looked away from the coop straight to your direction, still standing there, not sure what he should actually do. “I thought you wanted to leave,“ he said with a nod to you. </p><p><i>Don’t push it</i>. </p><p>“I did,“ you replied, stepping closer, “and I actually had no desire to come back as long as you were here.“ </p><p>He put his free hand on his heart, crutching pretendedly, saying, “Ouch, that hurt.“ </p><p>You rolled your eyes. His sarcasm was the only thing hurting here, but maybe you deserved that one. You glanced over to the coop. “You do know the chickens won’t eat you, do you? You’d be a little too much for them.“ </p><p>Chris shrugged. “I know that, but they are still scary.“ </p><p>You snorted, taking the bucket from him that he was immediately willing to let go off. At least, he was being honest. “Chickens? Scary? No, they’re not. Here, I’ll show you. The ones from Granny are actually very quiet and old, so don’t worry.“ </p><p>Before opening the fence gate to the coop, you took a short glance at him. He was this tall-standing guy with the sun-kissed Cali skin, a handsome face and some real muscles, yet he was scared of some chickens? This could potentially turn into some fun then. </p><p>Opening the short gate, you hold it open for Chris to follow you. He closed the gate behind you two without having you even ask him to do so. It didn’t go unnoticed by you, however, you chose not to say anything. It wasn’t worth it to praise him for these little simple things. </p><p>“They can go in and out of the coop as they choose to because my dad fenced it completely around, but they usually come outside in the mornings after they laid their eggs. It’s fairly easy to get the eggs without getting your hands picked all over.“ you explained as you opened the large door to the coop itself. </p><p>You looked around quickly, checking where eggs were laying and then you gathered them together in one swift movement, having Chris watch you do it. “You check the little nets as I like to call them and then you carefully collect them.“ you said, handing him the small, filled basket. </p><p>With a grin on your lips, you added, “There you go.“ </p><p>Chris starred wordlessly at the basket, taking it out of your hand. His gaze went up from the basket meeting your eyes. “What made you come back?“ </p><p>His question struck you like thunder—quick but powerful. This simple question would’ve sounded simple out of anyone else’s mouth, but he made those words sound like you had been gone for a long time without any hope of ever returning, and it was breaking his heart to see you back. Reminding yourself that he was an actor who should easily awoke feelings like this, which instantly made you not be impressed by it anymore. </p><p>“I couldn’t let my aunt’s favorite client fail at simple tasks like this. Imagine what it would do to his ego.“ you replied, trying to sound carelessly, but failing embarrassingly at it. You were no actress, you had no idea how to overplay a situation like this and not make it awkward. </p><p>Chris’s mouth twitched to a smile. “Guess you can be nice after all, even with the sass.“ </p><p>“Guess you don’t know me at all,“</p><p>“Maybe I’ll have some time to change that.“ </p><p>And as simple as that, he walked out of the coop, leaving you speechlessly behind. You wanted to curse yourself for feeling anything from this faked meanings. This was the damned magic of actors, they were able to make anything sound so beautiful that you were left wondering how beautiful his lies must sound like. </p><p>You followed him back to your grandma’s house, stepping inside it without announcing yourself, walking past Max to pet him quickly before going to the dining room where you grandma had just finished everything for the breakfast. </p><p>“Y/N, my dear. I thought you didn’t want to come back.“ she said playfully surprised, obviously teasing you with a big grin on her face. Chris sat next to her at the table and to your dismiss, he sat right on your favorite spot where you had sat all your life. </p><p><i>That was an argument more to hate him. </i></p><p>Ignoring your Granny’s words, you grabbed a plate set and sat down opposite to him, smiling falsely at him as your eyes met. Your grandma chuckled into her glass of orange juice, overplaying the situation with asking Chris about the chickens. </p><p>“It went good,“ he answered, catching your now angry looking gaze. “Y/N was lovely enough to help me out. Admittedly, I was a tiny bit scared of the chickens.“ </p><p>Your grandma laughed lovingly. “That happens to the best, don’t worry. Y/N used to be scared too when she was little. She hated going to the coop.“ </p><p><i>How dare she?</i></p><p>Chris was still not breaking your stare off, instead he raised an eyebrow. “Oh, did she? Well, she was a brave one today.“ </p><p>Looking away from him over to your grandma, she smiled at you with her typical smile that your heart give in and forget any anger. She grabbed your free hand, rubbing her thumb over the back of it. “I’m glad you’re here to stay. I wanted to show Chris the town but I don’t think I’m ready to drive the truck just yet again. Will you be so kind?“ </p><p>There it was again, the part where you struggled. Christopher Evans was probably going to be the reason why you will feel the need to rip your hair out by the end of the week, and still be a darling in your grandma’s eyes, which was why you were doing her this favor. </p><p>“Alright Superstar, ready to see the bright side of this town?“ you said with a grin. </p><p>You had never seen him more confused before.</p><p>— — — — — </p><p>Panic was written all over his face. If he had believed that the roads you took after you had picked him up from the landing place were rough and broken down, he hadn’t seen most roads around here. The country never put their money toward towns like this, which truly needed it to repair simple things like the streets or update the cell service. Living in this small town was like living two decades behind, but you were so used to it that you didn’t mind it when your friends from college couldn’t reach you over the summer. It was freeing in some way. </p><p>Perhaps that was the exact reason why Aunt Susan had sent Chris here. This was undeniably a good place to get away from toxic places or people. </p><p>You didn’t have to play his babysitter. He was fifteen years older than you, he should be able to do simple tasks but time altered differently around here. In fact, you were the true adult here, instead of him.</p><p>Parking your granny’s old truck in the small parking lot close-by the market, you got out of the car, telling Chris, “Come on,“ </p><p>The market in the town was every single day. Farmers around here sold their fresh vegetables and fruits and bringing the people together. All in all, the community in this town was great, where everyone kind of looked after one another, however which also meant that there were all sorts of rumors and talks between the neighbors.</p><p>The general age around here wasn’t truly the age of Hollywood, or the ones who kept with the glamorous lives of people like Chris. Most people in this town had no clue who Chris was, and now you were walking around with for them, this tall, handsome stranger. You were already seeing the wildfire spread of rumors. </p><p>Granny was right when it came to your little dates with Brandon, you weren’t really into him and especially this summer, you couldn’t handle to be around him. Your dates over the past summers had been all sorts of friendly fun, however, this summer everything seemed different. He was eager, and probably believing that the two of you would end up marrying each other. </p><p>He would definitely hear about you walking around with Chris. It was silly but if you were already doomed to hang out with Chris, why not cause for some drama? </p><p>“Welcome to our humble little town. The market is great, it’s every day and everything’s fresh. Granny likes to come here most days, so you might go with her the other days. Our town is small, we only have a population of three thousand. Unlike Los Angeles.“ you explained, walking ahead while he kept up with you with big steps. The market was in the middle of the small pedestrian zone in the middle of the town. </p><p>“I see,“ he mumbled, looking over the filled market. </p><p>You grinned. Everyone came around for the market in the mornings to get the best vegetables for dinner. You gave him a moment to oversee it, before you nudged his side and nodded to the mass of locals. “Look, I know you don’t want to be here, and I don’t want you to be here either, but let’s get it over with and find something for Granny to cook for tonight.“</p><p>Chris sighed, yet he followed you closely. Perhaps he knew that he didn’t really have another choice. </p><p>“Did you grew up in Los Angeles?“ you questioned him out of nowhere as you looked around the different stands. You knew he didn’t. His birthplace and hometown came immediately up as you had googled his name the night before, but he didn’t need to know that. </p><p>“No,“ he replied. “I grew up in Boston, Massachusetts.“ </p><p>“A Massachusetts guy, I see.“ </p><p>“What about you? Did you grew up here?“ </p><p>You stopped at a stand, hesitating for a moment but then you answered his question truthfully, “I wasn’t born here, but my dad came back here with me when I was two. So technically, I grew up here.“ </p><p>You greeted Gray, the owner of the stand, who made the usual order of your Granny ready as you handed his wife the money. Before you were able to take the filled plastic bag, Chris came forward taking it, leaving you a little stunned. The bright smile of Gary’s wife made it clear to you that you miserably failed to hide it. She looked with wonder from you over to Chris, who noticed it much later and continued to make it even worse as he interrupted the stare with Gary’s wife to look down to you. </p><p><i>Little drama, yes. Wedding bells ringing drama, hell no!</i></p><p>Barely trying to hide your reddened cheeks, you said goodbye quickly, turning on your heels to walk away. After being far enough away from Gary’s stand, you dared to shoot another question. “Did you always wanted to become an actor?“ </p><p>“Looking back, I think it always has been only acting for me. I’m sure I wanted to be a firefighter at some point in my life, but I can’t imagine doing another job than acting now.“ </p><p>“I could never imagine myself acting,“ you mumbled more to yourself than admitting it to him, but your luck was a son of a bitch. </p><p>“Don’t knock it till you try it, I’d say.“</p><p>You shook your head. “No, never in my life.“ </p><p>Catching him nodding in your direction, you raised a brow. “Then tell me, what are you doing with your life?“ </p><p>This wasn’t the way you wanted this conversation to go. Actually, you didn’t even want to exchange any information about your life with him, but you dumbass had started such conversation that is based on exchanging, and now you had to deal with it. “I’m studying psychology at the University of Tennessee,“ you said, stopping in the middle of the market. </p><p>Chris eyed you for a moment, stopping too. “You study psychology? Why?“ </p><p>You shrugged. “I don’t know, it seemed fitting for me.“ </p><p>That was a bland lie. The wish to study psychology had struck you very early in your life, however, this part of your life story you’d never tell him, not even if he wasn’t a Hollywood douche that you had only known for a day. You had no idea if he was buying your lie, or simply having the feeling not to dig any deeper, but you were glad he chose to say nothing.</p><p>You stopped asking him any questions and instead, the two of you walked silently over the market as you placed the orders and Chris taking one bag after the other. Walking back to your Granny’s truck, a wave of misery overcame you. Somehow you were angry at Chris for asking what you were studying. In fact, you were behaving like an asshole, although it wasn’t his fault. You had started the conversation and it naturally went there. It was your own fault. </p><p>You pulled out the keys for the truck out of your pockets as you looked over to the truck. Your luck truly had left you today. Leaning against it was no other than Brandon. </p><p>“Oh fuck,“ you let out. </p><p>You didn’t care if Brandon was a nice guy or not, you truly didn’t want to speak to him right now. No matter if it was about dating this summer again or the battery of the truck. The misery inside you was yelling at the top of its lungs, trying to prove to yourself that you wanted to be alone. </p><p>Chris’s confused gaze moved from you to Brandon. Suddenly, his hand reached out, grabbing your wrist, making you look at him as you both stopped. A bitter shiver ran down your spine because you knew that Brandon was watching you standing there. </p><p>“What’s wrong?“ Chris asked quietly enough that Brandon couldn’t possibly hear a word. </p><p>“Nothing,“ you said, but this time Chris was taking this as an answer enough. “It’s just this guy that I used to go out with when I’m around. He’s not a bad guy, I just—“</p><p>“You just don’t fancy him?“ </p><p>You sighed, looking away. “Yes, kind of. I just want to go—“ </p><p>You cut yourself off as you felt Chris let go of your wrist. A sudden swift movement brought you closer to him. His hands touched your cheek lightly as he brushed your hair behind your ear. The smile on his lips lightened his entire face up, and in this breath of a moment, he looked irresistible. </p><p>“Let’s see how good you can act,“ he said, taking your hand in his, finger intwining. </p><p>Your head was spinning. His smile was addicting, and you couldn’t help but smile back at him. You were short of breath, your heart was racing against your thoughts, but instead of having the feeling that you were about to die, you felt more alive than ever before. </p><p>Chris turned back to the truck, still holding your hand while you walked toward it. Brandon’s gaze was burning on your skin, yet nothing changed from the overwhelming confidence you felt out of nowhere. </p><p>“Hey Brandon, what’s up?“ you said, almost not being able to get out the words.</p><p>Brandon pushed himself away from your Granny’s truck, and you expected him to say something along the lines about the battery, but he was fixed at Chris, who kept up his friendly smile, offering Brandon his hand the next second. </p><p>“Hey man, I’m Chris.“ he introduced himself so bluntly that you immediately stiffed next to him. </p><p>Although he looked as struck as you probably did, Brandon shook his head, followed by a quiet greeting. Chris must have noticed your struggle as his hips nudged yours subtly, almost as if he was reminding you that you were on cue. </p><p>Loosing up a little, you pressed your lips to a smile, making it visible for Brandon that you were waiting. “I just—I just wanted to ask about the,“ he stuttered, pointing to the truck, “um, the battery. Does your Granny want me to order her a new one?“ </p><p><i>That was totally not what he actually wanted to talk about. </i></p><p>“Yeah, that’d great. The truck won’t take her anywhere if she doesn’t get it changed soon.“ </p><p>You couldn’t even believe yourself. The tone of your voice suddenly had changed to a way too positive sounding one, almost squeaking, the way models always talked like. </p><p>Brandon nodded, still seeming not to wrap his head around seeing you with a guy like Chris, before he walked off without saying another word. Your entire body relaxed from the tension, however, you didn’t feel a bit better. </p><p>“Give me the keys, I’ll drive.“ Chris said. No, he more likely demanded, but you weren’t in the mood to put up a fight with him. As well as you gave up the chance of teasing him that he didn’t even know the way back to your Granny’s house. You just let it be and handed over the keys to him, climbing onto the passenger seat the second later. </p><p>In your head, you tried to rewinded the last minutes, trying to find the moment where Chris started acting. From his notice that something was wrong over to his quick response to play something in front of Brandon to scare him away—you were thankful for that. You couldn’t have one of those conversations with Brandon right now, but this action left you more confused than you were before. </p><p>You didn’t like Hollywood guys like Chris, and in these last few minutes, he had reminded you why exactly. </p><p><br></p><p><br></p><p><a href=\"https://oneshots-heaven.tumblr.com/post/178829793713/time-out-for-a-movie-star\" target=\"_blank\">&lt;&lt; Last Part</a> –– Next Part &gt;&gt;</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "oneshots-heaven",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 427,
                        "header_focus_width": 759,
                        "header_focus_height": 427,
                        "avatar_shape": "circle",
                        "background_color": "#F6F6F6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1170,427,411",
                        "header_image": "https://static.tumblr.com/2721ce67b7a98050beb4bab796417f7d/oqk19kr/ue2psxh6f/tumblr_static_8yj3ci8aff48sog44w08cwgss.jpg",
                        "header_image_focused": "https://static.tumblr.com/62657256151193f8164e7ca6b92edef5/oqk19kr/IZJpsxh6g/tumblr_static_tumblr_static_8yj3ci8aff48sog44w08cwgss_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/2721ce67b7a98050beb4bab796417f7d/oqk19kr/ue2psxh6f/tumblr_static_8yj3ci8aff48sog44w08cwgss_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#97343f",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185686619668"
                },
                "content_raw": "<p><figure data-orig-width=\"500\" data-orig-height=\"250\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/3f4adac4da4120b2a84bb9d020052188/tumblr_inline_pt97wt11gx1rjchpf_540.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"250\"></figure><p><i>A movie star who doesn’t want to be trapped in a small town and a small town girl who absolutely doesn’t want to have him there—they should get along, right?</i></p><b>Warning: </b>tiniest bit of swearing<br><b>Chris Evans x Reader<br></b><b style=\"font-size: 14px;\">Part TWO of “Time Out For A Movie Star“ </b>[[MORE]]<p><i>He was kidding, right? </i></p><p>You couldn’t believe your eyes as you watched from a far how Christopher Evans was carrying the bucket for the fresh eggs while looking like a scared chicken himself. Beginner’s work at its best. </p><p>Hesitatingly, you sat in your dad’s car parked on the yard. There was still the possibility for you to drive away unnoticed by anyone and forget about this stupid idea. You should’ve stood by your word and not drive here instead to keep an eye on your Aunt’s movie star, yet you had no argument to deny the fact that he was intriguing you. Just as much as the fact that he was another one of those pretty Hollywood guys made you furious. And you had no idea which part overweighted the other. </p><p>To do your father the favor, you told yourself that you need to keep your promise and keep helping your granny like you had planned it for the summer and the bonus was only that you would have your fun with teasing a movie star around. </p><p>Still keeping your eyes on him, you watched him standing slightly anxious in front of the chicken coop as if he wasn’t sure if he should just enter it or if he will hunted down by a dozen of chickens. Your mouth twitched and you hated it. Why was this amusing to you? </p><p><i>A celebrity hunted down by angry chickens</i>, yeah, that would be a title story. </p><p>You sighed, knowing that you didn’t have to kiss ass, but also didn’t have to be an asshole to him. Maybe he could use a little help from you to not completely be a failure. Telling yourself this over and over again, you hopped out of the truck, closing the car door with a slam as you walked straight over to him. </p><p>Chris looked away from the coop straight to your direction, still standing there, not sure what he should actually do. “I thought you wanted to leave,“ he said with a nod to you. </p><p><i>Don’t push it</i>. </p><p>“I did,“ you replied, stepping closer, “and I actually had no desire to come back as long as you were here.“ </p><p>He put his free hand on his heart, crutching pretendedly, saying, “Ouch, that hurt.“ </p><p>You rolled your eyes. His sarcasm was the only thing hurting here, but maybe you deserved that one. You glanced over to the coop. “You do know the chickens won’t eat you, do you? You’d be a little too much for them.“ </p><p>Chris shrugged. “I know that, but they are still scary.“ </p><p>You snorted, taking the bucket from him that he was immediately willing to let go off. At least, he was being honest. “Chickens? Scary? No, they’re not. Here, I’ll show you. The ones from Granny are actually very quiet and old, so don’t worry.“ </p><p>Before opening the fence gate to the coop, you took a short glance at him. He was this tall-standing guy with the sun-kissed Cali skin, a handsome face and some real muscles, yet he was scared of some chickens? This could potentially turn into some fun then. </p><p>Opening the short gate, you hold it open for Chris to follow you. He closed the gate behind you two without having you even ask him to do so. It didn’t go unnoticed by you, however, you chose not to say anything. It wasn’t worth it to praise him for these little simple things. </p><p>“They can go in and out of the coop as they choose to because my dad fenced it completely around, but they usually come outside in the mornings after they laid their eggs. It’s fairly easy to get the eggs without getting your hands picked all over.“ you explained as you opened the large door to the coop itself. </p><p>You looked around quickly, checking where eggs were laying and then you gathered them together in one swift movement, having Chris watch you do it. “You check the little nets as I like to call them and then you carefully collect them.“ you said, handing him the small, filled basket. </p><p>With a grin on your lips, you added, “There you go.“ </p><p>Chris starred wordlessly at the basket, taking it out of your hand. His gaze went up from the basket meeting your eyes. “What made you come back?“ </p><p>His question struck you like thunder—quick but powerful. This simple question would’ve sounded simple out of anyone else’s mouth, but he made those words sound like you had been gone for a long time without any hope of ever returning, and it was breaking his heart to see you back. Reminding yourself that he was an actor who should easily awoke feelings like this, which instantly made you not be impressed by it anymore. </p><p>“I couldn’t let my aunt’s favorite client fail at simple tasks like this. Imagine what it would do to his ego.“ you replied, trying to sound carelessly, but failing embarrassingly at it. You were no actress, you had no idea how to overplay a situation like this and not make it awkward. </p><p>Chris’s mouth twitched to a smile. “Guess you can be nice after all, even with the sass.“ </p><p>“Guess you don’t know me at all,“</p><p>“Maybe I’ll have some time to change that.“ </p><p>And as simple as that, he walked out of the coop, leaving you speechlessly behind. You wanted to curse yourself for feeling anything from this faked meanings. This was the damned magic of actors, they were able to make anything sound so beautiful that you were left wondering how beautiful his lies must sound like. </p><p>You followed him back to your grandma’s house, stepping inside it without announcing yourself, walking past Max to pet him quickly before going to the dining room where you grandma had just finished everything for the breakfast. </p><p>“Y/N, my dear. I thought you didn’t want to come back.“ she said playfully surprised, obviously teasing you with a big grin on her face. Chris sat next to her at the table and to your dismiss, he sat right on your favorite spot where you had sat all your life. </p><p><i>That was an argument more to hate him. </i></p><p>Ignoring your Granny’s words, you grabbed a plate set and sat down opposite to him, smiling falsely at him as your eyes met. Your grandma chuckled into her glass of orange juice, overplaying the situation with asking Chris about the chickens. </p><p>“It went good,“ he answered, catching your now angry looking gaze. “Y/N was lovely enough to help me out. Admittedly, I was a tiny bit scared of the chickens.“ </p><p>Your grandma laughed lovingly. “That happens to the best, don’t worry. Y/N used to be scared too when she was little. She hated going to the coop.“ </p><p><i>How dare she?</i></p><p>Chris was still not breaking your stare off, instead he raised an eyebrow. “Oh, did she? Well, she was a brave one today.“ </p><p>Looking away from him over to your grandma, she smiled at you with her typical smile that your heart give in and forget any anger. She grabbed your free hand, rubbing her thumb over the back of it. “I’m glad you’re here to stay. I wanted to show Chris the town but I don’t think I’m ready to drive the truck just yet again. Will you be so kind?“ </p><p>There it was again, the part where you struggled. Christopher Evans was probably going to be the reason why you will feel the need to rip your hair out by the end of the week, and still be a darling in your grandma’s eyes, which was why you were doing her this favor. </p><p>“Alright Superstar, ready to see the bright side of this town?“ you said with a grin. </p><p>You had never seen him more confused before.</p><p>— — — — — </p><p>Panic was written all over his face. If he had believed that the roads you took after you had picked him up from the landing place were rough and broken down, he hadn’t seen most roads around here. The country never put their money toward towns like this, which truly needed it to repair simple things like the streets or update the cell service. Living in this small town was like living two decades behind, but you were so used to it that you didn’t mind it when your friends from college couldn’t reach you over the summer. It was freeing in some way. </p><p>Perhaps that was the exact reason why Aunt Susan had sent Chris here. This was undeniably a good place to get away from toxic places or people. </p><p>You didn’t have to play his babysitter. He was fifteen years older than you, he should be able to do simple tasks but time altered differently around here. In fact, you were the true adult here, instead of him.</p><p>Parking your granny’s old truck in the small parking lot close-by the market, you got out of the car, telling Chris, “Come on,“ </p><p>The market in the town was every single day. Farmers around here sold their fresh vegetables and fruits and bringing the people together. All in all, the community in this town was great, where everyone kind of looked after one another, however which also meant that there were all sorts of rumors and talks between the neighbors.</p><p>The general age around here wasn’t truly the age of Hollywood, or the ones who kept with the glamorous lives of people like Chris. Most people in this town had no clue who Chris was, and now you were walking around with for them, this tall, handsome stranger. You were already seeing the wildfire spread of rumors. </p><p>Granny was right when it came to your little dates with Brandon, you weren’t really into him and especially this summer, you couldn’t handle to be around him. Your dates over the past summers had been all sorts of friendly fun, however, this summer everything seemed different. He was eager, and probably believing that the two of you would end up marrying each other. </p><p>He would definitely hear about you walking around with Chris. It was silly but if you were already doomed to hang out with Chris, why not cause for some drama? </p><p>“Welcome to our humble little town. The market is great, it’s every day and everything’s fresh. Granny likes to come here most days, so you might go with her the other days. Our town is small, we only have a population of three thousand. Unlike Los Angeles.“ you explained, walking ahead while he kept up with you with big steps. The market was in the middle of the small pedestrian zone in the middle of the town. </p><p>“I see,“ he mumbled, looking over the filled market. </p><p>You grinned. Everyone came around for the market in the mornings to get the best vegetables for dinner. You gave him a moment to oversee it, before you nudged his side and nodded to the mass of locals. “Look, I know you don’t want to be here, and I don’t want you to be here either, but let’s get it over with and find something for Granny to cook for tonight.“</p><p>Chris sighed, yet he followed you closely. Perhaps he knew that he didn’t really have another choice. </p><p>“Did you grew up in Los Angeles?“ you questioned him out of nowhere as you looked around the different stands. You knew he didn’t. His birthplace and hometown came immediately up as you had googled his name the night before, but he didn’t need to know that. </p><p>“No,“ he replied. “I grew up in Boston, Massachusetts.“ </p><p>“A Massachusetts guy, I see.“ </p><p>“What about you? Did you grew up here?“ </p><p>You stopped at a stand, hesitating for a moment but then you answered his question truthfully, “I wasn’t born here, but my dad came back here with me when I was two. So technically, I grew up here.“ </p><p>You greeted Gray, the owner of the stand, who made the usual order of your Granny ready as you handed his wife the money. Before you were able to take the filled plastic bag, Chris came forward taking it, leaving you a little stunned. The bright smile of Gary’s wife made it clear to you that you miserably failed to hide it. She looked with wonder from you over to Chris, who noticed it much later and continued to make it even worse as he interrupted the stare with Gary’s wife to look down to you. </p><p><i>Little drama, yes. Wedding bells ringing drama, hell no!</i></p><p>Barely trying to hide your reddened cheeks, you said goodbye quickly, turning on your heels to walk away. After being far enough away from Gary’s stand, you dared to shoot another question. “Did you always wanted to become an actor?“ </p><p>“Looking back, I think it always has been only acting for me. I’m sure I wanted to be a firefighter at some point in my life, but I can’t imagine doing another job than acting now.“ </p><p>“I could never imagine myself acting,“ you mumbled more to yourself than admitting it to him, but your luck was a son of a bitch. </p><p>“Don’t knock it till you try it, I’d say.“</p><p>You shook your head. “No, never in my life.“ </p><p>Catching him nodding in your direction, you raised a brow. “Then tell me, what are you doing with your life?“ </p><p>This wasn’t the way you wanted this conversation to go. Actually, you didn’t even want to exchange any information about your life with him, but you dumbass had started such conversation that is based on exchanging, and now you had to deal with it. “I’m studying psychology at the University of Tennessee,“ you said, stopping in the middle of the market. </p><p>Chris eyed you for a moment, stopping too. “You study psychology? Why?“ </p><p>You shrugged. “I don’t know, it seemed fitting for me.“ </p><p>That was a bland lie. The wish to study psychology had struck you very early in your life, however, this part of your life story you’d never tell him, not even if he wasn’t a Hollywood douche that you had only known for a day. You had no idea if he was buying your lie, or simply having the feeling not to dig any deeper, but you were glad he chose to say nothing.</p><p>You stopped asking him any questions and instead, the two of you walked silently over the market as you placed the orders and Chris taking one bag after the other. Walking back to your Granny’s truck, a wave of misery overcame you. Somehow you were angry at Chris for asking what you were studying. In fact, you were behaving like an asshole, although it wasn’t his fault. You had started the conversation and it naturally went there. It was your own fault. </p><p>You pulled out the keys for the truck out of your pockets as you looked over to the truck. Your luck truly had left you today. Leaning against it was no other than Brandon. </p><p>“Oh fuck,“ you let out. </p><p>You didn’t care if Brandon was a nice guy or not, you truly didn’t want to speak to him right now. No matter if it was about dating this summer again or the battery of the truck. The misery inside you was yelling at the top of its lungs, trying to prove to yourself that you wanted to be alone. </p><p>Chris’s confused gaze moved from you to Brandon. Suddenly, his hand reached out, grabbing your wrist, making you look at him as you both stopped. A bitter shiver ran down your spine because you knew that Brandon was watching you standing there. </p><p>“What’s wrong?“ Chris asked quietly enough that Brandon couldn’t possibly hear a word. </p><p>“Nothing,“ you said, but this time Chris was taking this as an answer enough. “It’s just this guy that I used to go out with when I’m around. He’s not a bad guy, I just—“</p><p>“You just don’t fancy him?“ </p><p>You sighed, looking away. “Yes, kind of. I just want to go—“ </p><p>You cut yourself off as you felt Chris let go of your wrist. A sudden swift movement brought you closer to him. His hands touched your cheek lightly as he brushed your hair behind your ear. The smile on his lips lightened his entire face up, and in this breath of a moment, he looked irresistible. </p><p>“Let’s see how good you can act,“ he said, taking your hand in his, finger intwining. </p><p>Your head was spinning. His smile was addicting, and you couldn’t help but smile back at him. You were short of breath, your heart was racing against your thoughts, but instead of having the feeling that you were about to die, you felt more alive than ever before. </p><p>Chris turned back to the truck, still holding your hand while you walked toward it. Brandon’s gaze was burning on your skin, yet nothing changed from the overwhelming confidence you felt out of nowhere. </p><p>“Hey Brandon, what’s up?“ you said, almost not being able to get out the words.</p><p>Brandon pushed himself away from your Granny’s truck, and you expected him to say something along the lines about the battery, but he was fixed at Chris, who kept up his friendly smile, offering Brandon his hand the next second. </p><p>“Hey man, I’m Chris.“ he introduced himself so bluntly that you immediately stiffed next to him. </p><p>Although he looked as struck as you probably did, Brandon shook his head, followed by a quiet greeting. Chris must have noticed your struggle as his hips nudged yours subtly, almost as if he was reminding you that you were on cue. </p><p>Loosing up a little, you pressed your lips to a smile, making it visible for Brandon that you were waiting. “I just—I just wanted to ask about the,“ he stuttered, pointing to the truck, “um, the battery. Does your Granny want me to order her a new one?“ </p><p><i>That was totally not what he actually wanted to talk about. </i></p><p>“Yeah, that’d great. The truck won’t take her anywhere if she doesn’t get it changed soon.“ </p><p>You couldn’t even believe yourself. The tone of your voice suddenly had changed to a way too positive sounding one, almost squeaking, the way models always talked like. </p><p>Brandon nodded, still seeming not to wrap his head around seeing you with a guy like Chris, before he walked off without saying another word. Your entire body relaxed from the tension, however, you didn’t feel a bit better. </p><p>“Give me the keys, I’ll drive.“ Chris said. No, he more likely demanded, but you weren’t in the mood to put up a fight with him. As well as you gave up the chance of teasing him that he didn’t even know the way back to your Granny’s house. You just let it be and handed over the keys to him, climbing onto the passenger seat the second later. </p><p>In your head, you tried to rewinded the last minutes, trying to find the moment where Chris started acting. From his notice that something was wrong over to his quick response to play something in front of Brandon to scare him away—you were thankful for that. You couldn’t have one of those conversations with Brandon right now, but this action left you more confused than you were before. </p><p>You didn’t like Hollywood guys like Chris, and in these last few minutes, he had reminded you why exactly. </p><p><br></p><p><br></p><p><a href=\"https://oneshots-heaven.tumblr.com/post/178829793713/time-out-for-a-movie-star\" target=\"_blank\">&lt;&lt; Last Part</a> –– Next Part &gt;&gt;</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/3f4adac4da4120b2a84bb9d020052188/tumblr_inline_pt97wt11gx1rjchpf_540.gif\" class=\"\"/></figure><p><i>A movie star who doesn&rsquo;t want to be trapped in a small town and a small town girl who absolutely doesn&rsquo;t want to have him there&mdash;they should get along, right?</i></p><b>Warning: </b>tiniest bit of swearing<br /><b>Chris Evans x Reader<br /></b><b>Part TWO of &ldquo;Time Out For A Movie Star&ldquo;&nbsp;</b><p><i>He was kidding, right? </i></p><p>You couldn&rsquo;t believe your eyes as you watched from a far how Christopher Evans was carrying the bucket for the fresh eggs while looking like a scared chicken himself. Beginner&rsquo;s work at its best. </p><p>Hesitatingly, you sat in your dad&rsquo;s car parked on the yard. There was still the possibility for you to drive away unnoticed by anyone and forget about this stupid idea. You should&rsquo;ve stood by your word and not drive here instead to keep an eye on your Aunt&rsquo;s movie star, yet you had no argument to deny the fact that he was intriguing you. Just as much as the fact that he was another one of those pretty Hollywood guys made you furious. And you had no idea which part overweighted the other. </p><p>To do your father the favor, you told yourself that you need to keep your promise and keep helping your granny like you had planned it for the summer and the bonus was only that you would have your fun with teasing a movie star around. </p><p>Still keeping your eyes on him, you watched him standing slightly anxious in front of the chicken coop as if he wasn&rsquo;t sure if he should just enter it or if he will hunted down by a dozen of chickens. Your mouth twitched and you hated it. Why was this amusing to you? </p><p><i>A celebrity hunted down by angry chickens</i>, yeah, that would be a title story. </p><p>You sighed, knowing that you didn&rsquo;t have to kiss ass, but also didn&rsquo;t have to be an asshole to him. Maybe he could use a little help from you to not completely be a failure. Telling yourself this over and over again, you hopped out of the truck, closing the car door with a slam as you walked straight over to him. </p><p>Chris looked away from the coop straight to your direction, still standing there, not sure what he should actually do. &ldquo;I thought you wanted to leave,&ldquo; he said with a nod to you. </p><p><i>Don&rsquo;t push it</i>. </p><p>&ldquo;I did,&ldquo; you replied, stepping closer, &ldquo;and I actually had no desire to come back as long as you were here.&ldquo; </p><p>He put his free hand on his heart, crutching pretendedly, saying, &ldquo;Ouch, that hurt.&ldquo; </p><p>You rolled your eyes. His sarcasm was the only thing hurting here, but maybe you deserved that one. You glanced over to the coop. &ldquo;You do know the chickens won&rsquo;t eat you, do you? You&rsquo;d be a little too much for them.&ldquo; </p><p>Chris shrugged. &ldquo;I know that, but they are still scary.&ldquo; </p><p>You snorted, taking the bucket from him that he was immediately willing to let go off. At least, he was being honest. &ldquo;Chickens? Scary? No, they&rsquo;re not. Here, I&rsquo;ll show you. The ones from Granny are actually very quiet and old, so don&rsquo;t worry.&ldquo; </p><p>Before opening the fence gate to the coop, you took a short glance at him. He was this tall-standing guy with the sun-kissed Cali skin, a handsome face and some real muscles, yet he was scared of some chickens? This could potentially turn into some fun then. </p><p>Opening the short gate, you hold it open for Chris to follow you. He closed the gate behind you two without having you even ask him to do so. It didn&rsquo;t go unnoticed by you, however, you chose not to say anything. It wasn&rsquo;t worth it to praise him for these little simple things. </p><p>&ldquo;They can go in and out of the coop as they choose to because my dad fenced it completely around, but they usually come outside in the mornings after they laid their eggs. It&rsquo;s fairly easy to get the eggs without getting your hands picked all over.&ldquo; you explained as you opened the large door to the coop itself. </p><p>You looked around quickly, checking where eggs were laying and then you gathered them together in one swift movement, having Chris watch you do it. &ldquo;You check the little nets as I like to call them and then you carefully collect them.&ldquo; you said, handing him the small, filled basket. </p><p>With a grin on your lips, you added, &ldquo;There you go.&ldquo; </p><p>Chris starred wordlessly at the basket, taking it out of your hand. His gaze went up from the basket meeting your eyes. &ldquo;What made you come back?&ldquo; </p><p>His question struck you like thunder&mdash;quick but powerful. This simple question would&rsquo;ve sounded simple out of anyone else&rsquo;s mouth, but he made those words sound like you had been gone for a long time without any hope of ever returning, and it was breaking his heart to see you back. Reminding yourself that he was an actor who should easily awoke feelings like this, which instantly made you not be impressed by it anymore. </p><p>&ldquo;I couldn&rsquo;t let my aunt&rsquo;s favorite client fail at simple tasks like this. Imagine what it would do to his ego.&ldquo; you replied, trying to sound carelessly, but failing embarrassingly at it. You were no actress, you had no idea how to overplay a situation like this and not make it awkward. </p><p>Chris&rsquo;s mouth twitched to a smile. &ldquo;Guess you can be nice after all, even with the sass.&ldquo; </p><p>&ldquo;Guess you don&rsquo;t know me at all,&ldquo;</p><p>&ldquo;Maybe I&rsquo;ll have some time to change that.&ldquo; </p><p>And as simple as that, he walked out of the coop, leaving you speechlessly behind. You wanted to curse yourself for feeling anything from this faked meanings. This was the damned magic of actors, they were able to make anything sound so beautiful that you were left wondering how beautiful his lies must sound like. </p><p>You followed him back to your grandma&rsquo;s house, stepping inside it without announcing yourself, walking past Max to pet him quickly before going to the dining room where you grandma had just finished everything for the breakfast. </p><p>&ldquo;Y/N, my dear. I thought you didn&rsquo;t want to come back.&ldquo; she said playfully surprised, obviously teasing you with a big grin on her face. Chris sat next to her at the table and to your dismiss, he sat right on your favorite spot where you had sat all your life. </p><p><i>That was an argument more to hate him. </i></p><p>Ignoring your Granny&rsquo;s words, you grabbed a plate set and sat down opposite to him, smiling falsely at him as your eyes met. Your grandma chuckled into her glass of orange juice, overplaying the situation with asking Chris about the chickens. </p><p>&ldquo;It went good,&ldquo; he answered, catching your now angry looking gaze. &ldquo;Y/N was lovely enough to help me out. Admittedly, I was a tiny bit scared of the chickens.&ldquo; </p><p>Your grandma laughed lovingly. &ldquo;That happens to the best, don&rsquo;t worry. Y/N used to be scared too when she was little. She hated going to the coop.&ldquo; </p><p><i>How dare she?</i></p><p>Chris was still not breaking your stare off, instead he raised an eyebrow. &ldquo;Oh, did she? Well, she was a brave one today.&ldquo; </p><p>Looking away from him over to your grandma, she smiled at you with her typical smile that your heart give in and forget any anger. She grabbed your free hand, rubbing her thumb over the back of it. &ldquo;I&rsquo;m glad you&rsquo;re here to stay. I wanted to show Chris the town but I don&rsquo;t think I&rsquo;m ready to drive the truck just yet again. Will you be so kind?&ldquo; </p><p>There it was again, the part where you struggled. Christopher Evans was probably going to be the reason why you will feel the need to rip your hair out by the end of the week, and still be a darling in your grandma&rsquo;s eyes, which was why you were doing her this favor. </p><p>&ldquo;Alright Superstar, ready to see the bright side of this town?&ldquo; you said with a grin. </p><p>You had never seen him more confused before.</p><p>&mdash; &mdash; &mdash; &mdash; &mdash; </p><p>Panic was written all over his face. If he had believed that the roads you took after you had picked him up from the landing place were rough and broken down, he hadn&rsquo;t seen most roads around here. The country never put their money toward towns like this, which truly needed it to repair simple things like the streets or update the cell service. Living in this small town was like living two decades behind, but you were so used to it that you didn&rsquo;t mind it when your friends from college couldn&rsquo;t reach you over the summer. It was freeing in some way. </p><p>Perhaps that was the exact reason why Aunt Susan had sent Chris here. This was undeniably a good place to get away from toxic places or people. </p><p>You didn&rsquo;t have to play his babysitter. He was fifteen years older than you, he should be able to do simple tasks but time altered differently around here. In fact, you were the true adult here, instead of him.</p><p>Parking your granny&rsquo;s old truck in the small parking lot close-by the market, you got out of the car, telling Chris, &ldquo;Come on,&ldquo; </p><p>The market in the town was every single day. Farmers around here sold their fresh vegetables and fruits and bringing the people together. All in all, the community in this town was great, where everyone kind of looked after one another, however which also meant that there were all sorts of rumors and talks between the neighbors.</p><p>The general age around here wasn&rsquo;t truly the age of Hollywood, or the ones who kept with the glamorous lives of people like Chris. Most people in this town had no clue who Chris was, and now you were walking around with for them, this tall, handsome stranger. You were already seeing the wildfire spread of rumors. </p><p>Granny was right when it came to your little dates with Brandon, you weren&rsquo;t really into him and especially this summer, you couldn&rsquo;t handle to be around him. Your dates over the past summers had been all sorts of friendly fun, however, this summer everything seemed different. He was eager, and probably believing that the two of you would end up marrying each other. </p><p>He would definitely hear about you walking around with Chris. It was silly but if you were already doomed to hang out with Chris, why not cause for some drama? </p><p>&ldquo;Welcome to our humble little town. The market is great, it&rsquo;s every day and everything&rsquo;s fresh. Granny likes to come here most days, so you might go with her the other days. Our town is small, we only have a population of three thousand. Unlike Los Angeles.&ldquo; you explained, walking ahead while he kept up with you with big steps. The market was in the middle of the small pedestrian zone in the middle of the town. </p><p>&ldquo;I see,&ldquo; he mumbled, looking over the filled market. </p><p>You grinned. Everyone came around for the market in the mornings to get the best vegetables for dinner. You gave him a moment to oversee it, before you nudged his side and nodded to the mass of locals. &ldquo;Look, I know you don&rsquo;t want to be here, and I don&rsquo;t want you to be here either, but let&rsquo;s get it over with and find something for Granny to cook for tonight.&ldquo;</p><p>Chris sighed, yet he followed you closely. Perhaps he knew that he didn&rsquo;t really have another choice. </p><p>&ldquo;Did you grew up in Los Angeles?&ldquo; you questioned him out of nowhere as you looked around the different stands. You knew he didn&rsquo;t. His birthplace and hometown came immediately up as you had googled his name the night before, but he didn&rsquo;t need to know that. </p><p>&ldquo;No,&ldquo; he replied. &ldquo;I grew up in Boston, Massachusetts.&ldquo; </p><p>&ldquo;A Massachusetts guy, I see.&ldquo; </p><p>&ldquo;What about you? Did you grew up here?&ldquo; </p><p>You stopped at a stand, hesitating for a moment but then you answered his question truthfully, &ldquo;I wasn&rsquo;t born here, but my dad came back here with me when I was two. So technically, I grew up here.&ldquo; </p><p>You greeted Gray, the owner of the stand, who made the usual order of your Granny ready as you handed his wife the money. Before you were able to take the filled plastic bag, Chris came forward taking it, leaving you a little stunned. The bright smile of Gary&rsquo;s wife made it clear to you that you miserably failed to hide it. She looked with wonder from you over to Chris, who noticed it much later and continued to make it even worse as he interrupted the stare with Gary&rsquo;s wife to look down to you. </p><p><i>Little drama, yes. Wedding bells ringing drama, hell no!</i></p><p>Barely trying to hide your reddened cheeks, you said goodbye quickly, turning on your heels to walk away. After being far enough away from Gary&rsquo;s stand, you dared to shoot another question. &ldquo;Did you always wanted to become an actor?&ldquo; </p><p>&ldquo;Looking back, I think it always has been only acting for me. I&rsquo;m sure I wanted to be a firefighter at some point in my life, but I can&rsquo;t imagine doing another job than acting now.&ldquo; </p><p>&ldquo;I could never imagine myself acting,&ldquo; you mumbled more to yourself than admitting it to him, but your luck was a son of a bitch. </p><p>&ldquo;Don&rsquo;t knock it till you try it, I&rsquo;d say.&ldquo;</p><p>You shook your head. &ldquo;No, never in my life.&ldquo; </p><p>Catching him nodding in your direction, you raised a brow. &ldquo;Then tell me, what are you doing with your life?&ldquo; </p><p>This wasn&rsquo;t the way you wanted this conversation to go. Actually, you didn&rsquo;t even want to exchange any information about your life with him, but you dumbass had started such conversation that is based on exchanging, and now you had to deal with it. &ldquo;I&rsquo;m studying psychology at the University of Tennessee,&ldquo; you said, stopping in the middle of the market. </p><p>Chris eyed you for a moment, stopping too. &ldquo;You study psychology? Why?&ldquo; </p><p>You shrugged. &ldquo;I don&rsquo;t know, it seemed fitting for me.&ldquo; </p><p>That was a bland lie. The wish to study psychology had struck you very early in your life, however, this part of your life story you&rsquo;d never tell him, not even if he wasn&rsquo;t a Hollywood douche that you had only known for a day. You had no idea if he was buying your lie, or simply having the feeling not to dig any deeper, but you were glad he chose to say nothing.</p><p>You stopped asking him any questions and instead, the two of you walked silently over the market as you placed the orders and Chris taking one bag after the other. Walking back to your Granny&rsquo;s truck, a wave of misery overcame you. Somehow you were angry at Chris for asking what you were studying. In fact, you were behaving like an asshole, although it wasn&rsquo;t his fault. You had started the conversation and it naturally went there. It was your own fault. </p><p>You pulled out the keys for the truck out of your pockets as you looked over to the truck. Your luck truly had left you today. Leaning against it was no other than Brandon. </p><p>&ldquo;Oh fuck,&ldquo; you let out. </p><p>You didn&rsquo;t care if Brandon was a nice guy or not, you truly didn&rsquo;t want to speak to him right now. No matter if it was about dating this summer again or the battery of the truck. The misery inside you was yelling at the top of its lungs, trying to prove to yourself that you wanted to be alone. </p><p>Chris&rsquo;s confused gaze moved from you to Brandon. Suddenly, his hand reached out, grabbing your wrist, making you look at him as you both stopped. A bitter shiver ran down your spine because you knew that Brandon was watching you standing there. </p><p>&ldquo;What&rsquo;s wrong?&ldquo; Chris asked quietly enough that Brandon couldn&rsquo;t possibly hear a word. </p><p>&ldquo;Nothing,&ldquo; you said, but this time Chris was taking this as an answer enough. &ldquo;It&rsquo;s just this guy that I used to go out with when I&rsquo;m around. He&rsquo;s not a bad guy, I just&mdash;&ldquo;</p><p>&ldquo;You just don&rsquo;t fancy him?&ldquo; </p><p>You sighed, looking away. &ldquo;Yes, kind of. I just want to go&mdash;&ldquo; </p><p>You cut yourself off as you felt Chris let go of your wrist. A sudden swift movement brought you closer to him. His hands touched your cheek lightly as he brushed your hair behind your ear. The smile on his lips lightened his entire face up, and in this breath of a moment, he looked irresistible. </p><p>&ldquo;Let&rsquo;s see how good you can act,&ldquo; he said, taking your hand in his, finger intwining. </p><p>Your head was spinning. His smile was addicting, and you couldn&rsquo;t help but smile back at him. You were short of breath, your heart was racing against your thoughts, but instead of having the feeling that you were about to die, you felt more alive than ever before. </p><p>Chris turned back to the truck, still holding your hand while you walked toward it. Brandon&rsquo;s gaze was burning on your skin, yet nothing changed from the overwhelming confidence you felt out of nowhere. </p><p>&ldquo;Hey Brandon, what&rsquo;s up?&ldquo; you said, almost not being able to get out the words.</p><p>Brandon pushed himself away from your Granny&rsquo;s truck, and you expected him to say something along the lines about the battery, but he was fixed at Chris, who kept up his friendly smile, offering Brandon his hand the next second. </p><p>&ldquo;Hey man, I&rsquo;m Chris.&ldquo; he introduced himself so bluntly that you immediately stiffed next to him. </p><p>Although he looked as struck as you probably did, Brandon shook his head, followed by a quiet greeting. Chris must have noticed your struggle as his hips nudged yours subtly, almost as if he was reminding you that you were on cue. </p><p>Loosing up a little, you pressed your lips to a smile, making it visible for Brandon that you were waiting. &ldquo;I just&mdash;I just wanted to ask about the,&ldquo; he stuttered, pointing to the truck, &ldquo;um, the battery. Does your Granny want me to order her a new one?&ldquo; </p><p><i>That was totally not what he actually wanted to talk about. </i></p><p>&ldquo;Yeah, that&rsquo;d great. The truck won&rsquo;t take her anywhere if she doesn&rsquo;t get it changed soon.&ldquo; </p><p>You couldn&rsquo;t even believe yourself. The tone of your voice suddenly had changed to a way too positive sounding one, almost squeaking, the way models always talked like. </p><p>Brandon nodded, still seeming not to wrap his head around seeing you with a guy like Chris, before he walked off without saying another word. Your entire body relaxed from the tension, however, you didn&rsquo;t feel a bit better. </p><p>&ldquo;Give me the keys, I&rsquo;ll drive.&ldquo; Chris said. No, he more likely demanded, but you weren&rsquo;t in the mood to put up a fight with him. As well as you gave up the chance of teasing him that he didn&rsquo;t even know the way back to your Granny&rsquo;s house. You just let it be and handed over the keys to him, climbing onto the passenger seat the second later. </p><p>In your head, you tried to rewinded the last minutes, trying to find the moment where Chris started acting. From his notice that something was wrong over to his quick response to play something in front of Brandon to scare him away&mdash;you were thankful for that. You couldn&rsquo;t have one of those conversations with Brandon right now, but this action left you more confused than you were before. </p><p>You didn&rsquo;t like Hollywood guys like Chris, and in these last few minutes, he had reminded you why exactly. </p><p><br /></p><p><br /></p><p><a href=\"https://oneshots-heaven.tumblr.com/post/178829793713/time-out-for-a-movie-star\" target=\"_blank\">&lt;&lt; Last Part</a> &ndash;&ndash; Next Part &gt;&gt;</p></p>",
                "content_abstract": "<p>\n<figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/3f4adac4da4120b2a84bb9d020052188/tumblr_inline_pt97wt11gx1rjchpf_540.gif\" class=\"\"/></figure>\n<p><i>A movie star who doesn&rsquo;t want to be trapped in a small town and a small town girl who absolutely doesn&rsquo;t want to have him there&mdash;they should get along, right?</i></p>\n<b>Warning: </b>tiniest bit of swearing<br /><b>Chris Evans x Reader<br /></b><b>Part TWO of &ldquo;Time Out For A Movie Star&ldquo;&nbsp;</b>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "crboston",
        "blog": {
            "name": "crboston",
            "title": "evans",
            "description": "bubba // smile, it's summer ",
            "url": "https://crboston.tumblr.com/",
            "uuid": "t:y8QsIYPCnbd51tlvA8hJ-g",
            "updated": 1561752788
        },
        "id": 185685785091,
        "post_url": "https://crboston.tumblr.com/post/185685785091/most-important-thing-you-own",
        "slug": "most-important-thing-you-own",
        "date": "2019-06-18 20:22:37 GMT",
        "timestamp": 1560889357,
        "state": "published",
        "format": "html",
        "reblog_key": "cld97yRl",
        "tags": [
            "chris evans",
            "evansedit",
            "gif",
            "1k",
            "2k"
        ],
        "short_url": "https://tmblr.co/ZyvuSh2ixl3e3",
        "summary": "— Most important thing you own? ",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 2142,
        "caption": "<p><small>— Most important thing you own?</small> </p>",
        "reblog": {
            "comment": "<p><small>— Most important thing you own?</small> </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "crboston",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/a2ad3aebe4a2b9e1f5dd205df802fe70/osusqg0/Ow4pqz1my/tumblr_static_-2094897320-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/a2ad3aebe4a2b9e1f5dd205df802fe70/osusqg0/Ow4pqz1my/tumblr_static_-2094897320-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/a2ad3aebe4a2b9e1f5dd205df802fe70/osusqg0/Ow4pqz1my/tumblr_static_-2094897320-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#222222",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185685785091"
                },
                "content_raw": "<p><small>— Most important thing you own?</small> </p>",
                "content": "<p><small>&mdash; Most important thing you own?</small>&nbsp;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "2",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/f48f3f3341cd166029c2c1b9a79961ba/tumblr_pt9b5zAKGr1vqppfto1_400.gif",
                    "width": 268,
                    "height": 315
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/f48f3f3341cd166029c2c1b9a79961ba/tumblr_pt9b5zAKGr1vqppfto1_400.gif",
                        "width": 268,
                        "height": 315
                    },
                    {
                        "url": "https://66.media.tumblr.com/f48f3f3341cd166029c2c1b9a79961ba/tumblr_pt9b5zAKGr1vqppfto1_250.gif",
                        "width": 250,
                        "height": 294
                    },
                    {
                        "url": "https://66.media.tumblr.com/f48f3f3341cd166029c2c1b9a79961ba/tumblr_pt9b5zAKGr1vqppfto1_100.gif",
                        "width": 100,
                        "height": 118
                    },
                    {
                        "url": "https://66.media.tumblr.com/f48f3f3341cd166029c2c1b9a79961ba/tumblr_pt9b5zAKGr1vqppfto1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/c8ebc30c2dff1762775d65b071e930fb/tumblr_pt9b5zAKGr1vqppfto2_400.gif",
                    "width": 268,
                    "height": 315
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/c8ebc30c2dff1762775d65b071e930fb/tumblr_pt9b5zAKGr1vqppfto2_400.gif",
                        "width": 268,
                        "height": 315
                    },
                    {
                        "url": "https://66.media.tumblr.com/c8ebc30c2dff1762775d65b071e930fb/tumblr_pt9b5zAKGr1vqppfto2_250.gif",
                        "width": 250,
                        "height": 294
                    },
                    {
                        "url": "https://66.media.tumblr.com/c8ebc30c2dff1762775d65b071e930fb/tumblr_pt9b5zAKGr1vqppfto2_100.gif",
                        "width": 100,
                        "height": 118
                    },
                    {
                        "url": "https://66.media.tumblr.com/c8ebc30c2dff1762775d65b071e930fb/tumblr_pt9b5zAKGr1vqppfto2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "cheermeupthankyou",
        "blog": {
            "name": "cheermeupthankyou",
            "title": "You don't know what you can save me from.",
            "description": "Hi, I'm Nel. I'm a chinese-sundanese-javanese Indonesian with German ancestors whose heart was left in New York. \nI love cats. And I talk to my plants. \nPartial photographer and a cook, but just basically a gamer girl.\n#CaptainMarvel 🌈\n#Queer #DragRace #BrieLarson #MackenzieDavis #CateBlanchett",
            "url": "https://cheermeupthankyou.tumblr.com/",
            "uuid": "t:7nGwOjWfXIA5E1SJMeaxiQ",
            "updated": 1561742975
        },
        "id": 185685280486,
        "post_url": "https://cheermeupthankyou.tumblr.com/post/185685280486/do-lesbians-in-general-have-a-tendency-to-have-a",
        "slug": "do-lesbians-in-general-have-a-tendency-to-have-a",
        "date": "2019-06-18 19:57:02 GMT",
        "timestamp": 1560887822,
        "state": "published",
        "format": "html",
        "reblog_key": "5DcRkbA6",
        "tags": [
            "brie larson",
            "chyler leigh",
            "chris evans",
            "captain marvel",
            "carol danvers",
            "supergirl",
            "alex danvers",
            "unicorn store",
            "not another teen movie",
            "avengers",
            "endgame",
            "captain america",
            "steve rogers"
        ],
        "short_url": "https://tmblr.co/ZL4pEy2ixj8Rc",
        "summary": "DO LESBIANS IN GENERAL HAVE A TENDENCY TO HAVE A DORKY COVERED-IN-PAINT WEARING-OVERALLS-INDULGING-IN-ART PAST BUT THEN GREW UP...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 712,
        "caption": "<p>DO LESBIANS IN GENERAL HAVE A TENDENCY TO HAVE A DORKY COVERED-IN-PAINT WEARING-OVERALLS-INDULGING-IN-ART PAST BUT THEN GREW UP TO BE A SASSY SUPERHERO LATER ON?<br/>.<br/>.<br/>.<br/>Also, Chris Evans being in movies with them both makes him the ultimate lesbian ally. </p><figure data-orig-width=\"500\" data-orig-height=\"232\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/a444e43cad3f2a1ec3c26f6096bb6d4d/tumblr_inline_ptb8g1Bu1Y1qco433_540.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"232\"/></figure>",
        "reblog": {
            "comment": "<p><p>DO LESBIANS IN GENERAL HAVE A TENDENCY TO HAVE A DORKY COVERED-IN-PAINT WEARING-OVERALLS-INDULGING-IN-ART PAST BUT THEN GREW UP TO BE A SASSY SUPERHERO LATER ON?<br>.<br>.<br>.<br>Also, Chris Evans being in movies with them both makes him the ultimate lesbian ally. </p><figure data-orig-width=\"500\" data-orig-height=\"232\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/a444e43cad3f2a1ec3c26f6096bb6d4d/tumblr_inline_ptb8g1Bu1Y1qco433_540.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"232\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "cheermeupthankyou",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 667,
                        "header_focus_width": 500,
                        "header_focus_height": 281,
                        "avatar_shape": "square",
                        "background_color": "#F6F6F6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "319,500,600,0",
                        "header_image": "https://static.tumblr.com/8ab72d43f517cd7097578c716fe4c5aa/isas1uu/VOLn6o19x/tumblr_static_ewh7iklb6qgc480kg8ocs08w0.jpg",
                        "header_image_focused": "https://static.tumblr.com/8ab72d43f517cd7097578c716fe4c5aa/isas1uu/mZdprdjpw/tumblr_static_tumblr_static_ewh7iklb6qgc480kg8ocs08w0_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_02_focused_v3.png?_v=b976ee00195b1b7806c94ae285ca46a7",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185685280486"
                },
                "content_raw": "<p><p>DO LESBIANS IN GENERAL HAVE A TENDENCY TO HAVE A DORKY COVERED-IN-PAINT WEARING-OVERALLS-INDULGING-IN-ART PAST BUT THEN GREW UP TO BE A SASSY SUPERHERO LATER ON?<br>.<br>.<br>.<br>Also, Chris Evans being in movies with them both makes him the ultimate lesbian ally. </p><figure data-orig-width=\"500\" data-orig-height=\"232\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/a444e43cad3f2a1ec3c26f6096bb6d4d/tumblr_inline_ptb8g1Bu1Y1qco433_540.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"232\"></figure></p>",
                "content": "<p><p>DO LESBIANS IN GENERAL HAVE A TENDENCY TO HAVE A DORKY COVERED-IN-PAINT WEARING-OVERALLS-INDULGING-IN-ART PAST BUT THEN GREW UP TO BE A SASSY SUPERHERO LATER ON?<br />.<br />.<br />.<br />Also, Chris Evans being in movies with them both makes him the ultimate lesbian ally.&nbsp;</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/a444e43cad3f2a1ec3c26f6096bb6d4d/tumblr_inline_ptb8g1Bu1Y1qco433_540.gif\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "22222",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/a818f350352e442ea3bac583e6e77c16/tumblr_ptb8r2rv0c1qcdswoo1_500.gif",
                    "width": 420,
                    "height": 378
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/a818f350352e442ea3bac583e6e77c16/tumblr_ptb8r2rv0c1qcdswoo1_500.gif",
                        "width": 420,
                        "height": 378
                    },
                    {
                        "url": "https://66.media.tumblr.com/a818f350352e442ea3bac583e6e77c16/tumblr_ptb8r2rv0c1qcdswoo1_400.gif",
                        "width": 400,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/a818f350352e442ea3bac583e6e77c16/tumblr_ptb8r2rv0c1qcdswoo1_250.gif",
                        "width": 250,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/a818f350352e442ea3bac583e6e77c16/tumblr_ptb8r2rv0c1qcdswoo1_100.gif",
                        "width": 100,
                        "height": 90
                    },
                    {
                        "url": "https://66.media.tumblr.com/a818f350352e442ea3bac583e6e77c16/tumblr_ptb8r2rv0c1qcdswoo1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/cd8fe41b61b5d28e6b573629ecc54bdc/tumblr_ptb8r2rv0c1qcdswoo5_500.gif",
                    "width": 420,
                    "height": 378
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/cd8fe41b61b5d28e6b573629ecc54bdc/tumblr_ptb8r2rv0c1qcdswoo5_500.gif",
                        "width": 420,
                        "height": 378
                    },
                    {
                        "url": "https://66.media.tumblr.com/cd8fe41b61b5d28e6b573629ecc54bdc/tumblr_ptb8r2rv0c1qcdswoo5_400.gif",
                        "width": 400,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/cd8fe41b61b5d28e6b573629ecc54bdc/tumblr_ptb8r2rv0c1qcdswoo5_250.gif",
                        "width": 250,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/cd8fe41b61b5d28e6b573629ecc54bdc/tumblr_ptb8r2rv0c1qcdswoo5_100.gif",
                        "width": 100,
                        "height": 90
                    },
                    {
                        "url": "https://66.media.tumblr.com/cd8fe41b61b5d28e6b573629ecc54bdc/tumblr_ptb8r2rv0c1qcdswoo5_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/7c9d95b333da496f0132879f04fadff3/tumblr_ptb8r2rv0c1qcdswoo2_500.gif",
                    "width": 420,
                    "height": 378
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/7c9d95b333da496f0132879f04fadff3/tumblr_ptb8r2rv0c1qcdswoo2_500.gif",
                        "width": 420,
                        "height": 378
                    },
                    {
                        "url": "https://66.media.tumblr.com/7c9d95b333da496f0132879f04fadff3/tumblr_ptb8r2rv0c1qcdswoo2_400.gif",
                        "width": 400,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/7c9d95b333da496f0132879f04fadff3/tumblr_ptb8r2rv0c1qcdswoo2_250.gif",
                        "width": 250,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/7c9d95b333da496f0132879f04fadff3/tumblr_ptb8r2rv0c1qcdswoo2_100.gif",
                        "width": 100,
                        "height": 90
                    },
                    {
                        "url": "https://66.media.tumblr.com/7c9d95b333da496f0132879f04fadff3/tumblr_ptb8r2rv0c1qcdswoo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/5a5d6e31c1900766ad4596b73ea3e8fb/tumblr_ptb8r2rv0c1qcdswoo6_500.gif",
                    "width": 420,
                    "height": 378
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/5a5d6e31c1900766ad4596b73ea3e8fb/tumblr_ptb8r2rv0c1qcdswoo6_500.gif",
                        "width": 420,
                        "height": 378
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a5d6e31c1900766ad4596b73ea3e8fb/tumblr_ptb8r2rv0c1qcdswoo6_400.gif",
                        "width": 400,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a5d6e31c1900766ad4596b73ea3e8fb/tumblr_ptb8r2rv0c1qcdswoo6_250.gif",
                        "width": 250,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a5d6e31c1900766ad4596b73ea3e8fb/tumblr_ptb8r2rv0c1qcdswoo6_100.gif",
                        "width": 100,
                        "height": 90
                    },
                    {
                        "url": "https://66.media.tumblr.com/5a5d6e31c1900766ad4596b73ea3e8fb/tumblr_ptb8r2rv0c1qcdswoo6_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/68ada16346579e22d494113212261fc6/tumblr_ptb8r2rv0c1qcdswoo3_500.gif",
                    "width": 420,
                    "height": 378
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/68ada16346579e22d494113212261fc6/tumblr_ptb8r2rv0c1qcdswoo3_500.gif",
                        "width": 420,
                        "height": 378
                    },
                    {
                        "url": "https://66.media.tumblr.com/68ada16346579e22d494113212261fc6/tumblr_ptb8r2rv0c1qcdswoo3_400.gif",
                        "width": 400,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/68ada16346579e22d494113212261fc6/tumblr_ptb8r2rv0c1qcdswoo3_250.gif",
                        "width": 250,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/68ada16346579e22d494113212261fc6/tumblr_ptb8r2rv0c1qcdswoo3_100.gif",
                        "width": 100,
                        "height": 90
                    },
                    {
                        "url": "https://66.media.tumblr.com/68ada16346579e22d494113212261fc6/tumblr_ptb8r2rv0c1qcdswoo3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/3797b8f2e245ea79c8ad924e2cfe8121/tumblr_ptb8r2rv0c1qcdswoo4_500.gif",
                    "width": 420,
                    "height": 378
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/3797b8f2e245ea79c8ad924e2cfe8121/tumblr_ptb8r2rv0c1qcdswoo4_500.gif",
                        "width": 420,
                        "height": 378
                    },
                    {
                        "url": "https://66.media.tumblr.com/3797b8f2e245ea79c8ad924e2cfe8121/tumblr_ptb8r2rv0c1qcdswoo4_400.gif",
                        "width": 400,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/3797b8f2e245ea79c8ad924e2cfe8121/tumblr_ptb8r2rv0c1qcdswoo4_250.gif",
                        "width": 250,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/3797b8f2e245ea79c8ad924e2cfe8121/tumblr_ptb8r2rv0c1qcdswoo4_100.gif",
                        "width": 100,
                        "height": 90
                    },
                    {
                        "url": "https://66.media.tumblr.com/3797b8f2e245ea79c8ad924e2cfe8121/tumblr_ptb8r2rv0c1qcdswoo4_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/6f207115c8ccc9ebb09049390edd0f81/tumblr_ptb8r2rv0c1qcdswoo7_400.gif",
                    "width": 364,
                    "height": 262
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/6f207115c8ccc9ebb09049390edd0f81/tumblr_ptb8r2rv0c1qcdswoo7_400.gif",
                        "width": 364,
                        "height": 262
                    },
                    {
                        "url": "https://66.media.tumblr.com/6f207115c8ccc9ebb09049390edd0f81/tumblr_ptb8r2rv0c1qcdswoo7_250.gif",
                        "width": 250,
                        "height": 180
                    },
                    {
                        "url": "https://66.media.tumblr.com/6f207115c8ccc9ebb09049390edd0f81/tumblr_ptb8r2rv0c1qcdswoo7_100.gif",
                        "width": 100,
                        "height": 72
                    },
                    {
                        "url": "https://66.media.tumblr.com/6f207115c8ccc9ebb09049390edd0f81/tumblr_ptb8r2rv0c1qcdswoo7_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/8c16bd0f47607ae52ab6320154cbdbdb/tumblr_ptb8r2rv0c1qcdswoo8_400.gif",
                    "width": 364,
                    "height": 262
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/8c16bd0f47607ae52ab6320154cbdbdb/tumblr_ptb8r2rv0c1qcdswoo8_400.gif",
                        "width": 364,
                        "height": 262
                    },
                    {
                        "url": "https://66.media.tumblr.com/8c16bd0f47607ae52ab6320154cbdbdb/tumblr_ptb8r2rv0c1qcdswoo8_250.gif",
                        "width": 250,
                        "height": 180
                    },
                    {
                        "url": "https://66.media.tumblr.com/8c16bd0f47607ae52ab6320154cbdbdb/tumblr_ptb8r2rv0c1qcdswoo8_100.gif",
                        "width": 100,
                        "height": 72
                    },
                    {
                        "url": "https://66.media.tumblr.com/8c16bd0f47607ae52ab6320154cbdbdb/tumblr_ptb8r2rv0c1qcdswoo8_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/baac9a76e7e512a5f03b4b118fbe3dd4/tumblr_ptb8r2rv0c1qcdswoo10_400.gif",
                    "width": 288,
                    "height": 288
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/baac9a76e7e512a5f03b4b118fbe3dd4/tumblr_ptb8r2rv0c1qcdswoo10_400.gif",
                        "width": 288,
                        "height": 288
                    },
                    {
                        "url": "https://66.media.tumblr.com/baac9a76e7e512a5f03b4b118fbe3dd4/tumblr_ptb8r2rv0c1qcdswoo10_250.gif",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/baac9a76e7e512a5f03b4b118fbe3dd4/tumblr_ptb8r2rv0c1qcdswoo10_100.gif",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/baac9a76e7e512a5f03b4b118fbe3dd4/tumblr_ptb8r2rv0c1qcdswoo10_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/5dd2ea16ae6719729ea51930d7f04ccc/tumblr_ptb8r2rv0c1qcdswoo9_r1_500.gif",
                    "width": 422,
                    "height": 466
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/5dd2ea16ae6719729ea51930d7f04ccc/tumblr_ptb8r2rv0c1qcdswoo9_r1_500.gif",
                        "width": 422,
                        "height": 466
                    },
                    {
                        "url": "https://66.media.tumblr.com/5dd2ea16ae6719729ea51930d7f04ccc/tumblr_ptb8r2rv0c1qcdswoo9_r1_400.gif",
                        "width": 400,
                        "height": 442
                    },
                    {
                        "url": "https://66.media.tumblr.com/5dd2ea16ae6719729ea51930d7f04ccc/tumblr_ptb8r2rv0c1qcdswoo9_r1_250.gif",
                        "width": 250,
                        "height": 276
                    },
                    {
                        "url": "https://66.media.tumblr.com/5dd2ea16ae6719729ea51930d7f04ccc/tumblr_ptb8r2rv0c1qcdswoo9_r1_100.gif",
                        "width": 100,
                        "height": 110
                    },
                    {
                        "url": "https://66.media.tumblr.com/5dd2ea16ae6719729ea51930d7f04ccc/tumblr_ptb8r2rv0c1qcdswoo9_r1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "marvellokilove",
        "blog": {
            "name": "marvellokilove",
            "title": "Loki Is Alive 💚",
            "description": "<p>Marvel Incorrect Quotes </p><p>Still waiting for the fucking sun. </p>",
            "url": "https://marvellokilove.tumblr.com/",
            "uuid": "t:I31JNSz-bZbF6h7b5Mg6aQ",
            "updated": 1561273705
        },
        "id": 185685258760,
        "post_url": "https://marvellokilove.tumblr.com/post/185685258760/marvel-characters-vs-actors-loki-i-will-destroy",
        "slug": "marvel-characters-vs-actors-loki-i-will-destroy",
        "date": "2019-06-18 19:55:59 GMT",
        "timestamp": 1560887759,
        "state": "published",
        "format": "html",
        "reblog_key": "StHyL0GQ",
        "tags": [
            "marvel actors",
            "loki",
            "tom hiddleston",
            "steve rogers",
            "chris evans",
            "tony stark",
            "robert downey jr"
        ],
        "short_url": "https://tmblr.co/ZGugRY2ixj388",
        "summary": "Marvel Characters VS Actors\nLoki: I will destroy the world and kill you all!\nTom Hiddleston: If you would please, I would like...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 369,
        "title": null,
        "body": "<h2>Marvel Characters VS Actors</h2><p><b>Loki:</b> I will destroy the world and kill you all!</p><p><b>Tom Hiddleston:</b> If you would please, I would like that. Thank you, and may God bless your soul. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>— — — </p><p><b>Captain America:</b> I will save America, even  if it kills me.  </p><p><b>Chris Evans:</b> &hellip;Can’t we just work this out? </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>— — —</p><p><b>Iron Man:</b> I’m fucking awesome </p><p><b>RDJ:</b> I’m fucking awesome </p>",
        "reblog": {
            "comment": "<p><h2>Marvel Characters VS Actors</h2><p><b>Loki:</b> I will destroy the world and kill you all!</p><p><b>Tom Hiddleston:</b> If you would please, I would like that. Thank you, and may God bless your soul. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>— — — </p><p><b>Captain America:</b> I will save America, even  if it kills me.  </p><p><b>Chris Evans:</b> …Can’t we just work this out? </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>— — —</p><p><b>Iron Man:</b> I’m fucking awesome </p><p><b>RDJ:</b> I’m fucking awesome </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "marvellokilove",
                    "active": true,
                    "theme": {
                        "header_full_width": 908,
                        "header_full_height": 400,
                        "header_focus_width": 547,
                        "header_focus_height": 308,
                        "avatar_shape": "square",
                        "background_color": "#222222",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "35,727,343,180",
                        "header_image": "https://static.tumblr.com/da15d87575b56108a038670605c63938/hme8ps6/WJpprcn6x/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/3f1c88a4a5fe45063574921d58307465/hme8ps6/lODprcn70/tumblr_static_tumblr_static__focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/da15d87575b56108a038670605c63938/hme8ps6/WJpprcn6x/tumblr_static__2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#CCB752",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#00CF35",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185685258760"
                },
                "content_raw": "<p><h2>Marvel Characters VS Actors</h2><p><b>Loki:</b> I will destroy the world and kill you all!</p><p><b>Tom Hiddleston:</b> If you would please, I would like that. Thank you, and may God bless your soul. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>— — — </p><p><b>Captain America:</b> I will save America, even  if it kills me.  </p><p><b>Chris Evans:</b> …Can’t we just work this out? </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>— — —</p><p><b>Iron Man:</b> I’m fucking awesome </p><p><b>RDJ:</b> I’m fucking awesome </p></p>",
                "content": "<p><h2>Marvel Characters VS Actors</h2><p><b>Loki:</b> I will destroy the world and kill you all!</p><p><b>Tom Hiddleston:</b> If you would please, I would like that. Thank you, and may God bless your soul. </p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\">&mdash; &mdash; &mdash; </p><p><b>Captain America:</b> I will save America, even  if it kills me.  </p><p><b>Chris Evans:</b> &hellip;Can&rsquo;t we just work this out? </p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\">&mdash; &mdash; &mdash;</p><p><b>Iron Man:</b> I&rsquo;m fucking awesome </p><p><b>RDJ:</b> I&rsquo;m fucking awesome </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "blackwidowshrine",
        "blog": {
            "name": "blackwidowshrine",
            "title": "I got red on my ledger",
            "description": "<p>multifandom, art, photography, unicorns and splatter movies. Mostly a Marvel Avengers blog. 100% Stony trash but I truly appreciate Stucky and Romanogers too. Punk ain't dead. </p>",
            "url": "https://blackwidowshrine.tumblr.com/",
            "uuid": "t:Mqntcj133UgtmCNOpqfX2g",
            "updated": 1561662893
        },
        "id": 185684996498,
        "post_url": "https://blackwidowshrine.tumblr.com/post/185684996498/the-color-of-his-eyes",
        "slug": "the-color-of-his-eyes",
        "date": "2019-06-18 19:41:58 GMT",
        "timestamp": 1560886918,
        "state": "published",
        "format": "html",
        "reblog_key": "SSmqfdZa",
        "tags": [
            "chris evans",
            "captain america",
            "steve rogers",
            "bearded chris evans",
            "catws",
            "mcu"
        ],
        "short_url": "https://tmblr.co/ZDno-i2ixi36I",
        "summary": "The color of his eyes.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 23,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1032\"><img src=\"https://66.media.tumblr.com/645908920dab904721859310e27734de/tumblr_ptb81xSp131tg86l4_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1032\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"756\" data-orig-width=\"540\" data-tumblr-attribution=\"pastellilapsiblog:9_0tgJQfWUhkkx9rJcDlMw:ZoIQUc2W5xpny\"><img src=\"https://66.media.tumblr.com/baa8ef2896fc6fa11ec1c72cc7bf712a/tumblr_p5myz7pgWc1we1ejdo1_540.gif\" data-orig-height=\"756\" data-orig-width=\"540\"/></figure><p class=\"npf_quirky\" data-npf='{\"subtype\":\"quirky\"}'>The <span class=\"npf_color_rachel\">color</span> of his eyes.</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1032\"><img src=\"https://66.media.tumblr.com/645908920dab904721859310e27734de/tumblr_ptb81xSp131tg86l4_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1032\"></figure><figure class=\"tmblr-full\" data-orig-height=\"756\" data-orig-width=\"540\" data-tumblr-attribution=\"pastellilapsiblog:9_0tgJQfWUhkkx9rJcDlMw:ZoIQUc2W5xpny\"><img src=\"https://66.media.tumblr.com/baa8ef2896fc6fa11ec1c72cc7bf712a/tumblr_p5myz7pgWc1we1ejdo1_540.gif\" data-orig-height=\"756\" data-orig-width=\"540\"></figure><p class=\"npf_quirky\" data-npf='{\"subtype\":\"quirky\"}'>The <span class=\"npf_color_rachel\">color</span> of his eyes.</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "blackwidowshrine",
                    "active": true,
                    "theme": {
                        "header_full_width": 1200,
                        "header_full_height": 691,
                        "header_focus_width": 1200,
                        "header_focus_height": 675,
                        "avatar_shape": "square",
                        "background_color": "#810909",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "8,1200,683,0",
                        "header_image": "https://static.tumblr.com/2006920bc4b5644f2e742c3a03b853dd/tnvji2d/eZ2nx8vve/tumblr_static_9dw6pt7lplwk8css8w04wwo00.jpg",
                        "header_image_focused": "https://static.tumblr.com/2006920bc4b5644f2e742c3a03b853dd/tnvji2d/IDpnx8vvg/tumblr_static_tumblr_static_9dw6pt7lplwk8css8w04wwo00_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/2006920bc4b5644f2e742c3a03b853dd/tnvji2d/eZ2nx8vve/tumblr_static_9dw6pt7lplwk8css8w04wwo00_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#222222",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Streetscript",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185684996498"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1032\"><img src=\"https://66.media.tumblr.com/645908920dab904721859310e27734de/tumblr_ptb81xSp131tg86l4_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1032\"></figure><figure class=\"tmblr-full\" data-orig-height=\"756\" data-orig-width=\"540\" data-tumblr-attribution=\"pastellilapsiblog:9_0tgJQfWUhkkx9rJcDlMw:ZoIQUc2W5xpny\"><img src=\"https://66.media.tumblr.com/baa8ef2896fc6fa11ec1c72cc7bf712a/tumblr_p5myz7pgWc1we1ejdo1_540.gif\" data-orig-height=\"756\" data-orig-width=\"540\"></figure><p class=\"npf_quirky\" data-npf='{\"subtype\":\"quirky\"}'>The <span class=\"npf_color_rachel\">color</span> of his eyes.</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/645908920dab904721859310e27734de/tumblr_ptb81xSp131tg86l4_540.jpg\" class=\"\"/></figure><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><p class=\"npf_quirky\" data-npf=\"{&quot;subtype&quot;:&quot;quirky&quot;}\">The <span class=\"npf_color_rachel\">color</span> of his eyes.</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "iamthekeymaster",
        "blog": {
            "name": "iamthekeymaster",
            "title": "I am the Key Master",
            "description": "<p>Fantasy/Sci-Fi/Horror</p><p>All genres of storytelling and entertainment. </p><p>Mystery and Intrigue</p><p>Let me show you a world to lose yourself in. Or just reblogs of Chris Evans, Marvel, and Sailor Moon. </p>",
            "url": "https://iamthekeymaster.tumblr.com/",
            "uuid": "t:LcLHl1VjfvhfChAtaSs3Jg",
            "updated": 1561730979
        },
        "id": 185684651747,
        "post_url": "https://iamthekeymaster.tumblr.com/post/185684651747/i-wish-he-could-come-back-and-reprise-his-role-of",
        "slug": "i-wish-he-could-come-back-and-reprise-his-role-of",
        "date": "2019-06-18 19:23:46 GMT",
        "timestamp": 1560885826,
        "state": "published",
        "format": "html",
        "reblog_key": "mW9qJRyH",
        "tags": [
            "chris evans",
            "aaron taylor johnson"
        ],
        "short_url": "https://tmblr.co/Zcp13v2ixgkxZ",
        "summary": "I wish he could come back and reprise his role of Quicksilver.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 59,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"245\" data-orig-width=\"245\"><img src=\"https://66.media.tumblr.com/4fcdf0c2d205040ec8d095328723fa4a/tumblr_ptb77jfsUp1rroz1e_540.gif\" data-orig-height=\"245\" data-orig-width=\"245\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"245\" data-orig-width=\"245\"><img src=\"https://66.media.tumblr.com/5ad758e28714bdc69a478fdf7f73090d/tumblr_ptb77k3ig21rroz1e_540.gif\" data-orig-height=\"245\" data-orig-width=\"245\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"245\" data-orig-width=\"245\"><img src=\"https://66.media.tumblr.com/7d79e8691b80b35a2486b7b9452f464d/tumblr_ptb77lItMw1rroz1e_540.gif\" data-orig-height=\"245\" data-orig-width=\"245\"/></figure></div><p>I wish he could come back and reprise his role of Quicksilver. </p>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"245\" data-orig-width=\"245\"><img src=\"https://66.media.tumblr.com/4fcdf0c2d205040ec8d095328723fa4a/tumblr_ptb77jfsUp1rroz1e_540.gif\" data-orig-height=\"245\" data-orig-width=\"245\"></figure><figure class=\"tmblr-full\" data-orig-height=\"245\" data-orig-width=\"245\"><img src=\"https://66.media.tumblr.com/5ad758e28714bdc69a478fdf7f73090d/tumblr_ptb77k3ig21rroz1e_540.gif\" data-orig-height=\"245\" data-orig-width=\"245\"></figure><figure class=\"tmblr-full\" data-orig-height=\"245\" data-orig-width=\"245\"><img src=\"https://66.media.tumblr.com/7d79e8691b80b35a2486b7b9452f464d/tumblr_ptb77lItMw1rroz1e_540.gif\" data-orig-height=\"245\" data-orig-width=\"245\"></figure></div><p>I wish he could come back and reprise his role of Quicksilver. </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "iamthekeymaster",
                    "active": true,
                    "theme": {
                        "header_full_width": 268,
                        "header_full_height": 180,
                        "header_focus_width": 230,
                        "header_focus_height": 129,
                        "avatar_shape": "square",
                        "background_color": "#EEEEEE",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "14,249,143,19",
                        "header_image": "https://static.tumblr.com/1352e7ddff93a56c150f2ee20b51cbcf/qbcojfp/N9Bpoqrgv/tumblr_static_.gif",
                        "header_image_focused": "https://static.tumblr.com/1352e7ddff93a56c150f2ee20b51cbcf/qbcojfp/o1Epoqrgx/tumblr_static_tumblr_static__focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/1352e7ddff93a56c150f2ee20b51cbcf/qbcojfp/N9Bpoqrgv/tumblr_static__2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#192155",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185684651747"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"245\" data-orig-width=\"245\"><img src=\"https://66.media.tumblr.com/4fcdf0c2d205040ec8d095328723fa4a/tumblr_ptb77jfsUp1rroz1e_540.gif\" data-orig-height=\"245\" data-orig-width=\"245\"></figure><figure class=\"tmblr-full\" data-orig-height=\"245\" data-orig-width=\"245\"><img src=\"https://66.media.tumblr.com/5ad758e28714bdc69a478fdf7f73090d/tumblr_ptb77k3ig21rroz1e_540.gif\" data-orig-height=\"245\" data-orig-width=\"245\"></figure><figure class=\"tmblr-full\" data-orig-height=\"245\" data-orig-width=\"245\"><img src=\"https://66.media.tumblr.com/7d79e8691b80b35a2486b7b9452f464d/tumblr_ptb77lItMw1rroz1e_540.gif\" data-orig-height=\"245\" data-orig-width=\"245\"></figure></div><p>I wish he could come back and reprise his role of Quicksilver. </p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4fcdf0c2d205040ec8d095328723fa4a/tumblr_ptb77jfsUp1rroz1e_540.gif\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/5ad758e28714bdc69a478fdf7f73090d/tumblr_ptb77k3ig21rroz1e_540.gif\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/7d79e8691b80b35a2486b7b9452f464d/tumblr_ptb77lItMw1rroz1e_540.gif\" class=\"\"/></figure><p>I wish he could come back and reprise his role of Quicksilver. </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "skyjane85",
        "blog": {
            "name": "skyjane85",
            "title": "A Daydream Away from Reality",
            "description": "Welcome to my blog, I post stuff about movies and tv shows and music.. Not a spoiler free blog, So look at your own risk.",
            "url": "https://skyjane85.tumblr.com/",
            "uuid": "t:ktiw5zWXtpLt2DRJVkOn8w",
            "updated": 1561739730
        },
        "id": 185684569268,
        "post_url": "https://skyjane85.tumblr.com/post/185684569268/this-isnt-gonna-change-what-happened",
        "slug": "this-isnt-gonna-change-what-happened",
        "date": "2019-06-18 19:19:43 GMT",
        "timestamp": 1560885583,
        "state": "published",
        "format": "html",
        "reblog_key": "deak3gEf",
        "tags": [
            "captain america: civil war",
            "steve rogers",
            "movie quotes",
            "my edit",
            "chris evans"
        ],
        "short_url": "https://tmblr.co/Zhvaon2ixgQoq",
        "summary": "This isn't gonna change what happened.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 113,
        "caption": "<blockquote><p>\n<i>This isn&rsquo;t gonna change what happened.\n\n</i><br/></p></blockquote>",
        "reblog": {
            "comment": "<p><blockquote><p>\n<i>This isn’t gonna change what happened.\n\n</i><br></p></blockquote></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "skyjane85",
                    "active": true,
                    "theme": {
                        "header_full_width": 851,
                        "header_full_height": 356,
                        "header_focus_width": 632,
                        "header_focus_height": 356,
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,766,356,134",
                        "header_image": "https://static.tumblr.com/dc43fe642786a92c67249e1fc6fd27d2/tz5esj2/cVDp9trp3/tumblr_static_c9rsksv4y7ksok48gcc4sg8g4.jpg",
                        "header_image_focused": "https://static.tumblr.com/dc43fe642786a92c67249e1fc6fd27d2/tz5esj2/nYEpp40ad/tumblr_static_tumblr_static_c9rsksv4y7ksok48gcc4sg8g4_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_08_focused_v3.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_stretch": true,
                        "link_color": "#97c5e0",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#e9e9f7",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185684569268"
                },
                "content_raw": "<p><blockquote><p>\n<i>This isn’t gonna change what happened.\n\n</i><br></p></blockquote></p>",
                "content": "<p><blockquote><p>\n<i>This isn&rsquo;t gonna change what happened.\n\n</i><br /></p></blockquote></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://skyjane85.tumblr.com/image/185684569268",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/5040ed0330c9a157a175a78be0e37f2d/tumblr_pt9vrcNDmc1tz0kdco1_1280.jpg",
                    "width": 697,
                    "height": 886
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/5040ed0330c9a157a175a78be0e37f2d/tumblr_pt9vrcNDmc1tz0kdco1_1280.jpg",
                        "width": 697,
                        "height": 886
                    },
                    {
                        "url": "https://66.media.tumblr.com/5040ed0330c9a157a175a78be0e37f2d/tumblr_pt9vrcNDmc1tz0kdco1_640.jpg",
                        "width": 640,
                        "height": 814
                    },
                    {
                        "url": "https://66.media.tumblr.com/5040ed0330c9a157a175a78be0e37f2d/tumblr_pt9vrcNDmc1tz0kdco1_540.jpg",
                        "width": 540,
                        "height": 686
                    },
                    {
                        "url": "https://66.media.tumblr.com/5040ed0330c9a157a175a78be0e37f2d/tumblr_pt9vrcNDmc1tz0kdco1_500.jpg",
                        "width": 500,
                        "height": 636
                    },
                    {
                        "url": "https://66.media.tumblr.com/5040ed0330c9a157a175a78be0e37f2d/tumblr_pt9vrcNDmc1tz0kdco1_400.jpg",
                        "width": 400,
                        "height": 508
                    },
                    {
                        "url": "https://66.media.tumblr.com/5040ed0330c9a157a175a78be0e37f2d/tumblr_pt9vrcNDmc1tz0kdco1_250.jpg",
                        "width": 250,
                        "height": 318
                    },
                    {
                        "url": "https://66.media.tumblr.com/5040ed0330c9a157a175a78be0e37f2d/tumblr_pt9vrcNDmc1tz0kdco1_100.jpg",
                        "width": 100,
                        "height": 127
                    },
                    {
                        "url": "https://66.media.tumblr.com/5040ed0330c9a157a175a78be0e37f2d/tumblr_pt9vrcNDmc1tz0kdco1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "puddle--wonderful",
        "blog": {
            "name": "puddle--wonderful",
            "title": "though it may look like (Write it!) like disaster.",
            "description": "<p>XXVII | Knoxville | PhD student of modernist lit and disability studies | I've got a sweetass caveman and two precious bunnies. | fabula_prima on AO3</p>",
            "url": "https://puddle--wonderful.tumblr.com/",
            "uuid": "t:AqncycckjLCEzrH2OScI8A",
            "updated": 1561758693
        },
        "id": 185684398133,
        "post_url": "https://puddle--wonderful.tumblr.com/post/185684398133/a-calendar-series-of-au-prompts-meet-him-in",
        "slug": "a-calendar-series-of-au-prompts-meet-him-in",
        "date": "2019-06-18 19:13:32 GMT",
        "timestamp": 1560885212,
        "state": "published",
        "format": "html",
        "reblog_key": "B3vZwoFG",
        "tags": [
            "a calendar series",
            "a calendar series of au prompts",
            "september",
            "Chris evans",
            "sorting through pictures of this guy",
            "is physically painful",
            "I had to take multiple breaks"
        ],
        "short_url": "https://tmblr.co/Zg7LVy2ixfn0r",
        "summary": "A Calendar Series of AU Prompts  Meet him in September, just as the leaves start to change and your friends or your coworkers or...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 6,
        "caption": "<p><b><a href=\"https://puddle--wonderful.tumblr.com/tagged/a-calendar-series-of-au-prompts\">A Calendar Series of AU Prompts</a></b><br/></p><blockquote><p>Meet him in <b>September</b>, just as the leaves start to change and your friends or your coworkers or your cousins drag you to some painfully adorable and rustic fall festival. He works on the farm, smells like a bonfire, and has so little trouble lifting you up into the hayride that you have to check with your companions to make sure he’s real. He jogs off with the excitable herding dogs as your ride takes off, but turns back briefly and flashes you a warm smile. The cart jostles gently beneath you and you wonder if there are other activities that involve his hands on your waist.<br/></p></blockquote>",
        "reblog": {
            "comment": "<p><p><b><a href=\"https://puddle--wonderful.tumblr.com/tagged/a-calendar-series-of-au-prompts\">A Calendar Series of AU Prompts</a></b><br></p><blockquote><p>Meet him in <b>September</b>, just as the leaves start to change and your friends or your coworkers or your cousins drag you to some painfully adorable and rustic fall festival. He works on the farm, smells like a bonfire, and has so little trouble lifting you up into the hayride that you have to check with your companions to make sure he’s real. He jogs off with the excitable herding dogs as your ride takes off, but turns back briefly and flashes you a warm smile. The cart jostles gently beneath you and you wonder if there are other activities that involve his hands on your waist.<br></p></blockquote></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "puddle--wonderful",
                    "active": true,
                    "theme": {
                        "header_full_width": 647,
                        "header_full_height": 645,
                        "header_focus_width": 647,
                        "header_focus_height": 364,
                        "avatar_shape": "square",
                        "background_color": "#E4F3DB",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,647,364,0",
                        "header_image": "https://static.tumblr.com/f9b8b0041701d68a89b5d697ea35a5c9/qducq9c/KuInbat50/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/f9b8b0041701d68a89b5d697ea35a5c9/qducq9c/Zsfnbat51/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f9b8b0041701d68a89b5d697ea35a5c9/qducq9c/KuInbat50/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#526149",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185684398133"
                },
                "content_raw": "<p><p><b><a href=\"https://puddle--wonderful.tumblr.com/tagged/a-calendar-series-of-au-prompts\">A Calendar Series of AU Prompts</a></b><br></p><blockquote><p>Meet him in <b>September</b>, just as the leaves start to change and your friends or your coworkers or your cousins drag you to some painfully adorable and rustic fall festival. He works on the farm, smells like a bonfire, and has so little trouble lifting you up into the hayride that you have to check with your companions to make sure he’s real. He jogs off with the excitable herding dogs as your ride takes off, but turns back briefly and flashes you a warm smile. The cart jostles gently beneath you and you wonder if there are other activities that involve his hands on your waist.<br></p></blockquote></p>",
                "content": "<p><p><b><a href=\"https://puddle--wonderful.tumblr.com/tagged/a-calendar-series-of-au-prompts\">A Calendar Series of AU Prompts</a></b><br /></p><blockquote><p>Meet him in <b>September</b>, just as the leaves start to change and your friends or your coworkers or your cousins drag you to some painfully adorable and rustic fall festival. He works on the farm, smells like a bonfire, and has so little trouble lifting you up into the hayride that you have to check with your companions to make sure he&rsquo;s real. He jogs off with the excitable herding dogs as your ride takes off, but turns back briefly and flashes you a warm smile. The cart jostles gently beneath you and you wonder if there are other activities that involve his hands on your waist.<br /></p></blockquote></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://puddle--wonderful.tumblr.com/image/185684398133",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/1943cffe7925e7e07bbbb81e71dac7b0/tumblr_ptb5xmA9cj1qa5wxvo1_1280.jpg",
                    "width": 1200,
                    "height": 1200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/1943cffe7925e7e07bbbb81e71dac7b0/tumblr_ptb5xmA9cj1qa5wxvo1_1280.jpg",
                        "width": 1200,
                        "height": 1200
                    },
                    {
                        "url": "https://66.media.tumblr.com/1943cffe7925e7e07bbbb81e71dac7b0/tumblr_ptb5xmA9cj1qa5wxvo1_640.jpg",
                        "width": 640,
                        "height": 640
                    },
                    {
                        "url": "https://66.media.tumblr.com/1943cffe7925e7e07bbbb81e71dac7b0/tumblr_ptb5xmA9cj1qa5wxvo1_540.jpg",
                        "width": 540,
                        "height": 540
                    },
                    {
                        "url": "https://66.media.tumblr.com/1943cffe7925e7e07bbbb81e71dac7b0/tumblr_ptb5xmA9cj1qa5wxvo1_500.jpg",
                        "width": 500,
                        "height": 500
                    },
                    {
                        "url": "https://66.media.tumblr.com/1943cffe7925e7e07bbbb81e71dac7b0/tumblr_ptb5xmA9cj1qa5wxvo1_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/1943cffe7925e7e07bbbb81e71dac7b0/tumblr_ptb5xmA9cj1qa5wxvo1_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/1943cffe7925e7e07bbbb81e71dac7b0/tumblr_ptb5xmA9cj1qa5wxvo1_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/1943cffe7925e7e07bbbb81e71dac7b0/tumblr_ptb5xmA9cj1qa5wxvo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "project-casting",
        "blog": {
            "name": "project-casting",
            "title": "Project Casting",
            "description": "The Entertainment Industry Lives Here!",
            "url": "https://project-casting.tumblr.com/",
            "uuid": "t:2fkBdMafSe8ZqjayGE9wTg",
            "updated": 1561727815
        },
        "id": 185683758325,
        "post_url": "https://project-casting.tumblr.com/post/185683758325/chris-evans-defending-jacob-casting-call-for",
        "slug": "chris-evans-defending-jacob-casting-call-for",
        "date": "2019-06-18 18:37:05 GMT",
        "timestamp": 1560883025,
        "state": "published",
        "format": "html",
        "reblog_key": "qdlvSd2b",
        "tags": [
            "Casting Call",
            "Chris Evans",
            "Defending Jacobs",
            "Kendall Cooper Casting"
        ],
        "short_url": "https://tmblr.co/ZCldPu2ixdKpr",
        "summary": "Chris Evans' \"Defending Jacob\" Casting Call for Swimmers",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1,
        "title": "Chris Evans' \"Defending Jacob\" Casting Call for Swimmers",
        "body": "<p><a href=\"http://www.projectcasting.com/casting-calls-acting-auditions/chris-evans-defending-jacob-casting-call-for-swimmers/\" target=\"_blank\">Chris Evans’ “Defending Jacob” Casting Call for Swimmers</a></p><img width=\"676\" height=\"451\" style=\"float: right; padding:10px;\" src=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg?w=676\" class=\"attachment-medium size-medium wp-post-image\" alt=\"Chris Evans\" data-attachment-id=\"149523\" data-permalink=\"http://www.projectcasting.com/news/chris-evans-marvel/attachment/chris-evans-3/\" data-orig-file=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg\" data-orig-size=\"1000,667\" data-comments-opened=\"0\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Chris Evans\" data-image-description=\"\" data-medium-file=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg?w=676\" data-large-file=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg?w=676\"/><blockquote><p>Casting directors are now casting actors, models, and talent to work on scenes filming on June 21st in Boston, Massachusetts.</p>\n<p>Producers are seeking the following types:</p>\n<ul><li>Production is seeking EXPERIENCED SWIMMERS and ENDURANCE SWIMMERS of all ethnicities, ages (18 and older), genders, sizes and types to work as extras this FRIDAY 6/21 in the Boston, MA area. Specifically seeking men with beards…</li></ul></blockquote><p><a href=\"http://www.projectcasting.com/casting-calls-acting-auditions/chris-evans-defending-jacob-casting-call-for-swimmers/\" target=\"_blank\">View On WordPress</a></p><div style=\"clear:both;\"></div>",
        "reblog": {
            "comment": "<p><p><a href=\"http://www.projectcasting.com/casting-calls-acting-auditions/chris-evans-defending-jacob-casting-call-for-swimmers/\" target=\"_blank\">Chris Evans’ “Defending Jacob” Casting Call for Swimmers</a></p><img width=\"676\" height=\"451\" style=\"float: right; padding:10px;\" src=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg?w=676\" class=\"attachment-medium size-medium wp-post-image\" alt=\"Chris Evans\" data-attachment-id=\"149523\" data-permalink=\"http://www.projectcasting.com/news/chris-evans-marvel/attachment/chris-evans-3/\" data-orig-file=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg\" data-orig-size=\"1000,667\" data-comments-opened=\"0\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Chris Evans\" data-image-description=\"\" data-medium-file=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg?w=676\" data-large-file=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg?w=676\"><blockquote><p>Casting directors are now casting actors, models, and talent to work on scenes filming on June 21st in Boston, Massachusetts.</p>\n<p>Producers are seeking the following types:</p>\n<ul><li>Production is seeking EXPERIENCED SWIMMERS and ENDURANCE SWIMMERS of all ethnicities, ages (18 and older), genders, sizes and types to work as extras this FRIDAY 6/21 in the Boston, MA area. Specifically seeking men with beards…</li></ul></blockquote><p><a href=\"http://www.projectcasting.com/casting-calls-acting-auditions/chris-evans-defending-jacob-casting-call-for-swimmers/\" target=\"_blank\">View On WordPress</a></p><div style=\"clear:both;\"></div></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "project-casting",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_01.png?_v=f67ca5ac5d1c4a0526964674cb5a0605",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_01.png?_v=f67ca5ac5d1c4a0526964674cb5a0605",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_01.png?_v=f67ca5ac5d1c4a0526964674cb5a0605",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185683758325"
                },
                "content_raw": "<p><p><a href=\"http://www.projectcasting.com/casting-calls-acting-auditions/chris-evans-defending-jacob-casting-call-for-swimmers/\" target=\"_blank\">Chris Evans’ “Defending Jacob” Casting Call for Swimmers</a></p><img width=\"676\" height=\"451\" style=\"float: right; padding:10px;\" src=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg?w=676\" class=\"attachment-medium size-medium wp-post-image\" alt=\"Chris Evans\" data-attachment-id=\"149523\" data-permalink=\"http://www.projectcasting.com/news/chris-evans-marvel/attachment/chris-evans-3/\" data-orig-file=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg\" data-orig-size=\"1000,667\" data-comments-opened=\"0\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Chris Evans\" data-image-description=\"\" data-medium-file=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg?w=676\" data-large-file=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg?w=676\"><blockquote><p>Casting directors are now casting actors, models, and talent to work on scenes filming on June 21st in Boston, Massachusetts.</p>\n<p>Producers are seeking the following types:</p>\n<ul><li>Production is seeking EXPERIENCED SWIMMERS and ENDURANCE SWIMMERS of all ethnicities, ages (18 and older), genders, sizes and types to work as extras this FRIDAY 6/21 in the Boston, MA area. Specifically seeking men with beards…</li></ul></blockquote><p><a href=\"http://www.projectcasting.com/casting-calls-acting-auditions/chris-evans-defending-jacob-casting-call-for-swimmers/\" target=\"_blank\">View On WordPress</a></p><div style=\"clear:both;\"></div></p>",
                "content": "<p><a href=\"http://www.projectcasting.com/casting-calls-acting-auditions/chris-evans-defending-jacob-casting-call-for-swimmers/\" target=\"_blank\">Chris Evans&rsquo; &ldquo;Defending Jacob&rdquo; Casting Call for&nbsp;Swimmers</a></p><div class=\"external-image-wrapper\" data-loading-text=\"Loading...\" data-src=\"http://www.projectcasting.com/wp-content/uploads/2018/10/Chris-Evans.jpg?w=676\">External image</div><blockquote><p>Casting directors are now casting actors, models, and talent to work on scenes filming on June 21st in Boston, Massachusetts.</p>\n<p>Producers are seeking the following types:</p>\n<ul><li>Production is seeking EXPERIENCED SWIMMERS and ENDURANCE SWIMMERS of all ethnicities, ages (18 and older), genders, sizes and types to work as extras this FRIDAY 6/21 in the Boston, MA area. Specifically seeking men with beards&hellip;</li></ul></blockquote><p><a href=\"http://www.projectcasting.com/casting-calls-acting-auditions/chris-evans-defending-jacob-casting-call-for-swimmers/\" target=\"_blank\">View On WordPress</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "daybreak96",
        "blog": {
            "name": "daybreak96",
            "title": "Now is the Hour of Wolves",
            "description": "<b>Never cruel or cowardly.\nNever give up. Never give in.</b>\n<a href=\"/tagged/fanfic\">My fanfics</a> - <a href=\"/tagged/fic-rec\">Fic Rec's</a> - <a href=\"/tagged/photoshoot\">A collection of Seb's (and some of Chris's) photoshoots</a>",
            "url": "https://daybreak96.tumblr.com/",
            "uuid": "t:jix5wvyBTLin06v51Ci5cQ",
            "updated": 1561762753
        },
        "id": 185683758996,
        "post_url": "https://daybreak96.tumblr.com/post/185683758996/this-is-really-weird-but-i-just-realised-it",
        "slug": "this-is-really-weird-but-i-just-realised-it",
        "date": "2019-06-18 18:36:59 GMT",
        "timestamp": 1560883019,
        "state": "published",
        "format": "html",
        "reblog_key": "g7cmWPRE",
        "tags": [
            "chris evans",
            "puncture",
            "collarbone tattoo",
            "tattoo",
            "shirtless chris",
            "gifs not mine"
        ],
        "short_url": "https://tmblr.co/Zq7Klv2ixdK_K",
        "summary": "This is really weird, but I just realised: it looks like they put makeup over the first two words of Chris’s collarbone tattoo...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 105,
        "caption": "<p>This is really weird, but I just realised: it looks like they put makeup over the first two words of Chris’s collarbone tattoo in Puncture, and maybe over the shoulder part for some reason ???</p><p><i>Gifs aren’t mine, just used for evidence</i></p>",
        "reblog": {
            "comment": "<p>This is really weird, but I just realised: it looks like they put makeup over the first two words of Chris’s collarbone tattoo in Puncture, and maybe over the shoulder part for some reason ???</p><p><i>Gifs aren’t mine, just used for evidence</i></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "daybreak96",
                    "active": true,
                    "theme": {
                        "header_full_width": 2000,
                        "header_full_height": 1402,
                        "header_focus_width": 1617,
                        "header_focus_height": 910,
                        "avatar_shape": "circle",
                        "background_color": "#c1ffea",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "15,1903,925,286",
                        "header_image": "https://static.tumblr.com/dcc2c6948685211f38256c8fc4334440/an0fs2r/q1hpjfucr/tumblr_static_5xgc8db89kg88k48sckokscok.jpg",
                        "header_image_focused": "https://static.tumblr.com/cae4a488203a64b04734e761c88436ce/an0fs2r/nOhpqnczq/tumblr_static_tumblr_static_5xgc8db89kg88k48sckokscok_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_11_focused_v3.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_stretch": true,
                        "link_color": "#ab45ec",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ab45ec",
                        "title_font": "Typewriter FS",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185683758996"
                },
                "content_raw": "<p>This is really weird, but I just realised: it looks like they put makeup over the first two words of Chris’s collarbone tattoo in Puncture, and maybe over the shoulder part for some reason ???</p><p><i>Gifs aren’t mine, just used for evidence</i></p>",
                "content": "<p>This is really weird, but I just realised: it looks like they put makeup over the first two words of Chris&rsquo;s collarbone tattoo in Puncture, and maybe over the shoulder part for some reason ???</p><p><i>Gifs aren&rsquo;t mine, just used for evidence</i></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "2221",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/1f4e6bc9ea8a8806fdef9f089ce35d48/tumblr_ptb51n20C41rrzvvjo3_500.gif",
                    "width": 500,
                    "height": 430
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/1f4e6bc9ea8a8806fdef9f089ce35d48/tumblr_ptb51n20C41rrzvvjo3_500.gif",
                        "width": 500,
                        "height": 430
                    },
                    {
                        "url": "https://66.media.tumblr.com/1f4e6bc9ea8a8806fdef9f089ce35d48/tumblr_ptb51n20C41rrzvvjo3_400.gif",
                        "width": 400,
                        "height": 344
                    },
                    {
                        "url": "https://66.media.tumblr.com/1f4e6bc9ea8a8806fdef9f089ce35d48/tumblr_ptb51n20C41rrzvvjo3_250.gif",
                        "width": 250,
                        "height": 215
                    },
                    {
                        "url": "https://66.media.tumblr.com/1f4e6bc9ea8a8806fdef9f089ce35d48/tumblr_ptb51n20C41rrzvvjo3_100.gif",
                        "width": 100,
                        "height": 86
                    },
                    {
                        "url": "https://66.media.tumblr.com/1f4e6bc9ea8a8806fdef9f089ce35d48/tumblr_ptb51n20C41rrzvvjo3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/d052a62d345195e9cb91119031b365f5/tumblr_ptb51n20C41rrzvvjo5_540.gif",
                    "width": 540,
                    "height": 297
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/d052a62d345195e9cb91119031b365f5/tumblr_ptb51n20C41rrzvvjo5_540.gif",
                        "width": 540,
                        "height": 297
                    },
                    {
                        "url": "https://66.media.tumblr.com/d052a62d345195e9cb91119031b365f5/tumblr_ptb51n20C41rrzvvjo5_500.gif",
                        "width": 500,
                        "height": 275
                    },
                    {
                        "url": "https://66.media.tumblr.com/d052a62d345195e9cb91119031b365f5/tumblr_ptb51n20C41rrzvvjo5_400.gif",
                        "width": 400,
                        "height": 220
                    },
                    {
                        "url": "https://66.media.tumblr.com/d052a62d345195e9cb91119031b365f5/tumblr_ptb51n20C41rrzvvjo5_250.gif",
                        "width": 250,
                        "height": 138
                    },
                    {
                        "url": "https://66.media.tumblr.com/d052a62d345195e9cb91119031b365f5/tumblr_ptb51n20C41rrzvvjo5_100.gif",
                        "width": 100,
                        "height": 55
                    },
                    {
                        "url": "https://66.media.tumblr.com/d052a62d345195e9cb91119031b365f5/tumblr_ptb51n20C41rrzvvjo5_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/fe6908282d76b7c7cfd8ff2aba96e75b/tumblr_ptb51n20C41rrzvvjo7_540.gif",
                    "width": 540,
                    "height": 391
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/fe6908282d76b7c7cfd8ff2aba96e75b/tumblr_ptb51n20C41rrzvvjo7_540.gif",
                        "width": 540,
                        "height": 391
                    },
                    {
                        "url": "https://66.media.tumblr.com/fe6908282d76b7c7cfd8ff2aba96e75b/tumblr_ptb51n20C41rrzvvjo7_500.gif",
                        "width": 500,
                        "height": 362
                    },
                    {
                        "url": "https://66.media.tumblr.com/fe6908282d76b7c7cfd8ff2aba96e75b/tumblr_ptb51n20C41rrzvvjo7_400.gif",
                        "width": 400,
                        "height": 290
                    },
                    {
                        "url": "https://66.media.tumblr.com/fe6908282d76b7c7cfd8ff2aba96e75b/tumblr_ptb51n20C41rrzvvjo7_250.gif",
                        "width": 250,
                        "height": 181
                    },
                    {
                        "url": "https://66.media.tumblr.com/fe6908282d76b7c7cfd8ff2aba96e75b/tumblr_ptb51n20C41rrzvvjo7_100.gif",
                        "width": 100,
                        "height": 72
                    },
                    {
                        "url": "https://66.media.tumblr.com/fe6908282d76b7c7cfd8ff2aba96e75b/tumblr_ptb51n20C41rrzvvjo7_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/54f49886bf2d92d85b5f38f52dc98458/tumblr_ptb51n20C41rrzvvjo6_540.gif",
                    "width": 540,
                    "height": 391
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/54f49886bf2d92d85b5f38f52dc98458/tumblr_ptb51n20C41rrzvvjo6_540.gif",
                        "width": 540,
                        "height": 391
                    },
                    {
                        "url": "https://66.media.tumblr.com/54f49886bf2d92d85b5f38f52dc98458/tumblr_ptb51n20C41rrzvvjo6_500.gif",
                        "width": 500,
                        "height": 362
                    },
                    {
                        "url": "https://66.media.tumblr.com/54f49886bf2d92d85b5f38f52dc98458/tumblr_ptb51n20C41rrzvvjo6_400.gif",
                        "width": 400,
                        "height": 290
                    },
                    {
                        "url": "https://66.media.tumblr.com/54f49886bf2d92d85b5f38f52dc98458/tumblr_ptb51n20C41rrzvvjo6_250.gif",
                        "width": 250,
                        "height": 181
                    },
                    {
                        "url": "https://66.media.tumblr.com/54f49886bf2d92d85b5f38f52dc98458/tumblr_ptb51n20C41rrzvvjo6_100.gif",
                        "width": 100,
                        "height": 72
                    },
                    {
                        "url": "https://66.media.tumblr.com/54f49886bf2d92d85b5f38f52dc98458/tumblr_ptb51n20C41rrzvvjo6_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/a3e4c9466bf895b71e5ebcb7ea298877/tumblr_ptb51n20C41rrzvvjo1_1280.jpg",
                    "width": 979,
                    "height": 1222
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/a3e4c9466bf895b71e5ebcb7ea298877/tumblr_ptb51n20C41rrzvvjo1_1280.jpg",
                        "width": 979,
                        "height": 1222
                    },
                    {
                        "url": "https://66.media.tumblr.com/a3e4c9466bf895b71e5ebcb7ea298877/tumblr_ptb51n20C41rrzvvjo1_640.jpg",
                        "width": 640,
                        "height": 799
                    },
                    {
                        "url": "https://66.media.tumblr.com/a3e4c9466bf895b71e5ebcb7ea298877/tumblr_ptb51n20C41rrzvvjo1_540.jpg",
                        "width": 540,
                        "height": 674
                    },
                    {
                        "url": "https://66.media.tumblr.com/a3e4c9466bf895b71e5ebcb7ea298877/tumblr_ptb51n20C41rrzvvjo1_500.jpg",
                        "width": 500,
                        "height": 624
                    },
                    {
                        "url": "https://66.media.tumblr.com/a3e4c9466bf895b71e5ebcb7ea298877/tumblr_ptb51n20C41rrzvvjo1_400.jpg",
                        "width": 400,
                        "height": 499
                    },
                    {
                        "url": "https://66.media.tumblr.com/a3e4c9466bf895b71e5ebcb7ea298877/tumblr_ptb51n20C41rrzvvjo1_250.jpg",
                        "width": 250,
                        "height": 312
                    },
                    {
                        "url": "https://66.media.tumblr.com/a3e4c9466bf895b71e5ebcb7ea298877/tumblr_ptb51n20C41rrzvvjo1_100.jpg",
                        "width": 100,
                        "height": 125
                    },
                    {
                        "url": "https://66.media.tumblr.com/a3e4c9466bf895b71e5ebcb7ea298877/tumblr_ptb51n20C41rrzvvjo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/3d9527b6d1e66c3ebf6ddfecccbe157d/tumblr_ptb51n20C41rrzvvjo2_1280.jpg",
                    "width": 1015,
                    "height": 1222
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/3d9527b6d1e66c3ebf6ddfecccbe157d/tumblr_ptb51n20C41rrzvvjo2_1280.jpg",
                        "width": 1015,
                        "height": 1222
                    },
                    {
                        "url": "https://66.media.tumblr.com/3d9527b6d1e66c3ebf6ddfecccbe157d/tumblr_ptb51n20C41rrzvvjo2_640.jpg",
                        "width": 640,
                        "height": 771
                    },
                    {
                        "url": "https://66.media.tumblr.com/3d9527b6d1e66c3ebf6ddfecccbe157d/tumblr_ptb51n20C41rrzvvjo2_540.jpg",
                        "width": 540,
                        "height": 650
                    },
                    {
                        "url": "https://66.media.tumblr.com/3d9527b6d1e66c3ebf6ddfecccbe157d/tumblr_ptb51n20C41rrzvvjo2_500.jpg",
                        "width": 500,
                        "height": 602
                    },
                    {
                        "url": "https://66.media.tumblr.com/3d9527b6d1e66c3ebf6ddfecccbe157d/tumblr_ptb51n20C41rrzvvjo2_400.jpg",
                        "width": 400,
                        "height": 482
                    },
                    {
                        "url": "https://66.media.tumblr.com/3d9527b6d1e66c3ebf6ddfecccbe157d/tumblr_ptb51n20C41rrzvvjo2_250.jpg",
                        "width": 250,
                        "height": 301
                    },
                    {
                        "url": "https://66.media.tumblr.com/3d9527b6d1e66c3ebf6ddfecccbe157d/tumblr_ptb51n20C41rrzvvjo2_100.jpg",
                        "width": 100,
                        "height": 120
                    },
                    {
                        "url": "https://66.media.tumblr.com/3d9527b6d1e66c3ebf6ddfecccbe157d/tumblr_ptb51n20C41rrzvvjo2_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/03c1230c6afe32d21dc429488566571d/tumblr_ptb51n20C41rrzvvjo4_500.gif",
                    "width": 500,
                    "height": 230
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/03c1230c6afe32d21dc429488566571d/tumblr_ptb51n20C41rrzvvjo4_500.gif",
                        "width": 500,
                        "height": 230
                    },
                    {
                        "url": "https://66.media.tumblr.com/03c1230c6afe32d21dc429488566571d/tumblr_ptb51n20C41rrzvvjo4_400.gif",
                        "width": 400,
                        "height": 184
                    },
                    {
                        "url": "https://66.media.tumblr.com/03c1230c6afe32d21dc429488566571d/tumblr_ptb51n20C41rrzvvjo4_250.gif",
                        "width": 250,
                        "height": 115
                    },
                    {
                        "url": "https://66.media.tumblr.com/03c1230c6afe32d21dc429488566571d/tumblr_ptb51n20C41rrzvvjo4_100.gif",
                        "width": 100,
                        "height": 46
                    },
                    {
                        "url": "https://66.media.tumblr.com/03c1230c6afe32d21dc429488566571d/tumblr_ptb51n20C41rrzvvjo4_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "ayanemoonlight",
        "blog": {
            "name": "ayanemoonlight",
            "title": "Ayane Moon",
            "description": "Algerian,28. Slytherine, Photoshop edit maker,Massive Stucky fan\nsebastian stan,Tom Hiddelston,Jensen Ackels, Thorky,SPN Family, sherlock, HELP!AM IN TOOO MANY FANDOMS http://ko-fi.com/ayanemoon",
            "url": "https://ayanemoonlight.tumblr.com/",
            "uuid": "t:kI4dzxmxh4q0wiuDHV1_FQ",
            "updated": 1561734485
        },
        "id": 185683698653,
        "post_url": "https://ayanemoonlight.tumblr.com/post/185683698653/dracula-stevie-fic-this-pic-challenge-come-on",
        "slug": "dracula-stevie-fic-this-pic-challenge-come-on",
        "date": "2019-06-18 18:33:30 GMT",
        "timestamp": 1560882810,
        "state": "published",
        "format": "html",
        "reblog_key": "WwUH2pJt",
        "tags": [
            "dracula",
            "dracula untold",
            "Steve Rogers",
            "Chris Evans",
            "ficthispicchallenge"
        ],
        "short_url": "https://tmblr.co/ZtU64o2ixd6FT",
        "summary": "Dracula Stevie! FIC THIS PIC CHALLENGE! come on, guys! any vampire writers here? @hitlikehammers @smutslutsclub",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 219,
        "caption": "<h2>Dracula <b>Stevie</b>!</h2><p><b>FIC THIS PIC CHALLENGE!<br/></b>come on, guys! any vampire writers here?<br/><a class=\"tumblelog\" href=\"https://tmblr.co/miCgJDeCmu0y7zCc94iO5zw\">@hitlikehammers</a> <a class=\"tumblelog\" href=\"https://tmblr.co/m2qRCyHaU4ch1Won20Xhdrg\">@smutslutsclub</a></p>",
        "reblog": {
            "comment": "<p><h2>Dracula <b>Stevie</b>!</h2><p><b>FIC THIS PIC CHALLENGE!<br></b>come on, guys! any vampire writers here?<br><a class=\"tumblelog\" href=\"https://tmblr.co/miCgJDeCmu0y7zCc94iO5zw\">@hitlikehammers</a> <a class=\"tumblelog\" href=\"https://tmblr.co/m2qRCyHaU4ch1Won20Xhdrg\">@smutslutsclub</a></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ayanemoonlight",
                    "active": true,
                    "theme": {
                        "header_full_width": 2212,
                        "header_full_height": 918,
                        "header_focus_width": 1586,
                        "header_focus_height": 892,
                        "avatar_shape": "circle",
                        "background_color": "#1F0000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "25,1708,917,122",
                        "header_image": "https://static.tumblr.com/eaba355d2e28f84ef22fb7b27cd300ac/rusekgi/qnSovxdz7/tumblr_static_855ji8kvhrk8scwo0gggo8so.jpg",
                        "header_image_focused": "https://static.tumblr.com/eaba355d2e28f84ef22fb7b27cd300ac/rusekgi/moEovxdzd/tumblr_static_tumblr_static_855ji8kvhrk8scwo0gggo8so_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/eaba355d2e28f84ef22fb7b27cd300ac/rusekgi/qnSovxdz7/tumblr_static_855ji8kvhrk8scwo0gggo8so_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FF4141",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185683698653"
                },
                "content_raw": "<p><h2>Dracula <b>Stevie</b>!</h2><p><b>FIC THIS PIC CHALLENGE!<br></b>come on, guys! any vampire writers here?<br><a class=\"tumblelog\" href=\"https://tmblr.co/miCgJDeCmu0y7zCc94iO5zw\">@hitlikehammers</a> <a class=\"tumblelog\" href=\"https://tmblr.co/m2qRCyHaU4ch1Won20Xhdrg\">@smutslutsclub</a></p></p>",
                "content": "<p><h2>Dracula <b>Stevie</b>!</h2><p><b>FIC THIS PIC CHALLENGE!<br /></b>come on, guys! any vampire writers here?<br /><a href=\"https://tmblr.co/miCgJDeCmu0y7zCc94iO5zw\">@hitlikehammers</a> <a href=\"https://tmblr.co/m2qRCyHaU4ch1Won20Xhdrg\">@smutslutsclub</a></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://ayanemoonlight.tumblr.com/image/185683698653",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/e6f8b7272cc32c5db2acbf730cf3db60/tumblr_ptb4vuIrqe1twntmco1_1280.jpg",
                    "width": 1280,
                    "height": 1707
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/e6f8b7272cc32c5db2acbf730cf3db60/tumblr_ptb4vuIrqe1twntmco1_1280.jpg",
                        "width": 1280,
                        "height": 1707
                    },
                    {
                        "url": "https://66.media.tumblr.com/e6f8b7272cc32c5db2acbf730cf3db60/tumblr_ptb4vuIrqe1twntmco1_640.jpg",
                        "width": 640,
                        "height": 854
                    },
                    {
                        "url": "https://66.media.tumblr.com/e6f8b7272cc32c5db2acbf730cf3db60/tumblr_ptb4vuIrqe1twntmco1_540.jpg",
                        "width": 540,
                        "height": 720
                    },
                    {
                        "url": "https://66.media.tumblr.com/e6f8b7272cc32c5db2acbf730cf3db60/tumblr_ptb4vuIrqe1twntmco1_500.jpg",
                        "width": 500,
                        "height": 667
                    },
                    {
                        "url": "https://66.media.tumblr.com/e6f8b7272cc32c5db2acbf730cf3db60/tumblr_ptb4vuIrqe1twntmco1_400.jpg",
                        "width": 400,
                        "height": 533
                    },
                    {
                        "url": "https://66.media.tumblr.com/e6f8b7272cc32c5db2acbf730cf3db60/tumblr_ptb4vuIrqe1twntmco1_250.jpg",
                        "width": 250,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/e6f8b7272cc32c5db2acbf730cf3db60/tumblr_ptb4vuIrqe1twntmco1_100.jpg",
                        "width": 100,
                        "height": 133
                    },
                    {
                        "url": "https://66.media.tumblr.com/e6f8b7272cc32c5db2acbf730cf3db60/tumblr_ptb4vuIrqe1twntmco1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "blood17water",
        "blog": {
            "name": "blood17water",
            "title": "eileithhyia ‎⧗",
            "description": "tired",
            "url": "https://blood17water.tumblr.com/",
            "uuid": "t:MK2w1t7CwSCXcTtUCYVpLQ",
            "updated": 1561632736
        },
        "id": 185683636116,
        "post_url": "https://blood17water.tumblr.com/post/185683636116/i-didnt-want-you-to-be-alone-since-two-thousand",
        "slug": "i-didnt-want-you-to-be-alone-since-two-thousand",
        "date": "2019-06-18 18:30:09 GMT",
        "timestamp": 1560882609,
        "state": "published",
        "format": "html",
        "reblog_key": "s1hNCi5f",
        "tags": [
            "scarlett johansson",
            "chris evans",
            "cevans",
            "evansson",
            "romanogers",
            "scarjo",
            "endgame",
            "look at them over the years 😭",
            "my one true pairing",
            "marvel",
            "mcu",
            "steve rogers",
            "natasha romanoff",
            "captain america",
            "black widow",
            "captasha",
            "capwidow",
            "stasha"
        ],
        "short_url": "https://tmblr.co/ZID2oi2ixcs_K",
        "summary": "I DIDN'T WANT YOU TO BE ALONE.\nsince two thousand two :)",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 655,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"869\"><img src=\"https://66.media.tumblr.com/3befaf0d21b0c10838df61ee193b0949/tumblr_ptb4q5IPjt1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"869\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"881\"><img src=\"https://66.media.tumblr.com/773d2a1cbfbbf1493aa46c3ec82841e7/tumblr_ptb4q6VOkb1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"881\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1011\"><img src=\"https://66.media.tumblr.com/71fd136cce5d7eb6a2a8b287a757d80b/tumblr_ptb4q7cO5K1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1011\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1027\"><img src=\"https://66.media.tumblr.com/0f1030a61057a6317167e95afab411fb/tumblr_ptb4q7JVp31thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1027\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1036\"><img src=\"https://66.media.tumblr.com/6af5073b9e2ffa271425b68bd9c11f32/tumblr_ptb4q8rKBd1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1036\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"955\"><img src=\"https://66.media.tumblr.com/01226177de12bc2d1b674290695f9fad/tumblr_ptb4q81xcq1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"955\"/></figure></div><p><i><b>I DIDN&rsquo;T WANT YOU TO BE ALONE.</b></i></p><p><i>since <strike>two thousand two :)</strike></i></p>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"869\"><img src=\"https://66.media.tumblr.com/3befaf0d21b0c10838df61ee193b0949/tumblr_ptb4q5IPjt1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"869\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"881\"><img src=\"https://66.media.tumblr.com/773d2a1cbfbbf1493aa46c3ec82841e7/tumblr_ptb4q6VOkb1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"881\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1011\"><img src=\"https://66.media.tumblr.com/71fd136cce5d7eb6a2a8b287a757d80b/tumblr_ptb4q7cO5K1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1011\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1027\"><img src=\"https://66.media.tumblr.com/0f1030a61057a6317167e95afab411fb/tumblr_ptb4q7JVp31thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1027\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1036\"><img src=\"https://66.media.tumblr.com/6af5073b9e2ffa271425b68bd9c11f32/tumblr_ptb4q8rKBd1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1036\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"955\"><img src=\"https://66.media.tumblr.com/01226177de12bc2d1b674290695f9fad/tumblr_ptb4q81xcq1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"955\"></figure></div><p><i><b>I DIDN’T WANT YOU TO BE ALONE.</b></i></p><p><i>since <strike>two thousand two :)</strike></i></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "blood17water",
                    "active": true,
                    "theme": {
                        "header_full_width": 400,
                        "header_full_height": 306,
                        "header_focus_width": 400,
                        "header_focus_height": 225,
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,400,225,0",
                        "header_image": "https://static.tumblr.com/2928b06a242dc29f5a32b590d632ae5d/xuoiqd6/LBSptb4wd/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/335155a41c59d5f45161fa53f0816b22/xuoiqd6/PXbptb4we/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/2928b06a242dc29f5a32b590d632ae5d/xuoiqd6/LBSptb4wd/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#ede5f3",
                        "show_avatar": true,
                        "show_description": false,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#9DBCE9",
                        "title_font": "Caslon FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185683636116"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"869\"><img src=\"https://66.media.tumblr.com/3befaf0d21b0c10838df61ee193b0949/tumblr_ptb4q5IPjt1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"869\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"881\"><img src=\"https://66.media.tumblr.com/773d2a1cbfbbf1493aa46c3ec82841e7/tumblr_ptb4q6VOkb1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"881\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1011\"><img src=\"https://66.media.tumblr.com/71fd136cce5d7eb6a2a8b287a757d80b/tumblr_ptb4q7cO5K1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1011\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1027\"><img src=\"https://66.media.tumblr.com/0f1030a61057a6317167e95afab411fb/tumblr_ptb4q7JVp31thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1027\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1036\"><img src=\"https://66.media.tumblr.com/6af5073b9e2ffa271425b68bd9c11f32/tumblr_ptb4q8rKBd1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"1036\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"955\"><img src=\"https://66.media.tumblr.com/01226177de12bc2d1b674290695f9fad/tumblr_ptb4q81xcq1thl3sy_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"955\"></figure></div><p><i><b>I DIDN’T WANT YOU TO BE ALONE.</b></i></p><p><i>since <strike>two thousand two :)</strike></i></p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/3befaf0d21b0c10838df61ee193b0949/tumblr_ptb4q5IPjt1thl3sy_1280.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/773d2a1cbfbbf1493aa46c3ec82841e7/tumblr_ptb4q6VOkb1thl3sy_1280.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/71fd136cce5d7eb6a2a8b287a757d80b/tumblr_ptb4q7cO5K1thl3sy_1280.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0f1030a61057a6317167e95afab411fb/tumblr_ptb4q7JVp31thl3sy_1280.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/6af5073b9e2ffa271425b68bd9c11f32/tumblr_ptb4q8rKBd1thl3sy_1280.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/01226177de12bc2d1b674290695f9fad/tumblr_ptb4q81xcq1thl3sy_1280.jpg\" class=\"\"/></figure><p><i><b>I DIDN&rsquo;T WANT YOU TO BE ALONE.</b></i></p><p><i>since <strike>two thousand two :)</strike></i></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "istanstucky",
        "blog": {
            "name": "istanstucky",
            "title": "MARVElous",
            "description": "<p>text me ur fav marvel character,, let’s chat!!</p>",
            "url": "https://istanstucky.tumblr.com/",
            "uuid": "t:U0I6D-9vmmu_u7HOWqjdew",
            "updated": 1561412760
        },
        "id": 185683448832,
        "post_url": "https://istanstucky.tumblr.com/post/185683448832/sicko-mode-or-mo-bamba-no-question-the-marvel",
        "slug": "sicko-mode-or-mo-bamba-no-question-the-marvel",
        "date": "2019-06-18 18:19:39 GMT",
        "timestamp": 1560881979,
        "state": "published",
        "format": "html",
        "reblog_key": "VcuULstH",
        "tags": [
            "marvel",
            "iron man",
            "chris evans",
            "steve rogers",
            "peggy carter",
            "natasha romanoff",
            "ironfam",
            "the marvel bunch",
            "the russo brothers",
            "stan lee",
            "hawkeye",
            "dr strange",
            "black widow",
            "pepper potts"
        ],
        "short_url": "https://tmblr.co/Z4Tthf2ixc9G0",
        "summary": "sicko mode or mo bamba?? no question. the marvel bunch",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 2,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"713\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/0a483c4dbf7163c976e11a878d1ba0fe/tumblr_ptb48rb0Ng1ux25m5_540.jpg\" data-orig-height=\"713\" data-orig-width=\"720\"/></figure><p>sicko mode or mo bamba?? no question. the marvel bunch</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"713\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/0a483c4dbf7163c976e11a878d1ba0fe/tumblr_ptb48rb0Ng1ux25m5_540.jpg\" data-orig-height=\"713\" data-orig-width=\"720\"></figure><p>sicko mode or mo bamba?? no question. the marvel bunch</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "istanstucky",
                    "active": true,
                    "theme": {
                        "header_full_width": 680,
                        "header_full_height": 632,
                        "header_focus_width": 582,
                        "header_focus_height": 328,
                        "avatar_shape": "circle",
                        "background_color": "#BAE9DE",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "94,626,422,44",
                        "header_image": "https://static.tumblr.com/6c1b8f5f5a2d2ee76021e5be3d700a3e/seugndv/eoNptb3yl/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/90ff2194ef337a549e22445066a5853a/seugndv/hKDptb3ym/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/6c1b8f5f5a2d2ee76021e5be3d700a3e/seugndv/eoNptb3yl/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#B4A1FF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FD9395",
                        "title_font": "Avalon",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185683448832"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"713\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/0a483c4dbf7163c976e11a878d1ba0fe/tumblr_ptb48rb0Ng1ux25m5_540.jpg\" data-orig-height=\"713\" data-orig-width=\"720\"></figure><p>sicko mode or mo bamba?? no question. the marvel bunch</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0a483c4dbf7163c976e11a878d1ba0fe/tumblr_ptb48rb0Ng1ux25m5_540.jpg\" class=\"\"/></figure><p>sicko mode or mo bamba?? no question. the marvel bunch</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "daybreak96",
        "blog": {
            "name": "daybreak96",
            "title": "Now is the Hour of Wolves",
            "description": "<b>Never cruel or cowardly.\nNever give up. Never give in.</b>\n<a href=\"/tagged/fanfic\">My fanfics</a> - <a href=\"/tagged/fic-rec\">Fic Rec's</a> - <a href=\"/tagged/photoshoot\">A collection of Seb's (and some of Chris's) photoshoots</a>",
            "url": "https://daybreak96.tumblr.com/",
            "uuid": "t:jix5wvyBTLin06v51Ci5cQ",
            "updated": 1561762753
        },
        "id": 185683441086,
        "post_url": "https://daybreak96.tumblr.com/post/185683441086/ok-how-are-there-not-more-chris-evans-with-a-big",
        "slug": "ok-how-are-there-not-more-chris-evans-with-a-big",
        "date": "2019-06-18 18:19:07 GMT",
        "timestamp": 1560881947,
        "state": "published",
        "format": "html",
        "reblog_key": "IR62xUJX",
        "tags": [
            "chris evans",
            "fluff",
            "chris evans fanfic",
            "chris evans fic",
            "chris evans x reader",
            "daddy chris",
            "boston",
            "boston irish"
        ],
        "short_url": "https://tmblr.co/Zq7Klv2ixc7M_",
        "summary": "OK, how are there not more ‘Chris Evans with a big Boston family’ fics out there??",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 95,
        "title": null,
        "body": "<h1>OK, how are there not more ‘Chris Evans with a big Boston family’ fics out there??</h1><h1>I’m talking about pure fluff, filled with baby/toddler/Dodger high-jinks and maybe the odd smutty ‘baby-making’ chapter!!</h1>",
        "reblog": {
            "comment": "<p><h1>OK, how are there not more ‘Chris Evans with a big Boston family’ fics out there??</h1><h1>I’m talking about pure fluff, filled with baby/toddler/Dodger high-jinks and maybe the odd smutty ‘baby-making’ chapter!!</h1></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "daybreak96",
                    "active": true,
                    "theme": {
                        "header_full_width": 2000,
                        "header_full_height": 1402,
                        "header_focus_width": 1617,
                        "header_focus_height": 910,
                        "avatar_shape": "circle",
                        "background_color": "#c1ffea",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "15,1903,925,286",
                        "header_image": "https://static.tumblr.com/dcc2c6948685211f38256c8fc4334440/an0fs2r/q1hpjfucr/tumblr_static_5xgc8db89kg88k48sckokscok.jpg",
                        "header_image_focused": "https://static.tumblr.com/cae4a488203a64b04734e761c88436ce/an0fs2r/nOhpqnczq/tumblr_static_tumblr_static_5xgc8db89kg88k48sckokscok_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_11_focused_v3.png?_v=4275fa0865b78225d79970023dde05a1",
                        "header_stretch": true,
                        "link_color": "#ab45ec",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ab45ec",
                        "title_font": "Typewriter FS",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185683441086"
                },
                "content_raw": "<p><h1>OK, how are there not more ‘Chris Evans with a big Boston family’ fics out there??</h1><h1>I’m talking about pure fluff, filled with baby/toddler/Dodger high-jinks and maybe the odd smutty ‘baby-making’ chapter!!</h1></p>",
                "content": "<p><h1>OK, how are there not more&nbsp;&lsquo;Chris Evans with a big Boston family&rsquo; fics out there??</h1><h1>I&rsquo;m talking about pure fluff, filled with baby/toddler/Dodger high-jinks and maybe the odd smutty &lsquo;baby-making&rsquo; chapter!!</h1></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "cheeseburger-first",
        "blog": {
            "name": "cheeseburger-first",
            "title": "Let Me Marry You!",
            "description": "<p>• I’m terrified of social media...but hey, I try.</p><p>• I’m a slut for SuperWhoLock, marvel, The Arcana, Buzzfeed Unsolved; Literally anything. </p><p>• Ask me to write or draw something, I’ll get to it in a few years. ❤️</p>",
            "url": "https://cheeseburger-first.tumblr.com/",
            "uuid": "t:SCJvEfjIxzd_a0heX-VJxQ",
            "updated": 1561687907
        },
        "id": 185683381329,
        "post_url": "https://cheeseburger-first.tumblr.com/post/185683381329/so-its-canon-that-the-mcu-cast-has-a-groupchat",
        "slug": "so-its-canon-that-the-mcu-cast-has-a-groupchat",
        "date": "2019-06-18 18:15:41 GMT",
        "timestamp": 1560881741,
        "state": "published",
        "format": "html",
        "reblog_key": "dDNDHrhj",
        "tags": [
            "chris evans",
            "abengers assemble",
            "captain america",
            "mcu",
            "marvel cast",
            "marvel",
            "avengers"
        ],
        "short_url": "https://tmblr.co/ZsdhEg2ixbunH",
        "summary": "So it’s canon that the Mcu cast has a groupchat and Chris Evans will randomly text ‘Assemble’ in it.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 14,
        "title": null,
        "body": "<h1>So it’s canon that the Mcu cast has a groupchat and Chris Evans will randomly text ‘Assemble’ in it. </h1>",
        "reblog": {
            "comment": "<p><h1>So it’s canon that the Mcu cast has a groupchat and Chris Evans will randomly text ‘Assemble’ in it. </h1></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "cheeseburger-first",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 437,
                        "header_focus_width": 500,
                        "header_focus_height": 281,
                        "avatar_shape": "square",
                        "background_color": "#9D524F",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "1,500,282,0",
                        "header_image": "https://static.tumblr.com/4a5601bfc34aca090984732b616f0883/gcktdko/hBmpsw2jg/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/76ffa6e2c15033ceaf1fedda256d1134/gcktdko/WWBpsw2jh/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/4a5601bfc34aca090984732b616f0883/gcktdko/hBmpsw2jg/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#4D436D",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#130502",
                        "title_font": "Bookmania",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "185683381329"
                },
                "content_raw": "<p><h1>So it’s canon that the Mcu cast has a groupchat and Chris Evans will randomly text ‘Assemble’ in it. </h1></p>",
                "content": "<p><h1>So it&rsquo;s canon that the Mcu cast has a groupchat and Chris Evans will randomly text &lsquo;Assemble&rsquo; in it. </h1></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]