[
    {
        "type": "text",
        "blog_name": "icup-pretty-colors",
        "blog": {
            "name": "icup-pretty-colors",
            "title": "dj fruity saved my soul",
            "description": "♡ kam ♡ icon by tyrusismyreligion♡ ily ♡",
            "url": "https://icup-pretty-colors.tumblr.com/",
            "uuid": "t:Pzih9QhqBnZHTpXhMBd6Fg",
            "updated": 1561657411
        },
        "id": 177956257543,
        "post_url": "https://icup-pretty-colors.tumblr.com/post/177956257543/ok-but-nervous-by-shawn-mendes-tyrus-anthem",
        "slug": "ok-but-nervous-by-shawn-mendes-tyrus-anthem",
        "date": "2018-09-10 23:43:29 GMT",
        "timestamp": 1536623009,
        "state": "published",
        "format": "html",
        "reblog_key": "sVTB4V9F",
        "tags": [
            "dont even try to deny it",
            "u cannot change my mind",
            "tyrus",
            "tyrus andi mack",
            "andi mack",
            "cyrus goodman",
            "tj kippen"
        ],
        "short_url": "https://tmblr.co/Z_Obqb2bl1Fy7",
        "summary": "ok but nervous by shawn mendes? tyrus anthem",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 46,
        "title": null,
        "body": "<p>ok but nervous by shawn mendes? tyrus anthem</p>",
        "reblog": {
            "comment": "<p>ok but nervous by shawn mendes? tyrus anthem</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "icup-pretty-colors",
                    "active": true,
                    "theme": {
                        "header_full_width": 720,
                        "header_full_height": 1280,
                        "header_focus_width": 720,
                        "header_focus_height": 405,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "434,720,839,0",
                        "header_image": "https://static.tumblr.com/4c656abb98b2fa552d9eb2f107e4318f/rurgnrz/EFSprhp54/tumblr_static_1594993412-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/22fbbbc84facbca39c3d5566f2c5920c/rurgnrz/QUkprhp55/tumblr_static_tumblr_static_1594993412-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/4c656abb98b2fa552d9eb2f107e4318f/rurgnrz/EFSprhp54/tumblr_static_1594993412-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFF148",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFD731",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177956257543"
                },
                "content_raw": "<p>ok but nervous by shawn mendes? tyrus anthem</p>",
                "content": "<p>ok but nervous by shawn mendes? tyrus anthem</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "raf-solano",
        "blog": {
            "name": "raf-solano",
            "title": "i was feeling epic.",
            "description": "glo | she/her | 20 | asian-american | vidder | multifandom af | sidebar: dailyjtvgifs | icon: rafael-solano",
            "url": "https://raf-solano.tumblr.com/",
            "uuid": "t:fwUT5vcm2fznyN6mN-19kA",
            "updated": 1561770030
        },
        "id": 177955178102,
        "post_url": "https://raf-solano.tumblr.com/post/177955178102/im-thinking-about-making-a-tj-edit-i-made-a-mini",
        "slug": "im-thinking-about-making-a-tj-edit-i-made-a-mini",
        "date": "2018-09-10 23:04:27 GMT",
        "timestamp": 1536620667,
        "state": "published",
        "format": "html",
        "reblog_key": "hKs9AX4L",
        "tags": [
            "andi mack",
            "tj kippen"
        ],
        "short_url": "https://tmblr.co/ZYpOir2bkz8Ps",
        "summary": "I’m thinking about making a TJ edit. I made a mini one on my insta but I’m planning on a longer edit bc I have a really perfect...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 22,
        "title": null,
        "body": "<p>I’m thinking about making a TJ edit. I made a mini one on my insta but I’m planning on a longer edit bc I have a really perfect song in mind.</p>",
        "reblog": {
            "comment": "<p>I’m thinking about making a TJ edit. I made a mini one on my insta but I’m planning on a longer edit bc I have a really perfect song in mind.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "raf-solano",
                    "active": true,
                    "theme": {
                        "header_full_width": 245,
                        "header_full_height": 136,
                        "header_focus_width": 242,
                        "header_focus_height": 136,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,243,136,1",
                        "header_image": "https://static.tumblr.com/e3234f94c6c9ea15fff8359bd62e10a1/j67mwxm/ubBpqnoqs/tumblr_static_7n3edsmyynks4ckcw4ccww8ks.gif",
                        "header_image_focused": "https://static.tumblr.com/e3234f94c6c9ea15fff8359bd62e10a1/j67mwxm/rnOpqnoqv/tumblr_static_tumblr_static_7n3edsmyynks4ckcw4ccww8ks_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/e3234f94c6c9ea15fff8359bd62e10a1/j67mwxm/ubBpqnoqs/tumblr_static_7n3edsmyynks4ckcw4ccww8ks_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#888888",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#888888",
                        "title_font": "Caslon FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177955178102"
                },
                "content_raw": "<p>I’m thinking about making a TJ edit. I made a mini one on my insta but I’m planning on a longer edit bc I have a really perfect song in mind.</p>",
                "content": "<p>I&rsquo;m thinking about making a TJ edit. I made a mini one on my insta but I&rsquo;m planning on a longer edit bc I have a really perfect song in mind.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "seriestrash",
        "blog": {
            "name": "seriestrash",
            "title": "Hi",
            "description": "<a href=\"http:/seriestrash.tumblr.com/fics\">☼ Fics ☼</a> <br>\nEbony 🧚",
            "url": "https://seriestrash.tumblr.com/",
            "uuid": "t:8dLssggbE53NG9c3rMSezQ",
            "updated": 1561771973
        },
        "id": 177954769160,
        "post_url": "https://seriestrash.tumblr.com/post/177954769160/the-list-chapter-two",
        "slug": "the-list-chapter-two",
        "date": "2018-09-10 22:49:52 GMT",
        "timestamp": 1536619792,
        "state": "published",
        "format": "html",
        "reblog_key": "Cmq1rIWG",
        "tags": [
            "tyrus",
            "andi mack",
            "the list fic",
            "tj kippen",
            "cyrus goodman",
            "tyrus fic"
        ],
        "short_url": "https://tmblr.co/ZZwPpg2bkxaa8",
        "summary": "The List  - Chapter Two",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 219,
        "title": "The List  - Chapter Two",
        "body": "<figure data-orig-width=\"938\" data-orig-height=\"658\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4ba9e702d205bace9afcc41f8ea78c80/tumblr_inline_pdzr4iOaE81unll6l_540.png\" alt=\"image\" data-orig-width=\"938\" data-orig-height=\"658\"/></figure><p>- <a href=\"http://seriestrash.tumblr.com/post/177814576085/the-list-chapter-one\">1</a> -</p><p><i><b>Summary:</b> It’s summer vacation and TJ and Cyrus fill their days checking things off Cyrus’ list. </i></p><p><a href=\"https://archiveofourown.org/works/16240184/chapters/37966226\">Read on AO3</a><br/></p><h2><b>Chapter Two:</b> Park Day</h2><p><b>Word Count:</b> 1651</p><hr><p>Mid morning the following day, Cyrus makes his way over to the park to meet TJ like they had agreed upon. Cyrus arrives first and sits on a bench whilst he waits. As the warm sun is beaming down, Cyrus begins to overthink things. <i>What if I attempt a handstand and break my arm and then I’m unfit to try anything else on my list and the best summer ever is over before it had much of a chance to begin?</i></p><p>“You look like you’re panicking.” TJ purposely sneaks up on Cyrus and it causes him to jump. TJ slides in next to him on the park bench with an amused chuckle.<br/></p><p>“I’m always panicking,” Cyrus frowns, “and even more so now that you’ve scared me.” Cyrus adds with a playful shove to TJ’s arm. <br/></p><p>TJ pretends like it hurt and the two laugh it off. “Sorry I’m late, I was packing supplies.” TJ pulls his backpack onto his lap and pats it gently.</p><p>“Supplies?” Cyrus knits his brows together. <br/></p><p>“Well for starters I made a hard copy of the list,” TJ wears an excited smile as he unzips his backpack.<br/></p><p>“I love hard copies of things.” Cyrus gleams.</p><p>“That way it’s rewarding to physically cross something off the list.” TJ bops his head. “My printer was out of ink so I just wrote them down myself.” TJ explains as he hands Cyrus a sheet of paper. </p><p>Cyrus holds the torn page from one of TJ’s notebooks like he was just given the most precious gift. TJ had gone to the effort to write out all ninety-seven things from Cyrus’ list and even decorated the margin with a few doodles. </p><!-- more --><p>“I also brought a mat because grass makes me itchy- Well we didn’t actually have a picnic mat at home so it’s a bed sheet but same difference,” TJ shrugs, “Oh and my mom packed us snacks. She says she doesn’t want me spending all my money on junk food over the summer.” <br/></p><p>Cyrus doesn’t even try to hide his smile at the effort TJ put into the day. Cyrus thinks about how he spent the morning contemplating bringing his vest - the one he wears to Jonah’s frisbee matches - and how he decided he didn’t want to look dorky so all he packed was sunblock for them both and here TJ was unapologetically unpacking supplies. TJ’s rather adorable planning changes Cyrus’ panicked outlook on the first task - and those that will follow - into one more optimistic. </p><p>“So we going to do this handstand or what?” Cyrus asks. <br/></p><p>“Now that’s the right attitude!” TJ jumps up from the bench. <br/></p><p>The two pick a spot under the shade of a big tree. TJ lays out the bed sheet he brought and wastes no time showing Cyrus how easy it was to do a handstand. </p><p>“Is there anything you can’t do?” Cyrus coaxes his head to look at TJ whom is holding a handstand. TJ smiles and drops his position. <br/></p><p>“I can’t do a cartwheel.” TJ says once he’s sitting. <br/></p><p>“But that’s on my list?” Cyrus frowns. <br/></p><p>“Guess we’ll both be learning how to do one,” TJ shrugs one shoulder, “Now it’s your turn.” </p><p>Cyrus takes a deep breath and holds his arms up, he takes a step forward as if he was about to try but he stops and looks to TJ, “You might want to move back a little, just in case.” </p><p>TJ wriggles back to the far corner of the sheet and holds his hands together encouragingly as he waits for Cyrus to attempt his handstand. Cyrus takes another breath but further procrastinates by tucking his patterned t-shirt into his pants. </p><p>“Cyrus, Cyrus, Cyrus,” TJ chants quietly. <br/></p><p>Finally Cyrus lunges forward but instead of kicking his legs up he just flops forward on his hands and knees. Cyrus lifts his head up and meets TJ’s grimace. </p><p>“Almost,” TJ nods lightly, “Maybe try kicking your legs up this time?” <br/></p><p>Cyrus lets out a heavy sigh and tries again and again and again and each time ends with a rather ungraceful flop to the ground. After hurtling himself forward doesn’t work, Cyrus switches to two hands on the ground and light kicks of his legs upwards but it ends up being more of an amusing sight with his legs flailing about. </p><p>“Try kick higher,” TJ encourages, “I’ll catch your legs.” <br/></p><p>“I’ll kick you in the face,” Cyrus says in a panic as he holds his downward dog position. <br/></p><p>“Try not to do that.” TJ laughs nervously. <br/></p><p>Cyrus kicks up off the ground and his legs smack into TJ’s arms as he failed to grab Cyrus. They try this a few times but it proved no such luck. </p><p>“I’m too afraid I’m going to hurt you.” Cyrus shakes his head. “And I can hear children giggling at me and it’s not helping my self-confidence.”<br/></p><p>“We’re in a park, Underdog,” TJ laughs, “Hearing children laughing is hardly unusual.” <br/></p><p>After another few failed attempts and an entertaining mock yoga lesson from Cyrus, the two decide take a lunch break. TJ practically inhales his food and lays back on the part of the sheet that got direct sunlight. With sunglasses on he enjoys the rays as Cyrus sits in the shade and nibbles on the remainder of his sandwich. </p><p>“So is there anything else on the list that you can’t do?” Cyrus questions. </p><p>“I don’t know about can’t but there are some things I haven’t done, yeah.” TJ  turns his head towards Cyrus. His choice of words weren’t meant to be braggy or overconfident. Cyrus smiles lightly at TJ’s attitude and wished he could feel more like that. </p><p>“There are a few things on the list that didn’t make sense to me,” TJ laughs quietly, “like ‘horses’, what does that even mean?”</p><p>“They’re so big and scary.” Cyrus laughs nervously. </p><p>“So you want to not be afraid of them?” TJ questions, “Or you want to ride one?” </p><p>“Just,<i> horses.</i>” Cyrus shrugs innocently as he had mindlessly added a few things on the list over time. </p><p>“Horses.” TJ laughs and he turns his head to the sky again to enjoy the warmth of the sun. </p><p>Eventually the two stop lounging around and return to their summer task with a new plan of attack.. TJ cautiously stands by and helps Cyrus kick up against the tree for balance. </p><p>“Hey, I did it!” Cyrus is upside down and excited. </p><p>“Now try and kick off gently and hold it.” TJ holds his hands out just in case Cyrus fell. </p><p>Cyrus kicks too hard and topples over. “I’m never going to get this am I?” Cyrus grumbles on the ground. </p><p>“Your list didn’t say anything about being a professional gymnast,” TJ crouches down beside Cyrus, “I think the important thing is that you’re trying.” </p><p>“You didn’t pack a participation ribbon in your supplies did you?” Cyrus jokes and it warrants a chuckle from the basketball captain. </p><p>“Again?” TJ asks softly. </p><p>“Again.” Cyrus matches his tone and the fail montage continues until it’s a success. </p><p>“1..2!..3..!” TJ counts the seconds Cyrus held it for before he rolled forward out of his handstand. <br/></p><p>Cyrus throws his hands up victoriously in the air and the two teens celebrate his achievement. </p><p>“You beat your time it took to do a somersault.” TJ highlights. <br/></p><p>“At this rate I’m going do a cartwheel on the first try.” Cyrus jokes and to add to the theatrics he actually attempted to do one and amazingly he succeeded. <br/></p><p>Once Cyrus is on his feet he looks to TJ shocked at what just occurred, the taller boy also has a look of amazement plastered on his face. </p><p>“Did that just happen?” Cyrus asks in a state of disbelief. <br/></p><p>“That was incredible!” TJ affirms in astonishment. <br/></p><p>“I can do cartwheels!” Cyrus does three more cartwheels to celebrate.</p><p>“You try!” Cyrus stops once he feels dizzy. <br/></p><p>TJ frowns knowing it wasn’t going to be pretty but leaps into a failed attempt anyway. </p><p>“That’s okay,” Cyrus tries to squash his smile at how gawky TJ looked, “We can’t all be professional gymnasts like me.” </p><p>“Okay over achiever, let’s see you climb a tree next.” TJ playfully challenges. <br/></p><p>Cyrus scrunches up his nose, “You couldn’t let me be a rockstar for a few more moments?” </p><p>TJ coaxes his head with a smile before approaching the trunk of the tree. TJ crouches down and holds his hand on his knee to help boost Cyrus up. </p><p>“Is this cheating?” Cyrus hovers by TJ. <br/></p><p>“You want to jump up on your own?” TJ asks. <br/></p><p>Cyrus looks at the lowest branch which was barely reachable even if he stretched up and then he turns back to TJ with a smile as he accepts his offer to boost him up.  </p><p>Once on the lowest branch, Cyrus hugs the tree for support and looks down to TJ with an exaggerated smile, “I did it..” </p><p>“Higher.” TJ says with a devilish smirk. <br/></p><p>Cyrus sends him a puppy dog expression but cautiously stands himself up and climbs to a higher branch and eventually up to the point where he couldn’t climb anymore. </p><p>Cyrus looks out through the leaves and admires the wide view scope of the park. His eyes fall on the swings and with a smile he calls down to TJ, “Want to go for a swing before we go home?” </p><p>“I’ll race ya,” TJ calls up excitedly. <br/></p><p>“I’m in a tree, that’s not fair!” Cyrus whines as he carefully tries to climb down. <br/></p><p>TJ chuckles, waits to help Cyrus down from the tree safely and then he playfully pushes Cyrus and runs towards the swings with a head start. </p><p>“Last one there has to buy the other a milkshake from The Spoon!” TJ calls out as he runs. <br/></p><p>“Your mom said she doesn&rsquo;t want you eating junk food!” Cyrus cries out as he ultimately loses the race. <br/></p><p>[<a href=\"http://seriestrash.tumblr.com/post/178055315480/the-list-chapter-three\">Next Chapter</a>]<br/></p><hr><p><b>End Notes: </b><i>Chapter Two!! </i>I Hope you’re enjoying the story so far. Chapter one received positive reviews and I genuinely appreciated them all so much! I tried to reply to most but didn’t want to spam everyone with reblogged replies! But please know you mean the world to me!! </p>",
        "body_abstract": "\n<figure data-orig-width=\"938\" data-orig-height=\"658\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4ba9e702d205bace9afcc41f8ea78c80/tumblr_inline_pdzr4iOaE81unll6l_540.png\" alt=\"image\" data-orig-width=\"938\" data-orig-height=\"658\"></figure><p>- <a href=\"http://seriestrash.tumblr.com/post/177814576085/the-list-chapter-one\">1</a> -</p>\n<p><i><b>Summary:</b> It&rsquo;s summer vacation and TJ and Cyrus fill their days checking things off Cyrus&rsquo; list.&nbsp;</i></p>\n<p><a href=\"https://archiveofourown.org/works/16240184/chapters/37966226\">Read on AO3</a><br></p>\n<h2>\n<b>Chapter Two:</b> Park Day</h2>\n<p><b>Word Count:</b> 1651</p>\n<hr>\n<p>Mid morning the following day, Cyrus makes his way over to the park to meet TJ like they had agreed upon. Cyrus arrives first and sits on a bench whilst he waits. As the warm sun is beaming down, Cyrus begins to overthink things.&nbsp;<i>What if I attempt a handstand and break my arm and then I&rsquo;m unfit to try anything else on my list and the best summer ever is over before it had much of a chance to begin?</i></p>\n<p>&ldquo;You look like you&rsquo;re&nbsp;panicking.&rdquo; TJ purposely sneaks up on Cyrus and it causes him to jump. TJ slides in next to him on the park bench with an amused chuckle.<br></p>\n<p>&ldquo;I&rsquo;m always&nbsp;panicking,&rdquo; Cyrus frowns,&nbsp;&ldquo;and even more so now that you&rsquo;ve scared me.&rdquo; Cyrus adds with a playful shove to TJ&rsquo;s arm.&nbsp;<br></p>\n<p>TJ pretends like it hurt and the two&nbsp;laugh it off.&nbsp;&ldquo;Sorry I&rsquo;m late, I was packing supplies.&rdquo; TJ pulls his backpack onto his lap and pats it gently.</p>\n<p>&ldquo;Supplies?&rdquo; Cyrus knits his brows together.&nbsp;<br></p>\n<p>&ldquo;Well for starters I made a hard copy of the list,&rdquo;&nbsp;TJ wears an excited smile as he unzips his backpack.<br></p>\n<p>&ldquo;I love hard copies of things.&rdquo; Cyrus gleams.</p>\n<p>&ldquo;That way it&rsquo;s rewarding to physically cross something off the list.&rdquo; TJ bops his head.&nbsp;&ldquo;My printer was out of ink so I just wrote them down myself.&rdquo; TJ explains as he hands Cyrus a sheet of paper.&nbsp;</p>\n<p>Cyrus holds the torn page from one of TJ&rsquo;s notebooks like he was just given the most precious gift. TJ had gone to the effort to write out all ninety-seven things from Cyrus&rsquo; list and even decorated the margin with a few doodles.&nbsp;</p>\n",
        "reblog": {
            "comment": "<p><figure data-orig-width=\"938\" data-orig-height=\"658\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4ba9e702d205bace9afcc41f8ea78c80/tumblr_inline_pdzr4iOaE81unll6l_540.png\" alt=\"image\" data-orig-width=\"938\" data-orig-height=\"658\"></figure><p>- <a href=\"http://seriestrash.tumblr.com/post/177814576085/the-list-chapter-one\">1</a> -</p><p><i><b>Summary:</b> It’s summer vacation and TJ and Cyrus fill their days checking things off Cyrus’ list. </i></p><p><a href=\"https://archiveofourown.org/works/16240184/chapters/37966226\">Read on AO3</a><br></p><h2><b>Chapter Two:</b> Park Day</h2><p><b>Word Count:</b> 1651</p><hr><p>Mid morning the following day, Cyrus makes his way over to the park to meet TJ like they had agreed upon. Cyrus arrives first and sits on a bench whilst he waits. As the warm sun is beaming down, Cyrus begins to overthink things. <i>What if I attempt a handstand and break my arm and then I’m unfit to try anything else on my list and the best summer ever is over before it had much of a chance to begin?</i></p><p>“You look like you’re panicking.” TJ purposely sneaks up on Cyrus and it causes him to jump. TJ slides in next to him on the park bench with an amused chuckle.<br></p><p>“I’m always panicking,” Cyrus frowns, “and even more so now that you’ve scared me.” Cyrus adds with a playful shove to TJ’s arm. <br></p><p>TJ pretends like it hurt and the two laugh it off. “Sorry I’m late, I was packing supplies.” TJ pulls his backpack onto his lap and pats it gently.</p><p>“Supplies?” Cyrus knits his brows together. <br></p><p>“Well for starters I made a hard copy of the list,” TJ wears an excited smile as he unzips his backpack.<br></p><p>“I love hard copies of things.” Cyrus gleams.</p><p>“That way it’s rewarding to physically cross something off the list.” TJ bops his head. “My printer was out of ink so I just wrote them down myself.” TJ explains as he hands Cyrus a sheet of paper. </p><p>Cyrus holds the torn page from one of TJ’s notebooks like he was just given the most precious gift. TJ had gone to the effort to write out all ninety-seven things from Cyrus’ list and even decorated the margin with a few doodles. </p>[[MORE]]<p>“I also brought a mat because grass makes me itchy- Well we didn’t actually have a picnic mat at home so it’s a bed sheet but same difference,” TJ shrugs, “Oh and my mom packed us snacks. She says she doesn’t want me spending all my money on junk food over the summer.” <br></p><p>Cyrus doesn’t even try to hide his smile at the effort TJ put into the day. Cyrus thinks about how he spent the morning contemplating bringing his vest - the one he wears to Jonah’s frisbee matches - and how he decided he didn’t want to look dorky so all he packed was sunblock for them both and here TJ was unapologetically unpacking supplies. TJ’s rather adorable planning changes Cyrus’ panicked outlook on the first task - and those that will follow - into one more optimistic. </p><p>“So we going to do this handstand or what?” Cyrus asks. <br></p><p>“Now that’s the right attitude!” TJ jumps up from the bench. <br></p><p>The two pick a spot under the shade of a big tree. TJ lays out the bed sheet he brought and wastes no time showing Cyrus how easy it was to do a handstand. </p><p>“Is there anything you can’t do?” Cyrus coaxes his head to look at TJ whom is holding a handstand. TJ smiles and drops his position. <br></p><p>“I can’t do a cartwheel.” TJ says once he’s sitting. <br></p><p>“But that’s on my list?” Cyrus frowns. <br></p><p>“Guess we’ll both be learning how to do one,” TJ shrugs one shoulder, “Now it’s your turn.” </p><p>Cyrus takes a deep breath and holds his arms up, he takes a step forward as if he was about to try but he stops and looks to TJ, “You might want to move back a little, just in case.” </p><p>TJ wriggles back to the far corner of the sheet and holds his hands together encouragingly as he waits for Cyrus to attempt his handstand. Cyrus takes another breath but further procrastinates by tucking his patterned t-shirt into his pants. </p><p>“Cyrus, Cyrus, Cyrus,” TJ chants quietly. <br></p><p>Finally Cyrus lunges forward but instead of kicking his legs up he just flops forward on his hands and knees. Cyrus lifts his head up and meets TJ’s grimace. </p><p>“Almost,” TJ nods lightly, “Maybe try kicking your legs up this time?” <br></p><p>Cyrus lets out a heavy sigh and tries again and again and again and each time ends with a rather ungraceful flop to the ground. After hurtling himself forward doesn’t work, Cyrus switches to two hands on the ground and light kicks of his legs upwards but it ends up being more of an amusing sight with his legs flailing about. </p><p>“Try kick higher,” TJ encourages, “I’ll catch your legs.” <br></p><p>“I’ll kick you in the face,” Cyrus says in a panic as he holds his downward dog position. <br></p><p>“Try not to do that.” TJ laughs nervously. <br></p><p>Cyrus kicks up off the ground and his legs smack into TJ’s arms as he failed to grab Cyrus. They try this a few times but it proved no such luck. </p><p>“I’m too afraid I’m going to hurt you.” Cyrus shakes his head. “And I can hear children giggling at me and it’s not helping my self-confidence.”<br></p><p>“We’re in a park, Underdog,” TJ laughs, “Hearing children laughing is hardly unusual.” <br></p><p>After another few failed attempts and an entertaining mock yoga lesson from Cyrus, the two decide take a lunch break. TJ practically inhales his food and lays back on the part of the sheet that got direct sunlight. With sunglasses on he enjoys the rays as Cyrus sits in the shade and nibbles on the remainder of his sandwich. </p><p>“So is there anything else on the list that you can’t do?” Cyrus questions. </p><p>“I don’t know about can’t but there are some things I haven’t done, yeah.” TJ  turns his head towards Cyrus. His choice of words weren’t meant to be braggy or overconfident. Cyrus smiles lightly at TJ’s attitude and wished he could feel more like that. </p><p>“There are a few things on the list that didn’t make sense to me,” TJ laughs quietly, “like ‘horses’, what does that even mean?”</p><p>“They’re so big and scary.” Cyrus laughs nervously. </p><p>“So you want to not be afraid of them?” TJ questions, “Or you want to ride one?” </p><p>“Just,<i> horses.</i>” Cyrus shrugs innocently as he had mindlessly added a few things on the list over time. </p><p>“Horses.” TJ laughs and he turns his head to the sky again to enjoy the warmth of the sun. </p><p>Eventually the two stop lounging around and return to their summer task with a new plan of attack.. TJ cautiously stands by and helps Cyrus kick up against the tree for balance. </p><p>“Hey, I did it!” Cyrus is upside down and excited. </p><p>“Now try and kick off gently and hold it.” TJ holds his hands out just in case Cyrus fell. </p><p>Cyrus kicks too hard and topples over. “I’m never going to get this am I?” Cyrus grumbles on the ground. </p><p>“Your list didn’t say anything about being a professional gymnast,” TJ crouches down beside Cyrus, “I think the important thing is that you’re trying.” </p><p>“You didn’t pack a participation ribbon in your supplies did you?” Cyrus jokes and it warrants a chuckle from the basketball captain. </p><p>“Again?” TJ asks softly. </p><p>“Again.” Cyrus matches his tone and the fail montage continues until it’s a success. </p><p>“1..2!..3..!” TJ counts the seconds Cyrus held it for before he rolled forward out of his handstand. <br></p><p>Cyrus throws his hands up victoriously in the air and the two teens celebrate his achievement. </p><p>“You beat your time it took to do a somersault.” TJ highlights. <br></p><p>“At this rate I’m going do a cartwheel on the first try.” Cyrus jokes and to add to the theatrics he actually attempted to do one and amazingly he succeeded. <br></p><p>Once Cyrus is on his feet he looks to TJ shocked at what just occurred, the taller boy also has a look of amazement plastered on his face. </p><p>“Did that just happen?” Cyrus asks in a state of disbelief. <br></p><p>“That was incredible!” TJ affirms in astonishment. <br></p><p>“I can do cartwheels!” Cyrus does three more cartwheels to celebrate.</p><p>“You try!” Cyrus stops once he feels dizzy. <br></p><p>TJ frowns knowing it wasn’t going to be pretty but leaps into a failed attempt anyway. </p><p>“That’s okay,” Cyrus tries to squash his smile at how gawky TJ looked, “We can’t all be professional gymnasts like me.” </p><p>“Okay over achiever, let’s see you climb a tree next.” TJ playfully challenges. <br></p><p>Cyrus scrunches up his nose, “You couldn’t let me be a rockstar for a few more moments?” </p><p>TJ coaxes his head with a smile before approaching the trunk of the tree. TJ crouches down and holds his hand on his knee to help boost Cyrus up. </p><p>“Is this cheating?” Cyrus hovers by TJ. <br></p><p>“You want to jump up on your own?” TJ asks. <br></p><p>Cyrus looks at the lowest branch which was barely reachable even if he stretched up and then he turns back to TJ with a smile as he accepts his offer to boost him up.  </p><p>Once on the lowest branch, Cyrus hugs the tree for support and looks down to TJ with an exaggerated smile, “I did it..” </p><p>“Higher.” TJ says with a devilish smirk. <br></p><p>Cyrus sends him a puppy dog expression but cautiously stands himself up and climbs to a higher branch and eventually up to the point where he couldn’t climb anymore. </p><p>Cyrus looks out through the leaves and admires the wide view scope of the park. His eyes fall on the swings and with a smile he calls down to TJ, “Want to go for a swing before we go home?” </p><p>“I’ll race ya,” TJ calls up excitedly. <br></p><p>“I’m in a tree, that’s not fair!” Cyrus whines as he carefully tries to climb down. <br></p><p>TJ chuckles, waits to help Cyrus down from the tree safely and then he playfully pushes Cyrus and runs towards the swings with a head start. </p><p>“Last one there has to buy the other a milkshake from The Spoon!” TJ calls out as he runs. <br></p><p>“Your mom said she doesn’t want you eating junk food!” Cyrus cries out as he ultimately loses the race. <br></p><p>[<a href=\"http://seriestrash.tumblr.com/post/178055315480/the-list-chapter-three\">Next Chapter</a>]<br></p><hr><p><b>End Notes: </b><i>Chapter Two!! </i>I Hope you’re enjoying the story so far. Chapter one received positive reviews and I genuinely appreciated them all so much! I tried to reply to most but didn’t want to spam everyone with reblogged replies! But please know you mean the world to me!! </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "seriestrash",
                    "active": true,
                    "theme": {
                        "header_full_width": 1318,
                        "header_full_height": 650,
                        "header_focus_width": 1108,
                        "header_focus_height": 623,
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "22,1190,645,82",
                        "header_image": "https://static.tumblr.com/d97fdbefefeb24f418f155ea93df77f2/ipguujx/jU7pknp0w/tumblr_static_9ztpzsw0hdcswk4gocwkwkoo4.png",
                        "header_image_focused": "https://static.tumblr.com/bfea6215e165da99ad77a07c09772f87/ipguujx/pyXpknp0y/tumblr_static_tumblr_static_9ztpzsw0hdcswk4gocwkwkoo4_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/d97fdbefefeb24f418f155ea93df77f2/ipguujx/jU7pknp0w/tumblr_static_9ztpzsw0hdcswk4gocwkwkoo4_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#2b43fe",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Ziclets",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177954769160"
                },
                "content_raw": "<p><figure data-orig-width=\"938\" data-orig-height=\"658\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4ba9e702d205bace9afcc41f8ea78c80/tumblr_inline_pdzr4iOaE81unll6l_540.png\" alt=\"image\" data-orig-width=\"938\" data-orig-height=\"658\"></figure><p>- <a href=\"http://seriestrash.tumblr.com/post/177814576085/the-list-chapter-one\">1</a> -</p><p><i><b>Summary:</b> It’s summer vacation and TJ and Cyrus fill their days checking things off Cyrus’ list. </i></p><p><a href=\"https://archiveofourown.org/works/16240184/chapters/37966226\">Read on AO3</a><br></p><h2><b>Chapter Two:</b> Park Day</h2><p><b>Word Count:</b> 1651</p><hr><p>Mid morning the following day, Cyrus makes his way over to the park to meet TJ like they had agreed upon. Cyrus arrives first and sits on a bench whilst he waits. As the warm sun is beaming down, Cyrus begins to overthink things. <i>What if I attempt a handstand and break my arm and then I’m unfit to try anything else on my list and the best summer ever is over before it had much of a chance to begin?</i></p><p>“You look like you’re panicking.” TJ purposely sneaks up on Cyrus and it causes him to jump. TJ slides in next to him on the park bench with an amused chuckle.<br></p><p>“I’m always panicking,” Cyrus frowns, “and even more so now that you’ve scared me.” Cyrus adds with a playful shove to TJ’s arm. <br></p><p>TJ pretends like it hurt and the two laugh it off. “Sorry I’m late, I was packing supplies.” TJ pulls his backpack onto his lap and pats it gently.</p><p>“Supplies?” Cyrus knits his brows together. <br></p><p>“Well for starters I made a hard copy of the list,” TJ wears an excited smile as he unzips his backpack.<br></p><p>“I love hard copies of things.” Cyrus gleams.</p><p>“That way it’s rewarding to physically cross something off the list.” TJ bops his head. “My printer was out of ink so I just wrote them down myself.” TJ explains as he hands Cyrus a sheet of paper. </p><p>Cyrus holds the torn page from one of TJ’s notebooks like he was just given the most precious gift. TJ had gone to the effort to write out all ninety-seven things from Cyrus’ list and even decorated the margin with a few doodles. </p>[[MORE]]<p>“I also brought a mat because grass makes me itchy- Well we didn’t actually have a picnic mat at home so it’s a bed sheet but same difference,” TJ shrugs, “Oh and my mom packed us snacks. She says she doesn’t want me spending all my money on junk food over the summer.” <br></p><p>Cyrus doesn’t even try to hide his smile at the effort TJ put into the day. Cyrus thinks about how he spent the morning contemplating bringing his vest - the one he wears to Jonah’s frisbee matches - and how he decided he didn’t want to look dorky so all he packed was sunblock for them both and here TJ was unapologetically unpacking supplies. TJ’s rather adorable planning changes Cyrus’ panicked outlook on the first task - and those that will follow - into one more optimistic. </p><p>“So we going to do this handstand or what?” Cyrus asks. <br></p><p>“Now that’s the right attitude!” TJ jumps up from the bench. <br></p><p>The two pick a spot under the shade of a big tree. TJ lays out the bed sheet he brought and wastes no time showing Cyrus how easy it was to do a handstand. </p><p>“Is there anything you can’t do?” Cyrus coaxes his head to look at TJ whom is holding a handstand. TJ smiles and drops his position. <br></p><p>“I can’t do a cartwheel.” TJ says once he’s sitting. <br></p><p>“But that’s on my list?” Cyrus frowns. <br></p><p>“Guess we’ll both be learning how to do one,” TJ shrugs one shoulder, “Now it’s your turn.” </p><p>Cyrus takes a deep breath and holds his arms up, he takes a step forward as if he was about to try but he stops and looks to TJ, “You might want to move back a little, just in case.” </p><p>TJ wriggles back to the far corner of the sheet and holds his hands together encouragingly as he waits for Cyrus to attempt his handstand. Cyrus takes another breath but further procrastinates by tucking his patterned t-shirt into his pants. </p><p>“Cyrus, Cyrus, Cyrus,” TJ chants quietly. <br></p><p>Finally Cyrus lunges forward but instead of kicking his legs up he just flops forward on his hands and knees. Cyrus lifts his head up and meets TJ’s grimace. </p><p>“Almost,” TJ nods lightly, “Maybe try kicking your legs up this time?” <br></p><p>Cyrus lets out a heavy sigh and tries again and again and again and each time ends with a rather ungraceful flop to the ground. After hurtling himself forward doesn’t work, Cyrus switches to two hands on the ground and light kicks of his legs upwards but it ends up being more of an amusing sight with his legs flailing about. </p><p>“Try kick higher,” TJ encourages, “I’ll catch your legs.” <br></p><p>“I’ll kick you in the face,” Cyrus says in a panic as he holds his downward dog position. <br></p><p>“Try not to do that.” TJ laughs nervously. <br></p><p>Cyrus kicks up off the ground and his legs smack into TJ’s arms as he failed to grab Cyrus. They try this a few times but it proved no such luck. </p><p>“I’m too afraid I’m going to hurt you.” Cyrus shakes his head. “And I can hear children giggling at me and it’s not helping my self-confidence.”<br></p><p>“We’re in a park, Underdog,” TJ laughs, “Hearing children laughing is hardly unusual.” <br></p><p>After another few failed attempts and an entertaining mock yoga lesson from Cyrus, the two decide take a lunch break. TJ practically inhales his food and lays back on the part of the sheet that got direct sunlight. With sunglasses on he enjoys the rays as Cyrus sits in the shade and nibbles on the remainder of his sandwich. </p><p>“So is there anything else on the list that you can’t do?” Cyrus questions. </p><p>“I don’t know about can’t but there are some things I haven’t done, yeah.” TJ  turns his head towards Cyrus. His choice of words weren’t meant to be braggy or overconfident. Cyrus smiles lightly at TJ’s attitude and wished he could feel more like that. </p><p>“There are a few things on the list that didn’t make sense to me,” TJ laughs quietly, “like ‘horses’, what does that even mean?”</p><p>“They’re so big and scary.” Cyrus laughs nervously. </p><p>“So you want to not be afraid of them?” TJ questions, “Or you want to ride one?” </p><p>“Just,<i> horses.</i>” Cyrus shrugs innocently as he had mindlessly added a few things on the list over time. </p><p>“Horses.” TJ laughs and he turns his head to the sky again to enjoy the warmth of the sun. </p><p>Eventually the two stop lounging around and return to their summer task with a new plan of attack.. TJ cautiously stands by and helps Cyrus kick up against the tree for balance. </p><p>“Hey, I did it!” Cyrus is upside down and excited. </p><p>“Now try and kick off gently and hold it.” TJ holds his hands out just in case Cyrus fell. </p><p>Cyrus kicks too hard and topples over. “I’m never going to get this am I?” Cyrus grumbles on the ground. </p><p>“Your list didn’t say anything about being a professional gymnast,” TJ crouches down beside Cyrus, “I think the important thing is that you’re trying.” </p><p>“You didn’t pack a participation ribbon in your supplies did you?” Cyrus jokes and it warrants a chuckle from the basketball captain. </p><p>“Again?” TJ asks softly. </p><p>“Again.” Cyrus matches his tone and the fail montage continues until it’s a success. </p><p>“1..2!..3..!” TJ counts the seconds Cyrus held it for before he rolled forward out of his handstand. <br></p><p>Cyrus throws his hands up victoriously in the air and the two teens celebrate his achievement. </p><p>“You beat your time it took to do a somersault.” TJ highlights. <br></p><p>“At this rate I’m going do a cartwheel on the first try.” Cyrus jokes and to add to the theatrics he actually attempted to do one and amazingly he succeeded. <br></p><p>Once Cyrus is on his feet he looks to TJ shocked at what just occurred, the taller boy also has a look of amazement plastered on his face. </p><p>“Did that just happen?” Cyrus asks in a state of disbelief. <br></p><p>“That was incredible!” TJ affirms in astonishment. <br></p><p>“I can do cartwheels!” Cyrus does three more cartwheels to celebrate.</p><p>“You try!” Cyrus stops once he feels dizzy. <br></p><p>TJ frowns knowing it wasn’t going to be pretty but leaps into a failed attempt anyway. </p><p>“That’s okay,” Cyrus tries to squash his smile at how gawky TJ looked, “We can’t all be professional gymnasts like me.” </p><p>“Okay over achiever, let’s see you climb a tree next.” TJ playfully challenges. <br></p><p>Cyrus scrunches up his nose, “You couldn’t let me be a rockstar for a few more moments?” </p><p>TJ coaxes his head with a smile before approaching the trunk of the tree. TJ crouches down and holds his hand on his knee to help boost Cyrus up. </p><p>“Is this cheating?” Cyrus hovers by TJ. <br></p><p>“You want to jump up on your own?” TJ asks. <br></p><p>Cyrus looks at the lowest branch which was barely reachable even if he stretched up and then he turns back to TJ with a smile as he accepts his offer to boost him up.  </p><p>Once on the lowest branch, Cyrus hugs the tree for support and looks down to TJ with an exaggerated smile, “I did it..” </p><p>“Higher.” TJ says with a devilish smirk. <br></p><p>Cyrus sends him a puppy dog expression but cautiously stands himself up and climbs to a higher branch and eventually up to the point where he couldn’t climb anymore. </p><p>Cyrus looks out through the leaves and admires the wide view scope of the park. His eyes fall on the swings and with a smile he calls down to TJ, “Want to go for a swing before we go home?” </p><p>“I’ll race ya,” TJ calls up excitedly. <br></p><p>“I’m in a tree, that’s not fair!” Cyrus whines as he carefully tries to climb down. <br></p><p>TJ chuckles, waits to help Cyrus down from the tree safely and then he playfully pushes Cyrus and runs towards the swings with a head start. </p><p>“Last one there has to buy the other a milkshake from The Spoon!” TJ calls out as he runs. <br></p><p>“Your mom said she doesn’t want you eating junk food!” Cyrus cries out as he ultimately loses the race. <br></p><p>[<a href=\"http://seriestrash.tumblr.com/post/178055315480/the-list-chapter-three\">Next Chapter</a>]<br></p><hr><p><b>End Notes: </b><i>Chapter Two!! </i>I Hope you’re enjoying the story so far. Chapter one received positive reviews and I genuinely appreciated them all so much! I tried to reply to most but didn’t want to spam everyone with reblogged replies! But please know you mean the world to me!! </p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4ba9e702d205bace9afcc41f8ea78c80/tumblr_inline_pdzr4iOaE81unll6l_540.png\" class=\"\"/></figure><p>- <a href=\"http://seriestrash.tumblr.com/post/177814576085/the-list-chapter-one\">1</a> -</p><p><i><b>Summary:</b> It&rsquo;s summer vacation and TJ and Cyrus fill their days checking things off Cyrus&rsquo; list.&nbsp;</i></p><p><a href=\"https://archiveofourown.org/works/16240184/chapters/37966226\">Read on AO3</a><br /></p><h2><b>Chapter Two:</b> Park Day</h2><p><b>Word Count:</b> 1651</p><hr /><p>Mid morning the following day, Cyrus makes his way over to the park to meet TJ like they had agreed upon. Cyrus arrives first and sits on a bench whilst he waits. As the warm sun is beaming down, Cyrus begins to overthink things.&nbsp;<i>What if I attempt a handstand and break my arm and then I&rsquo;m unfit to try anything else on my list and the best summer ever is over before it had much of a chance to begin?</i></p><p>&ldquo;You look like you&rsquo;re&nbsp;panicking.&rdquo; TJ purposely sneaks up on Cyrus and it causes him to jump. TJ slides in next to him on the park bench with an amused chuckle.<br /></p><p>&ldquo;I&rsquo;m always&nbsp;panicking,&rdquo; Cyrus frowns,&nbsp;&ldquo;and even more so now that you&rsquo;ve scared me.&rdquo; Cyrus adds with a playful shove to TJ&rsquo;s arm.&nbsp;<br /></p><p>TJ pretends like it hurt and the two&nbsp;laugh it off.&nbsp;&ldquo;Sorry I&rsquo;m late, I was packing supplies.&rdquo; TJ pulls his backpack onto his lap and pats it gently.</p><p>&ldquo;Supplies?&rdquo; Cyrus knits his brows together.&nbsp;<br /></p><p>&ldquo;Well for starters I made a hard copy of the list,&rdquo;&nbsp;TJ wears an excited smile as he unzips his backpack.<br /></p><p>&ldquo;I love hard copies of things.&rdquo; Cyrus gleams.</p><p>&ldquo;That way it&rsquo;s rewarding to physically cross something off the list.&rdquo; TJ bops his head.&nbsp;&ldquo;My printer was out of ink so I just wrote them down myself.&rdquo; TJ explains as he hands Cyrus a sheet of paper.&nbsp;</p><p>Cyrus holds the torn page from one of TJ&rsquo;s notebooks like he was just given the most precious gift. TJ had gone to the effort to write out all ninety-seven things from Cyrus&rsquo; list and even decorated the margin with a few doodles.&nbsp;</p><p>&ldquo;I also brought a mat because grass makes me itchy- Well we didn&rsquo;t actually have a picnic mat at home so it&rsquo;s a bed sheet but same difference,&rdquo; TJ shrugs,&nbsp;&ldquo;Oh and my mom packed us snacks. She says she doesn&rsquo;t want me spending all my money on junk food over the summer.&rdquo;&nbsp;<br /></p><p>Cyrus doesn&rsquo;t even try to hide his smile at the effort TJ put into the day. Cyrus thinks about how he spent the morning contemplating bringing his vest - the one he wears to Jonah&rsquo;s frisbee matches -&nbsp;and how he decided he didn&rsquo;t want to look dorky so all he packed was sunblock for them both and here TJ was unapologetically unpacking supplies.&nbsp;TJ&rsquo;s rather adorable planning changes Cyrus&rsquo; panicked outlook on the first task - and those that will follow - into one more optimistic.&nbsp;</p><p>&ldquo;So we going to do this handstand or what?&rdquo; Cyrus asks.&nbsp;<br /></p><p>&ldquo;Now that&rsquo;s the right attitude!&rdquo; TJ jumps up from the bench.&nbsp;<br /></p><p>The two pick a spot under the shade of a big tree. TJ lays out the bed sheet he brought and wastes no time showing Cyrus how easy it was to do a handstand.&nbsp;</p><p>&ldquo;Is there anything you can&rsquo;t do?&rdquo; Cyrus coaxes his head to look at TJ whom is holding a handstand. TJ smiles and drops his position.&nbsp;<br /></p><p>&ldquo;I can&rsquo;t do a cartwheel.&rdquo; TJ says once he&rsquo;s sitting.&nbsp;<br /></p><p>&ldquo;But that&rsquo;s on my list?&rdquo; Cyrus frowns.&nbsp;<br /></p><p>&ldquo;Guess we&rsquo;ll both be learning how to do one,&rdquo; TJ shrugs one shoulder,&nbsp;&ldquo;Now it&rsquo;s your turn.&rdquo;&nbsp;</p><p>Cyrus takes a deep breath and holds his arms up, he takes a step forward as if he was about to try but he stops and looks to TJ,&nbsp;&ldquo;You might want to move back a little, just in case.&rdquo;&nbsp;</p><p>TJ wriggles back to the far corner of the sheet and holds his hands together encouragingly as he waits for Cyrus to attempt his handstand.&nbsp;Cyrus takes another breath but further procrastinates by tucking his patterned t-shirt into his pants.&nbsp;</p><p>&ldquo;Cyrus, Cyrus, Cyrus,&rdquo; TJ chants quietly.&nbsp;<br /></p><p>Finally Cyrus lunges forward but instead of kicking his legs up he just flops forward on his hands and knees. Cyrus lifts his head up and meets TJ&rsquo;s grimace.&nbsp;</p><p>&ldquo;Almost,&rdquo; TJ nods lightly,&nbsp;&ldquo;Maybe try kicking your legs up this time?&rdquo;&nbsp;<br /></p><p>Cyrus lets out a heavy sigh and tries again and again and again and each time ends with a rather ungraceful flop to the ground. After hurtling himself forward doesn&rsquo;t work, Cyrus switches to two hands on the ground and light kicks of his legs upwards but it ends up being more of an amusing sight with his legs flailing about.&nbsp;</p><p>&ldquo;Try kick higher,&rdquo; TJ encourages,&nbsp;&ldquo;I&rsquo;ll catch your legs.&rdquo;&nbsp;<br /></p><p>&ldquo;I&rsquo;ll kick you in the face,&rdquo; Cyrus says in a panic as he holds his downward dog position.&nbsp;<br /></p><p>&ldquo;Try not to do that.&rdquo; TJ laughs nervously.&nbsp;<br /></p><p>Cyrus kicks up off the ground and his legs smack into TJ&rsquo;s arms as he failed to grab Cyrus. They try this a few times but it proved no such luck.&nbsp;</p><p>&ldquo;I&rsquo;m too afraid I&rsquo;m going to hurt you.&rdquo; Cyrus shakes his head.&nbsp;&ldquo;And I can hear children giggling at me and it&rsquo;s not helping my self-confidence.&rdquo;<br /></p><p>&ldquo;We&rsquo;re in a park, Underdog,&rdquo; TJ laughs,&nbsp;&ldquo;Hearing children laughing is hardly unusual.&rdquo;&nbsp;<br /></p><p>After another few failed attempts and an entertaining mock yoga lesson from Cyrus, the two decide take a lunch break. TJ practically inhales his food and lays back on the part of the sheet that got direct sunlight. With sunglasses on he enjoys the rays as Cyrus sits in the shade and nibbles on the remainder of his sandwich. </p><p>&ldquo;So is there anything else on the list that you can&rsquo;t do?&rdquo; Cyrus questions. </p><p>&ldquo;I don&rsquo;t know about can&rsquo;t but there are some things I haven&rsquo;t done, yeah.&rdquo; TJ &nbsp;turns his head towards Cyrus. His choice of words weren&rsquo;t meant to be braggy or overconfident. Cyrus smiles lightly at TJ&rsquo;s attitude and wished he could feel more like that.&nbsp;</p><p>&ldquo;There are a few things on the list that didn&rsquo;t make sense to me,&rdquo; TJ laughs quietly,&nbsp;&ldquo;like &lsquo;horses&rsquo;, what does that even mean?&rdquo;</p><p>&ldquo;They&rsquo;re so big and scary.&rdquo; Cyrus laughs nervously. </p><p>&ldquo;So you want to not be afraid of them?&rdquo; TJ questions, &ldquo;Or you want to ride one?&rdquo; </p><p>&ldquo;Just,<i> horses.</i>&rdquo; Cyrus shrugs innocently as he had mindlessly added a few things on the list over time. </p><p>&ldquo;Horses.&rdquo; TJ laughs and he turns his head to the sky again to enjoy the warmth of the sun. </p><p>Eventually the two stop lounging around and return to their summer task with a new plan of attack.. TJ cautiously stands by and helps Cyrus kick up against the tree for balance. </p><p>&ldquo;Hey, I did it!&rdquo; Cyrus is upside down and excited. </p><p>&ldquo;Now try and kick off gently and hold it.&rdquo; TJ holds his hands out just in case Cyrus fell. </p><p>Cyrus kicks too hard and topples over. &ldquo;I&rsquo;m never going to get this am I?&rdquo; Cyrus grumbles on the ground. </p><p>&ldquo;Your list didn&rsquo;t say anything about being a professional gymnast,&rdquo; TJ crouches down beside Cyrus, &ldquo;I think the important thing is that you&rsquo;re trying.&rdquo; </p><p>&ldquo;You didn&rsquo;t pack a participation ribbon in your supplies did you?&rdquo; Cyrus jokes and it warrants a chuckle from the basketball captain. </p><p>&ldquo;Again?&rdquo; TJ asks softly. </p><p>&ldquo;Again.&rdquo; Cyrus matches his tone and the fail montage continues until it&rsquo;s a success. </p><p>&ldquo;1..2!..3..!&rdquo; TJ counts the seconds Cyrus held it for before he rolled forward out of his handstand. <br /></p><p>Cyrus throws his hands up victoriously in the air and the two teens celebrate his achievement.&nbsp;</p><p>&ldquo;You beat your time it took to do a somersault.&rdquo; TJ highlights.&nbsp;<br /></p><p>&ldquo;At this rate I&rsquo;m going do a cartwheel on the first try.&rdquo; Cyrus jokes and to add to the theatrics he actually attempted to do one and amazingly he succeeded.&nbsp;<br /></p><p>Once Cyrus is on his feet he looks to TJ shocked at what just occurred, the taller boy also has a look of amazement plastered on his face.&nbsp;</p><p>&ldquo;Did that just happen?&rdquo; Cyrus asks in a state of disbelief.&nbsp;<br /></p><p>&ldquo;That was incredible!&rdquo; TJ affirms in astonishment.&nbsp;<br /></p><p>&ldquo;I can do cartwheels!&rdquo;&nbsp;Cyrus does three more cartwheels to celebrate.</p><p>&ldquo;You try!&rdquo; Cyrus stops once he feels dizzy.&nbsp;<br /></p><p>TJ frowns knowing it wasn&rsquo;t going to be pretty but leaps into a failed attempt anyway.&nbsp;</p><p>&ldquo;That&rsquo;s okay,&rdquo; Cyrus tries to squash his smile at how gawky TJ looked,&nbsp;&ldquo;We can&rsquo;t all be professional gymnasts like me.&rdquo;&nbsp;</p><p>&ldquo;Okay over achiever, let&rsquo;s see you climb a tree next.&rdquo; TJ playfully challenges.&nbsp;<br /></p><p>Cyrus scrunches up his nose,&nbsp;&ldquo;You couldn&rsquo;t let me be a rockstar for a few more moments?&rdquo;&nbsp;</p><p>TJ coaxes his head with a smile before approaching the trunk of the tree. TJ crouches down and holds his hand on his knee to help boost Cyrus up.&nbsp;</p><p>&ldquo;Is this cheating?&rdquo; Cyrus hovers by TJ.&nbsp;<br /></p><p>&ldquo;You want to jump up on your own?&rdquo; TJ asks.&nbsp;<br /></p><p>Cyrus looks at the lowest branch which was barely reachable even if he stretched up and then he turns back to TJ with a smile as he accepts his offer to boost him up. &nbsp;</p><p>Once on the lowest branch, Cyrus hugs the tree for support and looks down to TJ with an exaggerated smile,&nbsp;&ldquo;I did it..&rdquo;&nbsp;</p><p>&ldquo;Higher.&rdquo; TJ says with a devilish smirk.&nbsp;<br /></p><p>Cyrus sends him a puppy dog expression but cautiously stands himself up and climbs to a higher branch and eventually up to the point where he couldn&rsquo;t climb anymore.&nbsp;</p><p>Cyrus looks out through the leaves and admires the wide view scope of the park. His eyes fall on the swings and with a smile he calls down to TJ,&nbsp;&ldquo;Want to go for a swing before we go home?&rdquo;&nbsp;</p><p>&ldquo;I&rsquo;ll race ya,&rdquo; TJ calls up excitedly.&nbsp;<br /></p><p>&ldquo;I&rsquo;m in a tree, that&rsquo;s not fair!&rdquo; Cyrus whines as he carefully tries to climb down.&nbsp;<br /></p><p>TJ chuckles, waits to help Cyrus down from the tree safely and then he playfully pushes Cyrus and runs towards the swings with a head start.&nbsp;</p><p>&ldquo;Last one there has to buy the other a milkshake from The Spoon!&rdquo; TJ calls out as he runs.&nbsp;<br /></p><p>&ldquo;Your mom said she&nbsp;doesn&rsquo;t want you eating junk food!&rdquo; Cyrus cries out as he ultimately loses the race.&nbsp;<br /></p><p>[<a href=\"http://seriestrash.tumblr.com/post/178055315480/the-list-chapter-three\">Next Chapter</a>]<br /></p><hr /><p><b>End Notes: </b><i>Chapter Two!! </i>I Hope you&rsquo;re enjoying the story so far. Chapter one received positive reviews and I genuinely appreciated them all so much! I tried to reply to most but didn&rsquo;t want to spam everyone with reblogged replies! But please know you mean the world to me!!&nbsp;</p></p>",
                "content_abstract": "<p>\n<figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4ba9e702d205bace9afcc41f8ea78c80/tumblr_inline_pdzr4iOaE81unll6l_540.png\" class=\"\"/></figure>\n<p>- <a href=\"http://seriestrash.tumblr.com/post/177814576085/the-list-chapter-one\">1</a> -</p>\n<p><i><b>Summary:</b> It&rsquo;s summer vacation and TJ and Cyrus fill their days checking things off Cyrus&rsquo; list.&nbsp;</i></p>\n<p><a href=\"https://archiveofourown.org/works/16240184/chapters/37966226\">Read on AO3</a><br /></p>\n<h2>\n<b>Chapter Two:</b> Park Day</h2>\n<p><b>Word Count:</b> 1651</p>\n<hr />\n<p>Mid morning the following day, Cyrus makes his way over to the park to meet TJ like they had agreed upon. Cyrus arrives first and sits on a bench whilst he waits. As the warm sun is beaming down, Cyrus begins to overthink things.&nbsp;<i>What if I attempt a handstand and break my arm and then I&rsquo;m unfit to try anything else on my list and the best summer ever is over before it had much of a chance to begin?</i></p>\n<p>&ldquo;You look like you&rsquo;re&nbsp;panicking.&rdquo; TJ purposely sneaks up on Cyrus and it causes him to jump. TJ slides in next to him on the park bench with an amused chuckle.<br /></p>\n<p>&ldquo;I&rsquo;m always&nbsp;panicking,&rdquo; Cyrus frowns,&nbsp;&ldquo;and even more so now that you&rsquo;ve scared me.&rdquo; Cyrus adds with a playful shove to TJ&rsquo;s arm.&nbsp;<br /></p>\n<p>TJ pretends like it hurt and the two&nbsp;laugh it off.&nbsp;&ldquo;Sorry I&rsquo;m late, I was packing supplies.&rdquo; TJ pulls his backpack onto his lap and pats it gently.</p>\n<p>&ldquo;Supplies?&rdquo; Cyrus knits his brows together.&nbsp;<br /></p>\n<p>&ldquo;Well for starters I made a hard copy of the list,&rdquo;&nbsp;TJ wears an excited smile as he unzips his backpack.<br /></p>\n<p>&ldquo;I love hard copies of things.&rdquo; Cyrus gleams.</p>\n<p>&ldquo;That way it&rsquo;s rewarding to physically cross something off the list.&rdquo; TJ bops his head.&nbsp;&ldquo;My printer was out of ink so I just wrote them down myself.&rdquo; TJ explains as he hands Cyrus a sheet of paper.&nbsp;</p>\n<p>Cyrus holds the torn page from one of TJ&rsquo;s notebooks like he was just given the most precious gift. TJ had gone to the effort to write out all ninety-seven things from Cyrus&rsquo; list and even decorated the margin with a few doodles.&nbsp;</p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "scarybasketballguy",
        "blog": {
            "name": "scarybasketballguy",
            "title": "vanessa vanjie isabella motherfucking mateo hytes",
            "description": "Paz, SHE/HER, that one girl who started her blog because she watched a ton of andi mack, brooke lynn hytes and vanessa vanjie mateo stan",
            "url": "https://scarybasketballguy.tumblr.com/",
            "uuid": "t:7gvxflsIJ1eu23GW4yGQDQ",
            "updated": 1561668948
        },
        "id": 177954540934,
        "post_url": "https://scarybasketballguy.tumblr.com/post/177954540934/hey-quick-question-why-is-tj-wearing-the-same",
        "slug": "hey-quick-question-why-is-tj-wearing-the-same",
        "date": "2018-09-10 22:41:50 GMT",
        "timestamp": 1536619310,
        "state": "published",
        "format": "html",
        "reblog_key": "MaQMy3Rx",
        "tags": [
            "andi mack",
            "tj kippen",
            "wardrobe",
            "tyrus"
        ],
        "short_url": "https://tmblr.co/ZU_z-Y2bkwis6",
        "summary": "hey  quick question why is tj wearing the same hoodie and a very similar coat both in ep 21 and ep 26? just wondering",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 99,
        "title": null,
        "body": "<p>hey </p><p>quick question</p><p>why is tj wearing the same hoodie and a very similar coat both in ep 21 and ep 26?</p><p>just wondering</p>",
        "reblog": {
            "comment": "<p>hey </p><p>quick question</p><p>why is tj wearing the same hoodie and a very similar coat both in ep 21 and ep 26?</p><p>just wondering</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "scarybasketballguy",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#d11e9e",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/6dbb0a76d48a23237564f1a2addaa8b2/rcywryi/OWbpsl7z1/tumblr_static_wo2fw3fvgm8k04sw8s4ckosg.gif",
                        "header_image_focused": "https://static.tumblr.com/6dbb0a76d48a23237564f1a2addaa8b2/rcywryi/OWbpsl7z1/tumblr_static_wo2fw3fvgm8k04sw8s4ckosg_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/6dbb0a76d48a23237564f1a2addaa8b2/rcywryi/OWbpsl7z1/tumblr_static_wo2fw3fvgm8k04sw8s4ckosg_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#dcecf5",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177954540934"
                },
                "content_raw": "<p>hey </p><p>quick question</p><p>why is tj wearing the same hoodie and a very similar coat both in ep 21 and ep 26?</p><p>just wondering</p>",
                "content": "<p>hey&nbsp;</p><p>quick question</p><p>why is tj wearing the same hoodie and a very similar coat both in ep 21 and ep 26?</p><p>just wondering</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "chat",
        "blog_name": "scarybasketballguy",
        "blog": {
            "name": "scarybasketballguy",
            "title": "vanessa vanjie isabella motherfucking mateo hytes",
            "description": "Paz, SHE/HER, that one girl who started her blog because she watched a ton of andi mack, brooke lynn hytes and vanessa vanjie mateo stan",
            "url": "https://scarybasketballguy.tumblr.com/",
            "uuid": "t:7gvxflsIJ1eu23GW4yGQDQ",
            "updated": 1561668948
        },
        "id": 177954066309,
        "post_url": "https://scarybasketballguy.tumblr.com/post/177954066309/tj-and-cyrus-texting-cyrus-gay-tj",
        "slug": "tj-and-cyrus-texting-cyrus-gay-tj",
        "date": "2018-09-10 22:25:24 GMT",
        "timestamp": 1536618324,
        "state": "published",
        "format": "html",
        "reblog_key": "rghEgD67",
        "tags": [
            "andi mack incorrect quotes",
            "andi mack",
            "tyrus",
            "homosexuality",
            "cyrus goodman",
            "tj kippen"
        ],
        "short_url": "https://tmblr.co/ZU_z-Y2bkuu_5",
        "summary": "Tj and Cyrus texting.\nCyrus: Gay!!!\nTj: What?\nCyrus: I meant yay, but it's never a bad time to praise homosexuality",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 371,
        "title": null,
        "body": "Tj and Cyrus texting.\nCyrus: Gay!!!\nTj: What?\nCyrus: I meant yay, but it's never a bad time to praise homosexuality",
        "dialogue": [
            {
                "name": "",
                "label": "",
                "phrase": "Tj and Cyrus texting."
            },
            {
                "name": "Cyrus",
                "label": "Cyrus:",
                "phrase": "Gay!!!"
            },
            {
                "name": "Tj",
                "label": "Tj:",
                "phrase": "What?"
            },
            {
                "name": "Cyrus",
                "label": "Cyrus:",
                "phrase": "I meant yay, but it's never a bad time to praise homosexuality"
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "video",
        "blog_name": "kittysrllygreetart",
        "blog": {
            "name": "kittysrllygreetart",
            "title": "ok…epic",
            "description": "<p>fatima, she/her, my interests change every 5 months</p>",
            "url": "https://kittysrllygreetart.tumblr.com/",
            "uuid": "t:VPHmJmEoq92a34XjO_Wt6g",
            "updated": 1561661211
        },
        "id": 177953719866,
        "post_url": "https://kittysrllygreetart.tumblr.com/post/177953719866/call-me-a-weeaboo-but-this-is-a-jyrus-angst-song",
        "slug": "call-me-a-weeaboo-but-this-is-a-jyrus-angst-song",
        "date": "2018-09-10 22:13:21 GMT",
        "timestamp": 1536617601,
        "state": "published",
        "format": "html",
        "reblog_key": "1vYUoqEB",
        "tags": [
            "its kinda more of a song about",
            "cyrus' feelings towards jonah",
            "and that whole shit",
            "bUT IM STILL COUNTING IT",
            "andi mack",
            "jyrus",
            "jyrus month 2018"
        ],
        "short_url": "https://tmblr.co/Z_iV8e2bktaOw",
        "summary": "CALL ME A WEEABOO but this is a jyrus angst song. so this is my entry for jyrus month 😔👏",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 10,
        "caption": "<p>CALL ME A WEEABOO but this is a jyrus angst song. so this is my entry for jyrus month 😔👏</p>",
        "reblog": {
            "comment": "<p>CALL ME A WEEABOO but this is a jyrus angst song. so this is my entry for jyrus month 😔👏</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "kittysrllygreetart",
                    "active": true,
                    "theme": {
                        "header_full_width": 1136,
                        "header_full_height": 640,
                        "header_focus_width": 836,
                        "header_focus_height": 470,
                        "avatar_shape": "square",
                        "background_color": "#6581AC",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "85,987,555,151",
                        "header_image": "https://static.tumblr.com/a8b8d7dbcc67bdce01505f9adf3373aa/s1gs7rm/YYRp05pvk/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/a8b8d7dbcc67bdce01505f9adf3373aa/s1gs7rm/aY6p05pvm/tumblr_static_tumblr_static__focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/a8b8d7dbcc67bdce01505f9adf3373aa/s1gs7rm/YYRp05pvk/tumblr_static__2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#FFFEE0",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#110B17",
                        "title_font": "Arquitecta",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177953719866"
                },
                "content_raw": "<p>CALL ME A WEEABOO but this is a jyrus angst song. so this is my entry for jyrus month 😔👏</p>",
                "content": "<p>CALL ME A WEEABOO but this is a jyrus angst song. so this is my entry for jyrus month &#128532;&#128079;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "html5_capable": false,
        "player": [
            {
                "width": 250,
                "embed_code": false
            },
            {
                "width": 400,
                "embed_code": false
            },
            {
                "width": 500,
                "embed_code": false
            }
        ],
        "video_type": "youtube",
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "lgbtyrus",
        "blog": {
            "name": "lgbtyrus",
            "title": "andi is babie",
            "description": "I'm Star and this is my Andi Mack Blog | I write fics | Ao3 and FFN: staristired | Follows + Replies from: @webarebares |",
            "url": "https://lgbtyrus.tumblr.com/",
            "uuid": "t:PfHbqpFYFeRhEQqx4XQUrA",
            "updated": 1561710230
        },
        "id": 177953608709,
        "post_url": "https://lgbtyrus.tumblr.com/post/177953608709/tjs-playlist-chapter-5",
        "slug": "tjs-playlist-chapter-5",
        "date": "2018-09-10 22:09:26 GMT",
        "timestamp": 1536617366,
        "state": "published",
        "format": "html",
        "reblog_key": "yHYMKQmI",
        "tags": [
            "stars writing",
            "andi mack",
            "tyrus",
            "tj kippen",
            "cyrus goodman",
            "tjs playlist"
        ],
        "short_url": "https://tmblr.co/ZcDxqY2bkt9G5",
        "summary": "TJ’s Playlist Chapter 5",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 141,
        "title": "TJ’s Playlist Chapter 5",
        "body": "<p><b>Story Summary:</b> When Cyrus finds a playlist on TJ’s desktop full of old love songs, he realizes that TJ has never been a scary basketball guy but rather a huge sap. TJ just wished Cyrus could realize that all of those songs remind him of a certain boy who likes chocolate chocolate chip muffins without telling him directly.</p><p>With insecurities and fears almost set in stone, it’s hard for TJ to admit that he has a heart aching crush on Cyrus who is trying to avoid just that. Of course, it doesn’t seem like both of them are trying to get over each other when they’re always together.</p><p><b><a href=\"https://archiveofourown.org/works/15801564/chapters/37213079\">Ao3 Link</a> | <a href=\"https://lgbtyrus.tumblr.com/post/177417182754/tjs-playlist-chapter-1\">Chapter 1 Link </a>| <a href=\"https://lgbtyrus.tumblr.com/post/177784471299/tjs-playlist-chapter-4\">Previous Chapter</a> | <a href=\"https://lgbtyrus.tumblr.com/post/178153409194/tjs-playlist-chapter-6\">Next Chapter</a> |</b></p><p><b>Words:</b> 3264</p><!-- more --><p>“Do you like TJ? Like, in more than friends?” Buffy asked\nhim.</p><p><i>Anything but that.</i></p><p>“Does that really matter right now?” Cyrus tried to jump\naround the question. It was a mistake, and he automatically knew it. </p><p>“So you do?” Buffy almost whispered. Cyrus felt himself turn\nred, and it was an unpleasant feeling that went to his stomach. He really\ndidn’t want to talk about it to anyone at all. It had taken forever for him to\nopen up about Jonah, and he certainly didn’t want to rush himself into\nadmitting something that could turn out to be something as simple as\nappreciation. </p><p>“No, Buffy,” Cyrus managed to say, “I don’t. But even if I\ndid, that shouldn’t be important.”</p><p>“Well,” he heard Buffy hesitate, “it’s important to me. It\nchanges a lot.” <i>Change the topic. Change\nthe topic. Change the topic.</i></p><p>“Are we talking right now or tomorrow morning? I don’t want\nto go to bed fighting with you.”</p><p>“We’re not fighting,” Buffy’s voice got louder. </p><p>“Well it sounds like we’re starting to,” Cyrus replied, his\ntone matching Buffy’s. </p><p>“Well, then,” Buffy stopped for a few seconds, “what do you\nwant to talk about?” </p><p>Cyrus plunged right at it and asked her, “Do you not like TJ\nand me hanging out? You guys were cool. He hasn’t changed. If he has, he’s\ngotten a lot better, not worse.”</p><p>“Answer my first question,” Buffy brought it up again,\nmaking Cyrus rub his face in frustration. </p><p><i>Why is she suddenly\nthinking about things like this? I don’t even want to think about things like this!</i></p><p>“There should be absolutely no correlation between why\nyou’ve gone from being on ‘we’re cool’ terms to ‘I hate you again.’ Please stop\nasking me that question,” Cyrus groaned. </p><p>“Well if you answered it, I wouldn’t have to ask it again.”</p><p>“You’re being really rude, Buffy. Maybe we should just talk\ntomorrow morning.”</p><p>“No!” Buffy suddenly shouted. She stayed silent for a\nfraction of a moment and then continued to speak in her regular voice, “Look,\nCyrus. Please just answer that question. It’ll help me sort out my feelings.”</p><p>“What about <i>my</i>\nfeelings?” Cyrus found himself asking. He knew he sounded like he was on the\nverge of crying. “You think it’s not upsetting to see you get worked up over\nsomething as small as me helping TJ with math. You’ve done it before. You know\nhe needs help.” Buffy didn’t answer, so Cyrus asked her, “What difference will\nit make if I have a crush on TJ?”</p><p>“A lot, actually,” Buffy replied. “If you do, it means he’ll\nbe your boyfriend and you’re going to pick him over us most of the time.” Cyrus\nfelt that if he wanted to, he could’ve cried.</p><p>“We,” Cyrus took a deep breath, sitting down at the edge of\nhis bed, “we never told Andi stuff like this.”</p><p>“Yeah but we were cool with Jonah,” Buffy tried to defend\nher stance. Cyrus knew he had her cornered, though. She didn’t sound so sure of\nherself.</p><p>“Well, you’re supposed to be cool with TJ. He rapped for\nyou!” Cyrus reminded her. “You guys were cool all summer. Nothing should have\nhad changed, Buffy.”</p><p>“Cyrus,” Buffy’s voice was the one shaking now, worrying\nCyrus. “If you like him and he liked you back, I’m so scared he’s going to hurt\nyou. He’s still not an angel, you know that, right?”</p><p>“Well, one,” Cyrus grumbled, in disbelief that he had to say\nthese things, “he’s nice to us and especially to me. Two,” Cyrus’ voice was\nraised now as he said, “he’s the biggest heterosexual in Shadyside! Do you\nthink I want to hurt myself like that again?” Buffy stayed quiet. Cyrus lowered\nhis voice, looking over to make sure his door was shut, “I’m over Jonah. I’ve\nbeen. But it still hurt seeing him with Andi when I liked him. At the end of\nthe day, I can’t catch feelings for TJ because I’ll hurt myself, and I’ll\nprobably lose the good friendship we have. But let’s face it, Buffy. It’s you I\nhave to worry about losing right now.”</p><p>“Cyrus…”</p><p>“I’m not going to stop being friends with TJ. He needs me\nright now, and I’m going to be there. I want you to be there, too. I want Jonah\nand Andi to be there. If we could get a little less hair gel on him, maybe he\ncould even be part of the Good Hair Crew,” Cyrus tried to add in some humor. He\nknew it had worked when he heard Buffy chuckle. “Please, Buffy. If you’re just\nworried that I’m going to, I don’t know, fall in love with TJ and he’s going to\nhurt me, let it go. Please. I’m starting to believe TJ wouldn’t even hurt a\nfly. He has a cat named Macaroni for goodness sake!”</p><p>“Alright,” Buffy sighed. “I’m being dramatic.” Cyrus was a\nlittle taken aback. He couldn’t believe Buffy was admitting she was wrong, but\nhe wasn’t going to rub that in.</p><p>“Yeah, you are,” Cyrus simply agreed. “I’d never chose my\nfuture boyfriend over you guys anyways. You know that, right?”</p><p>“Now I do.”</p><p>“Okay, there’s something else,” Cyrus added even though he\nfelt exhausted.</p><p>He heard Buffy groan, “There’s more?”</p><p>“Yeah,” Cyrus said. “It’s about Jonah and Andi. I’m not\ngoing to meddle into their relationship. They can figure their own stuff out,\nand if they need our opinion, we’ll give it to them occasionally.”</p><p>“Yeah, I agree on that one,” Buffy told him.</p><p>“Good.”</p><p>“Good.” Cyrus knew there was something missing, but he\nwasn’t going to ask Buffy for it. Buffy wasn’t going to give it to him either\nway. “Anyways, just remember that I love you and you can tell me anything, okay?”\nBuffy told him.</p><p>“I love you, too,” Cyrus finally smiled. “Please just be\nhonest next time.”</p><p>“Yeah, I was being stupid,” Buffy said. That was closest\nCyrus was going to get to a ‘sorry.’ He knew it. </p><p>“You’re just looking out for me in your own Buffy way,”\nCyrus told her, making her let out a quick laugh.</p><p>“I really am,” she told him. “Anyways, good night, Cyrus.”</p><p>“Goodnight, Buffy,” Cyrus said, hanging up. Cyrus fell back\non his bed and looked at his blank ceiling. He didn’t think a phone call could\nbe this draining. He sat back up and looked over at the black leathered journal\nsitting on his bedside drawer. He hadn’t written about TJ in there yet. He knew\nthat when he did, it meant it was permanent. It meant TJ meant a lot more than\nsomething to him.</p><p><i>It means we’re just\nreally good friends </i>Cyrus told himself before standing up and getting the\npolaroid from his cork board. He grabbed a pen and some tape before opening his\njournal.</p><p>-</p><p>TJ was sitting across from Amber on her bed. She was typing\nup an essay while he worked on some of his problems. It took him about ten\nminutes to get through one sometimes. But when he got stuck, he’d just have to\ntap Amber’s ankle, and she’d help him. TJ always told Amber she sucked out all\nthe math abilities from the womb and left him with the random ability to\nremember specific yet mostly irrelevant things. TJ didn’t give a damn when\nPangea stopped being Pangea, yet he knew it was 200 million years ago. It\nsometimes pissed him off.</p><p>TJ’s phone buzzed next to Amber’s on her cluttered desk\nacross the room. It was the only part of her room that still had a lot of\nlittle knick-knacks, mostly things he recognized from their childhood. </p><p>“You can’t answer it until you’re done with your homework,”\nshe reminded him of their rule. TJ rolled his eyes and went back to his wrinkled\nmath test. He had a feeling it was Cyrus, and it made him wish he could speed\nthrough math. That was the issue about math. It always had a specific answer.\nHe could go knock on a scientist’s door, say <i>fuck you, Pangea broke up 150 million years ago</i>, and it might be\nright if he convinced enough people. But no, math only had one answer. Unless\nit had right two answers, of course. X and Y were the power couple everyone\nhated. Either way, he couldn’t guess on a problem. He couldn’t fake his way out\nof it.</p><p>He continued to work, finding himself doing problems with\nsomewhat more ease. He had finished that day’s homework with Amber’s help, and\nhe was redoing the test. Mrs. Pierson said something about letting him retake\nit if he was interested, and he wasn’t going to let her or Cyrus down. About\ntwenty minutes after the phone had buzzed, he circled the problems he had\nskipped that even Amber couldn’t remember how to solve. There was only a few.\nHe closed the purple highlighter and handed his test to Amber who was finishing\nup her conclusion. </p><p>“I can’t believe you already have an essay due,” he told her\nas he repeatedly smothered his papers into her laptop until she grabbed them. </p><p>“I just got one of those English teachers that lives off the\nsouls of tired high school kids, no biggie,” she smiled and took the paper. She\nwent over his work for a few minutes while he looked around her room again. It\nwas a lot more empty. </p><p>“Your room looks like you’re ready to move or something,” TJ\ncommented.</p><p>“It’s just nice to declutter,” she told him, as she placed\nhis test on a notebook and began to write on a sticky note. She fixed his\nmistakes on a sticky note so he would be able to go back and fix things. “Here,”\nshe handed it to him. Almost done. Just that one.” TJ fixed the problem and\nstarted putting his things in his backpack. Amber watching him closely the\nwhole time. “Are you expecting a text from Cyrus?” she asked him, making him\nstop what he was doing. He kept his eyes on his backpack not wanting to turn to\nlook at her. “You guys look cute together,” she said, making TJ’s face heat up.\n</p><p>“I just,” TJ put up his hand to his mouth, causing Amber to\ngiggle.</p><p>“If you just admit that you like him, it’ll get easier,” she\ntold him gently. “I promise.” TJ put his hand down and rested them on his lap.\nHe had liked two boys before but neither of them were like Cyrus. Nobody was\nlike Cyrus. He had told Amber about both of them, and he had gotten over them fairly\nquickly without getting hurt terribly. Amber was the only one who knew he liked\nguys. It wasn’t that hard for him to hide anyways. Shadyside and all the US\nsociety seemed to have a stereotype for gay people, and he didn’t fit the\nmatch. It made things easier, but he often dug in the future and wondered that\nwhen he was out, if people were going to say he didn’t “look” gay.</p><p>Amber was the one that rejected girls that messaged him. He\nfelt like he’d be too nice and give them the wrong impression. Amber always\nasked him if anyone wondered why the handsome captain of the basketball team\nhad never had a girlfriend. There were definitely girls who wanted to turn the\nschool bully into a “cuddly bunny.” At least that’s what Amber told him.</p><p>“Earth to TJ,” Amber snapped her fingers. </p><p>“Sorry,” he mumbled. </p><p>“Look,” Amber smiled at him, “it’s the most obvious thing in\nthe world that you like Cyrus. Even Buffy see’s it.” TJ’s heart skipped.</p><p>He slightly popped his neck as he turned to her, “Buffy?” </p><p>“She texted me and asked me about putting up flyers in The\nSpoon, and we kept talking. I might have ended up sending her the photo where\nyou guys were asleep,” she gave him a worried smile, flashing both sets of teeth.\nTJ glared at her and bit his lip. “I didn’t think it was anything bad,\nhonestly. Like maybe Cyrus had already shown her. It’s a cute ‘guys being dudes’\npics I’m sorry.”</p><p>“You didn’t do anything bad,” TJ shook his head. He wasn’t\ngoing to get mad at her for something like that. </p><p>“Well,” Amber gave him a tight-lipped smile, “that’s when\nBuffy asked me if you liked him. I said I highly doubted it and that you were\njust really cool with Cyrus because he helped you. I switched it on her though.”</p><p>TJ raised an eyebrow at her, “What do you mean?”  </p><p>“I asked her if Cyrus liked you.”</p><p>“Amber!” TJ gasped in horror. Amber let out a laugh and put\nup a pillow in front of her face. “You can’t just ask Buffy things like that!\nShe’s going to think I really do like him.” TJ let out an inhumane groan that\nmade Amber laugh. </p><p>“Well you do,” Amber lowered the pillow to look at TJ’s\nface. He was freaking out. </p><p>“Well I never admitted it,” TJ crossed his arms like a\nlittle kid, making Amber roll her eyes. </p><p>“Come on, TJ. She just told me she didn’t think so and we\nleft it at that, I swear. I doubt she’ll blow it out of proportion.”</p><p>“Did you just meet Buffy?” TJ asked her in disbelief.</p><p>“We both kind of did.”</p><p>“I mean,” TJ rubbed his eyes with his hands in circular\nmotion, starting to hope that he had teleported to another world when he looked\nup again. He didn’t. “Buffy was being weird with Cyrus today, and I feel like\nit’s because of that. If she brings <i>that</i>\nup,” TJ frowned, “it’s going to make everything weird. I just know it.” Amber\njust looked at TJ with a grin that made TJ wanted to roll off her bed.</p><p>“TJ,” she chuckled, “you’re so… awkward. You weren’t like\nthis when you had a crush on Davis and Marc.”</p><p>“Well I was in elementary school so,” TJ shrugged, giving\nAmber a mournful look. Amber was just sitting there, having the time of her\nlife.</p><p>“I thought Marc was early 6<sup>th</sup> grade?” she raised\na brow, bringing her hand to her cheek.</p><p>“Same thing,” TJ grumbled. </p><p>“What makes Cyrus so different that you’re just scared of\nsaying you have a crush on him?”</p><p>“Because,” TJ whispered. He stopped and tried to think of a\nreason. But he really didn’t.</p><p>“Are you scared he might like you back?”</p><p>“God, Amber. I’d be the happiest person if he liked me back.\nBut I don’t even know if he likes guys. Didn’t he date your friend Iris?”</p><p>“That doesn’t mean anything, though.”</p><p>“I just don’t want to scare him off.”</p><p>“You scare everyone but him off. And Buffy. She asked me if\nwe were vampires.”</p><p>“Say yes. Maybe she’ll come put me out of my misery,” TJ moaned.\n</p><p>“You’re such a drama queen,” Amber rolled her eyes. “Just go\nanswer your crush.” TJ got up from her bed and mad his way towards the desk. He\npicked up his phone and sure enough, he had a text from Cyrys.</p><p>Cyrus: Just got off the phone with Buffy. The convo was a\nlittleee bit more intense than expected but we good now </p><p><b>TJ:</b> good. I\nwas getting worried.</p><p><b>TJ:</b> Was it\nanything I did????</p><p><b>Cyrus:</b> I don’t\nthink she liked you denying ur a vampire</p><p><b>TJ:</b>\nshocker. Can drink blood in peace in this town I swear</p><p><b>Cyrus</b>: do\nyou drink tomato juice?</p><p>TJ smiled at his phone screen, laughing at Cyrus’ comments. “Hey,\nTJ,” Amber told him, making him look up. “You don’t have to tell me you have a\ncrush on Cyrus. I think your smile says it all.”</p><p>“Oh, shut up,” TJ rolled his eyes, a small smile breaking\nonto his lips.</p><p><b><i>Well, alright, okay, you win</i></b></p><p><b><i>I&rsquo;m in love with you</i></b></p><p><b><i>Baby, what can I do?</i></b></p><p><b><i>I&rsquo;ll do anything you say</i></b></p><p><b><i>It&rsquo;s just got to be that way</i></b></p><p>-</p><p>It was nearly ten o’clock when Cyrus had told TJ goodnight.\nBefore that, Cyrus had told him he was proud of him for doing his math\nhomework, making TJ feel like a giddy dork on the inside. It felt good to have\nsomeone tell him he was doing good. He hadn’t had a conversation with his\nparents in a few days, so Cyrus and Amber were all he had. </p><p>TJ stood up on his bed and reached for the polaroid of him\nand Cyrus on his ceiling. The second he pulled it off, Amber walked into his room,\nscaring him. TJ quickly sat back down and slid the photo under his pillow. He\nshould’ve given up the minute Amber walked in.</p><p>“What is that?” Amber grinned.</p><p>“What’s what?” TJ furrowed his brows, sitting up and then\nsitting back down on the pillow.  </p><p>“If it’s the polaroid of you two together, you’re whipped,”\nshe laughed and took a seat at his desk. TJ saw no point in hiding it anymore,\nso he let out an audible annoyed huff before moving and taking out the photo. It\nwas the one where they were simply smiling but something about it made him want\nto stare at it forever. They just looked like good friends, and TJ felt like he\nwas okay with that.</p><p>“I think he looks good in this photo,” TJ thought out loud,\nimmediately clasping his hand over his mouth as Amber let out an ‘aww.’ </p><p>“I think it’s cute that you like him,” Amber smiled at him\nas she played with a Rubix cube he had on his desk.</p><p>“Sometimes it doesn’t feel cute,” TJ mumbled. “You know, knowing\nthat nothing can’t ever happen.”</p><p>“You’re so pessimistic, I swear. As soon as you say “no” to\nsomething, you never want to change your mind.”</p><p>“Well, we don’t exactly come from the most optimistic family.\nLet’s see. Nana has seen everyone she loves die and hates most of dad’s side.”</p><p>“She’s a million years, old, okay? Plus, was going to see GG\ndie eventually.”</p><p>“Dad is probably still upset that his heavy metal band never\ngot a break.”</p><p>“They were called the Black Collared Workers, and he had to\nget a day job as a white collared worker. The irony probably hurts him.”</p><p>“Mom didn’t want kids and she got stuck with two of us.”</p><p>“Technically, she could’ve put us up for adoption.”</p><p>“Oh yeah. Because GG was going to let her.”</p><p>“As soon as GG saw I was a girl, he was probably like, ‘Shit.\nI guess I have a new dancing partner. Oh wait? There’s a boy? Hell yeah. Let’s\ngo fishing.’”</p><p>“I still danced with GG,” TJ laughed, smiling at a photo of the\nold man on his ceiling. TJ looked like him a lot. It pleased their Nana who was\ntheir GG’s daughter- mostly because she didn’t want her grandkids to look like\nthe Kippen’s. TJ bit his lip before turning to Amber and asking, “Do you think\nGG would’ve been fine with me being gay?”</p><p>Amber smiled at him, “I think GG would’ve driven us to Pride\nif we asked him. So yeah, TJ. I really do.” TJ gave her a tight-lipped smile\nbefore looking at the photo of Cyrus in his hand.</p><p>“I really like Cyrus, you know?”</p><p>“I know.”</p><p><b><i>All that I am askin&rsquo;</i></b></p><p><b><i>All I want from you</i></b></p><p><b><i>Is just love me like I love you</i></b></p><p><b><i>And it won&rsquo;t be hard to do</i></b></p><p><b><i>If you&rsquo;re going to be my man</i></b></p><p><b><i>Sweet baby, take me by the hand</i></b></p><hr><p>For those who asked to be tagged :)  <a href=\"https://tmblr.co/m9hqVewUt-C1_vL4ENG-nWw\">@magicalcowboycalzonemoney</a> <a href=\"https://tmblr.co/m_4tRoSQ5rXO9yEH965AASA\">@the-greatt-perhaps</a> <a href=\"https://tmblr.co/mrTO_xWDLkyEgi4LFyByJMQ\">@thedampjofangirl</a> <a href=\"https://tmblr.co/mOT_OB-C0YwFAA2cBwIMWXg\">@evaeselgreatest</a></p><p>Let me know if you want to be tagged!</p><p>Also I know my updated are really sporadic right now, but I swear I’ll have a set day where I update once a week in about 2 weeks when I start school. I’m majoring in creative writing, so I know I’ll have a few other stories on my plate :) Thank you for the support so far &lt;3</p><p>Love, Star</p><p><b><a href=\"https://lgbtyrus.tumblr.com/post/178153409194/tjs-playlist-chapter-6\">Next Chapter</a></b></p>",
        "body_abstract": "\n<p><b>Story Summary:</b> When Cyrus finds a playlist on TJ&rsquo;s desktop full of old love songs, he realizes that TJ has never been a scary basketball guy but rather a huge sap. TJ just wished Cyrus could realize that all of those songs remind him of a certain boy who likes chocolate chocolate chip muffins without telling him directly.</p>\n<p>With insecurities and fears almost set in stone, it&rsquo;s hard for TJ to admit that he has a heart aching crush on Cyrus who is trying to avoid just that. Of course, it doesn&rsquo;t seem like both of them are trying to get over each other when they&rsquo;re always together.</p>\n<p><b><a href=\"https://archiveofourown.org/works/15801564/chapters/37213079\">Ao3 Link</a>&nbsp;| <a href=\"https://lgbtyrus.tumblr.com/post/177417182754/tjs-playlist-chapter-1\">Chapter 1 Link&nbsp;</a>| <a href=\"https://lgbtyrus.tumblr.com/post/177784471299/tjs-playlist-chapter-4\">Previous Chapter</a>&nbsp;| <a href=\"https://lgbtyrus.tumblr.com/post/178153409194/tjs-playlist-chapter-6\">Next Chapter</a> |</b></p>\n<p><b>Words:</b> 3264</p>\n",
        "reblog": {
            "comment": "<p><b>Story Summary:</b> When Cyrus finds a playlist on TJ’s desktop full of old love songs, he realizes that TJ has never been a scary basketball guy but rather a huge sap. TJ just wished Cyrus could realize that all of those songs remind him of a certain boy who likes chocolate chocolate chip muffins without telling him directly.</p><p>With insecurities and fears almost set in stone, it’s hard for TJ to admit that he has a heart aching crush on Cyrus who is trying to avoid just that. Of course, it doesn’t seem like both of them are trying to get over each other when they’re always together.</p><p><b><a href=\"https://archiveofourown.org/works/15801564/chapters/37213079\">Ao3 Link</a> | <a href=\"https://lgbtyrus.tumblr.com/post/177417182754/tjs-playlist-chapter-1\">Chapter 1 Link </a>| <a href=\"https://lgbtyrus.tumblr.com/post/177784471299/tjs-playlist-chapter-4\">Previous Chapter</a> | <a href=\"https://lgbtyrus.tumblr.com/post/178153409194/tjs-playlist-chapter-6\">Next Chapter</a> |</b></p><p><b>Words:</b> 3264</p>[[MORE]]<p>“Do you like TJ? Like, in more than friends?” Buffy asked\nhim.</p><p><i>Anything but that.</i></p><p>“Does that really matter right now?” Cyrus tried to jump\naround the question. It was a mistake, and he automatically knew it. </p><p>“So you do?” Buffy almost whispered. Cyrus felt himself turn\nred, and it was an unpleasant feeling that went to his stomach. He really\ndidn’t want to talk about it to anyone at all. It had taken forever for him to\nopen up about Jonah, and he certainly didn’t want to rush himself into\nadmitting something that could turn out to be something as simple as\nappreciation. </p><p>“No, Buffy,” Cyrus managed to say, “I don’t. But even if I\ndid, that shouldn’t be important.”</p><p>“Well,” he heard Buffy hesitate, “it’s important to me. It\nchanges a lot.” <i>Change the topic. Change\nthe topic. Change the topic.</i></p><p>“Are we talking right now or tomorrow morning? I don’t want\nto go to bed fighting with you.”</p><p>“We’re not fighting,” Buffy’s voice got louder. </p><p>“Well it sounds like we’re starting to,” Cyrus replied, his\ntone matching Buffy’s. </p><p>“Well, then,” Buffy stopped for a few seconds, “what do you\nwant to talk about?” </p><p>Cyrus plunged right at it and asked her, “Do you not like TJ\nand me hanging out? You guys were cool. He hasn’t changed. If he has, he’s\ngotten a lot better, not worse.”</p><p>“Answer my first question,” Buffy brought it up again,\nmaking Cyrus rub his face in frustration. </p><p><i>Why is she suddenly\nthinking about things like this? I don’t even want to think about things like this!</i></p><p>“There should be absolutely no correlation between why\nyou’ve gone from being on ‘we’re cool’ terms to ‘I hate you again.’ Please stop\nasking me that question,” Cyrus groaned. </p><p>“Well if you answered it, I wouldn’t have to ask it again.”</p><p>“You’re being really rude, Buffy. Maybe we should just talk\ntomorrow morning.”</p><p>“No!” Buffy suddenly shouted. She stayed silent for a\nfraction of a moment and then continued to speak in her regular voice, “Look,\nCyrus. Please just answer that question. It’ll help me sort out my feelings.”</p><p>“What about <i>my</i>\nfeelings?” Cyrus found himself asking. He knew he sounded like he was on the\nverge of crying. “You think it’s not upsetting to see you get worked up over\nsomething as small as me helping TJ with math. You’ve done it before. You know\nhe needs help.” Buffy didn’t answer, so Cyrus asked her, “What difference will\nit make if I have a crush on TJ?”</p><p>“A lot, actually,” Buffy replied. “If you do, it means he’ll\nbe your boyfriend and you’re going to pick him over us most of the time.” Cyrus\nfelt that if he wanted to, he could’ve cried.</p><p>“We,” Cyrus took a deep breath, sitting down at the edge of\nhis bed, “we never told Andi stuff like this.”</p><p>“Yeah but we were cool with Jonah,” Buffy tried to defend\nher stance. Cyrus knew he had her cornered, though. She didn’t sound so sure of\nherself.</p><p>“Well, you’re supposed to be cool with TJ. He rapped for\nyou!” Cyrus reminded her. “You guys were cool all summer. Nothing should have\nhad changed, Buffy.”</p><p>“Cyrus,” Buffy’s voice was the one shaking now, worrying\nCyrus. “If you like him and he liked you back, I’m so scared he’s going to hurt\nyou. He’s still not an angel, you know that, right?”</p><p>“Well, one,” Cyrus grumbled, in disbelief that he had to say\nthese things, “he’s nice to us and especially to me. Two,” Cyrus’ voice was\nraised now as he said, “he’s the biggest heterosexual in Shadyside! Do you\nthink I want to hurt myself like that again?” Buffy stayed quiet. Cyrus lowered\nhis voice, looking over to make sure his door was shut, “I’m over Jonah. I’ve\nbeen. But it still hurt seeing him with Andi when I liked him. At the end of\nthe day, I can’t catch feelings for TJ because I’ll hurt myself, and I’ll\nprobably lose the good friendship we have. But let’s face it, Buffy. It’s you I\nhave to worry about losing right now.”</p><p>“Cyrus…”</p><p>“I’m not going to stop being friends with TJ. He needs me\nright now, and I’m going to be there. I want you to be there, too. I want Jonah\nand Andi to be there. If we could get a little less hair gel on him, maybe he\ncould even be part of the Good Hair Crew,” Cyrus tried to add in some humor. He\nknew it had worked when he heard Buffy chuckle. “Please, Buffy. If you’re just\nworried that I’m going to, I don’t know, fall in love with TJ and he’s going to\nhurt me, let it go. Please. I’m starting to believe TJ wouldn’t even hurt a\nfly. He has a cat named Macaroni for goodness sake!”</p><p>“Alright,” Buffy sighed. “I’m being dramatic.” Cyrus was a\nlittle taken aback. He couldn’t believe Buffy was admitting she was wrong, but\nhe wasn’t going to rub that in.</p><p>“Yeah, you are,” Cyrus simply agreed. “I’d never chose my\nfuture boyfriend over you guys anyways. You know that, right?”</p><p>“Now I do.”</p><p>“Okay, there’s something else,” Cyrus added even though he\nfelt exhausted.</p><p>He heard Buffy groan, “There’s more?”</p><p>“Yeah,” Cyrus said. “It’s about Jonah and Andi. I’m not\ngoing to meddle into their relationship. They can figure their own stuff out,\nand if they need our opinion, we’ll give it to them occasionally.”</p><p>“Yeah, I agree on that one,” Buffy told him.</p><p>“Good.”</p><p>“Good.” Cyrus knew there was something missing, but he\nwasn’t going to ask Buffy for it. Buffy wasn’t going to give it to him either\nway. “Anyways, just remember that I love you and you can tell me anything, okay?”\nBuffy told him.</p><p>“I love you, too,” Cyrus finally smiled. “Please just be\nhonest next time.”</p><p>“Yeah, I was being stupid,” Buffy said. That was closest\nCyrus was going to get to a ‘sorry.’ He knew it. </p><p>“You’re just looking out for me in your own Buffy way,”\nCyrus told her, making her let out a quick laugh.</p><p>“I really am,” she told him. “Anyways, good night, Cyrus.”</p><p>“Goodnight, Buffy,” Cyrus said, hanging up. Cyrus fell back\non his bed and looked at his blank ceiling. He didn’t think a phone call could\nbe this draining. He sat back up and looked over at the black leathered journal\nsitting on his bedside drawer. He hadn’t written about TJ in there yet. He knew\nthat when he did, it meant it was permanent. It meant TJ meant a lot more than\nsomething to him.</p><p><i>It means we’re just\nreally good friends </i>Cyrus told himself before standing up and getting the\npolaroid from his cork board. He grabbed a pen and some tape before opening his\njournal.</p><p>-</p><p>TJ was sitting across from Amber on her bed. She was typing\nup an essay while he worked on some of his problems. It took him about ten\nminutes to get through one sometimes. But when he got stuck, he’d just have to\ntap Amber’s ankle, and she’d help him. TJ always told Amber she sucked out all\nthe math abilities from the womb and left him with the random ability to\nremember specific yet mostly irrelevant things. TJ didn’t give a damn when\nPangea stopped being Pangea, yet he knew it was 200 million years ago. It\nsometimes pissed him off.</p><p>TJ’s phone buzzed next to Amber’s on her cluttered desk\nacross the room. It was the only part of her room that still had a lot of\nlittle knick-knacks, mostly things he recognized from their childhood. </p><p>“You can’t answer it until you’re done with your homework,”\nshe reminded him of their rule. TJ rolled his eyes and went back to his wrinkled\nmath test. He had a feeling it was Cyrus, and it made him wish he could speed\nthrough math. That was the issue about math. It always had a specific answer.\nHe could go knock on a scientist’s door, say <i>fuck you, Pangea broke up 150 million years ago</i>, and it might be\nright if he convinced enough people. But no, math only had one answer. Unless\nit had right two answers, of course. X and Y were the power couple everyone\nhated. Either way, he couldn’t guess on a problem. He couldn’t fake his way out\nof it.</p><p>He continued to work, finding himself doing problems with\nsomewhat more ease. He had finished that day’s homework with Amber’s help, and\nhe was redoing the test. Mrs. Pierson said something about letting him retake\nit if he was interested, and he wasn’t going to let her or Cyrus down. About\ntwenty minutes after the phone had buzzed, he circled the problems he had\nskipped that even Amber couldn’t remember how to solve. There was only a few.\nHe closed the purple highlighter and handed his test to Amber who was finishing\nup her conclusion. </p><p>“I can’t believe you already have an essay due,” he told her\nas he repeatedly smothered his papers into her laptop until she grabbed them. </p><p>“I just got one of those English teachers that lives off the\nsouls of tired high school kids, no biggie,” she smiled and took the paper. She\nwent over his work for a few minutes while he looked around her room again. It\nwas a lot more empty. </p><p>“Your room looks like you’re ready to move or something,” TJ\ncommented.</p><p>“It’s just nice to declutter,” she told him, as she placed\nhis test on a notebook and began to write on a sticky note. She fixed his\nmistakes on a sticky note so he would be able to go back and fix things. “Here,”\nshe handed it to him. Almost done. Just that one.” TJ fixed the problem and\nstarted putting his things in his backpack. Amber watching him closely the\nwhole time. “Are you expecting a text from Cyrus?” she asked him, making him\nstop what he was doing. He kept his eyes on his backpack not wanting to turn to\nlook at her. “You guys look cute together,” she said, making TJ’s face heat up.\n</p><p>“I just,” TJ put up his hand to his mouth, causing Amber to\ngiggle.</p><p>“If you just admit that you like him, it’ll get easier,” she\ntold him gently. “I promise.” TJ put his hand down and rested them on his lap.\nHe had liked two boys before but neither of them were like Cyrus. Nobody was\nlike Cyrus. He had told Amber about both of them, and he had gotten over them fairly\nquickly without getting hurt terribly. Amber was the only one who knew he liked\nguys. It wasn’t that hard for him to hide anyways. Shadyside and all the US\nsociety seemed to have a stereotype for gay people, and he didn’t fit the\nmatch. It made things easier, but he often dug in the future and wondered that\nwhen he was out, if people were going to say he didn’t “look” gay.</p><p>Amber was the one that rejected girls that messaged him. He\nfelt like he’d be too nice and give them the wrong impression. Amber always\nasked him if anyone wondered why the handsome captain of the basketball team\nhad never had a girlfriend. There were definitely girls who wanted to turn the\nschool bully into a “cuddly bunny.” At least that’s what Amber told him.</p><p>“Earth to TJ,” Amber snapped her fingers. </p><p>“Sorry,” he mumbled. </p><p>“Look,” Amber smiled at him, “it’s the most obvious thing in\nthe world that you like Cyrus. Even Buffy see’s it.” TJ’s heart skipped.</p><p>He slightly popped his neck as he turned to her, “Buffy?” </p><p>“She texted me and asked me about putting up flyers in The\nSpoon, and we kept talking. I might have ended up sending her the photo where\nyou guys were asleep,” she gave him a worried smile, flashing both sets of teeth.\nTJ glared at her and bit his lip. “I didn’t think it was anything bad,\nhonestly. Like maybe Cyrus had already shown her. It’s a cute ‘guys being dudes’\npics I’m sorry.”</p><p>“You didn’t do anything bad,” TJ shook his head. He wasn’t\ngoing to get mad at her for something like that. </p><p>“Well,” Amber gave him a tight-lipped smile, “that’s when\nBuffy asked me if you liked him. I said I highly doubted it and that you were\njust really cool with Cyrus because he helped you. I switched it on her though.”</p><p>TJ raised an eyebrow at her, “What do you mean?”  </p><p>“I asked her if Cyrus liked you.”</p><p>“Amber!” TJ gasped in horror. Amber let out a laugh and put\nup a pillow in front of her face. “You can’t just ask Buffy things like that!\nShe’s going to think I really do like him.” TJ let out an inhumane groan that\nmade Amber laugh. </p><p>“Well you do,” Amber lowered the pillow to look at TJ’s\nface. He was freaking out. </p><p>“Well I never admitted it,” TJ crossed his arms like a\nlittle kid, making Amber roll her eyes. </p><p>“Come on, TJ. She just told me she didn’t think so and we\nleft it at that, I swear. I doubt she’ll blow it out of proportion.”</p><p>“Did you just meet Buffy?” TJ asked her in disbelief.</p><p>“We both kind of did.”</p><p>“I mean,” TJ rubbed his eyes with his hands in circular\nmotion, starting to hope that he had teleported to another world when he looked\nup again. He didn’t. “Buffy was being weird with Cyrus today, and I feel like\nit’s because of that. If she brings <i>that</i>\nup,” TJ frowned, “it’s going to make everything weird. I just know it.” Amber\njust looked at TJ with a grin that made TJ wanted to roll off her bed.</p><p>“TJ,” she chuckled, “you’re so… awkward. You weren’t like\nthis when you had a crush on Davis and Marc.”</p><p>“Well I was in elementary school so,” TJ shrugged, giving\nAmber a mournful look. Amber was just sitting there, having the time of her\nlife.</p><p>“I thought Marc was early 6<sup>th</sup> grade?” she raised\na brow, bringing her hand to her cheek.</p><p>“Same thing,” TJ grumbled. </p><p>“What makes Cyrus so different that you’re just scared of\nsaying you have a crush on him?”</p><p>“Because,” TJ whispered. He stopped and tried to think of a\nreason. But he really didn’t.</p><p>“Are you scared he might like you back?”</p><p>“God, Amber. I’d be the happiest person if he liked me back.\nBut I don’t even know if he likes guys. Didn’t he date your friend Iris?”</p><p>“That doesn’t mean anything, though.”</p><p>“I just don’t want to scare him off.”</p><p>“You scare everyone but him off. And Buffy. She asked me if\nwe were vampires.”</p><p>“Say yes. Maybe she’ll come put me out of my misery,” TJ moaned.\n</p><p>“You’re such a drama queen,” Amber rolled her eyes. “Just go\nanswer your crush.” TJ got up from her bed and mad his way towards the desk. He\npicked up his phone and sure enough, he had a text from Cyrys.</p><p>Cyrus: Just got off the phone with Buffy. The convo was a\nlittleee bit more intense than expected but we good now </p><p><b>TJ:</b> good. I\nwas getting worried.</p><p><b>TJ:</b> Was it\nanything I did????</p><p><b>Cyrus:</b> I don’t\nthink she liked you denying ur a vampire</p><p><b>TJ:</b>\nshocker. Can drink blood in peace in this town I swear</p><p><b>Cyrus</b>: do\nyou drink tomato juice?</p><p>TJ smiled at his phone screen, laughing at Cyrus’ comments. “Hey,\nTJ,” Amber told him, making him look up. “You don’t have to tell me you have a\ncrush on Cyrus. I think your smile says it all.”</p><p>“Oh, shut up,” TJ rolled his eyes, a small smile breaking\nonto his lips.</p><p><b><i>Well, alright, okay, you win</i></b></p><p><b><i>I’m in love with you</i></b></p><p><b><i>Baby, what can I do?</i></b></p><p><b><i>I’ll do anything you say</i></b></p><p><b><i>It’s just got to be that way</i></b></p><p>-</p><p>It was nearly ten o’clock when Cyrus had told TJ goodnight.\nBefore that, Cyrus had told him he was proud of him for doing his math\nhomework, making TJ feel like a giddy dork on the inside. It felt good to have\nsomeone tell him he was doing good. He hadn’t had a conversation with his\nparents in a few days, so Cyrus and Amber were all he had. </p><p>TJ stood up on his bed and reached for the polaroid of him\nand Cyrus on his ceiling. The second he pulled it off, Amber walked into his room,\nscaring him. TJ quickly sat back down and slid the photo under his pillow. He\nshould’ve given up the minute Amber walked in.</p><p>“What is that?” Amber grinned.</p><p>“What’s what?” TJ furrowed his brows, sitting up and then\nsitting back down on the pillow.  </p><p>“If it’s the polaroid of you two together, you’re whipped,”\nshe laughed and took a seat at his desk. TJ saw no point in hiding it anymore,\nso he let out an audible annoyed huff before moving and taking out the photo. It\nwas the one where they were simply smiling but something about it made him want\nto stare at it forever. They just looked like good friends, and TJ felt like he\nwas okay with that.</p><p>“I think he looks good in this photo,” TJ thought out loud,\nimmediately clasping his hand over his mouth as Amber let out an ‘aww.’ </p><p>“I think it’s cute that you like him,” Amber smiled at him\nas she played with a Rubix cube he had on his desk.</p><p>“Sometimes it doesn’t feel cute,” TJ mumbled. “You know, knowing\nthat nothing can’t ever happen.”</p><p>“You’re so pessimistic, I swear. As soon as you say “no” to\nsomething, you never want to change your mind.”</p><p>“Well, we don’t exactly come from the most optimistic family.\nLet’s see. Nana has seen everyone she loves die and hates most of dad’s side.”</p><p>“She’s a million years, old, okay? Plus, was going to see GG\ndie eventually.”</p><p>“Dad is probably still upset that his heavy metal band never\ngot a break.”</p><p>“They were called the Black Collared Workers, and he had to\nget a day job as a white collared worker. The irony probably hurts him.”</p><p>“Mom didn’t want kids and she got stuck with two of us.”</p><p>“Technically, she could’ve put us up for adoption.”</p><p>“Oh yeah. Because GG was going to let her.”</p><p>“As soon as GG saw I was a girl, he was probably like, ‘Shit.\nI guess I have a new dancing partner. Oh wait? There’s a boy? Hell yeah. Let’s\ngo fishing.’”</p><p>“I still danced with GG,” TJ laughed, smiling at a photo of the\nold man on his ceiling. TJ looked like him a lot. It pleased their Nana who was\ntheir GG’s daughter- mostly because she didn’t want her grandkids to look like\nthe Kippen’s. TJ bit his lip before turning to Amber and asking, “Do you think\nGG would’ve been fine with me being gay?”</p><p>Amber smiled at him, “I think GG would’ve driven us to Pride\nif we asked him. So yeah, TJ. I really do.” TJ gave her a tight-lipped smile\nbefore looking at the photo of Cyrus in his hand.</p><p>“I really like Cyrus, you know?”</p><p>“I know.”</p><p><b><i>All that I am askin’</i></b></p><p><b><i>All I want from you</i></b></p><p><b><i>Is just love me like I love you</i></b></p><p><b><i>And it won’t be hard to do</i></b></p><p><b><i>If you’re going to be my man</i></b></p><p><b><i>Sweet baby, take me by the hand</i></b></p><hr><p>For those who asked to be tagged :)  <a href=\"https://tmblr.co/m9hqVewUt-C1_vL4ENG-nWw\">@magicalcowboycalzonemoney</a> <a href=\"https://tmblr.co/m_4tRoSQ5rXO9yEH965AASA\">@the-greatt-perhaps</a> <a href=\"https://tmblr.co/mrTO_xWDLkyEgi4LFyByJMQ\">@thedampjofangirl</a> <a href=\"https://tmblr.co/mOT_OB-C0YwFAA2cBwIMWXg\">@evaeselgreatest</a></p><p>Let me know if you want to be tagged!</p><p>Also I know my updated are really sporadic right now, but I swear I’ll have a set day where I update once a week in about 2 weeks when I start school. I’m majoring in creative writing, so I know I’ll have a few other stories on my plate :) Thank you for the support so far &lt;3</p><p>Love, Star</p><p><b><a href=\"https://lgbtyrus.tumblr.com/post/178153409194/tjs-playlist-chapter-6\">Next Chapter</a></b></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "lgbtyrus",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#fdd2db",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/0dedbd81e5a8afae7cb73fbfeba04fd7/dgx8kzq/5Aapmqg68/tumblr_static_878b5cwrjp4wks4wwcsockco8.jpg",
                        "header_image_focused": "https://static.tumblr.com/0dedbd81e5a8afae7cb73fbfeba04fd7/dgx8kzq/5Aapmqg68/tumblr_static_878b5cwrjp4wks4wwcsockco8_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/0dedbd81e5a8afae7cb73fbfeba04fd7/dgx8kzq/5Aapmqg68/tumblr_static_878b5cwrjp4wks4wwcsockco8_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#318198",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177953608709"
                },
                "content_raw": "<p><b>Story Summary:</b> When Cyrus finds a playlist on TJ’s desktop full of old love songs, he realizes that TJ has never been a scary basketball guy but rather a huge sap. TJ just wished Cyrus could realize that all of those songs remind him of a certain boy who likes chocolate chocolate chip muffins without telling him directly.</p><p>With insecurities and fears almost set in stone, it’s hard for TJ to admit that he has a heart aching crush on Cyrus who is trying to avoid just that. Of course, it doesn’t seem like both of them are trying to get over each other when they’re always together.</p><p><b><a href=\"https://archiveofourown.org/works/15801564/chapters/37213079\">Ao3 Link</a> | <a href=\"https://lgbtyrus.tumblr.com/post/177417182754/tjs-playlist-chapter-1\">Chapter 1 Link </a>| <a href=\"https://lgbtyrus.tumblr.com/post/177784471299/tjs-playlist-chapter-4\">Previous Chapter</a> | <a href=\"https://lgbtyrus.tumblr.com/post/178153409194/tjs-playlist-chapter-6\">Next Chapter</a> |</b></p><p><b>Words:</b> 3264</p>[[MORE]]<p>“Do you like TJ? Like, in more than friends?” Buffy asked\nhim.</p><p><i>Anything but that.</i></p><p>“Does that really matter right now?” Cyrus tried to jump\naround the question. It was a mistake, and he automatically knew it. </p><p>“So you do?” Buffy almost whispered. Cyrus felt himself turn\nred, and it was an unpleasant feeling that went to his stomach. He really\ndidn’t want to talk about it to anyone at all. It had taken forever for him to\nopen up about Jonah, and he certainly didn’t want to rush himself into\nadmitting something that could turn out to be something as simple as\nappreciation. </p><p>“No, Buffy,” Cyrus managed to say, “I don’t. But even if I\ndid, that shouldn’t be important.”</p><p>“Well,” he heard Buffy hesitate, “it’s important to me. It\nchanges a lot.” <i>Change the topic. Change\nthe topic. Change the topic.</i></p><p>“Are we talking right now or tomorrow morning? I don’t want\nto go to bed fighting with you.”</p><p>“We’re not fighting,” Buffy’s voice got louder. </p><p>“Well it sounds like we’re starting to,” Cyrus replied, his\ntone matching Buffy’s. </p><p>“Well, then,” Buffy stopped for a few seconds, “what do you\nwant to talk about?” </p><p>Cyrus plunged right at it and asked her, “Do you not like TJ\nand me hanging out? You guys were cool. He hasn’t changed. If he has, he’s\ngotten a lot better, not worse.”</p><p>“Answer my first question,” Buffy brought it up again,\nmaking Cyrus rub his face in frustration. </p><p><i>Why is she suddenly\nthinking about things like this? I don’t even want to think about things like this!</i></p><p>“There should be absolutely no correlation between why\nyou’ve gone from being on ‘we’re cool’ terms to ‘I hate you again.’ Please stop\nasking me that question,” Cyrus groaned. </p><p>“Well if you answered it, I wouldn’t have to ask it again.”</p><p>“You’re being really rude, Buffy. Maybe we should just talk\ntomorrow morning.”</p><p>“No!” Buffy suddenly shouted. She stayed silent for a\nfraction of a moment and then continued to speak in her regular voice, “Look,\nCyrus. Please just answer that question. It’ll help me sort out my feelings.”</p><p>“What about <i>my</i>\nfeelings?” Cyrus found himself asking. He knew he sounded like he was on the\nverge of crying. “You think it’s not upsetting to see you get worked up over\nsomething as small as me helping TJ with math. You’ve done it before. You know\nhe needs help.” Buffy didn’t answer, so Cyrus asked her, “What difference will\nit make if I have a crush on TJ?”</p><p>“A lot, actually,” Buffy replied. “If you do, it means he’ll\nbe your boyfriend and you’re going to pick him over us most of the time.” Cyrus\nfelt that if he wanted to, he could’ve cried.</p><p>“We,” Cyrus took a deep breath, sitting down at the edge of\nhis bed, “we never told Andi stuff like this.”</p><p>“Yeah but we were cool with Jonah,” Buffy tried to defend\nher stance. Cyrus knew he had her cornered, though. She didn’t sound so sure of\nherself.</p><p>“Well, you’re supposed to be cool with TJ. He rapped for\nyou!” Cyrus reminded her. “You guys were cool all summer. Nothing should have\nhad changed, Buffy.”</p><p>“Cyrus,” Buffy’s voice was the one shaking now, worrying\nCyrus. “If you like him and he liked you back, I’m so scared he’s going to hurt\nyou. He’s still not an angel, you know that, right?”</p><p>“Well, one,” Cyrus grumbled, in disbelief that he had to say\nthese things, “he’s nice to us and especially to me. Two,” Cyrus’ voice was\nraised now as he said, “he’s the biggest heterosexual in Shadyside! Do you\nthink I want to hurt myself like that again?” Buffy stayed quiet. Cyrus lowered\nhis voice, looking over to make sure his door was shut, “I’m over Jonah. I’ve\nbeen. But it still hurt seeing him with Andi when I liked him. At the end of\nthe day, I can’t catch feelings for TJ because I’ll hurt myself, and I’ll\nprobably lose the good friendship we have. But let’s face it, Buffy. It’s you I\nhave to worry about losing right now.”</p><p>“Cyrus…”</p><p>“I’m not going to stop being friends with TJ. He needs me\nright now, and I’m going to be there. I want you to be there, too. I want Jonah\nand Andi to be there. If we could get a little less hair gel on him, maybe he\ncould even be part of the Good Hair Crew,” Cyrus tried to add in some humor. He\nknew it had worked when he heard Buffy chuckle. “Please, Buffy. If you’re just\nworried that I’m going to, I don’t know, fall in love with TJ and he’s going to\nhurt me, let it go. Please. I’m starting to believe TJ wouldn’t even hurt a\nfly. He has a cat named Macaroni for goodness sake!”</p><p>“Alright,” Buffy sighed. “I’m being dramatic.” Cyrus was a\nlittle taken aback. He couldn’t believe Buffy was admitting she was wrong, but\nhe wasn’t going to rub that in.</p><p>“Yeah, you are,” Cyrus simply agreed. “I’d never chose my\nfuture boyfriend over you guys anyways. You know that, right?”</p><p>“Now I do.”</p><p>“Okay, there’s something else,” Cyrus added even though he\nfelt exhausted.</p><p>He heard Buffy groan, “There’s more?”</p><p>“Yeah,” Cyrus said. “It’s about Jonah and Andi. I’m not\ngoing to meddle into their relationship. They can figure their own stuff out,\nand if they need our opinion, we’ll give it to them occasionally.”</p><p>“Yeah, I agree on that one,” Buffy told him.</p><p>“Good.”</p><p>“Good.” Cyrus knew there was something missing, but he\nwasn’t going to ask Buffy for it. Buffy wasn’t going to give it to him either\nway. “Anyways, just remember that I love you and you can tell me anything, okay?”\nBuffy told him.</p><p>“I love you, too,” Cyrus finally smiled. “Please just be\nhonest next time.”</p><p>“Yeah, I was being stupid,” Buffy said. That was closest\nCyrus was going to get to a ‘sorry.’ He knew it. </p><p>“You’re just looking out for me in your own Buffy way,”\nCyrus told her, making her let out a quick laugh.</p><p>“I really am,” she told him. “Anyways, good night, Cyrus.”</p><p>“Goodnight, Buffy,” Cyrus said, hanging up. Cyrus fell back\non his bed and looked at his blank ceiling. He didn’t think a phone call could\nbe this draining. He sat back up and looked over at the black leathered journal\nsitting on his bedside drawer. He hadn’t written about TJ in there yet. He knew\nthat when he did, it meant it was permanent. It meant TJ meant a lot more than\nsomething to him.</p><p><i>It means we’re just\nreally good friends </i>Cyrus told himself before standing up and getting the\npolaroid from his cork board. He grabbed a pen and some tape before opening his\njournal.</p><p>-</p><p>TJ was sitting across from Amber on her bed. She was typing\nup an essay while he worked on some of his problems. It took him about ten\nminutes to get through one sometimes. But when he got stuck, he’d just have to\ntap Amber’s ankle, and she’d help him. TJ always told Amber she sucked out all\nthe math abilities from the womb and left him with the random ability to\nremember specific yet mostly irrelevant things. TJ didn’t give a damn when\nPangea stopped being Pangea, yet he knew it was 200 million years ago. It\nsometimes pissed him off.</p><p>TJ’s phone buzzed next to Amber’s on her cluttered desk\nacross the room. It was the only part of her room that still had a lot of\nlittle knick-knacks, mostly things he recognized from their childhood. </p><p>“You can’t answer it until you’re done with your homework,”\nshe reminded him of their rule. TJ rolled his eyes and went back to his wrinkled\nmath test. He had a feeling it was Cyrus, and it made him wish he could speed\nthrough math. That was the issue about math. It always had a specific answer.\nHe could go knock on a scientist’s door, say <i>fuck you, Pangea broke up 150 million years ago</i>, and it might be\nright if he convinced enough people. But no, math only had one answer. Unless\nit had right two answers, of course. X and Y were the power couple everyone\nhated. Either way, he couldn’t guess on a problem. He couldn’t fake his way out\nof it.</p><p>He continued to work, finding himself doing problems with\nsomewhat more ease. He had finished that day’s homework with Amber’s help, and\nhe was redoing the test. Mrs. Pierson said something about letting him retake\nit if he was interested, and he wasn’t going to let her or Cyrus down. About\ntwenty minutes after the phone had buzzed, he circled the problems he had\nskipped that even Amber couldn’t remember how to solve. There was only a few.\nHe closed the purple highlighter and handed his test to Amber who was finishing\nup her conclusion. </p><p>“I can’t believe you already have an essay due,” he told her\nas he repeatedly smothered his papers into her laptop until she grabbed them. </p><p>“I just got one of those English teachers that lives off the\nsouls of tired high school kids, no biggie,” she smiled and took the paper. She\nwent over his work for a few minutes while he looked around her room again. It\nwas a lot more empty. </p><p>“Your room looks like you’re ready to move or something,” TJ\ncommented.</p><p>“It’s just nice to declutter,” she told him, as she placed\nhis test on a notebook and began to write on a sticky note. She fixed his\nmistakes on a sticky note so he would be able to go back and fix things. “Here,”\nshe handed it to him. Almost done. Just that one.” TJ fixed the problem and\nstarted putting his things in his backpack. Amber watching him closely the\nwhole time. “Are you expecting a text from Cyrus?” she asked him, making him\nstop what he was doing. He kept his eyes on his backpack not wanting to turn to\nlook at her. “You guys look cute together,” she said, making TJ’s face heat up.\n</p><p>“I just,” TJ put up his hand to his mouth, causing Amber to\ngiggle.</p><p>“If you just admit that you like him, it’ll get easier,” she\ntold him gently. “I promise.” TJ put his hand down and rested them on his lap.\nHe had liked two boys before but neither of them were like Cyrus. Nobody was\nlike Cyrus. He had told Amber about both of them, and he had gotten over them fairly\nquickly without getting hurt terribly. Amber was the only one who knew he liked\nguys. It wasn’t that hard for him to hide anyways. Shadyside and all the US\nsociety seemed to have a stereotype for gay people, and he didn’t fit the\nmatch. It made things easier, but he often dug in the future and wondered that\nwhen he was out, if people were going to say he didn’t “look” gay.</p><p>Amber was the one that rejected girls that messaged him. He\nfelt like he’d be too nice and give them the wrong impression. Amber always\nasked him if anyone wondered why the handsome captain of the basketball team\nhad never had a girlfriend. There were definitely girls who wanted to turn the\nschool bully into a “cuddly bunny.” At least that’s what Amber told him.</p><p>“Earth to TJ,” Amber snapped her fingers. </p><p>“Sorry,” he mumbled. </p><p>“Look,” Amber smiled at him, “it’s the most obvious thing in\nthe world that you like Cyrus. Even Buffy see’s it.” TJ’s heart skipped.</p><p>He slightly popped his neck as he turned to her, “Buffy?” </p><p>“She texted me and asked me about putting up flyers in The\nSpoon, and we kept talking. I might have ended up sending her the photo where\nyou guys were asleep,” she gave him a worried smile, flashing both sets of teeth.\nTJ glared at her and bit his lip. “I didn’t think it was anything bad,\nhonestly. Like maybe Cyrus had already shown her. It’s a cute ‘guys being dudes’\npics I’m sorry.”</p><p>“You didn’t do anything bad,” TJ shook his head. He wasn’t\ngoing to get mad at her for something like that. </p><p>“Well,” Amber gave him a tight-lipped smile, “that’s when\nBuffy asked me if you liked him. I said I highly doubted it and that you were\njust really cool with Cyrus because he helped you. I switched it on her though.”</p><p>TJ raised an eyebrow at her, “What do you mean?”  </p><p>“I asked her if Cyrus liked you.”</p><p>“Amber!” TJ gasped in horror. Amber let out a laugh and put\nup a pillow in front of her face. “You can’t just ask Buffy things like that!\nShe’s going to think I really do like him.” TJ let out an inhumane groan that\nmade Amber laugh. </p><p>“Well you do,” Amber lowered the pillow to look at TJ’s\nface. He was freaking out. </p><p>“Well I never admitted it,” TJ crossed his arms like a\nlittle kid, making Amber roll her eyes. </p><p>“Come on, TJ. She just told me she didn’t think so and we\nleft it at that, I swear. I doubt she’ll blow it out of proportion.”</p><p>“Did you just meet Buffy?” TJ asked her in disbelief.</p><p>“We both kind of did.”</p><p>“I mean,” TJ rubbed his eyes with his hands in circular\nmotion, starting to hope that he had teleported to another world when he looked\nup again. He didn’t. “Buffy was being weird with Cyrus today, and I feel like\nit’s because of that. If she brings <i>that</i>\nup,” TJ frowned, “it’s going to make everything weird. I just know it.” Amber\njust looked at TJ with a grin that made TJ wanted to roll off her bed.</p><p>“TJ,” she chuckled, “you’re so… awkward. You weren’t like\nthis when you had a crush on Davis and Marc.”</p><p>“Well I was in elementary school so,” TJ shrugged, giving\nAmber a mournful look. Amber was just sitting there, having the time of her\nlife.</p><p>“I thought Marc was early 6<sup>th</sup> grade?” she raised\na brow, bringing her hand to her cheek.</p><p>“Same thing,” TJ grumbled. </p><p>“What makes Cyrus so different that you’re just scared of\nsaying you have a crush on him?”</p><p>“Because,” TJ whispered. He stopped and tried to think of a\nreason. But he really didn’t.</p><p>“Are you scared he might like you back?”</p><p>“God, Amber. I’d be the happiest person if he liked me back.\nBut I don’t even know if he likes guys. Didn’t he date your friend Iris?”</p><p>“That doesn’t mean anything, though.”</p><p>“I just don’t want to scare him off.”</p><p>“You scare everyone but him off. And Buffy. She asked me if\nwe were vampires.”</p><p>“Say yes. Maybe she’ll come put me out of my misery,” TJ moaned.\n</p><p>“You’re such a drama queen,” Amber rolled her eyes. “Just go\nanswer your crush.” TJ got up from her bed and mad his way towards the desk. He\npicked up his phone and sure enough, he had a text from Cyrys.</p><p>Cyrus: Just got off the phone with Buffy. The convo was a\nlittleee bit more intense than expected but we good now </p><p><b>TJ:</b> good. I\nwas getting worried.</p><p><b>TJ:</b> Was it\nanything I did????</p><p><b>Cyrus:</b> I don’t\nthink she liked you denying ur a vampire</p><p><b>TJ:</b>\nshocker. Can drink blood in peace in this town I swear</p><p><b>Cyrus</b>: do\nyou drink tomato juice?</p><p>TJ smiled at his phone screen, laughing at Cyrus’ comments. “Hey,\nTJ,” Amber told him, making him look up. “You don’t have to tell me you have a\ncrush on Cyrus. I think your smile says it all.”</p><p>“Oh, shut up,” TJ rolled his eyes, a small smile breaking\nonto his lips.</p><p><b><i>Well, alright, okay, you win</i></b></p><p><b><i>I’m in love with you</i></b></p><p><b><i>Baby, what can I do?</i></b></p><p><b><i>I’ll do anything you say</i></b></p><p><b><i>It’s just got to be that way</i></b></p><p>-</p><p>It was nearly ten o’clock when Cyrus had told TJ goodnight.\nBefore that, Cyrus had told him he was proud of him for doing his math\nhomework, making TJ feel like a giddy dork on the inside. It felt good to have\nsomeone tell him he was doing good. He hadn’t had a conversation with his\nparents in a few days, so Cyrus and Amber were all he had. </p><p>TJ stood up on his bed and reached for the polaroid of him\nand Cyrus on his ceiling. The second he pulled it off, Amber walked into his room,\nscaring him. TJ quickly sat back down and slid the photo under his pillow. He\nshould’ve given up the minute Amber walked in.</p><p>“What is that?” Amber grinned.</p><p>“What’s what?” TJ furrowed his brows, sitting up and then\nsitting back down on the pillow.  </p><p>“If it’s the polaroid of you two together, you’re whipped,”\nshe laughed and took a seat at his desk. TJ saw no point in hiding it anymore,\nso he let out an audible annoyed huff before moving and taking out the photo. It\nwas the one where they were simply smiling but something about it made him want\nto stare at it forever. They just looked like good friends, and TJ felt like he\nwas okay with that.</p><p>“I think he looks good in this photo,” TJ thought out loud,\nimmediately clasping his hand over his mouth as Amber let out an ‘aww.’ </p><p>“I think it’s cute that you like him,” Amber smiled at him\nas she played with a Rubix cube he had on his desk.</p><p>“Sometimes it doesn’t feel cute,” TJ mumbled. “You know, knowing\nthat nothing can’t ever happen.”</p><p>“You’re so pessimistic, I swear. As soon as you say “no” to\nsomething, you never want to change your mind.”</p><p>“Well, we don’t exactly come from the most optimistic family.\nLet’s see. Nana has seen everyone she loves die and hates most of dad’s side.”</p><p>“She’s a million years, old, okay? Plus, was going to see GG\ndie eventually.”</p><p>“Dad is probably still upset that his heavy metal band never\ngot a break.”</p><p>“They were called the Black Collared Workers, and he had to\nget a day job as a white collared worker. The irony probably hurts him.”</p><p>“Mom didn’t want kids and she got stuck with two of us.”</p><p>“Technically, she could’ve put us up for adoption.”</p><p>“Oh yeah. Because GG was going to let her.”</p><p>“As soon as GG saw I was a girl, he was probably like, ‘Shit.\nI guess I have a new dancing partner. Oh wait? There’s a boy? Hell yeah. Let’s\ngo fishing.’”</p><p>“I still danced with GG,” TJ laughed, smiling at a photo of the\nold man on his ceiling. TJ looked like him a lot. It pleased their Nana who was\ntheir GG’s daughter- mostly because she didn’t want her grandkids to look like\nthe Kippen’s. TJ bit his lip before turning to Amber and asking, “Do you think\nGG would’ve been fine with me being gay?”</p><p>Amber smiled at him, “I think GG would’ve driven us to Pride\nif we asked him. So yeah, TJ. I really do.” TJ gave her a tight-lipped smile\nbefore looking at the photo of Cyrus in his hand.</p><p>“I really like Cyrus, you know?”</p><p>“I know.”</p><p><b><i>All that I am askin’</i></b></p><p><b><i>All I want from you</i></b></p><p><b><i>Is just love me like I love you</i></b></p><p><b><i>And it won’t be hard to do</i></b></p><p><b><i>If you’re going to be my man</i></b></p><p><b><i>Sweet baby, take me by the hand</i></b></p><hr><p>For those who asked to be tagged :)  <a href=\"https://tmblr.co/m9hqVewUt-C1_vL4ENG-nWw\">@magicalcowboycalzonemoney</a> <a href=\"https://tmblr.co/m_4tRoSQ5rXO9yEH965AASA\">@the-greatt-perhaps</a> <a href=\"https://tmblr.co/mrTO_xWDLkyEgi4LFyByJMQ\">@thedampjofangirl</a> <a href=\"https://tmblr.co/mOT_OB-C0YwFAA2cBwIMWXg\">@evaeselgreatest</a></p><p>Let me know if you want to be tagged!</p><p>Also I know my updated are really sporadic right now, but I swear I’ll have a set day where I update once a week in about 2 weeks when I start school. I’m majoring in creative writing, so I know I’ll have a few other stories on my plate :) Thank you for the support so far &lt;3</p><p>Love, Star</p><p><b><a href=\"https://lgbtyrus.tumblr.com/post/178153409194/tjs-playlist-chapter-6\">Next Chapter</a></b></p>",
                "content": "<p><b>Story Summary:</b> When Cyrus finds a playlist on TJ&rsquo;s desktop full of old love songs, he realizes that TJ has never been a scary basketball guy but rather a huge sap. TJ just wished Cyrus could realize that all of those songs remind him of a certain boy who likes chocolate chocolate chip muffins without telling him directly.</p><p>With insecurities and fears almost set in stone, it&rsquo;s hard for TJ to admit that he has a heart aching crush on Cyrus who is trying to avoid just that. Of course, it doesn&rsquo;t seem like both of them are trying to get over each other when they&rsquo;re always together.</p><p><b><a href=\"https://archiveofourown.org/works/15801564/chapters/37213079\">Ao3 Link</a>&nbsp;| <a href=\"https://lgbtyrus.tumblr.com/post/177417182754/tjs-playlist-chapter-1\">Chapter 1 Link&nbsp;</a>| <a href=\"https://lgbtyrus.tumblr.com/post/177784471299/tjs-playlist-chapter-4\">Previous Chapter</a>&nbsp;| <a href=\"https://lgbtyrus.tumblr.com/post/178153409194/tjs-playlist-chapter-6\">Next Chapter</a> |</b></p><p><b>Words:</b> 3264</p><p>&ldquo;Do you like TJ? Like, in more than friends?&rdquo; Buffy asked\nhim.</p><p><i>Anything but that.</i></p><p>&ldquo;Does that really matter right now?&rdquo; Cyrus tried to jump\naround the question. It was a mistake, and he automatically knew it. </p><p>&ldquo;So you do?&rdquo; Buffy almost whispered. Cyrus felt himself turn\nred, and it was an unpleasant feeling that went to his stomach. He really\ndidn&rsquo;t want to talk about it to anyone at all. It had taken forever for him to\nopen up about Jonah, and he certainly didn&rsquo;t want to rush himself into\nadmitting something that could turn out to be something as simple as\nappreciation. </p><p>&ldquo;No, Buffy,&rdquo; Cyrus managed to say, &ldquo;I don&rsquo;t. But even if I\ndid, that shouldn&rsquo;t be important.&rdquo;</p><p>&ldquo;Well,&rdquo; he heard Buffy hesitate, &ldquo;it&rsquo;s important to me. It\nchanges a lot.&rdquo; <i>Change the topic. Change\nthe topic. Change the topic.</i></p><p>&ldquo;Are we talking right now or tomorrow morning? I don&rsquo;t want\nto go to bed fighting with you.&rdquo;</p><p>&ldquo;We&rsquo;re not fighting,&rdquo; Buffy&rsquo;s voice got louder. </p><p>&ldquo;Well it sounds like we&rsquo;re starting to,&rdquo; Cyrus replied, his\ntone matching Buffy&rsquo;s. </p><p>&ldquo;Well, then,&rdquo; Buffy stopped for a few seconds, &ldquo;what do you\nwant to talk about?&rdquo; </p><p>Cyrus plunged right at it and asked her, &ldquo;Do you not like TJ\nand me hanging out? You guys were cool. He hasn&rsquo;t changed. If he has, he&rsquo;s\ngotten a lot better, not worse.&rdquo;</p><p>&ldquo;Answer my first question,&rdquo; Buffy brought it up again,\nmaking Cyrus rub his face in frustration. </p><p><i>Why is she suddenly\nthinking about things like this? I don&rsquo;t even want to think about things like this!</i></p><p>&ldquo;There should be absolutely no correlation between why\nyou&rsquo;ve gone from being on &lsquo;we&rsquo;re cool&rsquo; terms to &lsquo;I hate you again.&rsquo; Please stop\nasking me that question,&rdquo; Cyrus groaned. </p><p>&ldquo;Well if you answered it, I wouldn&rsquo;t have to ask it again.&rdquo;</p><p>&ldquo;You&rsquo;re being really rude, Buffy. Maybe we should just talk\ntomorrow morning.&rdquo;</p><p>&ldquo;No!&rdquo; Buffy suddenly shouted. She stayed silent for a\nfraction of a moment and then continued to speak in her regular voice, &ldquo;Look,\nCyrus. Please just answer that question. It&rsquo;ll help me sort out my feelings.&rdquo;</p><p>&ldquo;What about <i>my</i>\nfeelings?&rdquo; Cyrus found himself asking. He knew he sounded like he was on the\nverge of crying. &ldquo;You think it&rsquo;s not upsetting to see you get worked up over\nsomething as small as me helping TJ with math. You&rsquo;ve done it before. You know\nhe needs help.&rdquo; Buffy didn&rsquo;t answer, so Cyrus asked her, &ldquo;What difference will\nit make if I have a crush on TJ?&rdquo;</p><p>&ldquo;A lot, actually,&rdquo; Buffy replied. &ldquo;If you do, it means he&rsquo;ll\nbe your boyfriend and you&rsquo;re going to pick him over us most of the time.&rdquo; Cyrus\nfelt that if he wanted to, he could&rsquo;ve cried.</p><p>&ldquo;We,&rdquo; Cyrus took a deep breath, sitting down at the edge of\nhis bed, &ldquo;we never told Andi stuff like this.&rdquo;</p><p>&ldquo;Yeah but we were cool with Jonah,&rdquo; Buffy tried to defend\nher stance. Cyrus knew he had her cornered, though. She didn&rsquo;t sound so sure of\nherself.</p><p>&ldquo;Well, you&rsquo;re supposed to be cool with TJ. He rapped for\nyou!&rdquo; Cyrus reminded her. &ldquo;You guys were cool all summer. Nothing should have\nhad changed, Buffy.&rdquo;</p><p>&ldquo;Cyrus,&rdquo; Buffy&rsquo;s voice was the one shaking now, worrying\nCyrus. &ldquo;If you like him and he liked you back, I&rsquo;m so scared he&rsquo;s going to hurt\nyou. He&rsquo;s still not an angel, you know that, right?&rdquo;</p><p>&ldquo;Well, one,&rdquo; Cyrus grumbled, in disbelief that he had to say\nthese things, &ldquo;he&rsquo;s nice to us and especially to me. Two,&rdquo; Cyrus&rsquo; voice was\nraised now as he said, &ldquo;he&rsquo;s the biggest heterosexual in Shadyside! Do you\nthink I want to hurt myself like that again?&rdquo; Buffy stayed quiet. Cyrus lowered\nhis voice, looking over to make sure his door was shut, &ldquo;I&rsquo;m over Jonah. I&rsquo;ve\nbeen. But it still hurt seeing him with Andi when I liked him. At the end of\nthe day, I can&rsquo;t catch feelings for TJ because I&rsquo;ll hurt myself, and I&rsquo;ll\nprobably lose the good friendship we have. But let&rsquo;s face it, Buffy. It&rsquo;s you I\nhave to worry about losing right now.&rdquo;</p><p>&ldquo;Cyrus&hellip;&rdquo;</p><p>&ldquo;I&rsquo;m not going to stop being friends with TJ. He needs me\nright now, and I&rsquo;m going to be there. I want you to be there, too. I want Jonah\nand Andi to be there. If we could get a little less hair gel on him, maybe he\ncould even be part of the Good Hair Crew,&rdquo; Cyrus tried to add in some humor. He\nknew it had worked when he heard Buffy chuckle. &ldquo;Please, Buffy. If you&rsquo;re just\nworried that I&rsquo;m going to, I don&rsquo;t know, fall in love with TJ and he&rsquo;s going to\nhurt me, let it go. Please. I&rsquo;m starting to believe TJ wouldn&rsquo;t even hurt a\nfly. He has a cat named Macaroni for goodness sake!&rdquo;</p><p>&ldquo;Alright,&rdquo; Buffy sighed. &ldquo;I&rsquo;m being dramatic.&rdquo; Cyrus was a\nlittle taken aback. He couldn&rsquo;t believe Buffy was admitting she was wrong, but\nhe wasn&rsquo;t going to rub that in.</p><p>&ldquo;Yeah, you are,&rdquo; Cyrus simply agreed. &ldquo;I&rsquo;d never chose my\nfuture boyfriend over you guys anyways. You know that, right?&rdquo;</p><p>&ldquo;Now I do.&rdquo;</p><p>&ldquo;Okay, there&rsquo;s something else,&rdquo; Cyrus added even though he\nfelt exhausted.</p><p>He heard Buffy groan, &ldquo;There&rsquo;s more?&rdquo;</p><p>&ldquo;Yeah,&rdquo; Cyrus said. &ldquo;It&rsquo;s about Jonah and Andi. I&rsquo;m not\ngoing to meddle into their relationship. They can figure their own stuff out,\nand if they need our opinion, we&rsquo;ll give it to them occasionally.&rdquo;</p><p>&ldquo;Yeah, I agree on that one,&rdquo; Buffy told him.</p><p>&ldquo;Good.&rdquo;</p><p>&ldquo;Good.&rdquo; Cyrus knew there was something missing, but he\nwasn&rsquo;t going to ask Buffy for it. Buffy wasn&rsquo;t going to give it to him either\nway. &ldquo;Anyways, just remember that I love you and you can tell me anything, okay?&rdquo;\nBuffy told him.</p><p>&ldquo;I love you, too,&rdquo; Cyrus finally smiled. &ldquo;Please just be\nhonest next time.&rdquo;</p><p>&ldquo;Yeah, I was being stupid,&rdquo; Buffy said. That was closest\nCyrus was going to get to a &lsquo;sorry.&rsquo; He knew it. </p><p>&ldquo;You&rsquo;re just looking out for me in your own Buffy way,&rdquo;\nCyrus told her, making her let out a quick laugh.</p><p>&ldquo;I really am,&rdquo; she told him. &ldquo;Anyways, good night, Cyrus.&rdquo;</p><p>&ldquo;Goodnight, Buffy,&rdquo; Cyrus said, hanging up. Cyrus fell back\non his bed and looked at his blank ceiling. He didn&rsquo;t think a phone call could\nbe this draining. He sat back up and looked over at the black leathered journal\nsitting on his bedside drawer. He hadn&rsquo;t written about TJ in there yet. He knew\nthat when he did, it meant it was permanent. It meant TJ meant a lot more than\nsomething to him.</p><p><i>It means we&rsquo;re just\nreally good friends </i>Cyrus told himself before standing up and getting the\npolaroid from his cork board. He grabbed a pen and some tape before opening his\njournal.</p><p>-</p><p>TJ was sitting across from Amber on her bed. She was typing\nup an essay while he worked on some of his problems. It took him about ten\nminutes to get through one sometimes. But when he got stuck, he&rsquo;d just have to\ntap Amber&rsquo;s ankle, and she&rsquo;d help him. TJ always told Amber she sucked out all\nthe math abilities from the womb and left him with the random ability to\nremember specific yet mostly irrelevant things. TJ didn&rsquo;t give a damn when\nPangea stopped being Pangea, yet he knew it was 200 million years ago. It\nsometimes pissed him off.</p><p>TJ&rsquo;s phone buzzed next to Amber&rsquo;s on her cluttered desk\nacross the room. It was the only part of her room that still had a lot of\nlittle knick-knacks, mostly things he recognized from their childhood. </p><p>&ldquo;You can&rsquo;t answer it until you&rsquo;re done with your homework,&rdquo;\nshe reminded him of their rule. TJ rolled his eyes and went back to his wrinkled\nmath test. He had a feeling it was Cyrus, and it made him wish he could speed\nthrough math. That was the issue about math. It always had a specific answer.\nHe could go knock on a scientist&rsquo;s door, say <i>fuck you, Pangea broke up 150 million years ago</i>, and it might be\nright if he convinced enough people. But no, math only had one answer. Unless\nit had right two answers, of course. X and Y were the power couple everyone\nhated. Either way, he couldn&rsquo;t guess on a problem. He couldn&rsquo;t fake his way out\nof it.</p><p>He continued to work, finding himself doing problems with\nsomewhat more ease. He had finished that day&rsquo;s homework with Amber&rsquo;s help, and\nhe was redoing the test. Mrs. Pierson said something about letting him retake\nit if he was interested, and he wasn&rsquo;t going to let her or Cyrus down. About\ntwenty minutes after the phone had buzzed, he circled the problems he had\nskipped that even Amber couldn&rsquo;t remember how to solve. There was only a few.\nHe closed the purple highlighter and handed his test to Amber who was finishing\nup her conclusion. </p><p>&ldquo;I can&rsquo;t believe you already have an essay due,&rdquo; he told her\nas he repeatedly smothered his papers into her laptop until she grabbed them. </p><p>&ldquo;I just got one of those English teachers that lives off the\nsouls of tired high school kids, no biggie,&rdquo; she smiled and took the paper. She\nwent over his work for a few minutes while he looked around her room again. It\nwas a lot more empty. </p><p>&ldquo;Your room looks like you&rsquo;re ready to move or something,&rdquo; TJ\ncommented.</p><p>&ldquo;It&rsquo;s just nice to declutter,&rdquo; she told him, as she placed\nhis test on a notebook and began to write on a sticky note. She fixed his\nmistakes on a sticky note so he would be able to go back and fix things. &ldquo;Here,&rdquo;\nshe handed it to him. Almost done. Just that one.&rdquo; TJ fixed the problem and\nstarted putting his things in his backpack. Amber watching him closely the\nwhole time. &ldquo;Are you expecting a text from Cyrus?&rdquo; she asked him, making him\nstop what he was doing. He kept his eyes on his backpack not wanting to turn to\nlook at her. &ldquo;You guys look cute together,&rdquo; she said, making TJ&rsquo;s face heat up.\n</p><p>&ldquo;I just,&rdquo; TJ put up his hand to his mouth, causing Amber to\ngiggle.</p><p>&ldquo;If you just admit that you like him, it&rsquo;ll get easier,&rdquo; she\ntold him gently. &ldquo;I promise.&rdquo; TJ put his hand down and rested them on his lap.\nHe had liked two boys before but neither of them were like Cyrus. Nobody was\nlike Cyrus. He had told Amber about both of them, and he had gotten over them fairly\nquickly without getting hurt terribly. Amber was the only one who knew he liked\nguys. It wasn&rsquo;t that hard for him to hide anyways. Shadyside and all the US\nsociety seemed to have a stereotype for gay people, and he didn&rsquo;t fit the\nmatch. It made things easier, but he often dug in the future and wondered that\nwhen he was out, if people were going to say he didn&rsquo;t &ldquo;look&rdquo; gay.</p><p>Amber was the one that rejected girls that messaged him. He\nfelt like he&rsquo;d be too nice and give them the wrong impression. Amber always\nasked him if anyone wondered why the handsome captain of the basketball team\nhad never had a girlfriend. There were definitely girls who wanted to turn the\nschool bully into a &ldquo;cuddly bunny.&rdquo; At least that&rsquo;s what Amber told him.</p><p>&ldquo;Earth to TJ,&rdquo; Amber snapped her fingers. </p><p>&ldquo;Sorry,&rdquo; he mumbled. </p><p>&ldquo;Look,&rdquo; Amber smiled at him, &ldquo;it&rsquo;s the most obvious thing in\nthe world that you like Cyrus. Even Buffy see&rsquo;s it.&rdquo; TJ&rsquo;s heart skipped.</p><p>He slightly popped his neck as he turned to her, &ldquo;Buffy?&rdquo; </p><p>&ldquo;She texted me and asked me about putting up flyers in The\nSpoon, and we kept talking. I might have ended up sending her the photo where\nyou guys were asleep,&rdquo; she gave him a worried smile, flashing both sets of teeth.\nTJ glared at her and bit his lip. &ldquo;I didn&rsquo;t think it was anything bad,\nhonestly. Like maybe Cyrus had already shown her. It&rsquo;s a cute &lsquo;guys being dudes&rsquo;\npics I&rsquo;m sorry.&rdquo;</p><p>&ldquo;You didn&rsquo;t do anything bad,&rdquo; TJ shook his head. He wasn&rsquo;t\ngoing to get mad at her for something like that. </p><p>&ldquo;Well,&rdquo; Amber gave him a tight-lipped smile, &ldquo;that&rsquo;s when\nBuffy asked me if you liked him. I said I highly doubted it and that you were\njust really cool with Cyrus because he helped you. I switched it on her though.&rdquo;</p><p>TJ raised an eyebrow at her, &ldquo;What do you mean?&rdquo; &nbsp;</p><p>&ldquo;I asked her if Cyrus liked you.&rdquo;</p><p>&ldquo;Amber!&rdquo; TJ gasped in horror. Amber let out a laugh and put\nup a pillow in front of her face. &ldquo;You can&rsquo;t just ask Buffy things like that!\nShe&rsquo;s going to think I really do like him.&rdquo; TJ let out an inhumane groan that\nmade Amber laugh. </p><p>&ldquo;Well you do,&rdquo; Amber lowered the pillow to look at TJ&rsquo;s\nface. He was freaking out. </p><p>&ldquo;Well I never admitted it,&rdquo; TJ crossed his arms like a\nlittle kid, making Amber roll her eyes. </p><p>&ldquo;Come on, TJ. She just told me she didn&rsquo;t think so and we\nleft it at that, I swear. I doubt she&rsquo;ll blow it out of proportion.&rdquo;</p><p>&ldquo;Did you just meet Buffy?&rdquo; TJ asked her in disbelief.</p><p>&ldquo;We both kind of did.&rdquo;</p><p>&ldquo;I mean,&rdquo; TJ rubbed his eyes with his hands in circular\nmotion, starting to hope that he had teleported to another world when he looked\nup again. He didn&rsquo;t. &ldquo;Buffy was being weird with Cyrus today, and I feel like\nit&rsquo;s because of that. If she brings <i>that</i>\nup,&rdquo; TJ frowned, &ldquo;it&rsquo;s going to make everything weird. I just know it.&rdquo; Amber\njust looked at TJ with a grin that made TJ wanted to roll off her bed.</p><p>&ldquo;TJ,&rdquo; she chuckled, &ldquo;you&rsquo;re so&hellip; awkward. You weren&rsquo;t like\nthis when you had a crush on Davis and Marc.&rdquo;</p><p>&ldquo;Well I was in elementary school so,&rdquo; TJ shrugged, giving\nAmber a mournful look. Amber was just sitting there, having the time of her\nlife.</p><p>&ldquo;I thought Marc was early 6<sup>th</sup> grade?&rdquo; she raised\na brow, bringing her hand to her cheek.</p><p>&ldquo;Same thing,&rdquo; TJ grumbled. </p><p>&ldquo;What makes Cyrus so different that you&rsquo;re just scared of\nsaying you have a crush on him?&rdquo;</p><p>&ldquo;Because,&rdquo; TJ whispered. He stopped and tried to think of a\nreason. But he really didn&rsquo;t.</p><p>&ldquo;Are you scared he might like you back?&rdquo;</p><p>&ldquo;God, Amber. I&rsquo;d be the happiest person if he liked me back.\nBut I don&rsquo;t even know if he likes guys. Didn&rsquo;t he date your friend Iris?&rdquo;</p><p>&ldquo;That doesn&rsquo;t mean anything, though.&rdquo;</p><p>&ldquo;I just don&rsquo;t want to scare him off.&rdquo;</p><p>&ldquo;You scare everyone but him off. And Buffy. She asked me if\nwe were vampires.&rdquo;</p><p>&ldquo;Say yes. Maybe she&rsquo;ll come put me out of my misery,&rdquo; TJ moaned.\n</p><p>&ldquo;You&rsquo;re such a drama queen,&rdquo; Amber rolled her eyes. &ldquo;Just go\nanswer your crush.&rdquo; TJ got up from her bed and mad his way towards the desk. He\npicked up his phone and sure enough, he had a text from Cyrys.</p><p>Cyrus: Just got off the phone with Buffy. The convo was a\nlittleee bit more intense than expected but we good now </p><p><b>TJ:</b> good. I\nwas getting worried.</p><p><b>TJ:</b> Was it\nanything I did????</p><p><b>Cyrus:</b> I don&rsquo;t\nthink she liked you denying ur a vampire</p><p><b>TJ:</b>\nshocker. Can drink blood in peace in this town I swear</p><p><b>Cyrus</b>: do\nyou drink tomato juice?</p><p>TJ smiled at his phone screen, laughing at Cyrus&rsquo; comments. &ldquo;Hey,\nTJ,&rdquo; Amber told him, making him look up. &ldquo;You don&rsquo;t have to tell me you have a\ncrush on Cyrus. I think your smile says it all.&rdquo;</p><p>&ldquo;Oh, shut up,&rdquo; TJ rolled his eyes, a small smile breaking\nonto his lips.</p><p><b><i>Well, alright, okay, you win</i></b></p><p><b><i>I&rsquo;m in love with you</i></b></p><p><b><i>Baby, what can I do?</i></b></p><p><b><i>I&rsquo;ll do anything you say</i></b></p><p><b><i>It&rsquo;s just got to be that way</i></b></p><p>-</p><p>It was nearly ten o&rsquo;clock when Cyrus had told TJ goodnight.\nBefore that, Cyrus had told him he was proud of him for doing his math\nhomework, making TJ feel like a giddy dork on the inside. It felt good to have\nsomeone tell him he was doing good. He hadn&rsquo;t had a conversation with his\nparents in a few days, so Cyrus and Amber were all he had. </p><p>TJ stood up on his bed and reached for the polaroid of him\nand Cyrus on his ceiling. The second he pulled it off, Amber walked into his room,\nscaring him. TJ quickly sat back down and slid the photo under his pillow. He\nshould&rsquo;ve given up the minute Amber walked in.</p><p>&ldquo;What is that?&rdquo; Amber grinned.</p><p>&ldquo;What&rsquo;s what?&rdquo; TJ furrowed his brows, sitting up and then\nsitting back down on the pillow. &nbsp;</p><p>&ldquo;If it&rsquo;s the polaroid of you two together, you&rsquo;re whipped,&rdquo;\nshe laughed and took a seat at his desk. TJ saw no point in hiding it anymore,\nso he let out an audible annoyed huff before moving and taking out the photo. It\nwas the one where they were simply smiling but something about it made him want\nto stare at it forever. They just looked like good friends, and TJ felt like he\nwas okay with that.</p><p>&ldquo;I think he looks good in this photo,&rdquo; TJ thought out loud,\nimmediately clasping his hand over his mouth as Amber let out an &lsquo;aww.&rsquo; </p><p>&ldquo;I think it&rsquo;s cute that you like him,&rdquo; Amber smiled at him\nas she played with a Rubix cube he had on his desk.</p><p>&ldquo;Sometimes it doesn&rsquo;t feel cute,&rdquo; TJ mumbled. &ldquo;You know, knowing\nthat nothing can&rsquo;t ever happen.&rdquo;</p><p>&ldquo;You&rsquo;re so pessimistic, I swear. As soon as you say &ldquo;no&rdquo; to\nsomething, you never want to change your mind.&rdquo;</p><p>&ldquo;Well, we don&rsquo;t exactly come from the most optimistic family.\nLet&rsquo;s see. Nana has seen everyone she loves die and hates most of dad&rsquo;s side.&rdquo;</p><p>&ldquo;She&rsquo;s a million years, old, okay? Plus, was going to see GG\ndie eventually.&rdquo;</p><p>&ldquo;Dad is probably still upset that his heavy metal band never\ngot a break.&rdquo;</p><p>&ldquo;They were called the Black Collared Workers, and he had to\nget a day job as a white collared worker. The irony probably hurts him.&rdquo;</p><p>&ldquo;Mom didn&rsquo;t want kids and she got stuck with two of us.&rdquo;</p><p>&ldquo;Technically, she could&rsquo;ve put us up for adoption.&rdquo;</p><p>&ldquo;Oh yeah. Because GG was going to let her.&rdquo;</p><p>&ldquo;As soon as GG saw I was a girl, he was probably like, &lsquo;Shit.\nI guess I have a new dancing partner. Oh wait? There&rsquo;s a boy? Hell yeah. Let&rsquo;s\ngo fishing.&rsquo;&rdquo;</p><p>&ldquo;I still danced with GG,&rdquo; TJ laughed, smiling at a photo of the\nold man on his ceiling. TJ looked like him a lot. It pleased their Nana who was\ntheir GG&rsquo;s daughter- mostly because she didn&rsquo;t want her grandkids to look like\nthe Kippen&rsquo;s. TJ bit his lip before turning to Amber and asking, &ldquo;Do you think\nGG would&rsquo;ve been fine with me being gay?&rdquo;</p><p>Amber smiled at him, &ldquo;I think GG would&rsquo;ve driven us to Pride\nif we asked him. So yeah, TJ. I really do.&rdquo; TJ gave her a tight-lipped smile\nbefore looking at the photo of Cyrus in his hand.</p><p>&ldquo;I really like Cyrus, you know?&rdquo;</p><p>&ldquo;I know.&rdquo;</p><p><b><i>All that I am askin&rsquo;</i></b></p><p><b><i>All I want from you</i></b></p><p><b><i>Is just love me like I love you</i></b></p><p><b><i>And it won&rsquo;t be hard to do</i></b></p><p><b><i>If you&rsquo;re going to be my man</i></b></p><p><b><i>Sweet baby, take me by the hand</i></b></p><hr /><p>For those who asked to be tagged :)&nbsp; <a href=\"https://tmblr.co/m9hqVewUt-C1_vL4ENG-nWw\">@magicalcowboycalzonemoney</a> <a href=\"https://tmblr.co/m_4tRoSQ5rXO9yEH965AASA\">@the-greatt-perhaps</a> <a href=\"https://tmblr.co/mrTO_xWDLkyEgi4LFyByJMQ\">@thedampjofangirl</a> <a href=\"https://tmblr.co/mOT_OB-C0YwFAA2cBwIMWXg\">@evaeselgreatest</a></p><p>Let me know if you want to be tagged!</p><p>Also I know my updated are really sporadic right now, but I swear I&rsquo;ll have a set day where I update once a week in about 2 weeks when I start school. I&rsquo;m majoring in creative writing, so I know I&rsquo;ll have a few other stories on my plate :) Thank you for the support so far &lt;3</p><p>Love, Star</p><p><b><a href=\"https://lgbtyrus.tumblr.com/post/178153409194/tjs-playlist-chapter-6\">Next Chapter</a></b></p>",
                "content_abstract": "<p>\n<p><b>Story Summary:</b> When Cyrus finds a playlist on TJ&rsquo;s desktop full of old love songs, he realizes that TJ has never been a scary basketball guy but rather a huge sap. TJ just wished Cyrus could realize that all of those songs remind him of a certain boy who likes chocolate chocolate chip muffins without telling him directly.</p>\n<p>With insecurities and fears almost set in stone, it&rsquo;s hard for TJ to admit that he has a heart aching crush on Cyrus who is trying to avoid just that. Of course, it doesn&rsquo;t seem like both of them are trying to get over each other when they&rsquo;re always together.</p>\n<p><b><a href=\"https://archiveofourown.org/works/15801564/chapters/37213079\">Ao3 Link</a>&nbsp;| <a href=\"https://lgbtyrus.tumblr.com/post/177417182754/tjs-playlist-chapter-1\">Chapter 1 Link&nbsp;</a>| <a href=\"https://lgbtyrus.tumblr.com/post/177784471299/tjs-playlist-chapter-4\">Previous Chapter</a>&nbsp;| <a href=\"https://lgbtyrus.tumblr.com/post/178153409194/tjs-playlist-chapter-6\">Next Chapter</a> |</b></p>\n<p><b>Words:</b> 3264</p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "chat",
        "blog_name": "jose-fine-fridapettersen",
        "blog": {
            "name": "jose-fine-fridapettersen",
            "title": "this is a title",
            "description": "<p>m | 19 | messy | i like a lot of things but noora will own my ass forever probably</p>",
            "url": "https://jose-fine-fridapettersen.tumblr.com/",
            "uuid": "t:DSwVYTQwnHOWVl_3NOjiWA",
            "updated": 1561148126
        },
        "id": 177953516177,
        "post_url": "https://jose-fine-fridapettersen.tumblr.com/post/177953516177/me-im-in-college-now-im-an-adult-doing-adult",
        "slug": "me-im-in-college-now-im-an-adult-doing-adult",
        "date": "2018-09-10 22:06:11 GMT",
        "timestamp": 1536617171,
        "state": "published",
        "format": "html",
        "reblog_key": "KS9XJKoT",
        "tags": [
            "this is a true story",
            "it happened this morning and it was a damn good muffin",
            "so honestly no regrets",
            "also i love my lil son",
            "andi mack",
            "cyrus goodman",
            "tyrus",
            "100"
        ],
        "short_url": "https://tmblr.co/ZHHvlu2bksogH",
        "summary": "me: i’m in college now. i’m an adult doing adult things and i don’t have time for some kid’s show.\nalso me, grabbing a chocolate...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 377,
        "title": null,
        "body": "me: i’m in college now. i’m an adult doing adult things and i don’t have time for some kid’s show.\nalso me, grabbing a chocolate chocolate chip muffin from the caf: for cyrus",
        "dialogue": [
            {
                "name": "me",
                "label": "me:",
                "phrase": "i’m in college now. i’m an adult doing adult things and i don’t have time for some kid’s show."
            },
            {
                "name": "also me, grabbing a chocolate chocolate chip muffin from the caf",
                "label": "also me, grabbing a chocolate chocolate chip muffin from the caf:",
                "phrase": "for cyrus"
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "emmybbygryll",
        "blog": {
            "name": "emmybbygryll",
            "title": "andi mack!",
            "description": "<p>emma, 17, scorpio, disaster bi</p><p>definitely an andi mack blog</p><p>(likes/follows/replies come from artyearthy)</p>",
            "url": "https://emmybbygryll.tumblr.com/",
            "uuid": "t:lc67lgkMwHgucUu2G4iqjQ",
            "updated": 1561183226
        },
        "id": 177953264798,
        "post_url": "https://emmybbygryll.tumblr.com/post/177953264798/the-biggest-struggle-is-having-a-hc-that-buffy-is",
        "slug": "the-biggest-struggle-is-having-a-hc-that-buffy-is",
        "date": "2018-09-10 21:58:01 GMT",
        "timestamp": 1536616681,
        "state": "published",
        "format": "html",
        "reblog_key": "VwB5KBuT",
        "tags": [
            "andi mack",
            "buffy driscoll",
            "muffy",
            "my brain is so confused"
        ],
        "short_url": "https://tmblr.co/ZIo1bb2bkrrIU",
        "summary": "the biggest struggle is having a hc that buffy is a lesbian but also hardcore shipping muffy :///",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 48,
        "title": null,
        "body": "<p>the biggest struggle is having a hc that buffy is a lesbian but also hardcore shipping muffy :///</p>",
        "reblog": {
            "comment": "<p>the biggest struggle is having a hc that buffy is a lesbian but also hardcore shipping muffy :///</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "emmybbygryll",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 530,
                        "header_focus_width": 942,
                        "header_focus_height": 530,
                        "avatar_shape": "circle",
                        "background_color": "#CBD3E7",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1130,530,188",
                        "header_image": "https://static.tumblr.com/1d34658362fc66021545a38e20cdcf1b/zpxyseb/H5opdqp95/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/1d34658362fc66021545a38e20cdcf1b/zpxyseb/mIzpdqp96/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/1d34658362fc66021545a38e20cdcf1b/zpxyseb/H5opdqp95/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#6F6E87",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#2A3857",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177953264798"
                },
                "content_raw": "<p>the biggest struggle is having a hc that buffy is a lesbian but also hardcore shipping muffy :///</p>",
                "content": "<p>the biggest struggle is having a hc that buffy is a lesbian but also hardcore shipping muffy :///</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "flashprotectionsquad",
        "blog": {
            "name": "flashprotectionsquad",
            "title": "Flash Protectrion Squad",
            "description": "",
            "url": "https://flashprotectionsquad.tumblr.com/",
            "uuid": "t:jZP11WvSK9eiVFQZF3JMSg",
            "updated": 1561667387
        },
        "id": 177952832852,
        "post_url": "https://flashprotectionsquad.tumblr.com/post/177952832852/my-biggest-headcanon-about-why-tj-was-such-a-jerk",
        "slug": "my-biggest-headcanon-about-why-tj-was-such-a-jerk",
        "date": "2018-09-10 21:43:10 GMT",
        "timestamp": 1536615790,
        "state": "published",
        "format": "html",
        "reblog_key": "i0z9eJJ6",
        "tags": [
            "andi mack",
            "tj",
            "tj kippen",
            "buffy",
            "buffy driscoll",
            "Marty",
            "Marty from the party",
            "cyrus goodman",
            "Cyrus",
            "Tyrus",
            "Tarty ?",
            "Tj x Marty",
            "MJ ?"
        ],
        "short_url": "https://tmblr.co/ZdFa_l2bkqBrK",
        "summary": "My biggest headcanon about why TJ was such a jerk towards Buffy",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 475,
        "title": "My biggest headcanon about why TJ was such a jerk towards Buffy",
        "body": "<p>Remember how Marty wanted to be on the basketball team and didn’t ? And Buffy did even tho she’s a girl ?</p><p><br/></p><p>What if Tj had a crush on Marty from the Party and was angry that Buffy “took his place” on the team ? And WORST when he knew that Marty was in love with her ?</p><p><br/></p><p>I don’t give a damn, Marty is TJ’s gay awakening, before even Cyrus, I’ll fight you.</p>",
        "reblog": {
            "comment": "<p>Remember how Marty wanted to be on the basketball team and didn’t ? And Buffy did even tho she’s a girl ?</p><p><br></p><p>What if Tj had a crush on Marty from the Party and was angry that Buffy “took his place” on the team ? And WORST when he knew that Marty was in love with her ?</p><p><br></p><p>I don’t give a damn, Marty is TJ’s gay awakening, before even Cyrus, I’ll fight you.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "flashprotectionsquad",
                    "active": true,
                    "theme": {
                        "header_full_width": 1920,
                        "header_full_height": 794,
                        "header_focus_width": 1411,
                        "header_focus_height": 794,
                        "avatar_shape": "circle",
                        "background_color": "#ffe033",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1554,794,143",
                        "header_image": "https://static.tumblr.com/2ed3c6d5329afd32b6c26ad2459c84cb/zwy0ib3/fLPplqpb9/tumblr_static_cn2vl6sgr6gck04g40ksgg44o.jpg",
                        "header_image_focused": "https://static.tumblr.com/565eaf8898381fece1edae9c24b525ff/zwy0ib3/3y0plqpf0/tumblr_static_tumblr_static_cn2vl6sgr6gck04g40ksgg44o_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/2ed3c6d5329afd32b6c26ad2459c84cb/zwy0ib3/fLPplqpb9/tumblr_static_cn2vl6sgr6gck04g40ksgg44o_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#213f52",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#213f52",
                        "title_font": "Streetscript",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177952832852"
                },
                "content_raw": "<p>Remember how Marty wanted to be on the basketball team and didn’t ? And Buffy did even tho she’s a girl ?</p><p><br></p><p>What if Tj had a crush on Marty from the Party and was angry that Buffy “took his place” on the team ? And WORST when he knew that Marty was in love with her ?</p><p><br></p><p>I don’t give a damn, Marty is TJ’s gay awakening, before even Cyrus, I’ll fight you.</p>",
                "content": "<p>Remember how Marty wanted to be on the basketball team and didn&rsquo;t ? And Buffy did even tho she&rsquo;s a girl ?</p><p><br /></p><p>What if Tj had a crush on Marty from the Party and was angry that Buffy &ldquo;took his place&rdquo; on the team ? And WORST when he knew that Marty was in love with her ?</p><p><br /></p><p>I don&rsquo;t give a damn, Marty is TJ&rsquo;s gay awakening, before even Cyrus, I&rsquo;ll fight you.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "cantouttuffthebuff",
        "blog": {
            "name": "cantouttuffthebuff",
            "title": "Lilén",
            "description": "Lilén | 16 | 🇦🇷 | Bi | Usually go by she/her but any pronouns are fine! | Professional shitposter",
            "url": "https://cantouttuffthebuff.tumblr.com/",
            "uuid": "t:L7kxi-YQts2q-N_xObaJ7w",
            "updated": 1556581879
        },
        "id": 177952688408,
        "post_url": "https://cantouttuffthebuff.tumblr.com/post/177952688408/jonah-how-do-you-keep-your-pants-up-when-youre",
        "slug": "jonah-how-do-you-keep-your-pants-up-when-youre",
        "date": "2018-09-10 21:38:25 GMT",
        "timestamp": 1536615505,
        "state": "published",
        "format": "html",
        "reblog_key": "6JmwspZQ",
        "tags": [
            "andi mack",
            "jonah beck",
            "tj kippen",
            "incorrect andi mack",
            "andi mack as vines"
        ],
        "short_url": "https://tmblr.co/ZcNRcZ2bkpeaO",
        "summary": "Jonah: How do you keep your pants up when you're performing? It's incredible\nTJ:\nTJ:\nTJ: Belt",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 35,
        "title": null,
        "body": "<p><b>Jonah: </b>How do you keep your pants up when you&rsquo;re performing? It&rsquo;s incredible</p><p><b>TJ:</b></p><p><b><span style=\"color: #444444\">TJ</span>:</b></p><p><b>TJ: </b>Belt</p>",
        "reblog": {
            "comment": "<p><b>Jonah: </b>How do you keep your pants up when you’re performing? It’s incredible</p><p><b>TJ:</b></p><p><b><span style=\"color: #444444\">TJ</span>:</b></p><p><b>TJ: </b>Belt</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "cantouttuffthebuff",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/758574fdf349e0b6f1b5d9069c690e97/8pcd7zb/EU2pdif4w/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/758574fdf349e0b6f1b5d9069c690e97/8pcd7zb/EU2pdif4w/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/758574fdf349e0b6f1b5d9069c690e97/8pcd7zb/EU2pdif4w/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#BAE9DE",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#BAE9DE",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177952688408"
                },
                "content_raw": "<p><b>Jonah: </b>How do you keep your pants up when you’re performing? It’s incredible</p><p><b>TJ:</b></p><p><b><span style=\"color: #444444\">TJ</span>:</b></p><p><b>TJ: </b>Belt</p>",
                "content": "<p><b>Jonah: </b>How do you keep your pants up when you&rsquo;re performing? It&rsquo;s incredible</p><p><b>TJ:</b></p><p><b><span style=\"color: #444444\">TJ</span>:</b></p><p><b>TJ: </b>Belt</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "raf-solano",
        "blog": {
            "name": "raf-solano",
            "title": "i was feeling epic.",
            "description": "glo | she/her | 20 | asian-american | vidder | multifandom af | sidebar: dailyjtvgifs | icon: rafael-solano",
            "url": "https://raf-solano.tumblr.com/",
            "uuid": "t:fwUT5vcm2fznyN6mN-19kA",
            "updated": 1561770030
        },
        "id": 177952396472,
        "post_url": "https://raf-solano.tumblr.com/post/177952396472/first-the-disneynow-app-got-rid-of-s1-but-now",
        "slug": "first-the-disneynow-app-got-rid-of-s1-but-now",
        "date": "2018-09-10 21:28:36 GMT",
        "timestamp": 1536614916,
        "state": "published",
        "format": "html",
        "reblog_key": "VuurPMUc",
        "tags": [
            "andi mack"
        ],
        "short_url": "https://tmblr.co/ZYpOir2bkoXIu",
        "summary": "First the DisneyNOW app got rid of S1 but now 2x15-2x16 is missing as well??? WTF? Who is in charge?! They’re so incompetent",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 43,
        "title": null,
        "body": "<p>First the DisneyNOW app got rid of S1 but now 2x15-2x16 is missing as well??? WTF? Who is in charge?! They’re so incompetent </p>",
        "reblog": {
            "comment": "<p>First the DisneyNOW app got rid of S1 but now 2x15-2x16 is missing as well??? WTF? Who is in charge?! They’re so incompetent </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "raf-solano",
                    "active": true,
                    "theme": {
                        "header_full_width": 245,
                        "header_full_height": 136,
                        "header_focus_width": 242,
                        "header_focus_height": 136,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,243,136,1",
                        "header_image": "https://static.tumblr.com/e3234f94c6c9ea15fff8359bd62e10a1/j67mwxm/ubBpqnoqs/tumblr_static_7n3edsmyynks4ckcw4ccww8ks.gif",
                        "header_image_focused": "https://static.tumblr.com/e3234f94c6c9ea15fff8359bd62e10a1/j67mwxm/rnOpqnoqv/tumblr_static_tumblr_static_7n3edsmyynks4ckcw4ccww8ks_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/e3234f94c6c9ea15fff8359bd62e10a1/j67mwxm/ubBpqnoqs/tumblr_static_7n3edsmyynks4ckcw4ccww8ks_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#888888",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#888888",
                        "title_font": "Caslon FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177952396472"
                },
                "content_raw": "<p>First the DisneyNOW app got rid of S1 but now 2x15-2x16 is missing as well??? WTF? Who is in charge?! They’re so incompetent </p>",
                "content": "<p>First the DisneyNOW app got rid of S1 but now 2x15-2x16 is missing as well??? WTF? Who is in charge?! They&rsquo;re so incompetent </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "antimack",
        "blog": {
            "name": "antimack",
            "title": "Underdog",
            "description": "<p>Anthony / 18 / He, him / Gay / major Tyrus fan / hopeless romantic</p>",
            "url": "https://antimack.tumblr.com/",
            "uuid": "t:FR8M1lq5G2oVjtX1MDakSw",
            "updated": 1561683949
        },
        "id": 177952396970,
        "post_url": "https://antimack.tumblr.com/post/177952396970/cyrus-youre-such-a-dream-to-me",
        "slug": "cyrus-youre-such-a-dream-to-me",
        "date": "2018-09-10 21:28:34 GMT",
        "timestamp": 1536614914,
        "state": "published",
        "format": "html",
        "reblog_key": "ZZQBbvMo",
        "tags": [
            "cyrus goodman",
            "tyrus",
            "andi mack"
        ],
        "short_url": "https://tmblr.co/ZxuyXl2bkoXQg",
        "summary": "Cyrus: You’re such a dream to me",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 29,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Cyrus:</b> You’re such a dream to me </p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Cyrus:</b> You’re such a dream to me </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "antimack",
                    "active": true,
                    "theme": {
                        "header_full_width": 1920,
                        "header_full_height": 1200,
                        "header_focus_width": 1567,
                        "header_focus_height": 882,
                        "avatar_shape": "square",
                        "background_color": "#29574D",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "159,1744,1041,177",
                        "header_image": "https://static.tumblr.com/ee39f44c727078add907d05592aa972e/dsrhod4/PTiobrh0f/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/ee39f44c727078add907d05592aa972e/dsrhod4/dvCobrh0i/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/ee39f44c727078add907d05592aa972e/dsrhod4/PTiobrh0f/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FF3E3E",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Bookmania",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177952396970"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Cyrus:</b> You’re such a dream to me </p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Cyrus:</b> You&rsquo;re such a dream to me </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "kateegustafson",
        "blog": {
            "name": "kateegustafson",
            "title": "Katherine Gustafson",
            "description": "Twitter, Instagram, and Snapchat @kateegustafson",
            "url": "https://kateegustafson.tumblr.com/",
            "uuid": "t:gc2Y1c4lqW58f2drZ3V9eg",
            "updated": 1561765705
        },
        "id": 177951970924,
        "post_url": "https://kateegustafson.tumblr.com/post/177951970924/okay-why-the-fuck-cant-i-open-andis-texts",
        "slug": "okay-why-the-fuck-cant-i-open-andis-texts",
        "date": "2018-09-10 21:14:30 GMT",
        "timestamp": 1536614070,
        "state": "published",
        "format": "html",
        "reblog_key": "DJnIpcLC",
        "tags": [
            "this happens every time",
            "why",
            "andi mack",
            "cyrus goodman",
            "buffy driscoll",
            "jonah beck",
            "the good hair crew",
            "tj kippen",
            "marty from the party",
            "walker brodsky",
            "jyrus",
            "tyrus",
            "walrus",
            "wandi",
            "jandi",
            "ambi",
            "bandi",
            "tuffy",
            "muffy",
            "juffy",
            "wuffy",
            "amber kippen",
            "amber brown",
            "the kippen twins",
            "disney",
            "disney channel",
            "disney go"
        ],
        "short_url": "https://tmblr.co/ZtQc1c2bkmvPi",
        "summary": "okay why the FUCK can’t I open Andi’s texts",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 69,
        "title": null,
        "body": "<p>okay why the FUCK can’t I open Andi’s texts </p><figure class=\"tmblr-full\" data-orig-height=\"306\" data-orig-width=\"306\"><img src=\"https://66.media.tumblr.com/d7cf08466d29ce16ceace845f9bfdcaf/tumblr_peuz064DGQ1vrb9zu_540.gif\" data-orig-height=\"306\" data-orig-width=\"306\"/></figure>",
        "reblog": {
            "comment": "<p><p>okay why the FUCK can’t I open Andi’s texts </p><figure class=\"tmblr-full\" data-orig-height=\"306\" data-orig-width=\"306\"><img src=\"https://66.media.tumblr.com/d7cf08466d29ce16ceace845f9bfdcaf/tumblr_peuz064DGQ1vrb9zu_540.gif\" data-orig-height=\"306\" data-orig-width=\"306\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "kateegustafson",
                    "active": true,
                    "theme": {
                        "header_full_width": 960,
                        "header_full_height": 1280,
                        "header_focus_width": 798,
                        "header_focus_height": 449,
                        "avatar_shape": "circle",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "33,885,482,87",
                        "header_image": "https://static.tumblr.com/f6690737170d4e939956f643cd09cddd/pwf89ic/Kcxpgeigv/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/f6690737170d4e939956f643cd09cddd/pwf89ic/4mspgeigx/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f6690737170d4e939956f643cd09cddd/pwf89ic/Kcxpgeigv/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#385C92",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177951970924"
                },
                "content_raw": "<p><p>okay why the FUCK can’t I open Andi’s texts </p><figure class=\"tmblr-full\" data-orig-height=\"306\" data-orig-width=\"306\"><img src=\"https://66.media.tumblr.com/d7cf08466d29ce16ceace845f9bfdcaf/tumblr_peuz064DGQ1vrb9zu_540.gif\" data-orig-height=\"306\" data-orig-width=\"306\"></figure></p>",
                "content": "<p><p>okay why the FUCK can&rsquo;t I open Andi&rsquo;s texts </p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d7cf08466d29ce16ceace845f9bfdcaf/tumblr_peuz064DGQ1vrb9zu_540.gif\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "exaltedviolinist",
        "blog": {
            "name": "exaltedviolinist",
            "title": "Everything stays",
            "description": "Max│♂│20│Bisexual│Canadian Italian ║ Andi Mack│Brooklyn 99│9-1-1│The Legend of Korra│Pride & Prejudice│Children of Blood and Bone│Fire Emblem",
            "url": "https://exaltedviolinist.tumblr.com/",
            "uuid": "t:DvN0x50BKqtCz1xawO9yrQ",
            "updated": 1561764892
        },
        "id": 177951683722,
        "post_url": "https://exaltedviolinist.tumblr.com/post/177951683722/jyrus-month-day-10-%F0%9D%99%B9%F0%9D%9A%A2%F0%9D%9A%9B%F0%9D%9A%9E%F0%9D%9A%9C-%F0%9D%9A%82%F0%9D%9A%98%F0%9D%9A%97%F0%9D%9A%90-take-my-hand",
        "slug": "jyrus-month-day-10-𝙹𝚢𝚛𝚞𝚜-𝚂𝚘𝚗𝚐-take-my-hand",
        "date": "2018-09-10 21:04:53 GMT",
        "timestamp": 1536613493,
        "state": "published",
        "format": "html",
        "reblog_key": "aW3psLm4",
        "tags": [
            "jyrus",
            "jyrus month",
            "jonah beck",
            "cyrus goodman",
            "andi mack",
            "otp"
        ],
        "short_url": "https://tmblr.co/Zb2JMq2bklpIA",
        "summary": "JYRUS MONTH - DAY 10 𝙹𝚢𝚛𝚞𝚜 𝚂𝚘𝚗𝚐 Take My Hand - Simple Plan The raindrops, the tears keep falling. I see your face and it keeps...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 11,
        "title": null,
        "body": "<p><b>JYRUS MONTH - DAY 10</b></p><blockquote><p>𝙹𝚢𝚛𝚞𝚜 𝚂𝚘𝚗𝚐</p></blockquote><p><b><a href=\"https://www.youtube.com/watch?v=1s2Lgc6yVno\" target=\"_blank\">Take My Hand - Simple Plan</a></b></p><blockquote><p><i>The raindrops, the tears keep falling.<br/>I see your face and it keeps me going.<br/>If I get lost, your light’s going to guide me.<br/>And I know that you can take me <b>home</b>.</i></p></blockquote>",
        "reblog": {
            "comment": "<p><p><b>JYRUS MONTH - DAY 10</b></p><blockquote><p>𝙹𝚢𝚛𝚞𝚜 𝚂𝚘𝚗𝚐</p></blockquote><p><b><a href=\"https://www.youtube.com/watch?v=1s2Lgc6yVno\" target=\"_blank\">Take My Hand - Simple Plan</a></b></p><blockquote><p><i>The raindrops, the tears keep falling.<br>I see your face and it keeps me going.<br>If I get lost, your light’s going to guide me.<br>And I know that you can take me <b>home</b>.</i></p></blockquote></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "exaltedviolinist",
                    "active": true,
                    "theme": {
                        "header_full_width": 933,
                        "header_full_height": 524,
                        "header_focus_width": 932,
                        "header_focus_height": 524,
                        "avatar_shape": "square",
                        "background_color": "#ffffff",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,932,524,0",
                        "header_image": "https://static.tumblr.com/6390e1963d48da5214542b6e89b4ed6b/fbffqxm/JYRphksmh/tumblr_static_96s6jdiqh544wcscgs4gs8ckg.png",
                        "header_image_focused": "https://static.tumblr.com/6390e1963d48da5214542b6e89b4ed6b/fbffqxm/fVrpm0l1z/tumblr_static_tumblr_static_96s6jdiqh544wcscgs4gs8ckg_focused_v3.png",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_06_focused_v3.png?_v=c5e9c9bdca5f67be80d91514a36509cc",
                        "header_stretch": true,
                        "link_color": "#EEEEEE",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "1785 GLC Baskerville",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177951683722"
                },
                "content_raw": "<p><p><b>JYRUS MONTH - DAY 10</b></p><blockquote><p>𝙹𝚢𝚛𝚞𝚜 𝚂𝚘𝚗𝚐</p></blockquote><p><b><a href=\"https://www.youtube.com/watch?v=1s2Lgc6yVno\" target=\"_blank\">Take My Hand - Simple Plan</a></b></p><blockquote><p><i>The raindrops, the tears keep falling.<br>I see your face and it keeps me going.<br>If I get lost, your light’s going to guide me.<br>And I know that you can take me <b>home</b>.</i></p></blockquote></p>",
                "content": "<p><p><b>JYRUS MONTH - DAY 10</b></p><blockquote><p>&#120441;&#120482;&#120475;&#120478;&#120476; &#120450;&#120472;&#120471;&#120464;</p></blockquote><p><b><a href=\"https://www.youtube.com/watch?v=1s2Lgc6yVno\" target=\"_blank\">Take My Hand - Simple Plan</a></b></p><blockquote><p><i>The raindrops, the tears keep falling.<br />I see your face and it keeps me going.<br />If I get lost, your light&rsquo;s going to guide me.<br />And I know that you can take me <b>home</b>.</i></p></blockquote></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "heyoricohannah",
        "blog": {
            "name": "heyoricohannah",
            "title": "“I’m pretty petty and that’s a pity”",
            "description": "<p><a href=\"http://archiveofourown.org/users/hudstrige1\">http://archiveofourown.org/users/</a></p><p><a href=\"http://archiveofourown.org/users/hudstrige1\">Hudstrige1</a></p>",
            "url": "https://heyoricohannah.tumblr.com/",
            "uuid": "t:zlriIpsLWYGIwux3XXfcog",
            "updated": 1561771144
        },
        "id": 177951657981,
        "post_url": "https://heyoricohannah.tumblr.com/post/177951657981/a-song-for-jyrus-eh-this-one-this-one-this-one",
        "slug": "a-song-for-jyrus-eh-this-one-this-one-this-one",
        "date": "2018-09-10 21:04:00 GMT",
        "timestamp": 1536613440,
        "state": "published",
        "format": "html",
        "reblog_key": "N6FabV29",
        "tags": [
            "andi mack",
            "jyrus",
            "jyrus month",
            "bea miller"
        ],
        "short_url": "https://tmblr.co/ZJj3Oi2bkli-z",
        "summary": "A song for jyrus, Eh? This one. This one. This one right here takes the cake.\n“I don’t know why but my hands are shaking. I can...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 10,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/f03c8c539c9c438172f09864360cfa93/tumblr_peuyioVwOS1tl6fja_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"719\"/></figure><p>A song for jyrus, Eh? This one. This one. This one right here takes the cake.</p><p>“I don’t know why but my hands are shaking. I can see you coming and I stand here waiting. Yeah I get tongue tied in the conversation. It’s an effed up bad sick situation.</p><p>I tried to tie my heart down, board up all the windows, oh but it’s too late now, I let you get too close.</p><p>‘Cause you’re a force of nature. Look at what you’ve done. I can taste the danger. But I don’t wanna run. So pull me to the ground and I won’t put up a fight. I’m a caution taker, but baby you’re a force of nature.</p><p>I feel your lips moving and they take me under. You know just what to do how to make me want ya. And I know I’ll be broken when it’s over, oh but I can’t help but pull you closer.</p><p>I’ll be here till we collide. I don’t care if I survive. So crash into me one more time.”</p><p>Wow I basically just put all the lyrics but I don’t care because I love them I love this song I love Bea Miller and I love jyrus.</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/f03c8c539c9c438172f09864360cfa93/tumblr_peuyioVwOS1tl6fja_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><p>A song for jyrus, Eh? This one. This one. This one right here takes the cake.</p><p>“I don’t know why but my hands are shaking. I can see you coming and I stand here waiting. Yeah I get tongue tied in the conversation. It’s an effed up bad sick situation.</p><p>I tried to tie my heart down, board up all the windows, oh but it’s too late now, I let you get too close.</p><p>‘Cause you’re a force of nature. Look at what you’ve done. I can taste the danger. But I don’t wanna run. So pull me to the ground and I won’t put up a fight. I’m a caution taker, but baby you’re a force of nature.</p><p>I feel your lips moving and they take me under. You know just what to do how to make me want ya. And I know I’ll be broken when it’s over, oh but I can’t help but pull you closer.</p><p>I’ll be here till we collide. I don’t care if I survive. So crash into me one more time.”</p><p>Wow I basically just put all the lyrics but I don’t care because I love them I love this song I love Bea Miller and I love jyrus.</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "heyoricohannah",
                    "active": true,
                    "theme": {
                        "header_full_width": 702,
                        "header_full_height": 396,
                        "header_focus_width": 542,
                        "header_focus_height": 304,
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "30,553,334,11",
                        "header_image": "https://static.tumblr.com/4d4b56e15451686827dbe7c5ddc1de5c/n6z0gtk/0hpoddjuo/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/4d4b56e15451686827dbe7c5ddc1de5c/n6z0gtk/goNoddjuq/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/4d4b56e15451686827dbe7c5ddc1de5c/n6z0gtk/0hpoddjuo/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177951657981"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/f03c8c539c9c438172f09864360cfa93/tumblr_peuyioVwOS1tl6fja_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><p>A song for jyrus, Eh? This one. This one. This one right here takes the cake.</p><p>“I don’t know why but my hands are shaking. I can see you coming and I stand here waiting. Yeah I get tongue tied in the conversation. It’s an effed up bad sick situation.</p><p>I tried to tie my heart down, board up all the windows, oh but it’s too late now, I let you get too close.</p><p>‘Cause you’re a force of nature. Look at what you’ve done. I can taste the danger. But I don’t wanna run. So pull me to the ground and I won’t put up a fight. I’m a caution taker, but baby you’re a force of nature.</p><p>I feel your lips moving and they take me under. You know just what to do how to make me want ya. And I know I’ll be broken when it’s over, oh but I can’t help but pull you closer.</p><p>I’ll be here till we collide. I don’t care if I survive. So crash into me one more time.”</p><p>Wow I basically just put all the lyrics but I don’t care because I love them I love this song I love Bea Miller and I love jyrus.</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f03c8c539c9c438172f09864360cfa93/tumblr_peuyioVwOS1tl6fja_540.jpg\" class=\"\"/></figure><p>A song for jyrus, Eh? This one. This one. This one right here takes the cake.</p><p>&ldquo;I don&rsquo;t know why but my hands are shaking. I can see you coming and I stand here waiting. Yeah I get tongue tied in the conversation. It&rsquo;s an effed up bad sick situation.</p><p>I tried to tie my heart down, board up all the windows, oh but it&rsquo;s too late now, I let you get too close.</p><p>&lsquo;Cause you&rsquo;re a force of nature. Look at what you&rsquo;ve done. I can taste the danger. But I don&rsquo;t wanna run. So pull me to the ground and I won&rsquo;t put up a fight. I&rsquo;m a caution taker, but baby you&rsquo;re a force of nature.</p><p>I feel your lips moving and they take me under. You know just what to do how to make me want ya. And I know I&rsquo;ll be broken when it&rsquo;s over, oh but I can&rsquo;t help but pull you closer.</p><p>I&rsquo;ll be here till we collide. I don&rsquo;t care if I survive. So crash into me one more time.&rdquo;</p><p>Wow I basically just put all the lyrics but I don&rsquo;t care because I love them I love this song I love Bea Miller and I love jyrus.</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "lameobameo",
        "blog": {
            "name": "lameobameo",
            "title": "SampleText",
            "description": "the ocean is gross.",
            "url": "https://lameobameo.tumblr.com/",
            "uuid": "t:RLyqsCTQ5KFX6rfGXnCENQ",
            "updated": 1543874855
        },
        "id": 177951578824,
        "post_url": "https://lameobameo.tumblr.com/post/177951578824",
        "slug": "",
        "date": "2018-09-10 21:01:25 GMT",
        "timestamp": 1536613285,
        "state": "published",
        "format": "html",
        "reblog_key": "bRa1Fsrx",
        "tags": [
            "tyrus andi mack",
            "tyrus",
            "no hate just why",
            "andi mack",
            "buffy andi mack",
            "cyrus goodman",
            "buffy driscoll",
            "tj kippen"
        ],
        "short_url": "https://tmblr.co/ZKswEZ2bklPh8",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 22,
        "title": null,
        "body": "<h1>Me when my sister thought TJ looked at Buffy and not Cyrus. </h1><figure class=\"tmblr-full\" data-orig-height=\"168\" data-orig-width=\"300\"><img src=\"https://66.media.tumblr.com/d106092fdf317408de904eb8b1f0eb46/tumblr_peuyedmAef1vk1st1_540.jpg\" data-orig-height=\"168\" data-orig-width=\"300\"/></figure>",
        "reblog": {
            "comment": "<p><h1>Me when my sister thought TJ looked at Buffy and not Cyrus. </h1><figure class=\"tmblr-full\" data-orig-height=\"168\" data-orig-width=\"300\"><img src=\"https://66.media.tumblr.com/d106092fdf317408de904eb8b1f0eb46/tumblr_peuyedmAef1vk1st1_540.jpg\" data-orig-height=\"168\" data-orig-width=\"300\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "lameobameo",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#794444",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/396abfbbb56eb089fe41ca0c48ecab4c/l2rbpuj/dSkph0aru/tumblr_static_-2094811663-content.png",
                        "header_image_focused": "https://static.tumblr.com/396abfbbb56eb089fe41ca0c48ecab4c/l2rbpuj/dSkph0aru/tumblr_static_-2094811663-content_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/396abfbbb56eb089fe41ca0c48ecab4c/l2rbpuj/dSkph0aru/tumblr_static_-2094811663-content_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#6EADD2",
                        "title_font": "Clarendon Text Pro",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177951578824"
                },
                "content_raw": "<p><h1>Me when my sister thought TJ looked at Buffy and not Cyrus. </h1><figure class=\"tmblr-full\" data-orig-height=\"168\" data-orig-width=\"300\"><img src=\"https://66.media.tumblr.com/d106092fdf317408de904eb8b1f0eb46/tumblr_peuyedmAef1vk1st1_540.jpg\" data-orig-height=\"168\" data-orig-width=\"300\"></figure></p>",
                "content": "<p><h1>Me when my sister thought TJ looked at Buffy and not Cyrus. </h1><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d106092fdf317408de904eb8b1f0eb46/tumblr_peuyedmAef1vk1st1_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "crystalstar34",
        "blog": {
            "name": "crystalstar34",
            "title": "Love Some Multi Trash",
            "description": "<p>Just a random girl who loves Shyland and some other things</p>",
            "url": "https://crystalstar34.tumblr.com/",
            "uuid": "t:fmX5wrOUVD7DZMO55j19Ww",
            "updated": 1561283184
        },
        "id": 177951341585,
        "post_url": "https://crystalstar34.tumblr.com/post/177951341585/i-think-these-2-songs-could-be-perfect-songs-for",
        "slug": "i-think-these-2-songs-could-be-perfect-songs-for",
        "date": "2018-09-10 20:53:35 GMT",
        "timestamp": 1536612815,
        "state": "published",
        "format": "html",
        "reblog_key": "pZxhpLWX",
        "tags": [
            "andi mack",
            "30 days of jyrus"
        ],
        "short_url": "https://tmblr.co/Zxu0Le2bkkVmH",
        "summary": "I think these 2 songs could be perfect songs for Jyrus \nOne would definitely be I Like Me Better by Lauv\nThis song would of...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 22,
        "title": null,
        "body": "<h1>Jyrus Month Day 10</h1><h2>I think these 2 songs could be perfect songs for Jyrus </h2><p>One would definitely be I Like Me Better by Lauv</p><figure class=\"tmblr-full\" data-orig-height=\"593\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/c9d90fb3c90f567b38dba66d00c0becb/tumblr_peuy19aP1T1ui3r5d_540.jpg\" data-orig-height=\"593\" data-orig-width=\"750\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"452\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/d76fc7b2cbe6b64bc9982bf1acf4a19c/tumblr_peuy1aZahZ1ui3r5d_540.jpg\" data-orig-height=\"452\" data-orig-width=\"750\"/></figure><p>This song would of played at a dance that Jonah and Cyrus were both at. It was the first time they heard the song but they automatically knew they loved it and that it was made just for them. Every time the song said, “I like me better when I’m with you,” they would be one of those cute but cringey couples and would point to one another every time they heard it. </p><p>Another song that I think would be perfect would be Sweet Creature by Harry Styles </p><figure class=\"tmblr-full\" data-orig-height=\"628\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/318624aec86a537d07b90815b786aa4a/tumblr_peuy1bclqV1ui3r5d_540.jpg\" data-orig-height=\"628\" data-orig-width=\"750\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"757\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/f27d968eb1f1b0cd2a49d332123ad8bb/tumblr_peuy1bqJOs1ui3r5d_540.jpg\" data-orig-height=\"757\" data-orig-width=\"750\"/></figure><p>Cyrus is obviously a Harry Styles fan. He had it all planned out. Cyrus picked this song to ask Jonah to dance with him. He agreed with every lyric and he felt like it was made for them. Jonah of course said yes when Cyrus asked and that was their first official dance together. They would always remeber this song and love it forever. </p>",
        "reblog": {
            "comment": "<p><h1>Jyrus Month Day 10</h1><h2>I think these 2 songs could be perfect songs for Jyrus </h2><p>One would definitely be I Like Me Better by Lauv</p><figure class=\"tmblr-full\" data-orig-height=\"593\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/c9d90fb3c90f567b38dba66d00c0becb/tumblr_peuy19aP1T1ui3r5d_540.jpg\" data-orig-height=\"593\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"452\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/d76fc7b2cbe6b64bc9982bf1acf4a19c/tumblr_peuy1aZahZ1ui3r5d_540.jpg\" data-orig-height=\"452\" data-orig-width=\"750\"></figure><p>This song would of played at a dance that Jonah and Cyrus were both at. It was the first time they heard the song but they automatically knew they loved it and that it was made just for them. Every time the song said, “I like me better when I’m with you,” they would be one of those cute but cringey couples and would point to one another every time they heard it. </p><p>Another song that I think would be perfect would be Sweet Creature by Harry Styles </p><figure class=\"tmblr-full\" data-orig-height=\"628\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/318624aec86a537d07b90815b786aa4a/tumblr_peuy1bclqV1ui3r5d_540.jpg\" data-orig-height=\"628\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"757\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/f27d968eb1f1b0cd2a49d332123ad8bb/tumblr_peuy1bqJOs1ui3r5d_540.jpg\" data-orig-height=\"757\" data-orig-width=\"750\"></figure><p>Cyrus is obviously a Harry Styles fan. He had it all planned out. Cyrus picked this song to ask Jonah to dance with him. He agreed with every lyric and he felt like it was made for them. Jonah of course said yes when Cyrus asked and that was their first official dance together. They would always remeber this song and love it forever. </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "crystalstar34",
                    "active": true,
                    "theme": {
                        "header_full_width": 746,
                        "header_full_height": 400,
                        "header_focus_width": 547,
                        "header_focus_height": 308,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "46,646,354,99",
                        "header_image": "https://static.tumblr.com/f588ac238a010a1586022af528059de7/azljmyv/Bmjpdni87/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/f588ac238a010a1586022af528059de7/azljmyv/qFZpdni88/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f588ac238a010a1586022af528059de7/azljmyv/Bmjpdni87/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Lorimer No 2",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177951341585"
                },
                "content_raw": "<p><h1>Jyrus Month Day 10</h1><h2>I think these 2 songs could be perfect songs for Jyrus </h2><p>One would definitely be I Like Me Better by Lauv</p><figure class=\"tmblr-full\" data-orig-height=\"593\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/c9d90fb3c90f567b38dba66d00c0becb/tumblr_peuy19aP1T1ui3r5d_540.jpg\" data-orig-height=\"593\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"452\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/d76fc7b2cbe6b64bc9982bf1acf4a19c/tumblr_peuy1aZahZ1ui3r5d_540.jpg\" data-orig-height=\"452\" data-orig-width=\"750\"></figure><p>This song would of played at a dance that Jonah and Cyrus were both at. It was the first time they heard the song but they automatically knew they loved it and that it was made just for them. Every time the song said, “I like me better when I’m with you,” they would be one of those cute but cringey couples and would point to one another every time they heard it. </p><p>Another song that I think would be perfect would be Sweet Creature by Harry Styles </p><figure class=\"tmblr-full\" data-orig-height=\"628\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/318624aec86a537d07b90815b786aa4a/tumblr_peuy1bclqV1ui3r5d_540.jpg\" data-orig-height=\"628\" data-orig-width=\"750\"></figure><figure class=\"tmblr-full\" data-orig-height=\"757\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/f27d968eb1f1b0cd2a49d332123ad8bb/tumblr_peuy1bqJOs1ui3r5d_540.jpg\" data-orig-height=\"757\" data-orig-width=\"750\"></figure><p>Cyrus is obviously a Harry Styles fan. He had it all planned out. Cyrus picked this song to ask Jonah to dance with him. He agreed with every lyric and he felt like it was made for them. Jonah of course said yes when Cyrus asked and that was their first official dance together. They would always remeber this song and love it forever. </p></p>",
                "content": "<p><h1>Jyrus Month Day 10</h1><h2>I think these 2 songs could be perfect songs for Jyrus </h2><p>One would definitely be I Like Me Better by Lauv</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c9d90fb3c90f567b38dba66d00c0becb/tumblr_peuy19aP1T1ui3r5d_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d76fc7b2cbe6b64bc9982bf1acf4a19c/tumblr_peuy1aZahZ1ui3r5d_540.jpg\" class=\"\"/></figure><p>This song would of played at a dance that Jonah and Cyrus were both at. It was the first time they heard the song but they automatically knew they loved it and that it was made just for them. Every time the song said, &ldquo;I like me better when I&rsquo;m with you,&rdquo; they would be one of those cute but cringey couples and would point to one another every time they heard it. </p><p>Another song that I think would be perfect would be Sweet Creature by Harry Styles </p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/318624aec86a537d07b90815b786aa4a/tumblr_peuy1bclqV1ui3r5d_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f27d968eb1f1b0cd2a49d332123ad8bb/tumblr_peuy1bqJOs1ui3r5d_540.jpg\" class=\"\"/></figure><p>Cyrus is obviously a Harry Styles fan. He had it all planned out. Cyrus picked this song to ask Jonah to dance with him. He agreed with every lyric and he felt like it was made for them. Jonah of course said yes when Cyrus asked and that was their first official dance together. They would always remeber this song and love it forever. </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "andiwiththegood-hair",
        "blog": {
            "name": "andiwiththegood-hair",
            "title": "",
            "description": "<p>alex | she/they | andi mack got cancelled welcome to the sad bitch blog | “and im gay\"</p>",
            "url": "https://andiwiththegood-hair.tumblr.com/",
            "uuid": "t:KnGetlkDfatFmJOKyVMmjA",
            "updated": 1561715081
        },
        "id": 177951158383,
        "post_url": "https://andiwiththegood-hair.tumblr.com/post/177951158383/bex-and-bowies-wedding-preacher-do-you-take",
        "slug": "bex-and-bowies-wedding-preacher-do-you-take",
        "date": "2018-09-10 20:47:21 GMT",
        "timestamp": 1536612441,
        "state": "published",
        "format": "html",
        "reblog_key": "82w3Bcfd",
        "tags": [
            "this is gonna happen",
            "andi mack",
            "bex mack",
            "bowie quinn"
        ],
        "short_url": "https://tmblr.co/Z4oCxa2bkjp1l",
        "summary": "*bex and bowie's wedding*\npreacher: do you take this man to be your lawfully wedded husband?\nbex: um :)\npreacher: and do you...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 173,
        "title": null,
        "body": "<p>*bex and bowie&rsquo;s wedding*</p><p>preacher: do you take this man to be your lawfully wedded husband?</p><p>bex: um :)</p><p>preacher: and do you take this woman to be your lawfully wedded wife?</p><p>bowie: um :)</p>",
        "reblog": {
            "comment": "<p>*bex and bowie’s wedding*</p><p>preacher: do you take this man to be your lawfully wedded husband?</p><p>bex: um :)</p><p>preacher: and do you take this woman to be your lawfully wedded wife?</p><p>bowie: um :)</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "andiwiththegood-hair",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#E8A395",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/1ed37fc69fee2ef80c8cf5cb92d676d4/flz5cnp/wLMpg696w/tumblr_static_-513609313-content.png",
                        "header_image_focused": "https://static.tumblr.com/1ed37fc69fee2ef80c8cf5cb92d676d4/flz5cnp/wLMpg696w/tumblr_static_-513609313-content_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/1ed37fc69fee2ef80c8cf5cb92d676d4/flz5cnp/wLMpg696w/tumblr_static_-513609313-content_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#000000",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177951158383"
                },
                "content_raw": "<p>*bex and bowie’s wedding*</p><p>preacher: do you take this man to be your lawfully wedded husband?</p><p>bex: um :)</p><p>preacher: and do you take this woman to be your lawfully wedded wife?</p><p>bowie: um :)</p>",
                "content": "<p>*bex and bowie&rsquo;s wedding*</p><p>preacher: do you take this man to be your lawfully wedded husband?</p><p>bex: um :)</p><p>preacher: and do you take this woman to be your lawfully wedded wife?</p><p>bowie: um :)</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "thechickenstrousers",
        "blog": {
            "name": "thechickenstrousers",
            "title": "",
            "description": "",
            "url": "https://thechickenstrousers.tumblr.com/",
            "uuid": "t:O9HcFtiNkrMAQQn2DNImnw",
            "updated": 1550883861
        },
        "id": 177950765920,
        "post_url": "https://thechickenstrousers.tumblr.com/post/177950765920/courtesy-of-my-best-friend",
        "slug": "courtesy-of-my-best-friend",
        "date": "2018-09-10 20:34:16 GMT",
        "timestamp": 1536611656,
        "state": "published",
        "format": "html",
        "reblog_key": "Z5ibOhEo",
        "tags": [
            "andi mack",
            "tyrus"
        ],
        "short_url": "https://tmblr.co/ZVFhGe2bkiJDW",
        "summary": "Courtesy of my best friend",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 204,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/c41d7b0e6b1a74d98b7e609fcb6dd5b5/tumblr_peux53tvna1uiaxxv_540.png\" data-orig-height=\"1280\" data-orig-width=\"719\"/></figure><p>Courtesy of my best friend </p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/c41d7b0e6b1a74d98b7e609fcb6dd5b5/tumblr_peux53tvna1uiaxxv_540.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><p>Courtesy of my best friend </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "thechickenstrousers",
                    "active": true,
                    "theme": {
                        "header_full_width": 720,
                        "header_full_height": 1280,
                        "header_focus_width": 616,
                        "header_focus_height": 347,
                        "avatar_shape": "square",
                        "background_color": "#F2ECE0",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "430,689,777,73",
                        "header_image": "https://static.tumblr.com/bd3cf3d419148b80a7e3b6fae186f5ed/xrwemgw/3zIpp7pnb/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/77818a6519479be0e0e076c3d8b6c57e/xrwemgw/jZApp7pnd/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/bd3cf3d419148b80a7e3b6fae186f5ed/xrwemgw/3zIpp7pnb/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#222222",
                        "title_font": "Lorimer No 2",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "177950765920"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"719\"><img src=\"https://66.media.tumblr.com/c41d7b0e6b1a74d98b7e609fcb6dd5b5/tumblr_peux53tvna1uiaxxv_540.png\" data-orig-height=\"1280\" data-orig-width=\"719\"></figure><p>Courtesy of my best friend </p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c41d7b0e6b1a74d98b7e609fcb6dd5b5/tumblr_peux53tvna1uiaxxv_540.png\" class=\"\"/></figure><p>Courtesy of my best friend </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]