[
    {
        "type": "text",
        "blog_name": "capcarolsdanver",
        "blog": {
            "name": "capcarolsdanver",
            "title": "Heroes. Noble warrior heroes.",
            "description": "Brie Larson/Captain Marvel sideblog\nI sometimes write stuff\nREQUESTS ARE TEMPORARILY CLOSED!!",
            "url": "https://capcarolsdanver.tumblr.com/",
            "uuid": "t:IQU1hIbIrvCQ8Pg0CJ3nBQ",
            "updated": 1561740228
        },
        "id": 184808662072,
        "post_url": "https://capcarolsdanver.tumblr.com/post/184808662072/comfort",
        "slug": "comfort",
        "date": "2019-05-11 19:18:39 GMT",
        "timestamp": 1557602319,
        "state": "published",
        "format": "html",
        "reblog_key": "cmMW3KV6",
        "tags": [
            "brie larson x reader",
            "brie larson imagine",
            "brie larson",
            "captain marvel",
            "brie larson fic",
            "mine"
        ],
        "short_url": "https://tmblr.co/Z57-_W2i7T6Gu",
        "summary": "Comfort",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 282,
        "title": "Comfort",
        "body": "<p><b>Requests: </b></p><p>Anonymous: So I just read Home and you did absolutely wonderful. I felt so much fluff, I was grinning the whole time. If you are still taking requests, can you do a continuation of Home where Brie kind of gets sad because of all the hate she is getting (she doesn’t deserve it) and the reader comforts her together with the rest of the mcu cast especially Hemsworth and Cheadle. Thank you.</p><p>Anonymous:<b> </b>i loved your Home one shot! can you do one where brie and her non famous girlfriend are hanging out at Disneyland with the other cast after she is done with press</p><p><b>Pairing: </b>Brie x reader</p><p><b>A/N:</b> Wooow I’m posting this much later than I meant to. Thank you both for the love and for the requests!! I love both of these requests and thought they would kinda work well together so here it is! Enjoy!!</p><figure class=\"tmblr-full\" data-orig-height=\"268\" data-orig-width=\"268\" data-tumblr-attribution=\"saffitz:GbmnA7vmHluLNaFuCS-wEg:ZAa_FX2i3t1AU\"><img src=\"https://66.media.tumblr.com/788038246a051c6825910cfa96e25549/tumblr_pr40uefEeC1y78h9ro1_400.gif\" data-orig-height=\"268\" data-orig-width=\"268\"/></figure><!-- more --><p>The feeling of strong arms wrapping around you wakes you up. You groan slightly, snuggling closer to Brie. She pulls you in towards her, pressing a kiss to your neck before she leans over you and kisses you on the lips. You hum into the kiss and she pulls back, smiling softly at you.</p><p>“Morning,” she says with a slight rasp to her voice. You lift a hand to tuck a strand of her short hair behind her ear and out of her face.</p><p>“Good morning, baby,” you reply to her before reaching towards your phone. You glance at the time and then back at Brie. “I’ve got to get up, I’m supposed to be meeting some friends for breakfast.” Brie immediately pouts.</p><p>\n“What? No! Stay here and cuddle with me!” You attempt to remove her arms from around you but she only tightens them. You huff and playfully glare at her.</p><p>“Brie. I swear I’ll be back so quickly you’ll barely realise I’ve gone. Then we can cuddle for as long as you want.” Brie seems to contemplate your words for a moment before reluctantly releasing you from her hold.</p><p>“Fine. But you better be ready to cuddle me the second you get back.” You chuckle at her and kiss the pout off her lips before getting out of bed.</p><p>“You’ve got a deal.”</p><p><br/></p><hr><p><br/></p><p>As promised, breakfast is only a quick outing and you’re back at the house fairly quickly. You make your way to the bedroom where you assume Brie still is. Your confusion peaks, however, when you notice the curtains are drawn shut, the room shrouded in darkness. You can see Brie’s figure sitting on the bed and her laptop in front of her shines some light onto her features.<br/></p><p>“Uhh. Babe, this is very ominous, don’t you think?” You startle Brie and immediately notice when she swipes at her face, clearly wiping away tears.</p><p>“Brie?” You automatically rush to her, placing yourself on the bed in front of her and resting your hands on her face. “What is it?” You wipe at the tears she missed and watch her closely, trying to focus on her eyes through the dark of the room.</p><p>“It’s okay. Everything’s okay, I’m fine,” she says weakly. You give her a disbelieving look.</p><p>“You don’t look fine to me. What happened?” You speak gently and she sighs as another tear rolls down her cheek. You wipe it away with your thumb and wait patiently before Brie grabs her laptop and shows you the screen.</p><p>She’s got Youtube open, and she’s searched her own name in the search bar. You look at some of the videos listed on the page. They range from ‘How Brie Larson is ruining the MCU’ to ‘Proof that the Avengers cast hate Brie Larson’. You sigh and look at her.</p><p>“Brie, what were even doing looking at this stuff? You know it’s all bullshit.” She shrugs weakly and you shut her laptop and put it aside.</p><p>“While you were gone, I went on Twitter and saw all these guys posting about me and how Don and Chris clearly hate me.” You place your hand on Brie’s thigh to comfort her and she drops her hand onto of yours, tracing the back of your hand with her thumb. “I mean, I kind of knew it was happening. I guess it just hit me hard today. Especially when I saw all the videos.”</p><p>“Looks like you should extend that stay away from social media then, hm?” You say gently. Brie sadly hums in response and wraps you in a tight embrace.</p><p>Since the end of the press tour, Brie had been overwhelmed with the amount of attention she’d received, both good and bad, and had decided on a much needed break from social media. You knew that as she’d gotten more popular, she’d had difficulty dealing with the attention because of her introverted nature, and she needed these breaks from time to time.</p><p>“Hey, how about we go out and do something today? We can forget all about the trolls of the internet for a little while.” You kiss Brie on the cheek and she leans into your body more.</p><p>“I don’t know, Y/N. I’m just really not in the mood today.” She pulls away from your embrace and stands, rubbing her face with her hand before she smiles at you sadly. “I’m sorry.” You stand up to join her, taking her hands in your own and holding them between you.</p><p>“Brie, you have absolutely nothing to apologise for. You hear me?” Your words are gentle and you see the smallest of smiles cross her face.</p><p>“Yeah,” she nods. Her eyes hold a warmth for you as she holds your gaze. “I’m just gonna jump in the shower. Maybe it’ll make me feel a little better.” You nod at her and watch her walk into the bathroom, closing the door behind her.</p><p>When you hear the shower turn on you pull your phone out, going through your contacts and finding the name you were after. You bite your lip in hesitation for a second before hitting the call button and holding the phone to your ear.</p><p>“Hello?” You hear Chris Hemsworth answer after a few moments.</p><p>“Hey, Chris!” You say. At some point around the time of the world premiere for Endgame, you and the majority of the cast had all exchanged numbers, and right now you were glad that happened.</p><p>“Y/N! How’s it going? What can I do for you?” Hemsworth was a person you absolutely loved to talk to. No matter what the circumstance, he always had such a positive energy and you know he helped Brie out a lot when it came to her introduction to the MCU.</p><p>“You’re in LA right now, yeah?” You ask.</p><p>“I am! I just got back from Australia, like, two days ago.” You breath a sigh of relief.</p><p>“Okay, good. Uh, listen, Brie’s really not having a great day today. She found some videos online saying that the whole Avengers cast hates her and that she’s ruining the MCU.”</p><p>You hear Hemsworth mutter an “oh shit” before you continue.</p><p>“I was just wondering if you wouldn’t mind maybe coming by to talk to her? I have a feeling it’ll make her feel better hearing that it’s all bullshit from one of you guys instead of just me.”</p><p>“Of course!” Chris immediately exclaims. “You know what, I’ll try do one better. Let me make some calls and I’ll be ‘round soon, yeah?”</p><p><br/></p><hr><p><br/></p><p>Brie comes out of the bathroom and walks to the kitchen, where she finds you drinking a cup of coffee. She watches you for a moment and you offer her an affectionate smile before nodding your head in the direction of another mug sitting on the countertop.</p><p>“That one’s for you,” you say and she smiles gratefully, walking further into the kitchen to pick the mug up and take a sip from it.</p><p>\n“Mm, I so needed this. Thank you.”</p><p>“No problem.” You both continue drinking your coffees in relative silence for a while. You can see the shower has made Brie feel a little better, but her eyebrows are drawn together and you can see she is still stuck in her own thoughts.</p><p>\nYou glance at your phone to see if Hemsworth has texted you. At the lack of messages on your phone, you put it down on the countertop and look back at Brie. She draws her lower lip between her teeth, completely lost in her own thoughts, and you sigh, hoping Hemsworth gets here soon.</p><p>Right on cue, you hear your doorbell ring and Brie’s head snaps towards the door. She looks back at you in question.</p><p>“Are we expecting anyone today?” She asks and you shrug as she makes her way to your front door and opens it.</p><p>“Hey!” You hear Hemsworth shout in greeting before you see him step inside to hug Brie. She returns the hug before pulling back with a confused look on her face.</p><p>“Hemsworth. What brings you here?” She asks, though you can already see a smile on her face.</p><p>“What, you’re not excited to see me?” Chris says. His mouth turns to form a deep frown. Brie laughs at him before shoving him arm lightly.</p><p>“You know that’s not what I meant.” Chris chuckles and his smile finds its way back to his face.</p><p>“Well, a little birdie might have told me that you were having a pretty rough morning. So I’m here to make sure you still have an amazing day. Let’s go!” He exclaims as he gestures with his arm for you and Brie to follow him before he disappears out the door again. Brie turns to look at you.</p><p>“You called him?” You shrug, thankfully sensing that Brie wasn’t mad at you for calling Hemsworth. You walk towards her and her eyes study you carefully.</p><p>“You were breaking my heart,” you say and you see her eyes begin to swim with tears. “Plus, I’d say the fact that he dropped everything to get here so quickly kinda proves he doesn’t hate you.” Brie lets out a laugh and quickly wipes at her eyes before her tears can properly fall.</p><p>“Come on!” Hemsworth says insistently, coming back through the door. “Geez, at least you’re not going around telling everyone you’re the fastest avenger, eh?” He offers a cheeky wink to Brie before dodging a punch she has aimed at his arm.</p><p>Brie shakes her head and laughs, grabbing your hand as the two of you follow him out.</p><p><br/></p><hr><p><br/></p><p>You and Brie find yourselves sitting in the backseat of Chris’ car, and he drives for a little while before Brie finally speaks up.</p><p>“So, where are you taking us?” Chris smiles at you both through his rear-view mirror.</p><p>“Only the happiest place on earth, duh! Where else would I be taking you?” Brie looks at you for a moment, her brow furrowing in confusion before she turns to Chris again.</p><p>“You’re telling me we’re going to Disneyland?”</p><p>“Yep! It’s guaranteed to cheer you up the second we get there. And on top of that, I might have also called in some of the squad who could make it.” Brie’s mouth drops open slightly.</p><p>“Wait, really? You’re really all doing this because I was upset?”</p><p>“Well, yeah. Of course. We’re a family, you know.” Brie smiles a disbelieving smile and you see more tears form in her eyes. You take her hand and squeeze it in reassurance. “Besides, you know all the haters are just jealous of our friendship. Let’s be real. All banter aside, we are the two strongest avengers.”</p><p>“Obviously,” Brie laughs.</p><p>The car slows down and you look to see that you have arrived. Hemsworth parks the car and the three of you get out.</p><p>\n“Okay, we’re meeting everyone near the side of the entrance, over this way.” You follow him down near the entrance where he leads you to the group, who are trying to be subtle to avoid the attention of fans before they even get inside the park.</p><p>Everyone immediately cheers in greeting as you join them. The group consists of Scarlett Johansson, Mark Ruffalo, Chris Evans, Sebastian Stan, Anthony Mackie, Jeremy Renner, Paul Rudd and Don Cheadle. Everyone hugs one another before deciding to head into the park.</p><p>“I can’t believe I’m at Disneyland right now without my kids. This is awesome,” Paul says, earning a laugh from the group as you all pay for your tickets and enter the park. You begin walking down Main Street, USA and, to no one’s surprise, fans immediately begin recognising the group.</p><p>They all are happy to oblige when fans ask to take a quick photo, and you stand back and admire the group of people you regularly get to associate with. You all make your way through the park, stopping to get ice cream and to purchase Mickey Mouse ears which you all proudly wear.</p><p>You and Brie walk hand in hand with the rest of the group and you look over to Brie to find a huge smile on her face. Your heart warms at the sight and you mirror the smile on your own face.</p><p>Because you had arrived partway through the day, you are all aware that you have limited time to go on rides and hang out with each other before the fireworks show starts later in the evening. You all decide to head to Tomorrowland first, of course heading straight for Space Mountain and some of the other rides.</p><p>Hemsworth insists that everyone has to get a photo together with Mickie and Minnie, which turns out to be difficult with he size of the group but also a great deal of fun choosing which poses to go with.</p><p>As you continue walking through Disneyland, you and Brie continue to walk contently with each other, trailing towards the back of the group. Mackie and Sebastian are acting as unofficial leaders for the day, leading the pack from one place to another while everyone else loudly talks among themselves.</p><p>Somewhere between Fantasyland and Frontierland, Cheadle breaks away from his conversation with Evans to drop back and join you and Brie.</p><p>“Hey. Listen, Brie. You know anything those guys have to say online is bullshit, right? I mean, you’ve got to know how much we all love you.” Brie takes in a deep breath and sighs, looking at Cheadle.</p><p>“I do know. I guess it just really got to me today, you know?”</p><p>“Yeah, I get it.” Cheadle nods, complete sincerity in his tone. “They’re only coming for you because you’re a strong woman standing up for what’s right and they’re just threatened by you. That’s literally all it is. I’d probably even take it as a compliment if I were you.” Brie laughs.</p><p>“That’s actually a good way of looking at it. Thanks, Don. It means a lot.” Your group stops walking so some fans can get photos and Brie takes the opportunity to hug Cheadle.</p><p>\n“Any time, Brie.” He smiles at her before Evans calls him back over. The group starts moving again and Scarlett drops back to walk with you two now.</p><p>“I know we’ve been stopped a lot for photos, but it’s actually kind of a nice break after that press tour, don’t you think?” Brie quickly nods.</p><p>“Oh, one hundred percent. That press tour was on a whole other level.” You know how tough press tours can be for Brie, and she practically did back-to-back press tours for Captain Marvel and Avengers: Endgame, two of the biggest movies in the past year.</p><p>You’d only travelled with her for part of the Endgame press tour, so while you’d been at home you’d received a lot of phone calls and FaceTimes from Brie, many of which she would break down in tears because of just how exhausted she was. She also missed having you by her side, which is why she’d asked you to join her during the Endgame tour.</p><p>“Okay guys! Let’s stop to eat some food, then we’re heading to Space Mountain again before the fireworks. Sound good?” Mackie announces to the group, receiving a positive answer as he leads them towards the nearest restaurant.</p><p><br/></p><hr><p><br/></p><p>After going on Space Mountain again, you and the cast head off to find the perfect spot to sit and watch the fireworks together.<br/><br/>\n“Brie,” you hear from behind you as Hemsworth runs up to you and Brie. “Can we get a selfie?” He points at his phone and offers a grin.</p><p>“Of course,” Brie happily agrees. “What’s this for? Instagram?”</p><p>“Yeah. I’m planning on putting up some photos that are just a massive ‘fuck you’ to all the guys hating on you and saying we don’t like you. Plus, our whole group is just full of really hot people. I kinda want to use that for the likes, you know?” Brie laughs and shakes her head before her and Chris pose for a selfie, still both proudly wearing their Mickey ears.</p><p>Eventually, everyone decides on a spot to sit and watch the fireworks. Brie sits off slightly to the side of everyone else to give you both a little privacy, and gestures for you to sit between her legs in front of her. You do and she doesn’t waste any time wrapping her arms comfortably around your waist.</p><p>When the fireworks begin, Brie pulls you in closer and you lean into her body, feeling her chin coming to rest on your shoulder. Your hands rest on top of hers as you watch the show.</p><p>“Thank you,” you hear Brie say next to your ear. You turn your head slightly to look at her.</p><p>\n“For what?”</p><p>“For everything. You turned a pretty shitty day into one that I completely loved.”</p><p>“You know it’s no problem, Brie. But it definitely wasn’t just me who did all of this.” Brie presses her lips to your shoulder and you can feel the smile on your face.</p><p>“No, it wasn’t. But we both know that if it weren’t for you, I wouldn’t be so happy right now.” You shrug lightly.</p><p>“Well. You know I would do anything for you.”</p><p>“God, this is gonna sound super sappy, but you’re the most amazing person I’ve ever met and I’m so glad I get to call you mine.” You chuckle, a smile plastered on your face and you turn to capture Brie’s lips in a kiss.</p><p>“I love you,” you mumble against her lips. The corners of Brie’s eyes crinkle as she grins at you.</p><p>“I love you too.”</p>",
        "body_abstract": "\n<p><b>Requests:&nbsp;</b></p>\n<p>Anonymous: So I just read Home and you did absolutely wonderful. I felt so much fluff, I was grinning the whole time. If you are still taking requests, can you do a continuation of Home where Brie kind of gets sad because of all the hate she is getting (she doesn&rsquo;t deserve it) and the reader comforts her together with the rest of the mcu cast especially Hemsworth and Cheadle. Thank you.</p>\n<p>Anonymous:<b>&nbsp;</b>i loved your Home one shot! can you do one where brie and her non famous girlfriend are hanging out at Disneyland with the other cast after she is done with press</p>\n<p><b>Pairing: </b>Brie x reader</p>\n<p><b>A/N:</b>&nbsp;Wooow I&rsquo;m posting this much later than I meant to. Thank you both for the love and for the requests!! I love both of these requests and thought they would kinda work well together so here it is! Enjoy!!</p>\n<figure class=\"tmblr-full\" data-orig-height=\"268\" data-orig-width=\"268\" data-tumblr-attribution=\"saffitz:GbmnA7vmHluLNaFuCS-wEg:ZAa_FX2i3t1AU\"><img src=\"https://66.media.tumblr.com/788038246a051c6825910cfa96e25549/tumblr_pr40uefEeC1y78h9ro1_400.gif\" data-orig-height=\"268\" data-orig-width=\"268\"></figure>\n",
        "reblog": {
            "comment": "<p><b>Requests: </b></p><p>Anonymous: So I just read Home and you did absolutely wonderful. I felt so much fluff, I was grinning the whole time. If you are still taking requests, can you do a continuation of Home where Brie kind of gets sad because of all the hate she is getting (she doesn’t deserve it) and the reader comforts her together with the rest of the mcu cast especially Hemsworth and Cheadle. Thank you.</p><p>Anonymous:<b> </b>i loved your Home one shot! can you do one where brie and her non famous girlfriend are hanging out at Disneyland with the other cast after she is done with press</p><p><b>Pairing: </b>Brie x reader</p><p><b>A/N:</b> Wooow I’m posting this much later than I meant to. Thank you both for the love and for the requests!! I love both of these requests and thought they would kinda work well together so here it is! Enjoy!!</p><figure class=\"tmblr-full\" data-orig-height=\"268\" data-orig-width=\"268\" data-tumblr-attribution=\"saffitz:GbmnA7vmHluLNaFuCS-wEg:ZAa_FX2i3t1AU\"><img src=\"https://66.media.tumblr.com/788038246a051c6825910cfa96e25549/tumblr_pr40uefEeC1y78h9ro1_400.gif\" data-orig-height=\"268\" data-orig-width=\"268\"></figure>[[MORE]]<p>The feeling of strong arms wrapping around you wakes you up. You groan slightly, snuggling closer to Brie. She pulls you in towards her, pressing a kiss to your neck before she leans over you and kisses you on the lips. You hum into the kiss and she pulls back, smiling softly at you.</p><p>“Morning,” she says with a slight rasp to her voice. You lift a hand to tuck a strand of her short hair behind her ear and out of her face.</p><p>“Good morning, baby,” you reply to her before reaching towards your phone. You glance at the time and then back at Brie. “I’ve got to get up, I’m supposed to be meeting some friends for breakfast.” Brie immediately pouts.</p><p>\n“What? No! Stay here and cuddle with me!” You attempt to remove her arms from around you but she only tightens them. You huff and playfully glare at her.</p><p>“Brie. I swear I’ll be back so quickly you’ll barely realise I’ve gone. Then we can cuddle for as long as you want.” Brie seems to contemplate your words for a moment before reluctantly releasing you from her hold.</p><p>“Fine. But you better be ready to cuddle me the second you get back.” You chuckle at her and kiss the pout off her lips before getting out of bed.</p><p>“You’ve got a deal.”</p><p><br></p><hr><p><br></p><p>As promised, breakfast is only a quick outing and you’re back at the house fairly quickly. You make your way to the bedroom where you assume Brie still is. Your confusion peaks, however, when you notice the curtains are drawn shut, the room shrouded in darkness. You can see Brie’s figure sitting on the bed and her laptop in front of her shines some light onto her features.<br></p><p>“Uhh. Babe, this is very ominous, don’t you think?” You startle Brie and immediately notice when she swipes at her face, clearly wiping away tears.</p><p>“Brie?” You automatically rush to her, placing yourself on the bed in front of her and resting your hands on her face. “What is it?” You wipe at the tears she missed and watch her closely, trying to focus on her eyes through the dark of the room.</p><p>“It’s okay. Everything’s okay, I’m fine,” she says weakly. You give her a disbelieving look.</p><p>“You don’t look fine to me. What happened?” You speak gently and she sighs as another tear rolls down her cheek. You wipe it away with your thumb and wait patiently before Brie grabs her laptop and shows you the screen.</p><p>She’s got Youtube open, and she’s searched her own name in the search bar. You look at some of the videos listed on the page. They range from ‘How Brie Larson is ruining the MCU’ to ‘Proof that the Avengers cast hate Brie Larson’. You sigh and look at her.</p><p>“Brie, what were even doing looking at this stuff? You know it’s all bullshit.” She shrugs weakly and you shut her laptop and put it aside.</p><p>“While you were gone, I went on Twitter and saw all these guys posting about me and how Don and Chris clearly hate me.” You place your hand on Brie’s thigh to comfort her and she drops her hand onto of yours, tracing the back of your hand with her thumb. “I mean, I kind of knew it was happening. I guess it just hit me hard today. Especially when I saw all the videos.”</p><p>“Looks like you should extend that stay away from social media then, hm?” You say gently. Brie sadly hums in response and wraps you in a tight embrace.</p><p>Since the end of the press tour, Brie had been overwhelmed with the amount of attention she’d received, both good and bad, and had decided on a much needed break from social media. You knew that as she’d gotten more popular, she’d had difficulty dealing with the attention because of her introverted nature, and she needed these breaks from time to time.</p><p>“Hey, how about we go out and do something today? We can forget all about the trolls of the internet for a little while.” You kiss Brie on the cheek and she leans into your body more.</p><p>“I don’t know, Y/N. I’m just really not in the mood today.” She pulls away from your embrace and stands, rubbing her face with her hand before she smiles at you sadly. “I’m sorry.” You stand up to join her, taking her hands in your own and holding them between you.</p><p>“Brie, you have absolutely nothing to apologise for. You hear me?” Your words are gentle and you see the smallest of smiles cross her face.</p><p>“Yeah,” she nods. Her eyes hold a warmth for you as she holds your gaze. “I’m just gonna jump in the shower. Maybe it’ll make me feel a little better.” You nod at her and watch her walk into the bathroom, closing the door behind her.</p><p>When you hear the shower turn on you pull your phone out, going through your contacts and finding the name you were after. You bite your lip in hesitation for a second before hitting the call button and holding the phone to your ear.</p><p>“Hello?” You hear Chris Hemsworth answer after a few moments.</p><p>“Hey, Chris!” You say. At some point around the time of the world premiere for Endgame, you and the majority of the cast had all exchanged numbers, and right now you were glad that happened.</p><p>“Y/N! How’s it going? What can I do for you?” Hemsworth was a person you absolutely loved to talk to. No matter what the circumstance, he always had such a positive energy and you know he helped Brie out a lot when it came to her introduction to the MCU.</p><p>“You’re in LA right now, yeah?” You ask.</p><p>“I am! I just got back from Australia, like, two days ago.” You breath a sigh of relief.</p><p>“Okay, good. Uh, listen, Brie’s really not having a great day today. She found some videos online saying that the whole Avengers cast hates her and that she’s ruining the MCU.”</p><p>You hear Hemsworth mutter an “oh shit” before you continue.</p><p>“I was just wondering if you wouldn’t mind maybe coming by to talk to her? I have a feeling it’ll make her feel better hearing that it’s all bullshit from one of you guys instead of just me.”</p><p>“Of course!” Chris immediately exclaims. “You know what, I’ll try do one better. Let me make some calls and I’ll be ‘round soon, yeah?”</p><p><br></p><hr><p><br></p><p>Brie comes out of the bathroom and walks to the kitchen, where she finds you drinking a cup of coffee. She watches you for a moment and you offer her an affectionate smile before nodding your head in the direction of another mug sitting on the countertop.</p><p>“That one’s for you,” you say and she smiles gratefully, walking further into the kitchen to pick the mug up and take a sip from it.</p><p>\n“Mm, I so needed this. Thank you.”</p><p>“No problem.” You both continue drinking your coffees in relative silence for a while. You can see the shower has made Brie feel a little better, but her eyebrows are drawn together and you can see she is still stuck in her own thoughts.</p><p>\nYou glance at your phone to see if Hemsworth has texted you. At the lack of messages on your phone, you put it down on the countertop and look back at Brie. She draws her lower lip between her teeth, completely lost in her own thoughts, and you sigh, hoping Hemsworth gets here soon.</p><p>Right on cue, you hear your doorbell ring and Brie’s head snaps towards the door. She looks back at you in question.</p><p>“Are we expecting anyone today?” She asks and you shrug as she makes her way to your front door and opens it.</p><p>“Hey!” You hear Hemsworth shout in greeting before you see him step inside to hug Brie. She returns the hug before pulling back with a confused look on her face.</p><p>“Hemsworth. What brings you here?” She asks, though you can already see a smile on her face.</p><p>“What, you’re not excited to see me?” Chris says. His mouth turns to form a deep frown. Brie laughs at him before shoving him arm lightly.</p><p>“You know that’s not what I meant.” Chris chuckles and his smile finds its way back to his face.</p><p>“Well, a little birdie might have told me that you were having a pretty rough morning. So I’m here to make sure you still have an amazing day. Let’s go!” He exclaims as he gestures with his arm for you and Brie to follow him before he disappears out the door again. Brie turns to look at you.</p><p>“You called him?” You shrug, thankfully sensing that Brie wasn’t mad at you for calling Hemsworth. You walk towards her and her eyes study you carefully.</p><p>“You were breaking my heart,” you say and you see her eyes begin to swim with tears. “Plus, I’d say the fact that he dropped everything to get here so quickly kinda proves he doesn’t hate you.” Brie lets out a laugh and quickly wipes at her eyes before her tears can properly fall.</p><p>“Come on!” Hemsworth says insistently, coming back through the door. “Geez, at least you’re not going around telling everyone you’re the fastest avenger, eh?” He offers a cheeky wink to Brie before dodging a punch she has aimed at his arm.</p><p>Brie shakes her head and laughs, grabbing your hand as the two of you follow him out.</p><p><br></p><hr><p><br></p><p>You and Brie find yourselves sitting in the backseat of Chris’ car, and he drives for a little while before Brie finally speaks up.</p><p>“So, where are you taking us?” Chris smiles at you both through his rear-view mirror.</p><p>“Only the happiest place on earth, duh! Where else would I be taking you?” Brie looks at you for a moment, her brow furrowing in confusion before she turns to Chris again.</p><p>“You’re telling me we’re going to Disneyland?”</p><p>“Yep! It’s guaranteed to cheer you up the second we get there. And on top of that, I might have also called in some of the squad who could make it.” Brie’s mouth drops open slightly.</p><p>“Wait, really? You’re really all doing this because I was upset?”</p><p>“Well, yeah. Of course. We’re a family, you know.” Brie smiles a disbelieving smile and you see more tears form in her eyes. You take her hand and squeeze it in reassurance. “Besides, you know all the haters are just jealous of our friendship. Let’s be real. All banter aside, we are the two strongest avengers.”</p><p>“Obviously,” Brie laughs.</p><p>The car slows down and you look to see that you have arrived. Hemsworth parks the car and the three of you get out.</p><p>\n“Okay, we’re meeting everyone near the side of the entrance, over this way.” You follow him down near the entrance where he leads you to the group, who are trying to be subtle to avoid the attention of fans before they even get inside the park.</p><p>Everyone immediately cheers in greeting as you join them. The group consists of Scarlett Johansson, Mark Ruffalo, Chris Evans, Sebastian Stan, Anthony Mackie, Jeremy Renner, Paul Rudd and Don Cheadle. Everyone hugs one another before deciding to head into the park.</p><p>“I can’t believe I’m at Disneyland right now without my kids. This is awesome,” Paul says, earning a laugh from the group as you all pay for your tickets and enter the park. You begin walking down Main Street, USA and, to no one’s surprise, fans immediately begin recognising the group.</p><p>They all are happy to oblige when fans ask to take a quick photo, and you stand back and admire the group of people you regularly get to associate with. You all make your way through the park, stopping to get ice cream and to purchase Mickey Mouse ears which you all proudly wear.</p><p>You and Brie walk hand in hand with the rest of the group and you look over to Brie to find a huge smile on her face. Your heart warms at the sight and you mirror the smile on your own face.</p><p>Because you had arrived partway through the day, you are all aware that you have limited time to go on rides and hang out with each other before the fireworks show starts later in the evening. You all decide to head to Tomorrowland first, of course heading straight for Space Mountain and some of the other rides.</p><p>Hemsworth insists that everyone has to get a photo together with Mickie and Minnie, which turns out to be difficult with he size of the group but also a great deal of fun choosing which poses to go with.</p><p>As you continue walking through Disneyland, you and Brie continue to walk contently with each other, trailing towards the back of the group. Mackie and Sebastian are acting as unofficial leaders for the day, leading the pack from one place to another while everyone else loudly talks among themselves.</p><p>Somewhere between Fantasyland and Frontierland, Cheadle breaks away from his conversation with Evans to drop back and join you and Brie.</p><p>“Hey. Listen, Brie. You know anything those guys have to say online is bullshit, right? I mean, you’ve got to know how much we all love you.” Brie takes in a deep breath and sighs, looking at Cheadle.</p><p>“I do know. I guess it just really got to me today, you know?”</p><p>“Yeah, I get it.” Cheadle nods, complete sincerity in his tone. “They’re only coming for you because you’re a strong woman standing up for what’s right and they’re just threatened by you. That’s literally all it is. I’d probably even take it as a compliment if I were you.” Brie laughs.</p><p>“That’s actually a good way of looking at it. Thanks, Don. It means a lot.” Your group stops walking so some fans can get photos and Brie takes the opportunity to hug Cheadle.</p><p>\n“Any time, Brie.” He smiles at her before Evans calls him back over. The group starts moving again and Scarlett drops back to walk with you two now.</p><p>“I know we’ve been stopped a lot for photos, but it’s actually kind of a nice break after that press tour, don’t you think?” Brie quickly nods.</p><p>“Oh, one hundred percent. That press tour was on a whole other level.” You know how tough press tours can be for Brie, and she practically did back-to-back press tours for Captain Marvel and Avengers: Endgame, two of the biggest movies in the past year.</p><p>You’d only travelled with her for part of the Endgame press tour, so while you’d been at home you’d received a lot of phone calls and FaceTimes from Brie, many of which she would break down in tears because of just how exhausted she was. She also missed having you by her side, which is why she’d asked you to join her during the Endgame tour.</p><p>“Okay guys! Let’s stop to eat some food, then we’re heading to Space Mountain again before the fireworks. Sound good?” Mackie announces to the group, receiving a positive answer as he leads them towards the nearest restaurant.</p><p><br></p><hr><p><br></p><p>After going on Space Mountain again, you and the cast head off to find the perfect spot to sit and watch the fireworks together.<br><br>\n“Brie,” you hear from behind you as Hemsworth runs up to you and Brie. “Can we get a selfie?” He points at his phone and offers a grin.</p><p>“Of course,” Brie happily agrees. “What’s this for? Instagram?”</p><p>“Yeah. I’m planning on putting up some photos that are just a massive ‘fuck you’ to all the guys hating on you and saying we don’t like you. Plus, our whole group is just full of really hot people. I kinda want to use that for the likes, you know?” Brie laughs and shakes her head before her and Chris pose for a selfie, still both proudly wearing their Mickey ears.</p><p>Eventually, everyone decides on a spot to sit and watch the fireworks. Brie sits off slightly to the side of everyone else to give you both a little privacy, and gestures for you to sit between her legs in front of her. You do and she doesn’t waste any time wrapping her arms comfortably around your waist.</p><p>When the fireworks begin, Brie pulls you in closer and you lean into her body, feeling her chin coming to rest on your shoulder. Your hands rest on top of hers as you watch the show.</p><p>“Thank you,” you hear Brie say next to your ear. You turn your head slightly to look at her.</p><p>\n“For what?”</p><p>“For everything. You turned a pretty shitty day into one that I completely loved.”</p><p>“You know it’s no problem, Brie. But it definitely wasn’t just me who did all of this.” Brie presses her lips to your shoulder and you can feel the smile on your face.</p><p>“No, it wasn’t. But we both know that if it weren’t for you, I wouldn’t be so happy right now.” You shrug lightly.</p><p>“Well. You know I would do anything for you.”</p><p>“God, this is gonna sound super sappy, but you’re the most amazing person I’ve ever met and I’m so glad I get to call you mine.” You chuckle, a smile plastered on your face and you turn to capture Brie’s lips in a kiss.</p><p>“I love you,” you mumble against her lips. The corners of Brie’s eyes crinkle as she grins at you.</p><p>“I love you too.”</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "capcarolsdanver",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/2b48f0a90284e46158867bc708399373/bozsmjg/Vlzppnb3n/tumblr_static_e17a8gyi0js4wg080ookcsk0k.jpg",
                        "header_image_focused": "https://static.tumblr.com/2b48f0a90284e46158867bc708399373/bozsmjg/Vlzppnb3n/tumblr_static_e17a8gyi0js4wg080ookcsk0k_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/2b48f0a90284e46158867bc708399373/bozsmjg/Vlzppnb3n/tumblr_static_e17a8gyi0js4wg080ookcsk0k_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Quadrat",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184808662072"
                },
                "content_raw": "<p><b>Requests: </b></p><p>Anonymous: So I just read Home and you did absolutely wonderful. I felt so much fluff, I was grinning the whole time. If you are still taking requests, can you do a continuation of Home where Brie kind of gets sad because of all the hate she is getting (she doesn’t deserve it) and the reader comforts her together with the rest of the mcu cast especially Hemsworth and Cheadle. Thank you.</p><p>Anonymous:<b> </b>i loved your Home one shot! can you do one where brie and her non famous girlfriend are hanging out at Disneyland with the other cast after she is done with press</p><p><b>Pairing: </b>Brie x reader</p><p><b>A/N:</b> Wooow I’m posting this much later than I meant to. Thank you both for the love and for the requests!! I love both of these requests and thought they would kinda work well together so here it is! Enjoy!!</p><figure class=\"tmblr-full\" data-orig-height=\"268\" data-orig-width=\"268\" data-tumblr-attribution=\"saffitz:GbmnA7vmHluLNaFuCS-wEg:ZAa_FX2i3t1AU\"><img src=\"https://66.media.tumblr.com/788038246a051c6825910cfa96e25549/tumblr_pr40uefEeC1y78h9ro1_400.gif\" data-orig-height=\"268\" data-orig-width=\"268\"></figure>[[MORE]]<p>The feeling of strong arms wrapping around you wakes you up. You groan slightly, snuggling closer to Brie. She pulls you in towards her, pressing a kiss to your neck before she leans over you and kisses you on the lips. You hum into the kiss and she pulls back, smiling softly at you.</p><p>“Morning,” she says with a slight rasp to her voice. You lift a hand to tuck a strand of her short hair behind her ear and out of her face.</p><p>“Good morning, baby,” you reply to her before reaching towards your phone. You glance at the time and then back at Brie. “I’ve got to get up, I’m supposed to be meeting some friends for breakfast.” Brie immediately pouts.</p><p>\n“What? No! Stay here and cuddle with me!” You attempt to remove her arms from around you but she only tightens them. You huff and playfully glare at her.</p><p>“Brie. I swear I’ll be back so quickly you’ll barely realise I’ve gone. Then we can cuddle for as long as you want.” Brie seems to contemplate your words for a moment before reluctantly releasing you from her hold.</p><p>“Fine. But you better be ready to cuddle me the second you get back.” You chuckle at her and kiss the pout off her lips before getting out of bed.</p><p>“You’ve got a deal.”</p><p><br></p><hr><p><br></p><p>As promised, breakfast is only a quick outing and you’re back at the house fairly quickly. You make your way to the bedroom where you assume Brie still is. Your confusion peaks, however, when you notice the curtains are drawn shut, the room shrouded in darkness. You can see Brie’s figure sitting on the bed and her laptop in front of her shines some light onto her features.<br></p><p>“Uhh. Babe, this is very ominous, don’t you think?” You startle Brie and immediately notice when she swipes at her face, clearly wiping away tears.</p><p>“Brie?” You automatically rush to her, placing yourself on the bed in front of her and resting your hands on her face. “What is it?” You wipe at the tears she missed and watch her closely, trying to focus on her eyes through the dark of the room.</p><p>“It’s okay. Everything’s okay, I’m fine,” she says weakly. You give her a disbelieving look.</p><p>“You don’t look fine to me. What happened?” You speak gently and she sighs as another tear rolls down her cheek. You wipe it away with your thumb and wait patiently before Brie grabs her laptop and shows you the screen.</p><p>She’s got Youtube open, and she’s searched her own name in the search bar. You look at some of the videos listed on the page. They range from ‘How Brie Larson is ruining the MCU’ to ‘Proof that the Avengers cast hate Brie Larson’. You sigh and look at her.</p><p>“Brie, what were even doing looking at this stuff? You know it’s all bullshit.” She shrugs weakly and you shut her laptop and put it aside.</p><p>“While you were gone, I went on Twitter and saw all these guys posting about me and how Don and Chris clearly hate me.” You place your hand on Brie’s thigh to comfort her and she drops her hand onto of yours, tracing the back of your hand with her thumb. “I mean, I kind of knew it was happening. I guess it just hit me hard today. Especially when I saw all the videos.”</p><p>“Looks like you should extend that stay away from social media then, hm?” You say gently. Brie sadly hums in response and wraps you in a tight embrace.</p><p>Since the end of the press tour, Brie had been overwhelmed with the amount of attention she’d received, both good and bad, and had decided on a much needed break from social media. You knew that as she’d gotten more popular, she’d had difficulty dealing with the attention because of her introverted nature, and she needed these breaks from time to time.</p><p>“Hey, how about we go out and do something today? We can forget all about the trolls of the internet for a little while.” You kiss Brie on the cheek and she leans into your body more.</p><p>“I don’t know, Y/N. I’m just really not in the mood today.” She pulls away from your embrace and stands, rubbing her face with her hand before she smiles at you sadly. “I’m sorry.” You stand up to join her, taking her hands in your own and holding them between you.</p><p>“Brie, you have absolutely nothing to apologise for. You hear me?” Your words are gentle and you see the smallest of smiles cross her face.</p><p>“Yeah,” she nods. Her eyes hold a warmth for you as she holds your gaze. “I’m just gonna jump in the shower. Maybe it’ll make me feel a little better.” You nod at her and watch her walk into the bathroom, closing the door behind her.</p><p>When you hear the shower turn on you pull your phone out, going through your contacts and finding the name you were after. You bite your lip in hesitation for a second before hitting the call button and holding the phone to your ear.</p><p>“Hello?” You hear Chris Hemsworth answer after a few moments.</p><p>“Hey, Chris!” You say. At some point around the time of the world premiere for Endgame, you and the majority of the cast had all exchanged numbers, and right now you were glad that happened.</p><p>“Y/N! How’s it going? What can I do for you?” Hemsworth was a person you absolutely loved to talk to. No matter what the circumstance, he always had such a positive energy and you know he helped Brie out a lot when it came to her introduction to the MCU.</p><p>“You’re in LA right now, yeah?” You ask.</p><p>“I am! I just got back from Australia, like, two days ago.” You breath a sigh of relief.</p><p>“Okay, good. Uh, listen, Brie’s really not having a great day today. She found some videos online saying that the whole Avengers cast hates her and that she’s ruining the MCU.”</p><p>You hear Hemsworth mutter an “oh shit” before you continue.</p><p>“I was just wondering if you wouldn’t mind maybe coming by to talk to her? I have a feeling it’ll make her feel better hearing that it’s all bullshit from one of you guys instead of just me.”</p><p>“Of course!” Chris immediately exclaims. “You know what, I’ll try do one better. Let me make some calls and I’ll be ‘round soon, yeah?”</p><p><br></p><hr><p><br></p><p>Brie comes out of the bathroom and walks to the kitchen, where she finds you drinking a cup of coffee. She watches you for a moment and you offer her an affectionate smile before nodding your head in the direction of another mug sitting on the countertop.</p><p>“That one’s for you,” you say and she smiles gratefully, walking further into the kitchen to pick the mug up and take a sip from it.</p><p>\n“Mm, I so needed this. Thank you.”</p><p>“No problem.” You both continue drinking your coffees in relative silence for a while. You can see the shower has made Brie feel a little better, but her eyebrows are drawn together and you can see she is still stuck in her own thoughts.</p><p>\nYou glance at your phone to see if Hemsworth has texted you. At the lack of messages on your phone, you put it down on the countertop and look back at Brie. She draws her lower lip between her teeth, completely lost in her own thoughts, and you sigh, hoping Hemsworth gets here soon.</p><p>Right on cue, you hear your doorbell ring and Brie’s head snaps towards the door. She looks back at you in question.</p><p>“Are we expecting anyone today?” She asks and you shrug as she makes her way to your front door and opens it.</p><p>“Hey!” You hear Hemsworth shout in greeting before you see him step inside to hug Brie. She returns the hug before pulling back with a confused look on her face.</p><p>“Hemsworth. What brings you here?” She asks, though you can already see a smile on her face.</p><p>“What, you’re not excited to see me?” Chris says. His mouth turns to form a deep frown. Brie laughs at him before shoving him arm lightly.</p><p>“You know that’s not what I meant.” Chris chuckles and his smile finds its way back to his face.</p><p>“Well, a little birdie might have told me that you were having a pretty rough morning. So I’m here to make sure you still have an amazing day. Let’s go!” He exclaims as he gestures with his arm for you and Brie to follow him before he disappears out the door again. Brie turns to look at you.</p><p>“You called him?” You shrug, thankfully sensing that Brie wasn’t mad at you for calling Hemsworth. You walk towards her and her eyes study you carefully.</p><p>“You were breaking my heart,” you say and you see her eyes begin to swim with tears. “Plus, I’d say the fact that he dropped everything to get here so quickly kinda proves he doesn’t hate you.” Brie lets out a laugh and quickly wipes at her eyes before her tears can properly fall.</p><p>“Come on!” Hemsworth says insistently, coming back through the door. “Geez, at least you’re not going around telling everyone you’re the fastest avenger, eh?” He offers a cheeky wink to Brie before dodging a punch she has aimed at his arm.</p><p>Brie shakes her head and laughs, grabbing your hand as the two of you follow him out.</p><p><br></p><hr><p><br></p><p>You and Brie find yourselves sitting in the backseat of Chris’ car, and he drives for a little while before Brie finally speaks up.</p><p>“So, where are you taking us?” Chris smiles at you both through his rear-view mirror.</p><p>“Only the happiest place on earth, duh! Where else would I be taking you?” Brie looks at you for a moment, her brow furrowing in confusion before she turns to Chris again.</p><p>“You’re telling me we’re going to Disneyland?”</p><p>“Yep! It’s guaranteed to cheer you up the second we get there. And on top of that, I might have also called in some of the squad who could make it.” Brie’s mouth drops open slightly.</p><p>“Wait, really? You’re really all doing this because I was upset?”</p><p>“Well, yeah. Of course. We’re a family, you know.” Brie smiles a disbelieving smile and you see more tears form in her eyes. You take her hand and squeeze it in reassurance. “Besides, you know all the haters are just jealous of our friendship. Let’s be real. All banter aside, we are the two strongest avengers.”</p><p>“Obviously,” Brie laughs.</p><p>The car slows down and you look to see that you have arrived. Hemsworth parks the car and the three of you get out.</p><p>\n“Okay, we’re meeting everyone near the side of the entrance, over this way.” You follow him down near the entrance where he leads you to the group, who are trying to be subtle to avoid the attention of fans before they even get inside the park.</p><p>Everyone immediately cheers in greeting as you join them. The group consists of Scarlett Johansson, Mark Ruffalo, Chris Evans, Sebastian Stan, Anthony Mackie, Jeremy Renner, Paul Rudd and Don Cheadle. Everyone hugs one another before deciding to head into the park.</p><p>“I can’t believe I’m at Disneyland right now without my kids. This is awesome,” Paul says, earning a laugh from the group as you all pay for your tickets and enter the park. You begin walking down Main Street, USA and, to no one’s surprise, fans immediately begin recognising the group.</p><p>They all are happy to oblige when fans ask to take a quick photo, and you stand back and admire the group of people you regularly get to associate with. You all make your way through the park, stopping to get ice cream and to purchase Mickey Mouse ears which you all proudly wear.</p><p>You and Brie walk hand in hand with the rest of the group and you look over to Brie to find a huge smile on her face. Your heart warms at the sight and you mirror the smile on your own face.</p><p>Because you had arrived partway through the day, you are all aware that you have limited time to go on rides and hang out with each other before the fireworks show starts later in the evening. You all decide to head to Tomorrowland first, of course heading straight for Space Mountain and some of the other rides.</p><p>Hemsworth insists that everyone has to get a photo together with Mickie and Minnie, which turns out to be difficult with he size of the group but also a great deal of fun choosing which poses to go with.</p><p>As you continue walking through Disneyland, you and Brie continue to walk contently with each other, trailing towards the back of the group. Mackie and Sebastian are acting as unofficial leaders for the day, leading the pack from one place to another while everyone else loudly talks among themselves.</p><p>Somewhere between Fantasyland and Frontierland, Cheadle breaks away from his conversation with Evans to drop back and join you and Brie.</p><p>“Hey. Listen, Brie. You know anything those guys have to say online is bullshit, right? I mean, you’ve got to know how much we all love you.” Brie takes in a deep breath and sighs, looking at Cheadle.</p><p>“I do know. I guess it just really got to me today, you know?”</p><p>“Yeah, I get it.” Cheadle nods, complete sincerity in his tone. “They’re only coming for you because you’re a strong woman standing up for what’s right and they’re just threatened by you. That’s literally all it is. I’d probably even take it as a compliment if I were you.” Brie laughs.</p><p>“That’s actually a good way of looking at it. Thanks, Don. It means a lot.” Your group stops walking so some fans can get photos and Brie takes the opportunity to hug Cheadle.</p><p>\n“Any time, Brie.” He smiles at her before Evans calls him back over. The group starts moving again and Scarlett drops back to walk with you two now.</p><p>“I know we’ve been stopped a lot for photos, but it’s actually kind of a nice break after that press tour, don’t you think?” Brie quickly nods.</p><p>“Oh, one hundred percent. That press tour was on a whole other level.” You know how tough press tours can be for Brie, and she practically did back-to-back press tours for Captain Marvel and Avengers: Endgame, two of the biggest movies in the past year.</p><p>You’d only travelled with her for part of the Endgame press tour, so while you’d been at home you’d received a lot of phone calls and FaceTimes from Brie, many of which she would break down in tears because of just how exhausted she was. She also missed having you by her side, which is why she’d asked you to join her during the Endgame tour.</p><p>“Okay guys! Let’s stop to eat some food, then we’re heading to Space Mountain again before the fireworks. Sound good?” Mackie announces to the group, receiving a positive answer as he leads them towards the nearest restaurant.</p><p><br></p><hr><p><br></p><p>After going on Space Mountain again, you and the cast head off to find the perfect spot to sit and watch the fireworks together.<br><br>\n“Brie,” you hear from behind you as Hemsworth runs up to you and Brie. “Can we get a selfie?” He points at his phone and offers a grin.</p><p>“Of course,” Brie happily agrees. “What’s this for? Instagram?”</p><p>“Yeah. I’m planning on putting up some photos that are just a massive ‘fuck you’ to all the guys hating on you and saying we don’t like you. Plus, our whole group is just full of really hot people. I kinda want to use that for the likes, you know?” Brie laughs and shakes her head before her and Chris pose for a selfie, still both proudly wearing their Mickey ears.</p><p>Eventually, everyone decides on a spot to sit and watch the fireworks. Brie sits off slightly to the side of everyone else to give you both a little privacy, and gestures for you to sit between her legs in front of her. You do and she doesn’t waste any time wrapping her arms comfortably around your waist.</p><p>When the fireworks begin, Brie pulls you in closer and you lean into her body, feeling her chin coming to rest on your shoulder. Your hands rest on top of hers as you watch the show.</p><p>“Thank you,” you hear Brie say next to your ear. You turn your head slightly to look at her.</p><p>\n“For what?”</p><p>“For everything. You turned a pretty shitty day into one that I completely loved.”</p><p>“You know it’s no problem, Brie. But it definitely wasn’t just me who did all of this.” Brie presses her lips to your shoulder and you can feel the smile on your face.</p><p>“No, it wasn’t. But we both know that if it weren’t for you, I wouldn’t be so happy right now.” You shrug lightly.</p><p>“Well. You know I would do anything for you.”</p><p>“God, this is gonna sound super sappy, but you’re the most amazing person I’ve ever met and I’m so glad I get to call you mine.” You chuckle, a smile plastered on your face and you turn to capture Brie’s lips in a kiss.</p><p>“I love you,” you mumble against her lips. The corners of Brie’s eyes crinkle as she grins at you.</p><p>“I love you too.”</p>",
                "content": "<p><b>Requests:&nbsp;</b></p><p>Anonymous: So I just read Home and you did absolutely wonderful. I felt so much fluff, I was grinning the whole time. If you are still taking requests, can you do a continuation of Home where Brie kind of gets sad because of all the hate she is getting (she doesn&rsquo;t deserve it) and the reader comforts her together with the rest of the mcu cast especially Hemsworth and Cheadle. Thank you.</p><p>Anonymous:<b>&nbsp;</b>i loved your Home one shot! can you do one where brie and her non famous girlfriend are hanging out at Disneyland with the other cast after she is done with press</p><p><b>Pairing: </b>Brie x reader</p><p><b>A/N:</b>&nbsp;Wooow I&rsquo;m posting this much later than I meant to. Thank you both for the love and for the requests!! I love both of these requests and thought they would kinda work well together so here it is! Enjoy!!</p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><p>The feeling of strong arms wrapping around you wakes you up. You groan slightly, snuggling closer to Brie. She pulls you in towards her, pressing a kiss to your neck before she leans over you and kisses you on the lips. You hum into the kiss and she pulls back, smiling softly at you.</p><p>&ldquo;Morning,&rdquo; she says with a slight rasp to her voice. You lift a hand to tuck a strand of her short hair behind her ear and out of her face.</p><p>&ldquo;Good morning, baby,&rdquo; you reply to her before reaching towards your phone. You glance at the time and then back at Brie. &ldquo;I&rsquo;ve got to get up, I&rsquo;m supposed to be meeting some friends for breakfast.&rdquo; Brie immediately pouts.</p><p>\n&ldquo;What? No! Stay here and cuddle with me!&rdquo; You attempt to remove her arms from around you but she only tightens them. You huff and playfully glare at her.</p><p>&ldquo;Brie. I swear I&rsquo;ll be back so quickly you&rsquo;ll barely realise I&rsquo;ve gone. Then we can cuddle for as long as you want.&rdquo; Brie seems to contemplate your words for a moment before reluctantly releasing you from her hold.</p><p>&ldquo;Fine. But you better be ready to cuddle me the second you get back.&rdquo; You chuckle at her and kiss the pout off her lips before getting out of bed.</p><p>&ldquo;You&rsquo;ve got a deal.&rdquo;</p><p><br /></p><hr /><p><br /></p><p>As promised, breakfast is only a quick outing and you&rsquo;re back at the house fairly quickly. You make your way to the bedroom where you assume Brie still is. Your confusion peaks, however, when you notice the curtains are drawn shut, the room shrouded in darkness. You can see Brie&rsquo;s figure sitting on the bed and her laptop in front of her shines some light onto her features.<br /></p><p>&ldquo;Uhh. Babe, this is very ominous, don&rsquo;t you think?&rdquo; You startle Brie and immediately notice when she swipes at her face, clearly wiping away tears.</p><p>&ldquo;Brie?&rdquo; You automatically rush to her, placing yourself on the bed in front of her and resting your hands on her face. &ldquo;What is it?&rdquo; You wipe at the tears she missed and watch her closely, trying to focus on her eyes through the dark of the room.</p><p>&ldquo;It&rsquo;s okay. Everything&rsquo;s okay, I&rsquo;m fine,&rdquo; she says weakly. You give her a disbelieving look.</p><p>&ldquo;You don&rsquo;t look fine to me. What happened?&rdquo; You speak gently and she sighs as another tear rolls down her cheek. You wipe it away with your thumb and wait patiently before Brie grabs her laptop and shows you the screen.</p><p>She&rsquo;s got Youtube open, and she&rsquo;s searched her own name in the search bar. You look at some of the videos listed on the page. They range from &lsquo;How Brie Larson is ruining the MCU&rsquo; to &lsquo;Proof that the Avengers cast hate Brie Larson&rsquo;. You sigh and look at her.</p><p>&ldquo;Brie, what were even doing looking at this stuff? You know it&rsquo;s all bullshit.&rdquo; She shrugs weakly and you shut her laptop and put it aside.</p><p>&ldquo;While you were gone, I went on Twitter and saw all these guys posting about me and how Don and Chris clearly hate me.&rdquo; You place your hand on Brie&rsquo;s thigh to comfort her and she drops her hand onto of yours, tracing the back of your hand with her thumb. &ldquo;I mean, I kind of knew it was happening. I guess it just hit me hard today. Especially when I saw all the videos.&rdquo;</p><p>&ldquo;Looks like you should extend that stay away from social media then, hm?&rdquo; You say gently. Brie sadly hums in response and wraps you in a tight embrace.</p><p>Since the end of the press tour, Brie had been overwhelmed with the amount of attention she&rsquo;d received, both good and bad, and had decided on a much needed break from social media. You knew that as she&rsquo;d gotten more popular, she&rsquo;d had difficulty dealing with the attention because of her introverted nature, and she needed these breaks from time to time.</p><p>&ldquo;Hey, how about we go out and do something today? We can forget all about the trolls of the internet for a little while.&rdquo; You kiss Brie on the cheek and she leans into your body more.</p><p>&ldquo;I don&rsquo;t know, Y/N. I&rsquo;m just really not in the mood today.&rdquo; She pulls away from your embrace and stands, rubbing her face with her hand before she smiles at you sadly. &ldquo;I&rsquo;m sorry.&rdquo; You stand up to join her, taking her hands in your own and holding them between you.</p><p>&ldquo;Brie, you have absolutely nothing to apologise for. You hear me?&rdquo; Your words are gentle and you see the smallest of smiles cross her face.</p><p>&ldquo;Yeah,&rdquo; she nods. Her eyes hold a warmth for you as she holds your gaze. &ldquo;I&rsquo;m just gonna jump in the shower. Maybe it&rsquo;ll make me feel a little better.&rdquo; You nod at her and watch her walk into the bathroom, closing the door behind her.</p><p>When you hear the shower turn on you pull your phone out, going through your contacts and finding the name you were after. You bite your lip in hesitation for a second before hitting the call button and holding the phone to your ear.</p><p>&ldquo;Hello?&rdquo; You hear Chris Hemsworth answer after a few moments.</p><p>&ldquo;Hey, Chris!&rdquo; You say. At some point around the time of the world premiere for Endgame, you and the majority of the cast had all exchanged numbers, and right now you were glad that happened.</p><p>&ldquo;Y/N! How&rsquo;s it going? What can I do for you?&rdquo; Hemsworth was a person you absolutely loved to talk to. No matter what the circumstance, he always had such a positive energy and you know he helped Brie out a lot when it came to her introduction to the MCU.</p><p>&ldquo;You&rsquo;re in LA right now, yeah?&rdquo; You ask.</p><p>&ldquo;I am! I just got back from Australia, like, two days ago.&rdquo; You breath a sigh of relief.</p><p>&ldquo;Okay, good. Uh, listen, Brie&rsquo;s really not having a great day today. She found some videos online saying that the whole Avengers cast hates her and that she&rsquo;s ruining the MCU.&rdquo;</p><p>You hear Hemsworth mutter an &ldquo;oh shit&rdquo; before you continue.</p><p>&ldquo;I was just wondering if you wouldn&rsquo;t mind maybe coming by to talk to her? I have a feeling it&rsquo;ll make her feel better hearing that it&rsquo;s all bullshit from one of you guys instead of just me.&rdquo;</p><p>&ldquo;Of course!&rdquo; Chris immediately exclaims. &ldquo;You know what, I&rsquo;ll try do one better. Let me make some calls and I&rsquo;ll be &lsquo;round soon, yeah?&rdquo;</p><p><br /></p><hr /><p><br /></p><p>Brie comes out of the bathroom and walks to the kitchen, where she finds you drinking a cup of coffee. She watches you for a moment and you offer her an affectionate smile before nodding your head in the direction of another mug sitting on the countertop.</p><p>&ldquo;That one&rsquo;s for you,&rdquo; you say and she smiles gratefully, walking further into the kitchen to pick the mug up and take a sip from it.</p><p>\n&ldquo;Mm, I so needed this. Thank you.&rdquo;</p><p>&ldquo;No problem.&rdquo; You both continue drinking your coffees in relative silence for a while. You can see the shower has made Brie feel a little better, but her eyebrows are drawn together and you can see she is still stuck in her own thoughts.</p><p>\nYou glance at your phone to see if Hemsworth has texted you. At the lack of messages on your phone, you put it down on the countertop and look back at Brie. She draws her lower lip between her teeth, completely lost in her own thoughts, and you sigh, hoping Hemsworth gets here soon.</p><p>Right on cue, you hear your doorbell ring and Brie&rsquo;s head snaps towards the door. She looks back at you in question.</p><p>&ldquo;Are we expecting anyone today?&rdquo; She asks and you shrug as she makes her way to your front door and opens it.</p><p>&ldquo;Hey!&rdquo; You hear Hemsworth shout in greeting before you see him step inside to hug Brie. She returns the hug before pulling back with a confused look on her face.</p><p>&ldquo;Hemsworth. What brings you here?&rdquo; She asks, though you can already see a smile on her face.</p><p>&ldquo;What, you&rsquo;re not excited to see me?&rdquo; Chris says. His mouth turns to form a deep frown. Brie laughs at him before shoving him arm lightly.</p><p>&ldquo;You know that&rsquo;s not what I meant.&rdquo; Chris chuckles and his smile finds its way back to his face.</p><p>&ldquo;Well, a little birdie might have told me that you were having a pretty rough morning. So I&rsquo;m here to make sure you still have an amazing day. Let&rsquo;s go!&rdquo; He exclaims as he gestures with his arm for you and Brie to follow him before he disappears out the door again. Brie turns to look at you.</p><p>&ldquo;You called him?&rdquo; You shrug, thankfully sensing that Brie wasn&rsquo;t mad at you for calling Hemsworth. You walk towards her and her eyes study you carefully.</p><p>&ldquo;You were breaking my heart,&rdquo; you say and you see her eyes begin to swim with tears. &ldquo;Plus, I&rsquo;d say the fact that he dropped everything to get here so quickly kinda proves he doesn&rsquo;t hate you.&rdquo; Brie lets out a laugh and quickly wipes at her eyes before her tears can properly fall.</p><p>&ldquo;Come on!&rdquo; Hemsworth says insistently, coming back through the door. &ldquo;Geez, at least you&rsquo;re not going around telling everyone you&rsquo;re the fastest avenger, eh?&rdquo; He offers a cheeky wink to Brie before dodging a punch she has aimed at his arm.</p><p>Brie shakes her head and laughs, grabbing your hand as the two of you follow him out.</p><p><br /></p><hr /><p><br /></p><p>You and Brie find yourselves sitting in the backseat of Chris&rsquo; car, and he drives for a little while before Brie finally speaks up.</p><p>&ldquo;So, where are you taking us?&rdquo; Chris smiles at you both through his rear-view mirror.</p><p>&ldquo;Only the happiest place on earth, duh! Where else would I be taking you?&rdquo; Brie looks at you for a moment, her brow furrowing in confusion before she turns to Chris again.</p><p>&ldquo;You&rsquo;re telling me we&rsquo;re going to Disneyland?&rdquo;</p><p>&ldquo;Yep! It&rsquo;s guaranteed to cheer you up the second we get there. And on top of that, I might have also called in some of the squad who could make it.&rdquo; Brie&rsquo;s mouth drops open slightly.</p><p>&ldquo;Wait, really? You&rsquo;re really all doing this because I was upset?&rdquo;</p><p>&ldquo;Well, yeah. Of course. We&rsquo;re a family, you know.&rdquo; Brie smiles a disbelieving smile and you see more tears form in her eyes. You take her hand and squeeze it in reassurance. &ldquo;Besides, you know all the haters are just jealous of our friendship. Let&rsquo;s be real. All banter aside, we are the two strongest avengers.&rdquo;</p><p>&ldquo;Obviously,&rdquo; Brie laughs.</p><p>The car slows down and you look to see that you have arrived. Hemsworth parks the car and the three of you get out.</p><p>\n&ldquo;Okay, we&rsquo;re meeting everyone near the side of the entrance, over this way.&rdquo; You follow him down near the entrance where he leads you to the group, who are trying to be subtle to avoid the attention of fans before they even get inside the park.</p><p>Everyone immediately cheers in greeting as you join them. The group consists of Scarlett Johansson, Mark Ruffalo, Chris Evans, Sebastian Stan, Anthony Mackie, Jeremy Renner, Paul Rudd and Don Cheadle. Everyone hugs one another before deciding to head into the park.</p><p>&ldquo;I can&rsquo;t believe I&rsquo;m at Disneyland right now without my kids. This is awesome,&rdquo; Paul says, earning a laugh from the group as you all pay for your tickets and enter the park. You begin walking down Main Street, USA and, to no one&rsquo;s surprise, fans immediately begin recognising the group.</p><p>They all are happy to oblige when fans ask to take a quick photo, and you stand back and admire the group of people you regularly get to associate with. You all make your way through the park, stopping to get ice cream and to purchase Mickey Mouse ears which you all proudly wear.</p><p>You and Brie walk hand in hand with the rest of the group and you look over to Brie to find a huge smile on her face. Your heart warms at the sight and you mirror the smile on your own face.</p><p>Because you had arrived partway through the day, you are all aware that you have limited time to go on rides and hang out with each other before the fireworks show starts later in the evening. You all decide to head to Tomorrowland first, of course heading straight for Space Mountain and some of the other rides.</p><p>Hemsworth insists that everyone has to get a photo together with Mickie and Minnie, which turns out to be difficult with he size of the group but also a great deal of fun choosing which poses to go with.</p><p>As you continue walking through Disneyland, you and Brie continue to walk contently with each other, trailing towards the back of the group. Mackie and Sebastian are acting as unofficial leaders for the day, leading the pack from one place to another while everyone else loudly talks among themselves.</p><p>Somewhere between Fantasyland and Frontierland, Cheadle breaks away from his conversation with Evans to drop back and join you and Brie.</p><p>&ldquo;Hey. Listen, Brie. You know anything those guys have to say online is bullshit, right? I mean, you&rsquo;ve got to know how much we all love you.&rdquo; Brie takes in a deep breath and sighs, looking at Cheadle.</p><p>&ldquo;I do know. I guess it just really got to me today, you know?&rdquo;</p><p>&ldquo;Yeah, I get it.&rdquo; Cheadle nods, complete sincerity in his tone. &ldquo;They&rsquo;re only coming for you because you&rsquo;re a strong woman standing up for what&rsquo;s right and they&rsquo;re just threatened by you. That&rsquo;s literally all it is. I&rsquo;d probably even take it as a compliment if I were you.&rdquo; Brie laughs.</p><p>&ldquo;That&rsquo;s actually a good way of looking at it. Thanks, Don. It means a lot.&rdquo; Your group stops walking so some fans can get photos and Brie takes the opportunity to hug Cheadle.</p><p>\n&ldquo;Any time, Brie.&rdquo; He smiles at her before Evans calls him back over. The group starts moving again and Scarlett drops back to walk with you two now.</p><p>&ldquo;I know we&rsquo;ve been stopped a lot for photos, but it&rsquo;s actually kind of a nice break after that press tour, don&rsquo;t you think?&rdquo; Brie quickly nods.</p><p>&ldquo;Oh, one hundred percent. That press tour was on a whole other level.&rdquo; You know how tough press tours can be for Brie, and she practically did back-to-back press tours for Captain Marvel and Avengers: Endgame, two of the biggest movies in the past year.</p><p>You&rsquo;d only travelled with her for part of the Endgame press tour, so while you&rsquo;d been at home you&rsquo;d received a lot of phone calls and FaceTimes from Brie, many of which she would break down in tears because of just how exhausted she was. She also missed having you by her side, which is why she&rsquo;d asked you to join her during the Endgame tour.</p><p>&ldquo;Okay guys! Let&rsquo;s stop to eat some food, then we&rsquo;re heading to Space Mountain again before the fireworks. Sound good?&rdquo; Mackie announces to the group, receiving a positive answer as he leads them towards the nearest restaurant.</p><p><br /></p><hr /><p><br /></p><p>After going on Space Mountain again, you and the cast head off to find the perfect spot to sit and watch the fireworks together.<br /><br />\n&ldquo;Brie,&rdquo; you hear from behind you as Hemsworth runs up to you and Brie. &ldquo;Can we get a selfie?&rdquo; He points at his phone and offers a grin.</p><p>&ldquo;Of course,&rdquo; Brie happily agrees. &ldquo;What&rsquo;s this for? Instagram?&rdquo;</p><p>&ldquo;Yeah. I&rsquo;m planning on putting up some photos that are just a massive &lsquo;fuck you&rsquo; to all the guys hating on you and saying we don&rsquo;t like you. Plus, our whole group is just full of really hot people. I kinda want to use that for the likes, you know?&rdquo; Brie laughs and shakes her head before her and Chris pose for a selfie, still both proudly wearing their Mickey ears.</p><p>Eventually, everyone decides on a spot to sit and watch the fireworks. Brie sits off slightly to the side of everyone else to give you both a little privacy, and gestures for you to sit between her legs in front of her. You do and she doesn&rsquo;t waste any time wrapping her arms comfortably around your waist.</p><p>When the fireworks begin, Brie pulls you in closer and you lean into her body, feeling her chin coming to rest on your shoulder. Your hands rest on top of hers as you watch the show.</p><p>&ldquo;Thank you,&rdquo; you hear Brie say next to your ear. You turn your head slightly to look at her.</p><p>\n&ldquo;For what?&rdquo;</p><p>&ldquo;For everything. You turned a pretty shitty day into one that I completely loved.&rdquo;</p><p>&ldquo;You know it&rsquo;s no problem, Brie. But it definitely wasn&rsquo;t just me who did all of this.&rdquo; Brie presses her lips to your shoulder and you can feel the smile on your face.</p><p>&ldquo;No, it wasn&rsquo;t. But we both know that if it weren&rsquo;t for you, I wouldn&rsquo;t be so happy right now.&rdquo; You shrug lightly.</p><p>&ldquo;Well. You know I would do anything for you.&rdquo;</p><p>&ldquo;God, this is gonna sound super sappy, but you&rsquo;re the most amazing person I&rsquo;ve ever met and I&rsquo;m so glad I get to call you mine.&rdquo; You chuckle, a smile plastered on your face and you turn to capture Brie&rsquo;s lips in a kiss.</p><p>&ldquo;I love you,&rdquo; you mumble against her lips. The corners of Brie&rsquo;s eyes crinkle as she grins at you.</p><p>&ldquo;I love you too.&rdquo;</p>",
                "content_abstract": "<p>\n<p><b>Requests:&nbsp;</b></p>\n<p>Anonymous: So I just read Home and you did absolutely wonderful. I felt so much fluff, I was grinning the whole time. If you are still taking requests, can you do a continuation of Home where Brie kind of gets sad because of all the hate she is getting (she doesn&rsquo;t deserve it) and the reader comforts her together with the rest of the mcu cast especially Hemsworth and Cheadle. Thank you.</p>\n<p>Anonymous:<b>&nbsp;</b>i loved your Home one shot! can you do one where brie and her non famous girlfriend are hanging out at Disneyland with the other cast after she is done with press</p>\n<p><b>Pairing: </b>Brie x reader</p>\n<p><b>A/N:</b>&nbsp;Wooow I&rsquo;m posting this much later than I meant to. Thank you both for the love and for the requests!! I love both of these requests and thought they would kinda work well together so here it is! Enjoy!!</p>\n<figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "captain-marveled",
        "blog": {
            "name": "captain-marveled",
            "title": "︽✵︽",
            "description": "<p> | queer carol danvers warrior | higher, further, faster, baby.</p>",
            "url": "https://captain-marveled.tumblr.com/",
            "uuid": "t:w0JqCX_VXK67eNFuuq0GkQ",
            "updated": 1561584556
        },
        "id": 184808535577,
        "post_url": "https://captain-marveled.tumblr.com/post/184808535577/ive-saw-a-few-people-speculating-and-things-after",
        "slug": "ive-saw-a-few-people-speculating-and-things-after",
        "date": "2019-05-11 19:11:13 GMT",
        "timestamp": 1557601873,
        "state": "published",
        "format": "html",
        "reblog_key": "Zh1QvjCd",
        "tags": [
            "brie larson",
            "leave her alone ffs",
            "god",
            "i just want to protect her",
            "captain marvel",
            "carol danvers",
            "tessa thompson",
            "valkyrie",
            "brunnhilde",
            "janelle monae",
            "danai gurira",
            "lupita nyong'o",
            "lgbtq",
            "wlw"
        ],
        "short_url": "https://tmblr.co/Z1rX4f2i7SdOP",
        "summary": "ive saw a few people speculating and things after all the lupita, danai, janelle, tessa and brie rumours and i felt that this...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 2207,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1116\" data-orig-width=\"1122\"><img src=\"https://66.media.tumblr.com/bd7dbbcbed9f66628c325986fc8e2f0f/tumblr_prctaoN6SW1uc2hzv_1280.jpg\" data-orig-height=\"1116\" data-orig-width=\"1122\"/></figure><p>ive saw a few people speculating and things after all the lupita, danai, janelle, tessa and brie rumours and i felt that this was needed </p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1116\" data-orig-width=\"1122\"><img src=\"https://66.media.tumblr.com/bd7dbbcbed9f66628c325986fc8e2f0f/tumblr_prctaoN6SW1uc2hzv_1280.jpg\" data-orig-height=\"1116\" data-orig-width=\"1122\"></figure><p>ive saw a few people speculating and things after all the lupita, danai, janelle, tessa and brie rumours and i felt that this was needed </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "captain-marveled",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 624,
                        "header_focus_width": 640,
                        "header_focus_height": 360,
                        "avatar_shape": "square",
                        "background_color": "#FF7155",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "126,640,486,0",
                        "header_image": "https://static.tumblr.com/204febf9dc1040d8464a1cc04fc8d348/2qqhhxv/hqxprrkkw/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/a78199fa39ac5cb42ab4b2c8b56c13f2/2qqhhxv/7WQprrkky/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/204febf9dc1040d8464a1cc04fc8d348/2qqhhxv/hqxprrkkw/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#CD3D31",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFF100",
                        "title_font": "Quadrat",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184808535577"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1116\" data-orig-width=\"1122\"><img src=\"https://66.media.tumblr.com/bd7dbbcbed9f66628c325986fc8e2f0f/tumblr_prctaoN6SW1uc2hzv_1280.jpg\" data-orig-height=\"1116\" data-orig-width=\"1122\"></figure><p>ive saw a few people speculating and things after all the lupita, danai, janelle, tessa and brie rumours and i felt that this was needed </p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/bd7dbbcbed9f66628c325986fc8e2f0f/tumblr_prctaoN6SW1uc2hzv_1280.jpg\" class=\"\"/></figure><p>ive saw a few people speculating and things after all the lupita, danai, janelle, tessa and brie rumours and i felt that this was needed </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "chat",
        "blog_name": "incorrectlesbians",
        "blog": {
            "name": "incorrectlesbians",
            "title": "incorrect quotes ft mainly wlw ships",
            "description": "yeehaw",
            "url": "https://incorrectlesbians.tumblr.com/",
            "uuid": "t:HblM_PD-KdWZCMUNCSbV-A",
            "updated": 1561080732
        },
        "id": 184808484726,
        "post_url": "https://incorrectlesbians.tumblr.com/post/184808484726/fury-are-you-pro-gay-carol-of-course-i",
        "slug": "fury-are-you-pro-gay-carol-of-course-i",
        "date": "2019-05-11 19:08:14 GMT",
        "timestamp": 1557601694,
        "state": "published",
        "format": "html",
        "reblog_key": "psCAt2lQ",
        "tags": [
            "source: unknown",
            "captain marvel",
            "nick fury",
            "carol danvers",
            "mcu",
            "incorrect quotes",
            "marvel cinematic universe"
        ],
        "short_url": "https://tmblr.co/ZIMoIX2i7SQzs",
        "summary": "Fury: Are you pro-gay?\n\nCarol: Of course I am.\nFury: You are!?\nCarol: Did you think I was fucking amateur gay??",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 104,
        "title": null,
        "body": "Fury: Are you pro-gay?\n\nCarol: Of course I am.\nFury: You are!?\nCarol: Did you think I was fucking amateur gay??",
        "dialogue": [
            {
                "name": "Fury",
                "label": "Fury:",
                "phrase": "Are you pro-gay?"
            },
            {
                "name": "Carol",
                "label": "Carol:",
                "phrase": "Of course I am."
            },
            {
                "name": "Fury",
                "label": "Fury:",
                "phrase": "You are!?"
            },
            {
                "name": "Carol",
                "label": "Carol:",
                "phrase": "Did you think I was fucking amateur gay??"
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "daily-goose-the-cat",
        "blog": {
            "name": "daily-goose-the-cat",
            "title": "Goose The Cat Daily",
            "description": "<p>Follow to see the same picture of Goose the Cat every day.</p>",
            "url": "https://daily-goose-the-cat.tumblr.com/",
            "uuid": "t:BumV04tyJ10E585y7GEiFw",
            "updated": 1561748415
        },
        "id": 184808435679,
        "post_url": "https://daily-goose-the-cat.tumblr.com/post/184808435679/follow-to-see-the-same-picture-of-goose-the-cat",
        "slug": "follow-to-see-the-same-picture-of-goose-the-cat",
        "date": "2019-05-11 19:05:21 GMT",
        "timestamp": 1557601521,
        "state": "published",
        "format": "html",
        "reblog_key": "CBIpJ00o",
        "tags": [
            "goose the cat",
            "captain marvel",
            "marvel",
            "flerken",
            "daily"
        ],
        "short_url": "https://tmblr.co/ZErf8X2i7SE-V",
        "summary": "Follow to see the same picture of Goose the cat everyday",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 277,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"558\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/4904b96c0b36468acbb0aa09a32bf1ce/tumblr_prct0xExGZ1vay7i8_540.jpg\" data-orig-height=\"558\" data-orig-width=\"750\"/></figure><p>Follow to see the same picture of Goose the cat everyday </p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"558\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/4904b96c0b36468acbb0aa09a32bf1ce/tumblr_prct0xExGZ1vay7i8_540.jpg\" data-orig-height=\"558\" data-orig-width=\"750\"></figure><p>Follow to see the same picture of Goose the cat everyday </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "daily-goose-the-cat",
                    "active": true,
                    "theme": {
                        "header_full_width": 750,
                        "header_full_height": 558,
                        "header_focus_width": 750,
                        "header_focus_height": 422,
                        "avatar_shape": "circle",
                        "background_color": "#F6DBA1",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "54,750,476,0",
                        "header_image": "https://static.tumblr.com/4904b96c0b36468acbb0aa09a32bf1ce/zzzw80p/l8lppw8kq/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/ff1f626aebc3af6c9d5bf7643fb664e2/zzzw80p/3hdppw8kr/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/4904b96c0b36468acbb0aa09a32bf1ce/zzzw80p/l8lppw8kq/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184808435679"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"558\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/4904b96c0b36468acbb0aa09a32bf1ce/tumblr_prct0xExGZ1vay7i8_540.jpg\" data-orig-height=\"558\" data-orig-width=\"750\"></figure><p>Follow to see the same picture of Goose the cat everyday </p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4904b96c0b36468acbb0aa09a32bf1ce/tumblr_prct0xExGZ1vay7i8_540.jpg\" class=\"\"/></figure><p>Follow to see the same picture of Goose the cat everyday </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "callmepolaris",
        "blog": {
            "name": "callmepolaris",
            "title": "a little favor? Call me Polaris.",
            "description": "Hello there,<br>\nWelcome to my blog. I support diversity, so I don't mind how you live your life, I accept you...Except if you are an overbearing unkind arse! Get out!<br><br>\nI love photography and philosophy, so you will find some cool pics and random quotes.<br><br>\nI love powerful scenes, with strong women and a nice script.<br><br>\nI'm not a huge fan of movie theaters. My anxiety hates a room full of strangers and loud sounds...Ironically, because\nI have been working in the music industry for at least 15 years.<br><br>\nI'm such an easy-going person, if you call me 'ignorant' or wtvr; name calling does not make me read your argument...Try to educate me, I'm open for it.<br><br>\nThat's not all, but that's it for now.",
            "url": "https://callmepolaris.tumblr.com/",
            "uuid": "t:LmtpAAEHMEWfNs8z9IJIZA",
            "updated": 1561506883
        },
        "id": 184808278523,
        "post_url": "https://callmepolaris.tumblr.com/post/184808278523/unpopular-opinion-i-dont-wanna-a-love-interest",
        "slug": "unpopular-opinion-i-dont-wanna-a-love-interest",
        "date": "2019-05-11 18:56:25 GMT",
        "timestamp": 1557600985,
        "state": "published",
        "format": "html",
        "reblog_key": "QNyW93Qe",
        "tags": [
            "Carol Danvers",
            "Captain Marvel",
            "Avengers Endgame",
            "unpopular opinion",
            "why a girls can`t be accepted alone?",
            "The Life of Captain Marvel",
            "Skrull Invasion",
            "Monica Rambaeu",
            "I know that Carol had a few Boyfriends and I know my lbgt friends wanna her to have a girlfriend - I respect that",
            "but why she can't be all by herself?",
            "even Arya Stark writers had to put someone on her way - and that's annoys me!"
        ],
        "short_url": "https://tmblr.co/ZdppLl2i7Redx",
        "summary": "unpopular opinion: I don't wanna a love interest to Carol Danvers.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1,
        "title": "unpopular opinion: I don't wanna a love interest to Carol Danvers.",
        "body": "<p>I wanna her to go back home after Endgame, I really wish we could see more of: &ldquo;The Life of Captain Marvel&rdquo; mixed up with &ldquo;Skrull Invasion&rdquo; HQ.<br/>She coaching Monica how to be a hero while she&rsquo;s dealing with her fucked up family and bad Skrulls.<br/></p>",
        "reblog": {
            "comment": "<p>I wanna her to go back home after Endgame, I really wish we could see more of: “The Life of Captain Marvel” mixed up with “Skrull Invasion” HQ.<br>She coaching Monica how to be a hero while she’s dealing with her fucked up family and bad Skrulls.<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "callmepolaris",
                    "active": true,
                    "theme": {
                        "header_full_width": 959,
                        "header_full_height": 1200,
                        "header_focus_width": 959,
                        "header_focus_height": 539,
                        "avatar_shape": "circle",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "158,959,697,0",
                        "header_image": "https://static.tumblr.com/6a2efca005d253e8e5f11e48c7dd0794/og3htca/6msp78hpw/tumblr_static_ct7b7yc3iwowkg448o80c4wo8.jpg",
                        "header_image_focused": "https://static.tumblr.com/6a2efca005d253e8e5f11e48c7dd0794/og3htca/M34p78hpz/tumblr_static_tumblr_static_ct7b7yc3iwowkg448o80c4wo8_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/6a2efca005d253e8e5f11e48c7dd0794/og3htca/6msp78hpw/tumblr_static_ct7b7yc3iwowkg448o80c4wo8_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#077916",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#0caa17",
                        "title_font": "Arquitecta",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184808278523"
                },
                "content_raw": "<p>I wanna her to go back home after Endgame, I really wish we could see more of: “The Life of Captain Marvel” mixed up with “Skrull Invasion” HQ.<br>She coaching Monica how to be a hero while she’s dealing with her fucked up family and bad Skrulls.<br></p>",
                "content": "<p>I wanna her to go back home after Endgame, I really wish we could see more of: &ldquo;The Life of Captain Marvel&rdquo; mixed up with &ldquo;Skrull Invasion&rdquo; HQ.<br />She coaching Monica how to be a hero while she&rsquo;s dealing with her fucked up family and bad Skrulls.<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "paganich",
        "blog": {
            "name": "paganich",
            "title": "Thanks for checking in! I'm still garbage ",
            "description": "",
            "url": "https://paganich.tumblr.com/",
            "uuid": "t:4rqQwvh4uOol-bVoXIHZxQ",
            "updated": 1561488709
        },
        "id": 184808098745,
        "post_url": "https://paganich.tumblr.com/post/184808098745/countries-on-brie-larson",
        "slug": "countries-on-brie-larson",
        "date": "2019-05-11 18:45:39 GMT",
        "timestamp": 1557600339,
        "state": "published",
        "format": "html",
        "reblog_key": "hOnHVdZV",
        "tags": [
            "brie larson",
            "captain marvel",
            "usa",
            "latinamerica",
            "marvel",
            "mcu",
            "feminism"
        ],
        "short_url": "https://tmblr.co/ZDPCGe2i7Qykv",
        "summary": "Countries on Brie Larson",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 63,
        "title": null,
        "body": "<h1>Countries on Brie Larson</h1><h1>USA: she is a feminazi </h1><h1>Latin America: Omg, she is so beautiful and doesn’t deserve anything but love </h1>",
        "reblog": {
            "comment": "<p><h1>Countries on Brie Larson</h1><h1>USA: she is a feminazi </h1><h1>Latin America: Omg, she is so beautiful and doesn’t deserve anything but love </h1></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "paganich",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/38045bf1476cfa5c60506587aa6dc142/mqbfwgn/OJsps6zch/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/38045bf1476cfa5c60506587aa6dc142/mqbfwgn/OJsps6zch/tumblr_static__2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/38045bf1476cfa5c60506587aa6dc142/mqbfwgn/OJsps6zch/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Baskerville",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184808098745"
                },
                "content_raw": "<p><h1>Countries on Brie Larson</h1><h1>USA: she is a feminazi </h1><h1>Latin America: Omg, she is so beautiful and doesn’t deserve anything but love </h1></p>",
                "content": "<p><h1>Countries on Brie Larson</h1><h1>USA: she is a feminazi </h1><h1>Latin America: Omg, she is so beautiful and doesn&rsquo;t deserve anything but love </h1></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "doctorstrangeaskblog",
        "blog": {
            "name": "doctorstrangeaskblog",
            "title": "Ask Doctor Strange",
            "description": "Parody motivational fan made roleplay \"ask blog\" style for the fictional Marvel character Stephen Strange, the sassiest magician of the cosmos, NOT A DOCTOR. I DO NOT rp any innapropriate content with minors and I'll REPORT anyone I see doing so. No profit, just for fun, I'm not affiliated to Marvel or anyone, just fan made. Follow me on Twitter @drstrangefanask ",
            "url": "https://doctorstrangeaskblog.tumblr.com/",
            "uuid": "t:ffQ-DeYXAwccaZIVEZLHJw",
            "updated": 1561727471
        },
        "id": 184807992567,
        "post_url": "https://doctorstrangeaskblog.tumblr.com/post/184807992567/i-love-animals-so-i-have-nothing-to-complain",
        "slug": "i-love-animals-so-i-have-nothing-to-complain",
        "date": "2019-05-11 18:39:14 GMT",
        "timestamp": 1557599954,
        "state": "published",
        "format": "html",
        "reblog_key": "TjXXS9VJ",
        "tags": [
            "doctor strange",
            "goose",
            "captain marvel",
            "marvel",
            "cats"
        ],
        "short_url": "https://tmblr.co/ZeLhTf2i7QYpt",
        "summary": "I love animals so I have nothing to complain.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 24,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"112\" data-orig-width=\"637\"><img src=\"https://66.media.tumblr.com/e1e83cceadb3c2010ce0df015fcc463d/tumblr_inline_prcrrrRtYE1uyhiqa_540.png\" data-orig-height=\"112\" data-orig-width=\"637\"/></figure><p>I love animals so I have nothing to complain.<br/></p><figure class=\"tmblr-full\" data-orig-height=\"461\" data-orig-width=\"494\"><img src=\"https://66.media.tumblr.com/b3a32b19625e0885b8cce492700b6f28/tumblr_inline_pozs3itU171uyhiqa_1280.png\" data-orig-height=\"461\" data-orig-width=\"494\"/></figure>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"112\" data-orig-width=\"637\"><img src=\"https://66.media.tumblr.com/e1e83cceadb3c2010ce0df015fcc463d/tumblr_inline_prcrrrRtYE1uyhiqa_540.png\" data-orig-height=\"112\" data-orig-width=\"637\"></figure><p>I love animals so I have nothing to complain.<br></p><figure class=\"tmblr-full\" data-orig-height=\"461\" data-orig-width=\"494\"><img src=\"https://66.media.tumblr.com/b3a32b19625e0885b8cce492700b6f28/tumblr_inline_pozs3itU171uyhiqa_1280.png\" data-orig-height=\"461\" data-orig-width=\"494\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "doctorstrangeaskblog",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/5e13ccb6d8ab00f58cbc8f5437bc07ff/wjd9dwz/vVCpmjcbi/tumblr_static_-514622274-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/5e13ccb6d8ab00f58cbc8f5437bc07ff/wjd9dwz/vVCpmjcbi/tumblr_static_-514622274-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/5e13ccb6d8ab00f58cbc8f5437bc07ff/wjd9dwz/vVCpmjcbi/tumblr_static_-514622274-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#ffffff",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ffffff",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184807992567"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"112\" data-orig-width=\"637\"><img src=\"https://66.media.tumblr.com/e1e83cceadb3c2010ce0df015fcc463d/tumblr_inline_prcrrrRtYE1uyhiqa_540.png\" data-orig-height=\"112\" data-orig-width=\"637\"></figure><p>I love animals so I have nothing to complain.<br></p><figure class=\"tmblr-full\" data-orig-height=\"461\" data-orig-width=\"494\"><img src=\"https://66.media.tumblr.com/b3a32b19625e0885b8cce492700b6f28/tumblr_inline_pozs3itU171uyhiqa_1280.png\" data-orig-height=\"461\" data-orig-width=\"494\"></figure></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/e1e83cceadb3c2010ce0df015fcc463d/tumblr_inline_prcrrrRtYE1uyhiqa_540.png\" class=\"\"/></figure><p>I love animals so I have nothing to complain.<br /></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/b3a32b19625e0885b8cce492700b6f28/tumblr_inline_pozs3itU171uyhiqa_1280.png\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "ledenierdinosaure",
        "blog": {
            "name": "ledenierdinosaure",
            "title": "tired™",
            "description": "Caren. 23. She/Her. Latina (🇨🇱). Feminist. Sapphic. Spoonie. Blue haired. Nerd. Polyam. A pin up, occasionally. Bisexual in a glass wall closet. Eclectic skeptic witch.",
            "url": "https://ledenierdinosaure.tumblr.com/",
            "uuid": "t:2l7jCjyvp8i9asZLDa3igA",
            "updated": 1561666988
        },
        "id": 184807916746,
        "post_url": "https://ledenierdinosaure.tumblr.com/post/184807916746/the-thing-i-loved-the-most-from-captain-marvel-was",
        "slug": "the-thing-i-loved-the-most-from-captain-marvel-was",
        "date": "2019-05-11 18:34:44 GMT",
        "timestamp": 1557599684,
        "state": "published",
        "format": "html",
        "reblog_key": "Mws5zdPB",
        "tags": [
            "captain marvel"
        ],
        "short_url": "https://tmblr.co/Zs17qd2i7QGJA",
        "summary": "The thing I loved the most from captain marvel was my mother being excited about it. She loved the movie so much for some...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 2,
        "title": null,
        "body": "<p>The thing I loved the most from captain marvel was my mother being excited about it. She loved the movie so much for some reason, even when she&rsquo;s not much into superheroe movies.</p><p>It may be not the perfect movie and it have many flaws but my mother loved it and i saw her reacting like a girl and it&rsquo;s so precious.</p>",
        "reblog": {
            "comment": "<p>The thing I loved the most from captain marvel was my mother being excited about it. She loved the movie so much for some reason, even when she’s not much into superheroe movies.</p><p>It may be not the perfect movie and it have many flaws but my mother loved it and i saw her reacting like a girl and it’s so precious.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ledenierdinosaure",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#CCCCCC",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/21e203bc075c5ba2e7cbd283f19bca42/5i9nell/AC2po78lv/tumblr_static_1112925205-content.png",
                        "header_image_focused": "https://static.tumblr.com/21e203bc075c5ba2e7cbd283f19bca42/5i9nell/AC2po78lv/tumblr_static_1112925205-content_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/21e203bc075c5ba2e7cbd283f19bca42/5i9nell/AC2po78lv/tumblr_static_1112925205-content_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#775B89",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#775B89",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184807916746"
                },
                "content_raw": "<p>The thing I loved the most from captain marvel was my mother being excited about it. She loved the movie so much for some reason, even when she’s not much into superheroe movies.</p><p>It may be not the perfect movie and it have many flaws but my mother loved it and i saw her reacting like a girl and it’s so precious.</p>",
                "content": "<p>The thing I loved the most from captain marvel was my mother being excited about it. She loved the movie so much for some reason, even when she&rsquo;s not much into superheroe movies.</p><p>It may be not the perfect movie and it have many flaws but my mother loved it and i saw her reacting like a girl and it&rsquo;s so precious.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "asgardianmuffin",
        "blog": {
            "name": "asgardianmuffin",
            "title": "-asgardianmuffin-",
            "description": "",
            "url": "https://asgardianmuffin.tumblr.com/",
            "uuid": "t:xrXo_cpedLUEt3qNnNtTsQ",
            "updated": 1561443585
        },
        "id": 184807872379,
        "post_url": "https://asgardianmuffin.tumblr.com/post/184807872379/my-god-she-is-so-pretty-aaaaaaaaah",
        "slug": "my-god-she-is-so-pretty-aaaaaaaaah",
        "date": "2019-05-11 18:32:09 GMT",
        "timestamp": 1557599529,
        "state": "published",
        "format": "html",
        "reblog_key": "muuuka0p",
        "tags": [
            "marvel",
            "brie larson",
            "captain marvel",
            "sheisbeutiful",
            "i love her"
        ],
        "short_url": "https://tmblr.co/ZcADfe2i7Q5Tx",
        "summary": "my god she is so pretty AAAAAAAAAH",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 260,
        "caption": "<p>my god she is so pretty AAAAAAAAAH</p>",
        "reblog": {
            "comment": "<p>my god she is so pretty AAAAAAAAAH</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "asgardianmuffin",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/0bbd96a07dfe5c38bc0ff77e567914e0/d4wlbfk/OmOpr7rhs/tumblr_static_epl2zxclis08oog08g0s0s0sg.png",
                        "header_image_focused": "https://static.tumblr.com/0bbd96a07dfe5c38bc0ff77e567914e0/d4wlbfk/OmOpr7rhs/tumblr_static_epl2zxclis08oog08g0s0s0sg_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/0bbd96a07dfe5c38bc0ff77e567914e0/d4wlbfk/OmOpr7rhs/tumblr_static_epl2zxclis08oog08g0s0s0sg_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#eaa389",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Baskerville",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184807872379"
                },
                "content_raw": "<p>my god she is so pretty AAAAAAAAAH</p>",
                "content": "<p>my god she is so pretty AAAAAAAAAH</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "11",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/783fac7f04ee8d5a2b774bf9926ef717/tumblr_prcrhlne9L1w5qkano1_540.jpg",
                    "width": 540,
                    "height": 810
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/783fac7f04ee8d5a2b774bf9926ef717/tumblr_prcrhlne9L1w5qkano1_540.jpg",
                        "width": 540,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/783fac7f04ee8d5a2b774bf9926ef717/tumblr_prcrhlne9L1w5qkano1_500.jpg",
                        "width": 500,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/783fac7f04ee8d5a2b774bf9926ef717/tumblr_prcrhlne9L1w5qkano1_400.jpg",
                        "width": 400,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/783fac7f04ee8d5a2b774bf9926ef717/tumblr_prcrhlne9L1w5qkano1_250.jpg",
                        "width": 250,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/783fac7f04ee8d5a2b774bf9926ef717/tumblr_prcrhlne9L1w5qkano1_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/783fac7f04ee8d5a2b774bf9926ef717/tumblr_prcrhlne9L1w5qkano1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/77f5be88888e6a7b3dd9e8d29210a4da/tumblr_prcrhlne9L1w5qkano2_540.jpg",
                    "width": 540,
                    "height": 810
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/77f5be88888e6a7b3dd9e8d29210a4da/tumblr_prcrhlne9L1w5qkano2_540.jpg",
                        "width": 540,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/77f5be88888e6a7b3dd9e8d29210a4da/tumblr_prcrhlne9L1w5qkano2_500.jpg",
                        "width": 500,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/77f5be88888e6a7b3dd9e8d29210a4da/tumblr_prcrhlne9L1w5qkano2_400.jpg",
                        "width": 400,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/77f5be88888e6a7b3dd9e8d29210a4da/tumblr_prcrhlne9L1w5qkano2_250.jpg",
                        "width": 250,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/77f5be88888e6a7b3dd9e8d29210a4da/tumblr_prcrhlne9L1w5qkano2_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/77f5be88888e6a7b3dd9e8d29210a4da/tumblr_prcrhlne9L1w5qkano2_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "loveandsupportforcaptainmarvel",
        "blog": {
            "name": "loveandsupportforcaptainmarvel",
            "title": "Captain Marvel Doesn't Care For Your Sexism",
            "description": "Blog dedicated to standing up to the hate directed at Captain Marvel",
            "url": "https://loveandsupportforcaptainmarvel.tumblr.com/",
            "uuid": "t:0-cWR7-uIArlelsMf8-k_Q",
            "updated": 1561701855
        },
        "id": 184807707437,
        "post_url": "https://loveandsupportforcaptainmarvel.tumblr.com/post/184807707437/look-at-these-magazines-i-got-oh-whats",
        "slug": "look-at-these-magazines-i-got-oh-whats",
        "date": "2019-05-11 18:22:24 GMT",
        "timestamp": 1557598944,
        "state": "published",
        "format": "html",
        "reblog_key": "Ez4UHgD5",
        "tags": [
            "captain marvel",
            "marvel",
            "mcu",
            "carol danvers",
            "brie larson"
        ],
        "short_url": "https://tmblr.co/ZY_QEX2i7PTCj",
        "summary": "Look at these magazines I got! \nOh, what's this?\nYou're goddamn right!",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 1204,
        "title": null,
        "body": "<p>Look at these magazines I got! </p><figure class=\"tmblr-full\" data-orig-height=\"2268\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/4fa6e22d81a3a6449c81312d7e10dbdf/tumblr_prcr1bfOgU1vfc6su_540.jpg\" data-orig-height=\"2268\" data-orig-width=\"3024\"/></figure><p>Oh, what&rsquo;s this?</p><figure class=\"tmblr-full\" data-orig-height=\"1323\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/0929f6f2a6a081203d051c1d78e950dd/tumblr_prcr19j8Wj1vfc6su_540.jpg\" data-orig-height=\"1323\" data-orig-width=\"3024\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1916\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/b221542c56770c9ab722e9be78594798/tumblr_prcr189CrQ1vfc6su_540.jpg\" data-orig-height=\"1916\" data-orig-width=\"3024\"/></figure><p>You&rsquo;re goddamn right!</p>",
        "reblog": {
            "comment": "<p>Look at these magazines I got! </p><figure class=\"tmblr-full\" data-orig-height=\"2268\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/4fa6e22d81a3a6449c81312d7e10dbdf/tumblr_prcr1bfOgU1vfc6su_540.jpg\" data-orig-height=\"2268\" data-orig-width=\"3024\"></figure><p>Oh, what’s this?</p><figure class=\"tmblr-full\" data-orig-height=\"1323\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/0929f6f2a6a081203d051c1d78e950dd/tumblr_prcr19j8Wj1vfc6su_540.jpg\" data-orig-height=\"1323\" data-orig-width=\"3024\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1916\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/b221542c56770c9ab722e9be78594798/tumblr_prcr189CrQ1vfc6su_540.jpg\" data-orig-height=\"1916\" data-orig-width=\"3024\"></figure><p>You’re goddamn right!</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "loveandsupportforcaptainmarvel",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#9DBCE9",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/5adf546510c0cff938f5ef71c296828d/oc3dvug/Gn3pncr5f/tumblr_static_3iyynbdhtug4wc0ogk84g4c4o.jpg",
                        "header_image_focused": "https://static.tumblr.com/5adf546510c0cff938f5ef71c296828d/oc3dvug/Gn3pncr5f/tumblr_static_3iyynbdhtug4wc0ogk84g4c4o_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/5adf546510c0cff938f5ef71c296828d/oc3dvug/Gn3pncr5f/tumblr_static_3iyynbdhtug4wc0ogk84g4c4o_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFDC4E",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ca0404",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184807707437"
                },
                "content_raw": "<p>Look at these magazines I got! </p><figure class=\"tmblr-full\" data-orig-height=\"2268\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/4fa6e22d81a3a6449c81312d7e10dbdf/tumblr_prcr1bfOgU1vfc6su_540.jpg\" data-orig-height=\"2268\" data-orig-width=\"3024\"></figure><p>Oh, what’s this?</p><figure class=\"tmblr-full\" data-orig-height=\"1323\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/0929f6f2a6a081203d051c1d78e950dd/tumblr_prcr19j8Wj1vfc6su_540.jpg\" data-orig-height=\"1323\" data-orig-width=\"3024\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1916\" data-orig-width=\"3024\"><img src=\"https://66.media.tumblr.com/b221542c56770c9ab722e9be78594798/tumblr_prcr189CrQ1vfc6su_540.jpg\" data-orig-height=\"1916\" data-orig-width=\"3024\"></figure><p>You’re goddamn right!</p>",
                "content": "<p>Look at these magazines I got! </p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4fa6e22d81a3a6449c81312d7e10dbdf/tumblr_prcr1bfOgU1vfc6su_540.jpg\" class=\"\"/></figure><p>Oh, what&rsquo;s this?</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/0929f6f2a6a081203d051c1d78e950dd/tumblr_prcr19j8Wj1vfc6su_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/b221542c56770c9ab722e9be78594798/tumblr_prcr189CrQ1vfc6su_540.jpg\" class=\"\"/></figure><p>You&rsquo;re goddamn right!</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "newcaptainofsquad9",
        "blog": {
            "name": "newcaptainofsquad9",
            "title": "NewCaptainofSquad9",
            "description": "I'm Chadstity. I love anime and alternative music. #Pats #Breaking Benjamin #bleach #D gray man #Dragon ball z Never give up- quote through out my life. #team Haberkorn. If you love anime, rock/alternative music, books, writing, comics, learning and any other cool geeky pop culture stuff follow me. Please DO NOT Repost my work!",
            "url": "https://newcaptainofsquad9.tumblr.com/",
            "uuid": "t:AQP4lZwMv-zeFIHTTjAvQA",
            "updated": 1561586000
        },
        "id": 184807681362,
        "post_url": "https://newcaptainofsquad9.tumblr.com/post/184807681362/home-with-you-again-carol-danvers-x-maria",
        "slug": "home-with-you-again-carol-danvers-x-maria",
        "date": "2019-05-11 18:20:54 GMT",
        "timestamp": 1557598854,
        "state": "published",
        "format": "html",
        "reblog_key": "EtXz2zbu",
        "tags": [
            "endgame spoilers",
            "avengers spoilers",
            "avengers endgame",
            "Captain Marvel",
            "Carol Danvers",
            "maria rambeau",
            "carol x maria",
            "dambeau",
            "Brie Larson",
            "lashana lynch",
            "valkyrie",
            "brunnhilde",
            "talos",
            "avengers",
            "nick fury",
            "Marvel Comics",
            "marvel cinematic universe",
            "mcu imagines",
            "peter parker",
            "captain marvel spoilers",
            "carol danvers x maria rambeau",
            "fix it fic",
            "endgame fix it",
            "endgame fanfic"
        ],
        "short_url": "https://tmblr.co/ZJwYdt2i7PMrI",
        "summary": "Home With You Again~Carol \nDanvers x Maria Rambeau-Part 1\n(Avengers Endgame) Spoiler Warning!",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 68,
        "title": "Home With You Again~Carol \nDanvers x Maria Rambeau-Part 1\n(Avengers Endgame) Spoiler Warning!",
        "body": "<figure data-orig-width=\"500\" data-orig-height=\"278\" data-tumblr-attribution=\"theavengers:Lmb_Qa57Tv0psNL1WxyrZQ:ZhzcSn2gnEGES\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c2319293b70de885e724ed929b7b5f9d/tumblr_po2bvlSlk81tctq75o1_r1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"278\"/></figure><figure data-orig-width=\"268\" data-orig-height=\"315\" data-tumblr-attribution=\"tchillax:SB5YGZj0gx_KHLnxVqGLUA:ZC7Tzj2hl39qu\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/18aa2cdff576cd415e6e59fc100a0cb6/tumblr_ppnn69PGCQ1ubn6jto5_r1_400.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"315\"/></figure><p>Paring: Carol Danvers x Maria Rambeau, Platonic! Carol Danvers x Talos, Platonic! Carol Danvers x Peter Parker, Platonic! Carol Danvers x Nick Fury</p><p>Summary: (SPOILER WARNING) After Carol returns to Earth she finds out that both Maria and Monica were lost in the snap. She and the other Avengers successfully kill Thanos, but Carol goes overboard in a fit of rage. She manages to calm down, going into space to help out those who were affected by the snap. She now helps planets whenever she can, while drowning herself in her own sorrows and self pity. Abruptly, the Avengers need her help with Thanos from another timeline and she realizes that they reversed the snap, giving her a chance to see her lover and daughter again. </p><p>Word Count: 1,923</p><p>Writer’s Note: Lot’s of angst, a sad Carol but there will be fluff too :). It’s a bit disjointed, but we all needed this in Endgame people I hope I delivered. </p><hr><!-- more --><p>Carol glances down at the grass as she watches Tony and Pepper embrace. She would have flown through the galaxy, battling the stars, Kree and rogues all over again just to take Maria in her arms. But, all she came home to was dust, ash and a burnt pan where she assumed Maria was cooking. Tears escaped her, along with the glow of her hands that can with the frustration and anger she felt. She grabbed Maria’s cellphone, calling Monica, yet she didn’t answer. Her boyfriend, Tom picked up, frantic about Monica crumbling to dust in front of him. Carol let the anger consume her wholly, firing a photon blast through the ceiling of Maria’s kitchen before leaping into the air with a bone curdling scream. </p><p>&hellip;</p><p>“You didn’t have me,” Carol says to the Avengers numbly. <br/></p><p>“Look, new girl,” Rhodey starts, “we’re all about that superhero life but what-”<br/></p><p>Carol cut him off.</p><p>“You think I wanted to be out there! Away from my family while they disappeared? I’m getting that son of a bitch whether you’re with me or not.”<br/></p><p>Steve’s jaw tightens but he nods.</p><p>“She’s right, let’s get the son of a bitch,” he agreed. <br/></p><p>&hellip;</p><p>They caught Thanos alone. He was cooking something when Carol busted through his hut. All fire, hardly waiting for the avengers to catch up with her. A few photon blasts knocked him to the floor and Carol was on him again, arms firmly around his neck. Steve, Rhodey, Natasha, and Thor arrive. </p><p>“Where are the stones?” Steve asked.<br/></p><p>Carol’s grip on Thanos tightened, nearly strangling him to death.</p><p>“Answer. Him,” she growled. <br/></p><p>“Gone- I-I destroyed them,” Thanos said, “i-if y-you’re here now then, I was successful-”</p><p>“Damnit!” Carol roared.<br/></p><p>It happened quickly. Thor tried to rush in first, eyes glowing blue with the lightning of Stormbreaker around him. Carol’s move was swift, snapping Thanos’ neck before Thor could reach. She let the titan’s lifeless body drop, as Thor chopped off his head. </p><p>“The fuck was that!” Rhodey shouted.<br/></p><p>“He’s better that way,” Carol said bluntly, “I avenged our family, friends, half of the world.”</p><p>“Carol,” Steve started.<br/></p><p>Carol didn’t listen as she flew back into the air.</p><p>&hellip;</p><p>Talos found Carol in a bar on planet Krylor, drowning herself in the sorrows of whatever fine drinks she could get her hands on. He cringed when he found her, hunched over the bar with a friend, in silver armor, Brunnhilde. </p><p>“To the new Queen of New Asguard!” Carol beams as she downs her drink in one gulp. </p><p>Brunnhilde gives Captain Marvel a small smile. </p><p>“I’m worried about him,” she says, “all he does is drink and play&ndash; what are those things you mortals use to?”</p><p>“Video Games,” Carol bellows.</p><p>She finally notices Talos glaring at her. </p><p>“If you needed me you could have&ndash;”</p><p>“Paged you. You’re always in between planets, even got a new hair cut,” Talos says as he sits next to Carol.</p><p>Carol runs a quick hand through her now short hair. </p><p>“I had that hair for over twenty five years, it got in the way and I needed a change,” she says. </p><p>“I like it,” Talos says before looking to Brunnhilde, “you’re in company of a Queen, eh?”</p><p>Carol nods, “Talos, Brunnhilde. My best friend, saved him back in ‘95. Brunnhilde, Queen of New Asguard, met her back&ndash;”</p><p>Carol cut herself off, staring down at the bar. </p><p>“Five years ago,” she whispers.</p><p>Talos glares between the two women. Brunnhilde takes the hint and rises from the bar. </p><p>“Well, New Asguard isn’t going to govern itself,” she says.</p><p>Before Brunnhilde leaves she puts a hand on Talos’ shoulder. </p><p>“Good luck.”<br/></p><p>Talos gives her a sharp nod before stalking out. </p><p>“Seriously, is everyone all right?” Carol asks. <br/></p><p>“We’re hanging in there Carol, better than we were a few years ago. Thanks to you,” Talos says.<br/></p><p>Carol shrugs.</p><p>“It’s all I can do now. Krylor still needs supplies&ndash; I’m so close to finding more harvests for them. I need to.”<br/></p><p>She rises, but Talos stops her.</p><p>“Carol. Breathe,” he instructs. <br/></p><p>Carol gives him a hard look and sits back down, twirling the drink in her cup around. </p><p>“You lied you know,” he says, “I’m not your best friend.”<br/></p><p>Carol scoffs, “just take the complement.”</p><p>“I think you know where I’m getting at,” he banters, “remember when I went through that head of yours? Fogged up memories of flying aircrafts, cart racing and long karaoke nights with&ndash;”</p><p>“Don’t,” Carol warns, cutting Talos off. <br/></p><p>Talos purses his lips.</p><p>“You’re gonna have to talk about her eventually,” he suggests, “my wife and daughter miss them too-”<br/></p><p>“Talos,” Carol says, voice teetering on the edge of cracking, “Please all I can think about is&ndash;” <br/></p><p>Carol cuts herself off with a silent sob. She puts a hand on her face and exhales.</p><p>“Say it, tell me,” Talos whispers. <br/></p><p>Carol chuckles, wiping her damp and red eyes.</p><p>“Why are you making me do this?” she asks.<br/></p><p>Talos’ eyes soften as he squeezes Carol’s hand.</p><p>“You may be the strongest I’ve ever known Carol, but you’re still human. Still flesh and bone, you don’t need to hold your emotions in anymore. I thought you got Yon-Rogg out of your head already?”<br/></p><p>“I thought I did, but I could never stop thinking about them. I loved Maria, fuck I still do but&ndash;”<br/></p><p>Carol cut herself off again.</p><p>“Go on,” Talos urges, “what are you thinking?”<br/></p><p>“I have this dream of seeing them again,” Carol reflects, “God, Lieutenant Trouble’s really grown now, I didn’t even get to formally meet her boyfriend yet&ndash; and Maria&ndash; I just want her in my arms again. I want to be home with her again.” <br/></p><p>“Will you ever go back?” Talos asks, “to Earth, I mean just as a temporary stay?”<br/></p><p>Carol shakes her head.</p><p>“I doubt that Talos, the Avengers have Earth covered and I have the rest of the galaxy there’s no need to&ndash;”<br/></p><p>Carol gets cut off by the beeping of her phone, Natasha lent her one when she last visited Earth. Her eyes widened as she took it out. </p><p>“I have to get to Earth, now,” she says.<br/></p><p>Talos is up with her. </p><p>“Be careful, Carol,” he says.<br/></p><p>She doesn’t need it, they both know that. But, Carol accepts it anyway and embraces Talos tightly.</p><p>“Thank you, Talos.”<br/></p><p>&hellip;</p><p>Carol went binary in a millisecond while crashing through Thanos’ warships. She surveyed the battlefield, looking for this Thanos from another timeline. </p><p>“Danvers, we could use an assist,” Steve says. </p><p>Carol nods, swooping down and spotting Spiderman, clutching onto the gauntlet for dear life. </p><p>“Hi there, I-I’m Peter Parker,” he croaks.<br/></p><p>Carol’s eyes softened for a moment. Here was this kid in the middle of a battlefield, bruised and afraid. God, he reminded her of Monica when she fell off of her bike years ago. </p><p>“Hey Peter Parker, got something for me?” she asks.<br/></p><p>Peter gets up and hands the gauntlet off to Carol, eyeing her in a mixture of admiration and concern. </p><p>“um, uh ms&ndash;what’s your name?”</p><p>Carol grinned at him as she took the gauntlet and tucked it under her arm.</p><p>“Captain Marvel,” She declares.<br/></p><p>Peter frowns, “ah, of course you used the fake name&ndash; Cap, how are you gonna get through that alone?”</p><p>Carol turns toward the battle field, all of Thanos’ army waiting and Thanos himself. </p><p>“Well, Peter&ndash;”<br/></p><p>“She’s got help,” a voice says.<br/></p><p>Carol turns as the other heroines joined her. </p><p>“Go ahead, we’ve got your back,” Okoye says.</p><p>Carol nods and flies forward, eyes glows as she pushes through. </p><p>Thanos collides with her, the gauntlet flying from her grip as Carol recovers slightly. The titan goes for it, but she stops him, gripping his arms tightly in an act to subdue him. Thanos cringes and headbutts her. Carol doesn’t flinch before aiming to knock Thanos across the field. </p><p>“Captain Marvel look ou&ndash;”<br/></p><p>Peter’s plea didn’t get to Carol in time as Thanos peeled the power stone from his gauntlet, using it against her.</p><p>&hellip;</p><p>“Vel&ndash;Captain Marvel,” Peter pleas, shaking Carol helplessly.</p><p>Carol hops up, taking notice of Peter. His eyes were red, and face tear stained. </p><p>“Parker, what happened,” Carol demanded, softly, yet firmly.<br/></p><p>“M-Mr Stark he&ndash; he used the stones h-he’s&ndash;”<br/></p><p>Carol’s face grew white with shock and pain. Her fists clenched. She could have saved Stark again, but she was reckless. Again she couldn’t keep the ones she cared for safe. She watches Peter break down in sobs. She’s seen this before. Monica always ran to her while growing up, searching for her mother’s comfort. She does the only think she knows how to do in this situation. She brought Peter into her arms, rubbing his back and soothing him as he cried into her chest.</p><p>&hellip;</p><p>Carol watched from Stark’s porch as the eulogy ended. She kept her hands clasped together to keep them from trembling. </p><p>“D-Don’t lie to me, Fury,” she growled.<br/></p><p>Nick walked over to her.</p><p>“I’m here aren’t I,” he said in a matter of fact fashion, “everybody Thanos snapped from existence has returned.”<br/></p><p>Carol’s eyes glossed as the tears rose up again. She put her fist against her mouth to keep her composure.</p><p>“F-Fury&ndash;”</p><p>“Go see her,” he said, “I’m sure she’d want some explaining, especially with that haircut.”</p><p>Carol laughs and wipes her tears.</p><p>“Thank you, Fury,” she said. </p><p>Nick shrugged and gasped when Carol pulled him into her arms. He returned it fully. </p><p>“Anytime Avenger, we could road trip for old times&ndash;” </p><p>Carol shot up into the air.</p><p>“Sorry Fury, but I’ve been dreaming of this moment for five years,” Carol shouted before zipping off. <br/></p><p>&hellip;</p><p>Carol landed awkwardly, her black suit a little scorched and tattered from the trip, but she didn’t care. Maria’s house was in fine condition, even the hole Carol blew in the roof five years prior was gone. The door swung open and there she was, Maria Rambeau. Her fellow pilot, partner, best friend, lover. Her home. </p><p>“C-Carol&ndash; oh God&ndash;” Maria cried.</p><p>Carol ran up to her, taking the woman up into her arms in a warm embrace.</p><p>“I-It’s you, I missed your hugs,” Carol whispered into Maria’s neck.</p><p>“Carol, I&ndash; I thought you were&ndash;”</p><p>Maria broke down as Carol pulled back to see her face. Her hair got longer, now coming down past her neck. Carol admired the muscle in her lover’s arms as well, noticing how tight she held on. She almost came to tears too, but she had to be strong now. For the both of them. </p><p>“I’m here now,” she declared, “and I won’t leave and let anything like that happened again.”</p><p>Maria put on a weak smile and that was all it took for Carol to kiss her. Her hands found themselves around Maria’s waist, while Maria ran her hands through Carol’s now short hair. </p><p>Maria pulled back breathlessly and gazed fondly into Carol’s eyes.</p><p>“Haircut?”</p><p>Carol chuckled, “Do you like it?”</p><p>Maria touched Carol’s cheek and gave it a quick once over. </p><p>“I do, but it’s going to take some getting used to,” Maria said before betting her lip. </p><p>Carol caught the hint and slyly grinned.</p><p>“Oh, I see,” she said before capturing Maria’s lips again.<br/></p><p>The kiss grew more heated as Carol’s hand went to Maria’s thigh and Maria’s went to Carol’s chest.</p><p>“C-Carol, Carol, baby&ndash;look at me,” Maria said.<br/></p><p>Carol pulled away, eyes screwed shut before opening them again. </p><p>“I-I need you,” Carol whispered.<br/></p><p>“We’ve got time, OK?”<br/></p><p>Carol nodded and threw her arms around Maria again. </p>",
        "body_abstract": "\n<figure data-orig-width=\"500\" data-orig-height=\"278\" data-tumblr-attribution=\"theavengers:Lmb_Qa57Tv0psNL1WxyrZQ:ZhzcSn2gnEGES\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c2319293b70de885e724ed929b7b5f9d/tumblr_po2bvlSlk81tctq75o1_r1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"278\"></figure><figure data-orig-width=\"268\" data-orig-height=\"315\" data-tumblr-attribution=\"tchillax:SB5YGZj0gx_KHLnxVqGLUA:ZC7Tzj2hl39qu\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/18aa2cdff576cd415e6e59fc100a0cb6/tumblr_ppnn69PGCQ1ubn6jto5_r1_400.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"315\"></figure><p>Paring: Carol Danvers x Maria Rambeau, Platonic! Carol Danvers x Talos, Platonic! Carol Danvers x Peter Parker, Platonic! Carol Danvers x Nick Fury</p>\n<p>Summary: (SPOILER WARNING) After Carol returns to Earth she finds out that both Maria and Monica were lost in the snap. She and the other Avengers successfully kill Thanos, but Carol goes overboard in a fit of rage. She manages to calm down, going into space to help out those who were affected by the snap. She now helps planets whenever she can, while drowning herself in her own sorrows and self pity. Abruptly, the Avengers need her help with Thanos from another timeline and she realizes that they reversed the snap, giving her a chance to see her lover and daughter again.&nbsp;</p>\n<p>Word Count: 1,923</p>\n<p>Writer&rsquo;s Note: Lot&rsquo;s of angst, a sad Carol but there will be fluff too :). It&rsquo;s a bit disjointed, but we all needed this in Endgame people I hope I delivered.&nbsp;</p>\n<hr>\n",
        "reblog": {
            "comment": "<p><figure data-orig-width=\"500\" data-orig-height=\"278\" data-tumblr-attribution=\"theavengers:Lmb_Qa57Tv0psNL1WxyrZQ:ZhzcSn2gnEGES\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c2319293b70de885e724ed929b7b5f9d/tumblr_po2bvlSlk81tctq75o1_r1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"278\"></figure><figure data-orig-width=\"268\" data-orig-height=\"315\" data-tumblr-attribution=\"tchillax:SB5YGZj0gx_KHLnxVqGLUA:ZC7Tzj2hl39qu\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/18aa2cdff576cd415e6e59fc100a0cb6/tumblr_ppnn69PGCQ1ubn6jto5_r1_400.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"315\"></figure><p>Paring: Carol Danvers x Maria Rambeau, Platonic! Carol Danvers x Talos, Platonic! Carol Danvers x Peter Parker, Platonic! Carol Danvers x Nick Fury</p><p>Summary: (SPOILER WARNING) After Carol returns to Earth she finds out that both Maria and Monica were lost in the snap. She and the other Avengers successfully kill Thanos, but Carol goes overboard in a fit of rage. She manages to calm down, going into space to help out those who were affected by the snap. She now helps planets whenever she can, while drowning herself in her own sorrows and self pity. Abruptly, the Avengers need her help with Thanos from another timeline and she realizes that they reversed the snap, giving her a chance to see her lover and daughter again. </p><p>Word Count: 1,923</p><p>Writer’s Note: Lot’s of angst, a sad Carol but there will be fluff too :). It’s a bit disjointed, but we all needed this in Endgame people I hope I delivered. </p><hr>[[MORE]]<p>Carol glances down at the grass as she watches Tony and Pepper embrace. She would have flown through the galaxy, battling the stars, Kree and rogues all over again just to take Maria in her arms. But, all she came home to was dust, ash and a burnt pan where she assumed Maria was cooking. Tears escaped her, along with the glow of her hands that can with the frustration and anger she felt. She grabbed Maria’s cellphone, calling Monica, yet she didn’t answer. Her boyfriend, Tom picked up, frantic about Monica crumbling to dust in front of him. Carol let the anger consume her wholly, firing a photon blast through the ceiling of Maria’s kitchen before leaping into the air with a bone curdling scream. </p><p>…</p><p>“You didn’t have me,” Carol says to the Avengers numbly. <br></p><p>“Look, new girl,” Rhodey starts, “we’re all about that superhero life but what-”<br></p><p>Carol cut him off.</p><p>“You think I wanted to be out there! Away from my family while they disappeared? I’m getting that son of a bitch whether you’re with me or not.”<br></p><p>Steve’s jaw tightens but he nods.</p><p>“She’s right, let’s get the son of a bitch,” he agreed. <br></p><p>…</p><p>They caught Thanos alone. He was cooking something when Carol busted through his hut. All fire, hardly waiting for the avengers to catch up with her. A few photon blasts knocked him to the floor and Carol was on him again, arms firmly around his neck. Steve, Rhodey, Natasha, and Thor arrive. </p><p>“Where are the stones?” Steve asked.<br></p><p>Carol’s grip on Thanos tightened, nearly strangling him to death.</p><p>“Answer. Him,” she growled. <br></p><p>“Gone- I-I destroyed them,” Thanos said, “i-if y-you’re here now then, I was successful-”</p><p>“Damnit!” Carol roared.<br></p><p>It happened quickly. Thor tried to rush in first, eyes glowing blue with the lightning of Stormbreaker around him. Carol’s move was swift, snapping Thanos’ neck before Thor could reach. She let the titan’s lifeless body drop, as Thor chopped off his head. </p><p>“The fuck was that!” Rhodey shouted.<br></p><p>“He’s better that way,” Carol said bluntly, “I avenged our family, friends, half of the world.”</p><p>“Carol,” Steve started.<br></p><p>Carol didn’t listen as she flew back into the air.</p><p>…</p><p>Talos found Carol in a bar on planet Krylor, drowning herself in the sorrows of whatever fine drinks she could get her hands on. He cringed when he found her, hunched over the bar with a friend, in silver armor, Brunnhilde. </p><p>“To the new Queen of New Asguard!” Carol beams as she downs her drink in one gulp. </p><p>Brunnhilde gives Captain Marvel a small smile. </p><p>“I’m worried about him,” she says, “all he does is drink and play– what are those things you mortals use to?”</p><p>“Video Games,” Carol bellows.</p><p>She finally notices Talos glaring at her. </p><p>“If you needed me you could have–”</p><p>“Paged you. You’re always in between planets, even got a new hair cut,” Talos says as he sits next to Carol.</p><p>Carol runs a quick hand through her now short hair. </p><p>“I had that hair for over twenty five years, it got in the way and I needed a change,” she says. </p><p>“I like it,” Talos says before looking to Brunnhilde, “you’re in company of a Queen, eh?”</p><p>Carol nods, “Talos, Brunnhilde. My best friend, saved him back in ‘95. Brunnhilde, Queen of New Asguard, met her back–”</p><p>Carol cut herself off, staring down at the bar. </p><p>“Five years ago,” she whispers.</p><p>Talos glares between the two women. Brunnhilde takes the hint and rises from the bar. </p><p>“Well, New Asguard isn’t going to govern itself,” she says.</p><p>Before Brunnhilde leaves she puts a hand on Talos’ shoulder. </p><p>“Good luck.”<br></p><p>Talos gives her a sharp nod before stalking out. </p><p>“Seriously, is everyone all right?” Carol asks. <br></p><p>“We’re hanging in there Carol, better than we were a few years ago. Thanks to you,” Talos says.<br></p><p>Carol shrugs.</p><p>“It’s all I can do now. Krylor still needs supplies– I’m so close to finding more harvests for them. I need to.”<br></p><p>She rises, but Talos stops her.</p><p>“Carol. Breathe,” he instructs. <br></p><p>Carol gives him a hard look and sits back down, twirling the drink in her cup around. </p><p>“You lied you know,” he says, “I’m not your best friend.”<br></p><p>Carol scoffs, “just take the complement.”</p><p>“I think you know where I’m getting at,” he banters, “remember when I went through that head of yours? Fogged up memories of flying aircrafts, cart racing and long karaoke nights with–”</p><p>“Don’t,” Carol warns, cutting Talos off. <br></p><p>Talos purses his lips.</p><p>“You’re gonna have to talk about her eventually,” he suggests, “my wife and daughter miss them too-”<br></p><p>“Talos,” Carol says, voice teetering on the edge of cracking, “Please all I can think about is–” <br></p><p>Carol cuts herself off with a silent sob. She puts a hand on her face and exhales.</p><p>“Say it, tell me,” Talos whispers. <br></p><p>Carol chuckles, wiping her damp and red eyes.</p><p>“Why are you making me do this?” she asks.<br></p><p>Talos’ eyes soften as he squeezes Carol’s hand.</p><p>“You may be the strongest I’ve ever known Carol, but you’re still human. Still flesh and bone, you don’t need to hold your emotions in anymore. I thought you got Yon-Rogg out of your head already?”<br></p><p>“I thought I did, but I could never stop thinking about them. I loved Maria, fuck I still do but–”<br></p><p>Carol cut herself off again.</p><p>“Go on,” Talos urges, “what are you thinking?”<br></p><p>“I have this dream of seeing them again,” Carol reflects, “God, Lieutenant Trouble’s really grown now, I didn’t even get to formally meet her boyfriend yet– and Maria– I just want her in my arms again. I want to be home with her again.” <br></p><p>“Will you ever go back?” Talos asks, “to Earth, I mean just as a temporary stay?”<br></p><p>Carol shakes her head.</p><p>“I doubt that Talos, the Avengers have Earth covered and I have the rest of the galaxy there’s no need to–”<br></p><p>Carol gets cut off by the beeping of her phone, Natasha lent her one when she last visited Earth. Her eyes widened as she took it out. </p><p>“I have to get to Earth, now,” she says.<br></p><p>Talos is up with her. </p><p>“Be careful, Carol,” he says.<br></p><p>She doesn’t need it, they both know that. But, Carol accepts it anyway and embraces Talos tightly.</p><p>“Thank you, Talos.”<br></p><p>…</p><p>Carol went binary in a millisecond while crashing through Thanos’ warships. She surveyed the battlefield, looking for this Thanos from another timeline. </p><p>“Danvers, we could use an assist,” Steve says. </p><p>Carol nods, swooping down and spotting Spiderman, clutching onto the gauntlet for dear life. </p><p>“Hi there, I-I’m Peter Parker,” he croaks.<br></p><p>Carol’s eyes softened for a moment. Here was this kid in the middle of a battlefield, bruised and afraid. God, he reminded her of Monica when she fell off of her bike years ago. </p><p>“Hey Peter Parker, got something for me?” she asks.<br></p><p>Peter gets up and hands the gauntlet off to Carol, eyeing her in a mixture of admiration and concern. </p><p>“um, uh ms–what’s your name?”</p><p>Carol grinned at him as she took the gauntlet and tucked it under her arm.</p><p>“Captain Marvel,” She declares.<br></p><p>Peter frowns, “ah, of course you used the fake name– Cap, how are you gonna get through that alone?”</p><p>Carol turns toward the battle field, all of Thanos’ army waiting and Thanos himself. </p><p>“Well, Peter–”<br></p><p>“She’s got help,” a voice says.<br></p><p>Carol turns as the other heroines joined her. </p><p>“Go ahead, we’ve got your back,” Okoye says.</p><p>Carol nods and flies forward, eyes glows as she pushes through. </p><p>Thanos collides with her, the gauntlet flying from her grip as Carol recovers slightly. The titan goes for it, but she stops him, gripping his arms tightly in an act to subdue him. Thanos cringes and headbutts her. Carol doesn’t flinch before aiming to knock Thanos across the field. </p><p>“Captain Marvel look ou–”<br></p><p>Peter’s plea didn’t get to Carol in time as Thanos peeled the power stone from his gauntlet, using it against her.</p><p>…</p><p>“Vel–Captain Marvel,” Peter pleas, shaking Carol helplessly.</p><p>Carol hops up, taking notice of Peter. His eyes were red, and face tear stained. </p><p>“Parker, what happened,” Carol demanded, softly, yet firmly.<br></p><p>“M-Mr Stark he– he used the stones h-he’s–”<br></p><p>Carol’s face grew white with shock and pain. Her fists clenched. She could have saved Stark again, but she was reckless. Again she couldn’t keep the ones she cared for safe. She watches Peter break down in sobs. She’s seen this before. Monica always ran to her while growing up, searching for her mother’s comfort. She does the only think she knows how to do in this situation. She brought Peter into her arms, rubbing his back and soothing him as he cried into her chest.</p><p>…</p><p>Carol watched from Stark’s porch as the eulogy ended. She kept her hands clasped together to keep them from trembling. </p><p>“D-Don’t lie to me, Fury,” she growled.<br></p><p>Nick walked over to her.</p><p>“I’m here aren’t I,” he said in a matter of fact fashion, “everybody Thanos snapped from existence has returned.”<br></p><p>Carol’s eyes glossed as the tears rose up again. She put her fist against her mouth to keep her composure.</p><p>“F-Fury–”</p><p>“Go see her,” he said, “I’m sure she’d want some explaining, especially with that haircut.”</p><p>Carol laughs and wipes her tears.</p><p>“Thank you, Fury,” she said. </p><p>Nick shrugged and gasped when Carol pulled him into her arms. He returned it fully. </p><p>“Anytime Avenger, we could road trip for old times–” </p><p>Carol shot up into the air.</p><p>“Sorry Fury, but I’ve been dreaming of this moment for five years,” Carol shouted before zipping off. <br></p><p>…</p><p>Carol landed awkwardly, her black suit a little scorched and tattered from the trip, but she didn’t care. Maria’s house was in fine condition, even the hole Carol blew in the roof five years prior was gone. The door swung open and there she was, Maria Rambeau. Her fellow pilot, partner, best friend, lover. Her home. </p><p>“C-Carol– oh God–” Maria cried.</p><p>Carol ran up to her, taking the woman up into her arms in a warm embrace.</p><p>“I-It’s you, I missed your hugs,” Carol whispered into Maria’s neck.</p><p>“Carol, I– I thought you were–”</p><p>Maria broke down as Carol pulled back to see her face. Her hair got longer, now coming down past her neck. Carol admired the muscle in her lover’s arms as well, noticing how tight she held on. She almost came to tears too, but she had to be strong now. For the both of them. </p><p>“I’m here now,” she declared, “and I won’t leave and let anything like that happened again.”</p><p>Maria put on a weak smile and that was all it took for Carol to kiss her. Her hands found themselves around Maria’s waist, while Maria ran her hands through Carol’s now short hair. </p><p>Maria pulled back breathlessly and gazed fondly into Carol’s eyes.</p><p>“Haircut?”</p><p>Carol chuckled, “Do you like it?”</p><p>Maria touched Carol’s cheek and gave it a quick once over. </p><p>“I do, but it’s going to take some getting used to,” Maria said before betting her lip. </p><p>Carol caught the hint and slyly grinned.</p><p>“Oh, I see,” she said before capturing Maria’s lips again.<br></p><p>The kiss grew more heated as Carol’s hand went to Maria’s thigh and Maria’s went to Carol’s chest.</p><p>“C-Carol, Carol, baby–look at me,” Maria said.<br></p><p>Carol pulled away, eyes screwed shut before opening them again. </p><p>“I-I need you,” Carol whispered.<br></p><p>“We’ve got time, OK?”<br></p><p>Carol nodded and threw her arms around Maria again. </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "newcaptainofsquad9",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#f6f6f6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/9218d2514c2135245df791eabb21a283/nxp5qds/LGpo08m5x/tumblr_static_1n29q7tv7vxccowcgkwg4s4kk.jpg",
                        "header_image_focused": "https://static.tumblr.com/9218d2514c2135245df791eabb21a283/nxp5qds/LGpo08m5x/tumblr_static_1n29q7tv7vxccowcgkwg4s4kk_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/9218d2514c2135245df791eabb21a283/nxp5qds/LGpo08m5x/tumblr_static_1n29q7tv7vxccowcgkwg4s4kk_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ecc",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184807681362"
                },
                "content_raw": "<p><figure data-orig-width=\"500\" data-orig-height=\"278\" data-tumblr-attribution=\"theavengers:Lmb_Qa57Tv0psNL1WxyrZQ:ZhzcSn2gnEGES\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c2319293b70de885e724ed929b7b5f9d/tumblr_po2bvlSlk81tctq75o1_r1_500.gif\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"278\"></figure><figure data-orig-width=\"268\" data-orig-height=\"315\" data-tumblr-attribution=\"tchillax:SB5YGZj0gx_KHLnxVqGLUA:ZC7Tzj2hl39qu\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/18aa2cdff576cd415e6e59fc100a0cb6/tumblr_ppnn69PGCQ1ubn6jto5_r1_400.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"315\"></figure><p>Paring: Carol Danvers x Maria Rambeau, Platonic! Carol Danvers x Talos, Platonic! Carol Danvers x Peter Parker, Platonic! Carol Danvers x Nick Fury</p><p>Summary: (SPOILER WARNING) After Carol returns to Earth she finds out that both Maria and Monica were lost in the snap. She and the other Avengers successfully kill Thanos, but Carol goes overboard in a fit of rage. She manages to calm down, going into space to help out those who were affected by the snap. She now helps planets whenever she can, while drowning herself in her own sorrows and self pity. Abruptly, the Avengers need her help with Thanos from another timeline and she realizes that they reversed the snap, giving her a chance to see her lover and daughter again. </p><p>Word Count: 1,923</p><p>Writer’s Note: Lot’s of angst, a sad Carol but there will be fluff too :). It’s a bit disjointed, but we all needed this in Endgame people I hope I delivered. </p><hr>[[MORE]]<p>Carol glances down at the grass as she watches Tony and Pepper embrace. She would have flown through the galaxy, battling the stars, Kree and rogues all over again just to take Maria in her arms. But, all she came home to was dust, ash and a burnt pan where she assumed Maria was cooking. Tears escaped her, along with the glow of her hands that can with the frustration and anger she felt. She grabbed Maria’s cellphone, calling Monica, yet she didn’t answer. Her boyfriend, Tom picked up, frantic about Monica crumbling to dust in front of him. Carol let the anger consume her wholly, firing a photon blast through the ceiling of Maria’s kitchen before leaping into the air with a bone curdling scream. </p><p>…</p><p>“You didn’t have me,” Carol says to the Avengers numbly. <br></p><p>“Look, new girl,” Rhodey starts, “we’re all about that superhero life but what-”<br></p><p>Carol cut him off.</p><p>“You think I wanted to be out there! Away from my family while they disappeared? I’m getting that son of a bitch whether you’re with me or not.”<br></p><p>Steve’s jaw tightens but he nods.</p><p>“She’s right, let’s get the son of a bitch,” he agreed. <br></p><p>…</p><p>They caught Thanos alone. He was cooking something when Carol busted through his hut. All fire, hardly waiting for the avengers to catch up with her. A few photon blasts knocked him to the floor and Carol was on him again, arms firmly around his neck. Steve, Rhodey, Natasha, and Thor arrive. </p><p>“Where are the stones?” Steve asked.<br></p><p>Carol’s grip on Thanos tightened, nearly strangling him to death.</p><p>“Answer. Him,” she growled. <br></p><p>“Gone- I-I destroyed them,” Thanos said, “i-if y-you’re here now then, I was successful-”</p><p>“Damnit!” Carol roared.<br></p><p>It happened quickly. Thor tried to rush in first, eyes glowing blue with the lightning of Stormbreaker around him. Carol’s move was swift, snapping Thanos’ neck before Thor could reach. She let the titan’s lifeless body drop, as Thor chopped off his head. </p><p>“The fuck was that!” Rhodey shouted.<br></p><p>“He’s better that way,” Carol said bluntly, “I avenged our family, friends, half of the world.”</p><p>“Carol,” Steve started.<br></p><p>Carol didn’t listen as she flew back into the air.</p><p>…</p><p>Talos found Carol in a bar on planet Krylor, drowning herself in the sorrows of whatever fine drinks she could get her hands on. He cringed when he found her, hunched over the bar with a friend, in silver armor, Brunnhilde. </p><p>“To the new Queen of New Asguard!” Carol beams as she downs her drink in one gulp. </p><p>Brunnhilde gives Captain Marvel a small smile. </p><p>“I’m worried about him,” she says, “all he does is drink and play– what are those things you mortals use to?”</p><p>“Video Games,” Carol bellows.</p><p>She finally notices Talos glaring at her. </p><p>“If you needed me you could have–”</p><p>“Paged you. You’re always in between planets, even got a new hair cut,” Talos says as he sits next to Carol.</p><p>Carol runs a quick hand through her now short hair. </p><p>“I had that hair for over twenty five years, it got in the way and I needed a change,” she says. </p><p>“I like it,” Talos says before looking to Brunnhilde, “you’re in company of a Queen, eh?”</p><p>Carol nods, “Talos, Brunnhilde. My best friend, saved him back in ‘95. Brunnhilde, Queen of New Asguard, met her back–”</p><p>Carol cut herself off, staring down at the bar. </p><p>“Five years ago,” she whispers.</p><p>Talos glares between the two women. Brunnhilde takes the hint and rises from the bar. </p><p>“Well, New Asguard isn’t going to govern itself,” she says.</p><p>Before Brunnhilde leaves she puts a hand on Talos’ shoulder. </p><p>“Good luck.”<br></p><p>Talos gives her a sharp nod before stalking out. </p><p>“Seriously, is everyone all right?” Carol asks. <br></p><p>“We’re hanging in there Carol, better than we were a few years ago. Thanks to you,” Talos says.<br></p><p>Carol shrugs.</p><p>“It’s all I can do now. Krylor still needs supplies– I’m so close to finding more harvests for them. I need to.”<br></p><p>She rises, but Talos stops her.</p><p>“Carol. Breathe,” he instructs. <br></p><p>Carol gives him a hard look and sits back down, twirling the drink in her cup around. </p><p>“You lied you know,” he says, “I’m not your best friend.”<br></p><p>Carol scoffs, “just take the complement.”</p><p>“I think you know where I’m getting at,” he banters, “remember when I went through that head of yours? Fogged up memories of flying aircrafts, cart racing and long karaoke nights with–”</p><p>“Don’t,” Carol warns, cutting Talos off. <br></p><p>Talos purses his lips.</p><p>“You’re gonna have to talk about her eventually,” he suggests, “my wife and daughter miss them too-”<br></p><p>“Talos,” Carol says, voice teetering on the edge of cracking, “Please all I can think about is–” <br></p><p>Carol cuts herself off with a silent sob. She puts a hand on her face and exhales.</p><p>“Say it, tell me,” Talos whispers. <br></p><p>Carol chuckles, wiping her damp and red eyes.</p><p>“Why are you making me do this?” she asks.<br></p><p>Talos’ eyes soften as he squeezes Carol’s hand.</p><p>“You may be the strongest I’ve ever known Carol, but you’re still human. Still flesh and bone, you don’t need to hold your emotions in anymore. I thought you got Yon-Rogg out of your head already?”<br></p><p>“I thought I did, but I could never stop thinking about them. I loved Maria, fuck I still do but–”<br></p><p>Carol cut herself off again.</p><p>“Go on,” Talos urges, “what are you thinking?”<br></p><p>“I have this dream of seeing them again,” Carol reflects, “God, Lieutenant Trouble’s really grown now, I didn’t even get to formally meet her boyfriend yet– and Maria– I just want her in my arms again. I want to be home with her again.” <br></p><p>“Will you ever go back?” Talos asks, “to Earth, I mean just as a temporary stay?”<br></p><p>Carol shakes her head.</p><p>“I doubt that Talos, the Avengers have Earth covered and I have the rest of the galaxy there’s no need to–”<br></p><p>Carol gets cut off by the beeping of her phone, Natasha lent her one when she last visited Earth. Her eyes widened as she took it out. </p><p>“I have to get to Earth, now,” she says.<br></p><p>Talos is up with her. </p><p>“Be careful, Carol,” he says.<br></p><p>She doesn’t need it, they both know that. But, Carol accepts it anyway and embraces Talos tightly.</p><p>“Thank you, Talos.”<br></p><p>…</p><p>Carol went binary in a millisecond while crashing through Thanos’ warships. She surveyed the battlefield, looking for this Thanos from another timeline. </p><p>“Danvers, we could use an assist,” Steve says. </p><p>Carol nods, swooping down and spotting Spiderman, clutching onto the gauntlet for dear life. </p><p>“Hi there, I-I’m Peter Parker,” he croaks.<br></p><p>Carol’s eyes softened for a moment. Here was this kid in the middle of a battlefield, bruised and afraid. God, he reminded her of Monica when she fell off of her bike years ago. </p><p>“Hey Peter Parker, got something for me?” she asks.<br></p><p>Peter gets up and hands the gauntlet off to Carol, eyeing her in a mixture of admiration and concern. </p><p>“um, uh ms–what’s your name?”</p><p>Carol grinned at him as she took the gauntlet and tucked it under her arm.</p><p>“Captain Marvel,” She declares.<br></p><p>Peter frowns, “ah, of course you used the fake name– Cap, how are you gonna get through that alone?”</p><p>Carol turns toward the battle field, all of Thanos’ army waiting and Thanos himself. </p><p>“Well, Peter–”<br></p><p>“She’s got help,” a voice says.<br></p><p>Carol turns as the other heroines joined her. </p><p>“Go ahead, we’ve got your back,” Okoye says.</p><p>Carol nods and flies forward, eyes glows as she pushes through. </p><p>Thanos collides with her, the gauntlet flying from her grip as Carol recovers slightly. The titan goes for it, but she stops him, gripping his arms tightly in an act to subdue him. Thanos cringes and headbutts her. Carol doesn’t flinch before aiming to knock Thanos across the field. </p><p>“Captain Marvel look ou–”<br></p><p>Peter’s plea didn’t get to Carol in time as Thanos peeled the power stone from his gauntlet, using it against her.</p><p>…</p><p>“Vel–Captain Marvel,” Peter pleas, shaking Carol helplessly.</p><p>Carol hops up, taking notice of Peter. His eyes were red, and face tear stained. </p><p>“Parker, what happened,” Carol demanded, softly, yet firmly.<br></p><p>“M-Mr Stark he– he used the stones h-he’s–”<br></p><p>Carol’s face grew white with shock and pain. Her fists clenched. She could have saved Stark again, but she was reckless. Again she couldn’t keep the ones she cared for safe. She watches Peter break down in sobs. She’s seen this before. Monica always ran to her while growing up, searching for her mother’s comfort. She does the only think she knows how to do in this situation. She brought Peter into her arms, rubbing his back and soothing him as he cried into her chest.</p><p>…</p><p>Carol watched from Stark’s porch as the eulogy ended. She kept her hands clasped together to keep them from trembling. </p><p>“D-Don’t lie to me, Fury,” she growled.<br></p><p>Nick walked over to her.</p><p>“I’m here aren’t I,” he said in a matter of fact fashion, “everybody Thanos snapped from existence has returned.”<br></p><p>Carol’s eyes glossed as the tears rose up again. She put her fist against her mouth to keep her composure.</p><p>“F-Fury–”</p><p>“Go see her,” he said, “I’m sure she’d want some explaining, especially with that haircut.”</p><p>Carol laughs and wipes her tears.</p><p>“Thank you, Fury,” she said. </p><p>Nick shrugged and gasped when Carol pulled him into her arms. He returned it fully. </p><p>“Anytime Avenger, we could road trip for old times–” </p><p>Carol shot up into the air.</p><p>“Sorry Fury, but I’ve been dreaming of this moment for five years,” Carol shouted before zipping off. <br></p><p>…</p><p>Carol landed awkwardly, her black suit a little scorched and tattered from the trip, but she didn’t care. Maria’s house was in fine condition, even the hole Carol blew in the roof five years prior was gone. The door swung open and there she was, Maria Rambeau. Her fellow pilot, partner, best friend, lover. Her home. </p><p>“C-Carol– oh God–” Maria cried.</p><p>Carol ran up to her, taking the woman up into her arms in a warm embrace.</p><p>“I-It’s you, I missed your hugs,” Carol whispered into Maria’s neck.</p><p>“Carol, I– I thought you were–”</p><p>Maria broke down as Carol pulled back to see her face. Her hair got longer, now coming down past her neck. Carol admired the muscle in her lover’s arms as well, noticing how tight she held on. She almost came to tears too, but she had to be strong now. For the both of them. </p><p>“I’m here now,” she declared, “and I won’t leave and let anything like that happened again.”</p><p>Maria put on a weak smile and that was all it took for Carol to kiss her. Her hands found themselves around Maria’s waist, while Maria ran her hands through Carol’s now short hair. </p><p>Maria pulled back breathlessly and gazed fondly into Carol’s eyes.</p><p>“Haircut?”</p><p>Carol chuckled, “Do you like it?”</p><p>Maria touched Carol’s cheek and gave it a quick once over. </p><p>“I do, but it’s going to take some getting used to,” Maria said before betting her lip. </p><p>Carol caught the hint and slyly grinned.</p><p>“Oh, I see,” she said before capturing Maria’s lips again.<br></p><p>The kiss grew more heated as Carol’s hand went to Maria’s thigh and Maria’s went to Carol’s chest.</p><p>“C-Carol, Carol, baby–look at me,” Maria said.<br></p><p>Carol pulled away, eyes screwed shut before opening them again. </p><p>“I-I need you,” Carol whispered.<br></p><p>“We’ve got time, OK?”<br></p><p>Carol nodded and threw her arms around Maria again. </p></p>",
                "content": "<p><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><figure data-tumblr-media-id=\"1\" class=\"tmblr-full\"></figure><p>Paring: Carol Danvers x Maria Rambeau, Platonic! Carol Danvers x Talos, Platonic! Carol Danvers x Peter Parker, Platonic! Carol Danvers x Nick Fury</p><p>Summary: (SPOILER WARNING) After Carol returns to Earth she finds out that both Maria and Monica were lost in the snap. She and the other Avengers successfully kill Thanos, but Carol goes overboard in a fit of rage. She manages to calm down, going into space to help out those who were affected by the snap. She now helps planets whenever she can, while drowning herself in her own sorrows and self pity. Abruptly, the Avengers need her help with Thanos from another timeline and she realizes that they reversed the snap, giving her a chance to see her lover and daughter again.&nbsp;</p><p>Word Count: 1,923</p><p>Writer&rsquo;s Note: Lot&rsquo;s of angst, a sad Carol but there will be fluff too :). It&rsquo;s a bit disjointed, but we all needed this in Endgame people I hope I delivered.&nbsp;</p><hr /><p>Carol glances down at the grass as she watches Tony and Pepper embrace. She would have flown through the galaxy, battling the stars, Kree and rogues all over again just to take Maria in her arms. But, all she came home to was dust, ash and a burnt pan where she assumed Maria was cooking. Tears escaped her, along with the glow of her hands that can with the frustration and anger she felt. She grabbed Maria&rsquo;s cellphone, calling Monica, yet she didn&rsquo;t answer. Her boyfriend, Tom picked up, frantic about Monica crumbling to dust in front of him. Carol let the anger consume her wholly, firing a photon blast through the ceiling of Maria&rsquo;s kitchen before leaping into the air with a bone curdling scream.&nbsp;</p><p>&hellip;</p><p>&ldquo;You didn&rsquo;t have me,&rdquo; Carol says to the Avengers numbly.&nbsp;<br /></p><p>&ldquo;Look, new girl,&rdquo; Rhodey starts,&nbsp;&ldquo;we&rsquo;re all about that superhero life but what-&rdquo;<br /></p><p>Carol cut him off.</p><p>&ldquo;You think I wanted to be out there! Away from my family while they disappeared? I&rsquo;m getting that son of a bitch whether you&rsquo;re with me or not.&rdquo;<br /></p><p>Steve&rsquo;s jaw tightens but he nods.</p><p>&ldquo;She&rsquo;s right, let&rsquo;s get the son of a bitch,&rdquo; he agreed.&nbsp;<br /></p><p>&hellip;</p><p>They caught Thanos alone. He was cooking something when Carol busted through his hut. All fire, hardly waiting for the avengers to catch up with her. A few photon blasts knocked him to the floor and Carol was on him again, arms firmly around his neck. Steve, Rhodey, Natasha, and Thor arrive.&nbsp;</p><p>&ldquo;Where are the stones?&rdquo; Steve asked.<br /></p><p>Carol&rsquo;s grip on Thanos tightened, nearly strangling him to death.</p><p>&ldquo;Answer. Him,&rdquo; she growled.&nbsp;<br /></p><p>&ldquo;Gone- I-I destroyed them,&rdquo; Thanos said,&nbsp;&ldquo;i-if y-you&rsquo;re here now then, I was successful-&rdquo;</p><p>&ldquo;Damnit!&rdquo; Carol roared.<br /></p><p>It happened quickly. Thor tried to rush in first, eyes glowing blue with the lightning of Stormbreaker around him. Carol&rsquo;s move was swift, snapping Thanos&rsquo; neck before Thor could reach. She let the titan&rsquo;s lifeless body drop, as Thor chopped off his head.&nbsp;</p><p>&ldquo;The fuck was that!&rdquo; Rhodey shouted.<br /></p><p>&ldquo;He&rsquo;s better that way,&rdquo; Carol said bluntly,&nbsp;&ldquo;I avenged our family, friends, half of the world.&rdquo;</p><p>&ldquo;Carol,&rdquo; Steve started.<br /></p><p>Carol didn&rsquo;t listen as she flew back into the air.</p><p>&hellip;</p><p>Talos found Carol in a bar on planet Krylor, drowning herself in the sorrows of whatever fine drinks she could get her hands on. He cringed when he found her, hunched over the bar with a friend, in silver armor, Brunnhilde.&nbsp;</p><p>&ldquo;To the new Queen of New Asguard!&rdquo; Carol beams as she downs her drink in one gulp.&nbsp;</p><p>Brunnhilde gives Captain Marvel a small smile.&nbsp;</p><p>&ldquo;I&rsquo;m worried about him,&rdquo; she says,&nbsp;&ldquo;all he does is drink and play&ndash; what are those things you mortals use to?&rdquo;</p><p>&ldquo;Video Games,&rdquo; Carol bellows.</p><p>She finally notices Talos glaring at her.&nbsp;</p><p>&ldquo;If you needed me you could have&ndash;&rdquo;</p><p>&ldquo;Paged you. You&rsquo;re always in between planets, even got a new hair cut,&rdquo; Talos says as he sits next to Carol.</p><p>Carol runs a quick hand through her now short hair.&nbsp;</p><p>&ldquo;I had that hair for over twenty five years, it got in the way and I needed a change,&rdquo; she says.&nbsp;</p><p>&ldquo;I like it,&rdquo; Talos says before looking to Brunnhilde,&nbsp;&ldquo;you&rsquo;re in company of a Queen, eh?&rdquo;</p><p>Carol nods,&nbsp;&ldquo;Talos, Brunnhilde. My best friend, saved him back in&nbsp;&lsquo;95. Brunnhilde, Queen of New Asguard, met her back&ndash;&rdquo;</p><p>Carol cut herself off, staring down at the bar.&nbsp;</p><p>&ldquo;Five years ago,&rdquo; she whispers.</p><p>Talos glares between the two women. Brunnhilde takes the hint and rises from the bar.&nbsp;</p><p>&ldquo;Well, New Asguard isn&rsquo;t going to govern itself,&rdquo; she says.</p><p>Before Brunnhilde leaves she puts a hand on Talos&rsquo; shoulder.&nbsp;</p><p>&ldquo;Good luck.&rdquo;<br /></p><p>Talos gives her a sharp nod before stalking out.&nbsp;</p><p>&ldquo;Seriously, is everyone all right?&rdquo; Carol asks.&nbsp;<br /></p><p>&ldquo;We&rsquo;re hanging in there Carol, better than we were a few years ago. Thanks to you,&rdquo; Talos says.<br /></p><p>Carol shrugs.</p><p>&ldquo;It&rsquo;s all I can do now. Krylor still needs supplies&ndash; I&rsquo;m so close to finding more harvests for them. I need to.&rdquo;<br /></p><p>She rises, but Talos stops her.</p><p>&ldquo;Carol. Breathe,&rdquo; he instructs.&nbsp;<br /></p><p>Carol gives him a hard look and sits back down, twirling the drink in her cup around.&nbsp;</p><p>&ldquo;You lied you know,&rdquo; he says,&nbsp;&ldquo;I&rsquo;m not your best friend.&rdquo;<br /></p><p>Carol scoffs,&nbsp;&ldquo;just take the complement.&rdquo;</p><p>&ldquo;I think you know where I&rsquo;m getting at,&rdquo; he banters,&nbsp;&ldquo;remember when I went through that head of yours? Fogged up memories of flying aircrafts, cart racing and long karaoke nights with&ndash;&rdquo;</p><p>&ldquo;Don&rsquo;t,&rdquo; Carol warns, cutting Talos off.&nbsp;<br /></p><p>Talos purses his lips.</p><p>&ldquo;You&rsquo;re gonna have to talk about her eventually,&rdquo; he suggests,&nbsp;&ldquo;my wife and daughter miss them too-&rdquo;<br /></p><p>&ldquo;Talos,&rdquo; Carol says, voice teetering on the edge of cracking,&nbsp;&ldquo;Please all I can think about is&ndash;&rdquo;&nbsp;<br /></p><p>Carol cuts herself off with a silent sob. She puts a hand on her face and exhales.</p><p>&ldquo;Say it, tell me,&rdquo; Talos whispers.&nbsp;<br /></p><p>Carol chuckles, wiping her damp and red eyes.</p><p>&ldquo;Why are you making me do this?&rdquo; she asks.<br /></p><p>Talos&rsquo; eyes soften as he squeezes Carol&rsquo;s hand.</p><p>&ldquo;You may be the strongest I&rsquo;ve ever known Carol, but you&rsquo;re still human. Still flesh and bone, you don&rsquo;t need to hold your emotions in anymore. I thought you got Yon-Rogg out of your head already?&rdquo;<br /></p><p>&ldquo;I thought I did, but I could never stop thinking about them. I loved Maria, fuck I still do but&ndash;&rdquo;<br /></p><p>Carol cut herself off again.</p><p>&ldquo;Go on,&rdquo; Talos urges,&nbsp;&ldquo;what are you thinking?&rdquo;<br /></p><p>&ldquo;I have this dream of seeing them again,&rdquo; Carol reflects,&nbsp;&ldquo;God, Lieutenant Trouble&rsquo;s really grown now, I didn&rsquo;t even get to formally meet her boyfriend yet&ndash; and Maria&ndash; I just want her in my arms again. I want to be home with her again.&rdquo;&nbsp;<br /></p><p>&ldquo;Will you ever go back?&rdquo; Talos asks,&nbsp;&ldquo;to Earth, I mean just as a temporary stay?&rdquo;<br /></p><p>Carol shakes her head.</p><p>&ldquo;I doubt that Talos, the Avengers have Earth covered and I have the rest of the galaxy there&rsquo;s no need to&ndash;&rdquo;<br /></p><p>Carol gets cut off by the beeping of her phone, Natasha lent her one when she last visited Earth. Her eyes widened as she took it out.&nbsp;</p><p>&ldquo;I have to get to Earth, now,&rdquo; she says.<br /></p><p>Talos is up with her.&nbsp;</p><p>&ldquo;Be careful, Carol,&rdquo; he says.<br /></p><p>She doesn&rsquo;t need it, they both know that. But, Carol accepts it anyway and embraces Talos tightly.</p><p>&ldquo;Thank you, Talos.&rdquo;<br /></p><p>&hellip;</p><p>Carol went binary in a millisecond while crashing through Thanos&rsquo; warships. She surveyed the battlefield, looking for this Thanos from another timeline.&nbsp;</p><p>&ldquo;Danvers, we could use an assist,&rdquo; Steve says.&nbsp;</p><p>Carol nods, swooping down and spotting Spiderman, clutching onto the gauntlet for dear life.&nbsp;</p><p>&ldquo;Hi there, I-I&rsquo;m Peter Parker,&rdquo; he croaks.<br /></p><p>Carol&rsquo;s eyes softened for a moment. Here was this kid in the middle of a battlefield, bruised and afraid. God, he reminded her of Monica when she fell off of her bike years ago.&nbsp;</p><p>&ldquo;Hey Peter Parker, got something for me?&rdquo; she asks.<br /></p><p>Peter gets up and hands the gauntlet off to Carol, eyeing her in a mixture of admiration and concern.&nbsp;</p><p>&ldquo;um, uh ms&ndash;what&rsquo;s your name?&rdquo;</p><p>Carol grinned at him as she took the gauntlet and tucked it under her arm.</p><p>&ldquo;Captain Marvel,&rdquo; She declares.<br /></p><p>Peter frowns,&nbsp;&ldquo;ah, of course you used the fake name&ndash; Cap, how are you gonna get through that alone?&rdquo;</p><p>Carol turns toward the battle field, all of Thanos&rsquo; army waiting and Thanos himself.&nbsp;</p><p>&ldquo;Well, Peter&ndash;&rdquo;<br /></p><p>&ldquo;She&rsquo;s got help,&rdquo; a voice says.<br /></p><p>Carol turns as the other heroines joined her.&nbsp;</p><p>&ldquo;Go ahead, we&rsquo;ve got your back,&rdquo; Okoye says.</p><p>Carol nods and flies forward, eyes glows as she pushes through.&nbsp;</p><p>Thanos collides with her, the gauntlet flying from her grip as Carol recovers slightly. The titan goes for it, but she stops him, gripping his arms tightly in an act to subdue him. Thanos cringes and headbutts her. Carol doesn&rsquo;t flinch before aiming to knock Thanos across the field.&nbsp;</p><p>&ldquo;Captain Marvel look ou&ndash;&rdquo;<br /></p><p>Peter&rsquo;s plea didn&rsquo;t get to Carol in time as Thanos peeled the power stone from his gauntlet, using it against her.</p><p>&hellip;</p><p>&ldquo;Vel&ndash;Captain Marvel,&rdquo; Peter pleas, shaking Carol helplessly.</p><p>Carol hops up, taking notice of Peter. His eyes were red, and face tear stained.&nbsp;</p><p>&ldquo;Parker, what happened,&rdquo; Carol demanded, softly, yet firmly.<br /></p><p>&ldquo;M-Mr Stark he&ndash; he used the stones h-he&rsquo;s&ndash;&rdquo;<br /></p><p>Carol&rsquo;s face grew white with shock and pain. Her fists clenched. She could have saved Stark again, but she was reckless. Again she couldn&rsquo;t keep the ones she cared for safe. She watches Peter break down in sobs. She&rsquo;s seen this before. Monica always ran to her while growing up, searching for her mother&rsquo;s comfort. She does the only think she knows how to do in this situation. She brought Peter into her arms, rubbing his back and soothing him as he cried into her chest.</p><p>&hellip;</p><p>Carol watched from Stark&rsquo;s porch as the eulogy ended. She kept her hands clasped together to keep them from trembling.&nbsp;</p><p>&ldquo;D-Don&rsquo;t lie to me, Fury,&rdquo; she growled.<br /></p><p>Nick walked over to her.</p><p>&ldquo;I&rsquo;m here aren&rsquo;t I,&rdquo; he said in a matter of fact fashion,&nbsp;&ldquo;everybody Thanos snapped from existence has returned.&rdquo;<br /></p><p>Carol&rsquo;s eyes glossed as the tears rose up again. She put her fist against her mouth to keep her composure.</p><p>&ldquo;F-Fury&ndash;&rdquo;</p><p>&ldquo;Go see her,&rdquo; he said,&nbsp;&ldquo;I&rsquo;m sure she&rsquo;d want some explaining, especially with that haircut.&rdquo;</p><p>Carol laughs and wipes her tears.</p><p>&ldquo;Thank you, Fury,&rdquo; she said.&nbsp;</p><p>Nick shrugged and gasped when Carol pulled him into her arms. He returned it fully.&nbsp;</p><p>&ldquo;Anytime Avenger, we could road trip for old times&ndash;&rdquo;&nbsp;</p><p>Carol shot up into the air.</p><p>&ldquo;Sorry Fury, but I&rsquo;ve been dreaming of this moment for five years,&rdquo; Carol shouted before zipping off.&nbsp;<br /></p><p>&hellip;</p><p>Carol landed awkwardly, her black suit a little scorched and tattered from the trip, but she didn&rsquo;t care. Maria&rsquo;s house was in fine condition, even the hole Carol blew in the roof five years prior was gone. The door swung open and there she was, Maria Rambeau. Her fellow pilot, partner, best friend, lover. Her home.&nbsp;</p><p>&ldquo;C-Carol&ndash; oh God&ndash;&rdquo; Maria cried.</p><p>Carol ran up to her, taking the woman up into her arms in a warm embrace.</p><p>&ldquo;I-It&rsquo;s you, I missed your hugs,&rdquo; Carol whispered into Maria&rsquo;s neck.</p><p>&ldquo;Carol, I&ndash; I thought you were&ndash;&rdquo;</p><p>Maria broke down as Carol pulled back to see her face. Her hair got longer, now coming down past her neck. Carol admired the muscle in her lover&rsquo;s arms as well, noticing how tight she held on. She almost came to tears too, but she had to be strong now. For the both of them.&nbsp;</p><p>&ldquo;I&rsquo;m here now,&rdquo; she declared,&nbsp;&ldquo;and I won&rsquo;t leave and let anything like that happened again.&rdquo;</p><p>Maria put on a weak smile and that was all it took for Carol to kiss her. Her hands found themselves around Maria&rsquo;s waist, while Maria ran her hands through Carol&rsquo;s now short hair.&nbsp;</p><p>Maria pulled back breathlessly and gazed fondly into Carol&rsquo;s eyes.</p><p>&ldquo;Haircut?&rdquo;</p><p>Carol chuckled,&nbsp;&ldquo;Do you like it?&rdquo;</p><p>Maria touched Carol&rsquo;s cheek and gave it a quick once over.&nbsp;</p><p>&ldquo;I do, but it&rsquo;s going to take some getting used to,&rdquo; Maria said before betting her lip.&nbsp;</p><p>Carol caught the hint and slyly grinned.</p><p>&ldquo;Oh, I see,&rdquo; she said before capturing Maria&rsquo;s lips again.<br /></p><p>The kiss grew more heated as Carol&rsquo;s hand went to Maria&rsquo;s thigh and Maria&rsquo;s went to Carol&rsquo;s chest.</p><p>&ldquo;C-Carol, Carol, baby&ndash;look at me,&rdquo; Maria said.<br /></p><p>Carol pulled away, eyes screwed shut before opening them again.&nbsp;</p><p>&ldquo;I-I need you,&rdquo; Carol whispered.<br /></p><p>&ldquo;We&rsquo;ve got time, OK?&rdquo;<br /></p><p>Carol nodded and threw her arms around Maria again.&nbsp;</p></p>",
                "content_abstract": "<p>\n<figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><figure data-tumblr-media-id=\"1\" class=\"tmblr-full\"></figure>\n<p>Paring: Carol Danvers x Maria Rambeau, Platonic! Carol Danvers x Talos, Platonic! Carol Danvers x Peter Parker, Platonic! Carol Danvers x Nick Fury</p>\n<p>Summary: (SPOILER WARNING) After Carol returns to Earth she finds out that both Maria and Monica were lost in the snap. She and the other Avengers successfully kill Thanos, but Carol goes overboard in a fit of rage. She manages to calm down, going into space to help out those who were affected by the snap. She now helps planets whenever she can, while drowning herself in her own sorrows and self pity. Abruptly, the Avengers need her help with Thanos from another timeline and she realizes that they reversed the snap, giving her a chance to see her lover and daughter again.&nbsp;</p>\n<p>Word Count: 1,923</p>\n<p>Writer&rsquo;s Note: Lot&rsquo;s of angst, a sad Carol but there will be fluff too :). It&rsquo;s a bit disjointed, but we all needed this in Endgame people I hope I delivered.&nbsp;</p>\n<hr />\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "servi-lesu",
        "blog": {
            "name": "servi-lesu",
            "title": "Soul Canvas",
            "description": "Soul\nsōl/\nnoun\n\"A person's moral or emotional nature or sense of identity.\"\nCan·vas\n/ˈkanvəs/\nnoun\n\"A piece of canvas cloth prepared for use as the surface for an oil painting.\" \n“If we find ourselves with a desire that nothing in this world can satisfy, the most probable explanation is that we were made for another world.” - C.S. Lewis",
            "url": "https://servi-lesu.tumblr.com/",
            "uuid": "t:qa9YBNV9RfGt42_e54rfsQ",
            "updated": 1561695420
        },
        "id": 184807646022,
        "post_url": "https://servi-lesu.tumblr.com/post/184807646022",
        "slug": "",
        "date": "2019-05-11 18:18:52 GMT",
        "timestamp": 1557598732,
        "state": "published",
        "format": "html",
        "reblog_key": "CSk7LF0C",
        "tags": [
            "Walt Disney Studios",
            "Marvel Studios",
            "Avengers: Endgame",
            "Captain Marvel",
            "Valkyrie",
            "Okoye",
            "Shuri",
            "Gamora",
            "The Wasp",
            "Mantis",
            "Nebula",
            "Rescue",
            "Scarlet Witch",
            "Gif"
        ],
        "short_url": "https://tmblr.co/Zk1zDo2i7PED6",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 43,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "image_permalink": "https://servi-lesu.tumblr.com/image/184807646022",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/cee398506305b59e3945d540bddecf89/tumblr_prcqvgdH081tue45do1_540.gif",
                    "width": 540,
                    "height": 220
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/cee398506305b59e3945d540bddecf89/tumblr_prcqvgdH081tue45do1_540.gif",
                        "width": 540,
                        "height": 220
                    },
                    {
                        "url": "https://66.media.tumblr.com/cee398506305b59e3945d540bddecf89/tumblr_prcqvgdH081tue45do1_500.gif",
                        "width": 500,
                        "height": 204
                    },
                    {
                        "url": "https://66.media.tumblr.com/cee398506305b59e3945d540bddecf89/tumblr_prcqvgdH081tue45do1_400.gif",
                        "width": 400,
                        "height": 163
                    },
                    {
                        "url": "https://66.media.tumblr.com/cee398506305b59e3945d540bddecf89/tumblr_prcqvgdH081tue45do1_250.gif",
                        "width": 250,
                        "height": 102
                    },
                    {
                        "url": "https://66.media.tumblr.com/cee398506305b59e3945d540bddecf89/tumblr_prcqvgdH081tue45do1_100.gif",
                        "width": 100,
                        "height": 41
                    },
                    {
                        "url": "https://66.media.tumblr.com/cee398506305b59e3945d540bddecf89/tumblr_prcqvgdH081tue45do1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "genius-billionaire-playboy",
        "blog": {
            "name": "genius-billionaire-playboy",
            "title": "Iconiq",
            "description": "",
            "url": "https://genius-billionaire-playboy.tumblr.com/",
            "uuid": "t:vU7h-mzEA08HUs48YZdV1Q",
            "updated": 1561567963
        },
        "id": 184807460751,
        "post_url": "https://genius-billionaire-playboy.tumblr.com/post/184807460751/nothing-against-the-russos-but-imagine",
        "slug": "nothing-against-the-russos-but-imagine",
        "date": "2019-05-11 18:07:56 GMT",
        "timestamp": 1557598076,
        "state": "published",
        "format": "html",
        "reblog_key": "IbOfrTqL",
        "tags": [
            "marvel mcu",
            "marvel endgame",
            "captain marvel",
            "marveledit",
            "marvel",
            "mcufam",
            "mcuedit",
            "mcu",
            "movies",
            "iron man",
            "spiderman ffh",
            "avengers endgame spoilers",
            "endgame",
            "endgame spoilers",
            "avengers endgame",
            "endgame premiere",
            "endgame trailer",
            "taika waititi",
            "thor odinson",
            "tony stark",
            "spiderman",
            "peter parker",
            "avengers",
            "avengers infinity war",
            "thank you taika",
            "thor ragnarok",
            "best memes",
            "meme",
            "marvel memes"
        ],
        "short_url": "https://tmblr.co/Z5UXYZ2i7OW_F",
        "summary": "Nothing against the Russos, but imagine...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 378,
        "title": null,
        "body": "<p>Nothing against the Russos, but imagine&hellip;</p><figure class=\"tmblr-full\" data-orig-height=\"1023\" data-orig-width=\"768\"><img src=\"https://66.media.tumblr.com/4d1f833b81a29ca79139c85e53eccfde/tumblr_prcqd7T5Iw1w1udjx_540.jpg\" data-orig-height=\"1023\" data-orig-width=\"768\"/></figure>",
        "reblog": {
            "comment": "<p><p>Nothing against the Russos, but imagine…</p><figure class=\"tmblr-full\" data-orig-height=\"1023\" data-orig-width=\"768\"><img src=\"https://66.media.tumblr.com/4d1f833b81a29ca79139c85e53eccfde/tumblr_prcqd7T5Iw1w1udjx_540.jpg\" data-orig-height=\"1023\" data-orig-width=\"768\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "genius-billionaire-playboy",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_08.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184807460751"
                },
                "content_raw": "<p><p>Nothing against the Russos, but imagine…</p><figure class=\"tmblr-full\" data-orig-height=\"1023\" data-orig-width=\"768\"><img src=\"https://66.media.tumblr.com/4d1f833b81a29ca79139c85e53eccfde/tumblr_prcqd7T5Iw1w1udjx_540.jpg\" data-orig-height=\"1023\" data-orig-width=\"768\"></figure></p>",
                "content": "<p><p>Nothing against the Russos, but imagine&hellip;</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4d1f833b81a29ca79139c85e53eccfde/tumblr_prcqd7T5Iw1w1udjx_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "luckysam78",
        "blog": {
            "name": "luckysam78",
            "title": "samburger",
            "description": "i write fanfiction for <a href=\"https://luckysam78.tumblr.com/tagged/marvel\">marvel</a>, <a href=\"https://luckysam78.tumblr.com/tagged/samphanfics\">dan and phil</a>, <a href=\"https://luckysam78.tumblr.com/tagged/samfb\">fantastic beasts</a>, <a href=\"https://luckysam78.tumblr.com/post/185341057961/complete-list-of-fanfiction-links\">& more!</a> ✿ <a href=\"https://luckysam78.tumblr.com/tagged/sammasterlists\">masterlists</a> ✿<a href=\"https://archiveofourown.org/users/luckysam78/pseuds/luckysam78\">ao3</a> ✿ <a href=\"https://tinsley-goldsworth.tumblr.com\">bfu sideblog</a>",
            "url": "https://luckysam78.tumblr.com/",
            "uuid": "t:vJPsqkpeFjyW2gXU3_nUYQ",
            "updated": 1561558258
        },
        "id": 184807445246,
        "post_url": "https://luckysam78.tumblr.com/post/184807445246/summary-requested-by-mystic-ender-youre",
        "slug": "summary-requested-by-mystic-ender-youre",
        "date": "2019-05-11 18:07:04 GMT",
        "timestamp": 1557598024,
        "state": "published",
        "format": "html",
        "reblog_key": "7hQ5O40A",
        "tags": [
            "marvel",
            "captain marvel",
            "carol danvers",
            "carol danvers x reader",
            "captain marvel x reader",
            "captain marvel imagine",
            "carol danvers imagine",
            "avengers",
            "mcu",
            "avengers endgame",
            "imagine",
            "lesbian",
            "gay",
            "fanfiction",
            "x reader",
            "marvel fanfiction",
            "marvel imagine"
        ],
        "short_url": "https://tmblr.co/ZaxRld2i7OTB_",
        "summary": "Summary: (requested by @mystic-ender ) you're stuck on a Ferris Wheel ride with someone you don't even know, simply because they...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 220,
        "title": null,
        "body": "<h1>stuck here together (carol danvers x reader)</h1><p>Summary: (requested by <a class=\"tumblelog\" href=\"https://tmblr.co/mVjYaBUQqzEP-IlJArO5SOA\" target=\"_blank\">@mystic-ender</a> ) you&rsquo;re stuck on a Ferris Wheel ride with someone you don&rsquo;t even know, simply because they wouldn&rsquo;t let you be alone in your booth.</p><p>Wc: 1475</p><p>a/n: this fic is written post endgame so just imagine carol with the short haircut she had in the movie!</p><figure class=\"tmblr-full\" data-orig-height=\"400\" data-orig-width=\"540\"><img src=\"https://66.media.tumblr.com/de005dbe32a56ef6e3891da69badd3a3/tumblr_inline_pr0btqfyMU1umj62y_540.gif\" data-orig-height=\"400\" data-orig-width=\"540\"/></figure><p>After everybody came back from being dusted, people tried very hard to return back to normal and in your town, people decided that living life normally meant throwing a carnival. You weren’t complaining and you promised that you were going to try to play pretend along with everybody so that you could return to your normal life, whatever your normal life was like five years ago.</p><p>Kylee, your best friend, invited you to come to the carnival with her boyfriend, Xavier and you agreed, hoping you would be reminded of the good old times you spent with Kylee. You three went on a couple rides together and the roller coasters were able to fit all of you three so splitting up the group wasn’t a problem. After going on a couple rides, Kylee wanted to ride the Ferris wheel since she wanted to watch the romantic sunset with Xavier, claiming that it would be an amazing view since the Ferris wheel overlooked a glossy lake. </p><p>Before you got in line for the Ferris wheel, you got cotton candy and Kylee watched Xavier attempt to win a stuffed animal for her by throwing darts at balloons. Afterward, you guys went to board the Ferris wheel and to your disappointment, the Ferris wheel booths could only hold two people at a time so you allowed Kylee to go with Xavier. When you boarded onto the booth, the ride operator told you that you weren’t allowed to be alone in your booth and a girl boarded the booth, sitting next to you. </p><p>At first, you felt a bit uncomfortable about being on a ride with a stranger but the girl was actually quite pretty. She wore a crocodile green jacket with jean shorts with a blue and red t-shirt. Her hair was cut in a short pixie bob cut and she radiated big lesbian energy. For some reason, she looked vaguely familiar but you couldn’t recall where you saw her before. </p><p>“Your shirt is really patriotic,” You blurted out by accident as the ride started, the booth slowly ascending. The girl turned towards you, appearing to be pleasantly surprised as she tugged at the ends of her jacket.</p><p>“Really? I didn’t notice that! I guess I’m just used to wearing these colors. I’m Carol by the way,” Carol stuck out a hand, her smile shining brighter than the light of the sun and stars combined. You shook her hand, smiling back as the panic mode in your brain turned on, reminding you that you hadn’t talked with a pretty girl in ages. The last time you flirted with somebody, you stumbled over your words and ended up ruining the moment so you silently promised yourself that you were going to stay calm during this interaction.</p><p>“Oh, I’m Y/n! Um, how’s your day going?” You attempted to start a conversation to ease the slowly eroding tension since you knew that silence with strangers always made you uncomfortable. As the ride briefly stopped to let some more people on, the booth rocked slightly, causing a piece of Carol’s hair to fall on her forehead. She casually pushed the hair back and you tried not to seem like that simple gesture stole your oxygen supply.</p><p>“I’ve been exploring the town for a bit. I haven’t been here in a while because of traveling,” Carol stared off into the distance, taking in the view of the town as she wistfully replied.</p><p>“To where? If you don’t mind me asking,” Carol turned back to face you again, her lips curling into another small smile as you asked the question. </p><p>“Let’s just say somewhere very far from here. What are you here for?” Her eyes flashed with a spark of something undetectable, possibly mischief or affection (although there is not much of a difference between those two), as she asked. </p><p>“A friend invited me to come with her and her boyfriend. I wish this was a double date but as you can probably tell, I don’t have a partner to ride romantic Ferris wheel rides with,” You joked, hoping that she enjoyed sarcastic humor and to your delight, your remark earned a giggle from her.</p><p>“Yeah, same here. My girlfriend broke up with me because I was ‘too liberal’ for her,” Carol explained, using air quotes to emphasize the absurdity of the accusation and rolled her eyes as she continued to explain. “All I did was try to advocate for equal rights but I guess she didn’t care and thought that equal rights don’t matter.” </p><p>“Ouch, that sucks big time,” You offered a sympathetic remark just as the Ferris wheel abruptly halted to a stop. Your booth was at the very top of the Ferris wheel and it was swinging back and forth due to the sudden stop. You glanced down at the ground to see the operator pushing buttons and pulling levers at the operating station, clearly panicking.</p><p>“Well, I guess this means we’re stuck here together” You commented, not particularly anxious about being stuck in a Ferris wheel with a very attractive and sweet girl. </p><p>“I don’t mind. Hey, can I have some of that cotton candy? It looks delicious,” Carol glanced at the cotton candy then looking up at you, an innocent, child-like look in her eyes. </p><p>“Sure!” You grabbed a tuft of cotton candy from the cone of cotton candy in your hand and handed it to Carol. Carol excitedly put the cotton candy in her mouth and ate it, smiling the whole time. </p><p>“Mm, this is amazing! I think this is the best cotton candy I’ve ever had in my life!” Carol commented, her smile widened as the sweetness of the cotton candy registering in her taste buds. </p><p>“It really is amazing,” You agreed, staring off into the distance and silently admiring the view. The sun was slowly sinking into the horizon and the sunset reflected into the smooth surface of the water’s lake. The view was as breathtaking as Kylee promised and you breathlessly thought aloud, “The view is really beautiful.”</p><p>“Quite honestly, I think you’re prettier than the sunset,” Carol quipped casually and then she noticed your intense blush spreading across your cheeks. Instinctively, she brought her hands up to her mouth and gasped, “Did I just say that out loud? Oh my gosh, I’m so sorry if I made you uncomfortable. I know you’re single and I respect that and I’m so sorry I said that. It totally just slipped from my mouth.” </p><p>“No, it’s okay! Don’t worry about it. And actually, I’ve been looking for ‘the one’ for a while but you know, since people dissolved and came back after five years, it’s hard to find somebody among all this chaos,” You lightheartedly replied, trying to laugh off the slightly harrowing topic you accidentally brought up. </p><p>“Oh, yeah I’m sorry. These past few years have been difficult,” Carol admitted, seeming to be a little lost in her memories of the past few years. You noticed how uncomfortable how quickly Carol’s demeanor changed at the mention of the dusting. </p><p>“No, it’s really okay. I, uh, think you’re really pretty too,” You bashfully flirted, feeling the blush returning to your face. Carol’s beautiful smile returned as she beamed at your remark.</p><p>“If we ever get off this thing, do you maybe want to ride the carousel or something together? I would love to get to know you better. You’re a really cool person.”</p><p>“Sure! But if we’re stuck up here forever, you better not finish all our food supply within the next twenty-two minutes,” You dramatically shielded your cotton candy from Carol, gaining a laugh from her. </p><p>“No worries. Even if I do finish our food supply, I can always scale the side of this giant wheel with you in my arms and safely land on the ground,” Carol retorted, a dead serious expression on her face that broke into delight when you broke out in wheezing laughter. </p><p>“Sound romantic,” You responded, grinning as Carol laughed along with you. Abruptly, the booth lurched forward as the Ferris wheel began working again. Your hand accidentally landed onto Carol’s as you almost crashed into her. You quickly apologized and you two sat silently in the booth, glancing shyly at each other as the booth reached the bottom of the Ferris wheel. </p><p>As you got off of the Ferris wheel, you saw Kylee and she quickly ran over to you, “You’re okay! I was worried about you! That was really scary. Xavier and I are going to get some hot dogs to calm down before going on any other rides. Want to come?”</p><p>You glanced over at Carol, who was expectantly waiting for you by the exit of the Ferris wheel and answered, “Actually, I think I’ll pass. I promised somebody a carousel ride.” </p><p>~</p><p>please feel free to send requests! check out my marvel page on my blog for more marvel fics!</p>",
        "reblog": {
            "comment": "<p><h1>stuck here together (carol danvers x reader)</h1><p>Summary: (requested by <a class=\"tumblelog\" href=\"https://tmblr.co/mVjYaBUQqzEP-IlJArO5SOA\" target=\"_blank\">@mystic-ender</a> ) you’re stuck on a Ferris Wheel ride with someone you don’t even know, simply because they wouldn’t let you be alone in your booth.</p><p>Wc: 1475</p><p>a/n: this fic is written post endgame so just imagine carol with the short haircut she had in the movie!</p><figure class=\"tmblr-full\" data-orig-height=\"400\" data-orig-width=\"540\"><img src=\"https://66.media.tumblr.com/de005dbe32a56ef6e3891da69badd3a3/tumblr_inline_pr0btqfyMU1umj62y_540.gif\" data-orig-height=\"400\" data-orig-width=\"540\"></figure><p>After everybody came back from being dusted, people tried very hard to return back to normal and in your town, people decided that living life normally meant throwing a carnival. You weren’t complaining and you promised that you were going to try to play pretend along with everybody so that you could return to your normal life, whatever your normal life was like five years ago.</p><p>Kylee, your best friend, invited you to come to the carnival with her boyfriend, Xavier and you agreed, hoping you would be reminded of the good old times you spent with Kylee. You three went on a couple rides together and the roller coasters were able to fit all of you three so splitting up the group wasn’t a problem. After going on a couple rides, Kylee wanted to ride the Ferris wheel since she wanted to watch the romantic sunset with Xavier, claiming that it would be an amazing view since the Ferris wheel overlooked a glossy lake. </p><p>Before you got in line for the Ferris wheel, you got cotton candy and Kylee watched Xavier attempt to win a stuffed animal for her by throwing darts at balloons. Afterward, you guys went to board the Ferris wheel and to your disappointment, the Ferris wheel booths could only hold two people at a time so you allowed Kylee to go with Xavier. When you boarded onto the booth, the ride operator told you that you weren’t allowed to be alone in your booth and a girl boarded the booth, sitting next to you. </p><p>At first, you felt a bit uncomfortable about being on a ride with a stranger but the girl was actually quite pretty. She wore a crocodile green jacket with jean shorts with a blue and red t-shirt. Her hair was cut in a short pixie bob cut and she radiated big lesbian energy. For some reason, she looked vaguely familiar but you couldn’t recall where you saw her before. </p><p>“Your shirt is really patriotic,” You blurted out by accident as the ride started, the booth slowly ascending. The girl turned towards you, appearing to be pleasantly surprised as she tugged at the ends of her jacket.</p><p>“Really? I didn’t notice that! I guess I’m just used to wearing these colors. I’m Carol by the way,” Carol stuck out a hand, her smile shining brighter than the light of the sun and stars combined. You shook her hand, smiling back as the panic mode in your brain turned on, reminding you that you hadn’t talked with a pretty girl in ages. The last time you flirted with somebody, you stumbled over your words and ended up ruining the moment so you silently promised yourself that you were going to stay calm during this interaction.</p><p>“Oh, I’m Y/n! Um, how’s your day going?” You attempted to start a conversation to ease the slowly eroding tension since you knew that silence with strangers always made you uncomfortable. As the ride briefly stopped to let some more people on, the booth rocked slightly, causing a piece of Carol’s hair to fall on her forehead. She casually pushed the hair back and you tried not to seem like that simple gesture stole your oxygen supply.</p><p>“I’ve been exploring the town for a bit. I haven’t been here in a while because of traveling,” Carol stared off into the distance, taking in the view of the town as she wistfully replied.</p><p>“To where? If you don’t mind me asking,” Carol turned back to face you again, her lips curling into another small smile as you asked the question. </p><p>“Let’s just say somewhere very far from here. What are you here for?” Her eyes flashed with a spark of something undetectable, possibly mischief or affection (although there is not much of a difference between those two), as she asked. </p><p>“A friend invited me to come with her and her boyfriend. I wish this was a double date but as you can probably tell, I don’t have a partner to ride romantic Ferris wheel rides with,” You joked, hoping that she enjoyed sarcastic humor and to your delight, your remark earned a giggle from her.</p><p>“Yeah, same here. My girlfriend broke up with me because I was ‘too liberal’ for her,” Carol explained, using air quotes to emphasize the absurdity of the accusation and rolled her eyes as she continued to explain. “All I did was try to advocate for equal rights but I guess she didn’t care and thought that equal rights don’t matter.” </p><p>“Ouch, that sucks big time,” You offered a sympathetic remark just as the Ferris wheel abruptly halted to a stop. Your booth was at the very top of the Ferris wheel and it was swinging back and forth due to the sudden stop. You glanced down at the ground to see the operator pushing buttons and pulling levers at the operating station, clearly panicking.</p><p>“Well, I guess this means we’re stuck here together” You commented, not particularly anxious about being stuck in a Ferris wheel with a very attractive and sweet girl. </p><p>“I don’t mind. Hey, can I have some of that cotton candy? It looks delicious,” Carol glanced at the cotton candy then looking up at you, an innocent, child-like look in her eyes. </p><p>“Sure!” You grabbed a tuft of cotton candy from the cone of cotton candy in your hand and handed it to Carol. Carol excitedly put the cotton candy in her mouth and ate it, smiling the whole time. </p><p>“Mm, this is amazing! I think this is the best cotton candy I’ve ever had in my life!” Carol commented, her smile widened as the sweetness of the cotton candy registering in her taste buds. </p><p>“It really is amazing,” You agreed, staring off into the distance and silently admiring the view. The sun was slowly sinking into the horizon and the sunset reflected into the smooth surface of the water’s lake. The view was as breathtaking as Kylee promised and you breathlessly thought aloud, “The view is really beautiful.”</p><p>“Quite honestly, I think you’re prettier than the sunset,” Carol quipped casually and then she noticed your intense blush spreading across your cheeks. Instinctively, she brought her hands up to her mouth and gasped, “Did I just say that out loud? Oh my gosh, I’m so sorry if I made you uncomfortable. I know you’re single and I respect that and I’m so sorry I said that. It totally just slipped from my mouth.” </p><p>“No, it’s okay! Don’t worry about it. And actually, I’ve been looking for ‘the one’ for a while but you know, since people dissolved and came back after five years, it’s hard to find somebody among all this chaos,” You lightheartedly replied, trying to laugh off the slightly harrowing topic you accidentally brought up. </p><p>“Oh, yeah I’m sorry. These past few years have been difficult,” Carol admitted, seeming to be a little lost in her memories of the past few years. You noticed how uncomfortable how quickly Carol’s demeanor changed at the mention of the dusting. </p><p>“No, it’s really okay. I, uh, think you’re really pretty too,” You bashfully flirted, feeling the blush returning to your face. Carol’s beautiful smile returned as she beamed at your remark.</p><p>“If we ever get off this thing, do you maybe want to ride the carousel or something together? I would love to get to know you better. You’re a really cool person.”</p><p>“Sure! But if we’re stuck up here forever, you better not finish all our food supply within the next twenty-two minutes,” You dramatically shielded your cotton candy from Carol, gaining a laugh from her. </p><p>“No worries. Even if I do finish our food supply, I can always scale the side of this giant wheel with you in my arms and safely land on the ground,” Carol retorted, a dead serious expression on her face that broke into delight when you broke out in wheezing laughter. </p><p>“Sound romantic,” You responded, grinning as Carol laughed along with you. Abruptly, the booth lurched forward as the Ferris wheel began working again. Your hand accidentally landed onto Carol’s as you almost crashed into her. You quickly apologized and you two sat silently in the booth, glancing shyly at each other as the booth reached the bottom of the Ferris wheel. </p><p>As you got off of the Ferris wheel, you saw Kylee and she quickly ran over to you, “You’re okay! I was worried about you! That was really scary. Xavier and I are going to get some hot dogs to calm down before going on any other rides. Want to come?”</p><p>You glanced over at Carol, who was expectantly waiting for you by the exit of the Ferris wheel and answered, “Actually, I think I’ll pass. I promised somebody a carousel ride.” </p><p>~</p><p>please feel free to send requests! check out my marvel page on my blog for more marvel fics!</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "luckysam78",
                    "active": true,
                    "theme": {
                        "header_full_width": 2100,
                        "header_full_height": 880,
                        "header_focus_width": 1565,
                        "header_focus_height": 880,
                        "avatar_shape": "circle",
                        "background_color": "#97c5e0",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1832,880,267",
                        "header_image": "https://static.tumblr.com/630dd74016678de9bfdbe8a4a08aa717/xupxymm/6NTplpkub/tumblr_static_2v735ag9hpkwook8swckgosw8.jpg",
                        "header_image_focused": "https://static.tumblr.com/4e5a8a3938609ddf714a01eb20f65eb7/xupxymm/rV3plpkue/tumblr_static_tumblr_static_2v735ag9hpkwook8swckgosw8_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/630dd74016678de9bfdbe8a4a08aa717/xupxymm/6NTplpkub/tumblr_static_2v735ag9hpkwook8swckgosw8_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#427ea3",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#575555",
                        "title_font": "Avalon",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184807445246"
                },
                "content_raw": "<p><h1>stuck here together (carol danvers x reader)</h1><p>Summary: (requested by <a class=\"tumblelog\" href=\"https://tmblr.co/mVjYaBUQqzEP-IlJArO5SOA\" target=\"_blank\">@mystic-ender</a> ) you’re stuck on a Ferris Wheel ride with someone you don’t even know, simply because they wouldn’t let you be alone in your booth.</p><p>Wc: 1475</p><p>a/n: this fic is written post endgame so just imagine carol with the short haircut she had in the movie!</p><figure class=\"tmblr-full\" data-orig-height=\"400\" data-orig-width=\"540\"><img src=\"https://66.media.tumblr.com/de005dbe32a56ef6e3891da69badd3a3/tumblr_inline_pr0btqfyMU1umj62y_540.gif\" data-orig-height=\"400\" data-orig-width=\"540\"></figure><p>After everybody came back from being dusted, people tried very hard to return back to normal and in your town, people decided that living life normally meant throwing a carnival. You weren’t complaining and you promised that you were going to try to play pretend along with everybody so that you could return to your normal life, whatever your normal life was like five years ago.</p><p>Kylee, your best friend, invited you to come to the carnival with her boyfriend, Xavier and you agreed, hoping you would be reminded of the good old times you spent with Kylee. You three went on a couple rides together and the roller coasters were able to fit all of you three so splitting up the group wasn’t a problem. After going on a couple rides, Kylee wanted to ride the Ferris wheel since she wanted to watch the romantic sunset with Xavier, claiming that it would be an amazing view since the Ferris wheel overlooked a glossy lake. </p><p>Before you got in line for the Ferris wheel, you got cotton candy and Kylee watched Xavier attempt to win a stuffed animal for her by throwing darts at balloons. Afterward, you guys went to board the Ferris wheel and to your disappointment, the Ferris wheel booths could only hold two people at a time so you allowed Kylee to go with Xavier. When you boarded onto the booth, the ride operator told you that you weren’t allowed to be alone in your booth and a girl boarded the booth, sitting next to you. </p><p>At first, you felt a bit uncomfortable about being on a ride with a stranger but the girl was actually quite pretty. She wore a crocodile green jacket with jean shorts with a blue and red t-shirt. Her hair was cut in a short pixie bob cut and she radiated big lesbian energy. For some reason, she looked vaguely familiar but you couldn’t recall where you saw her before. </p><p>“Your shirt is really patriotic,” You blurted out by accident as the ride started, the booth slowly ascending. The girl turned towards you, appearing to be pleasantly surprised as she tugged at the ends of her jacket.</p><p>“Really? I didn’t notice that! I guess I’m just used to wearing these colors. I’m Carol by the way,” Carol stuck out a hand, her smile shining brighter than the light of the sun and stars combined. You shook her hand, smiling back as the panic mode in your brain turned on, reminding you that you hadn’t talked with a pretty girl in ages. The last time you flirted with somebody, you stumbled over your words and ended up ruining the moment so you silently promised yourself that you were going to stay calm during this interaction.</p><p>“Oh, I’m Y/n! Um, how’s your day going?” You attempted to start a conversation to ease the slowly eroding tension since you knew that silence with strangers always made you uncomfortable. As the ride briefly stopped to let some more people on, the booth rocked slightly, causing a piece of Carol’s hair to fall on her forehead. She casually pushed the hair back and you tried not to seem like that simple gesture stole your oxygen supply.</p><p>“I’ve been exploring the town for a bit. I haven’t been here in a while because of traveling,” Carol stared off into the distance, taking in the view of the town as she wistfully replied.</p><p>“To where? If you don’t mind me asking,” Carol turned back to face you again, her lips curling into another small smile as you asked the question. </p><p>“Let’s just say somewhere very far from here. What are you here for?” Her eyes flashed with a spark of something undetectable, possibly mischief or affection (although there is not much of a difference between those two), as she asked. </p><p>“A friend invited me to come with her and her boyfriend. I wish this was a double date but as you can probably tell, I don’t have a partner to ride romantic Ferris wheel rides with,” You joked, hoping that she enjoyed sarcastic humor and to your delight, your remark earned a giggle from her.</p><p>“Yeah, same here. My girlfriend broke up with me because I was ‘too liberal’ for her,” Carol explained, using air quotes to emphasize the absurdity of the accusation and rolled her eyes as she continued to explain. “All I did was try to advocate for equal rights but I guess she didn’t care and thought that equal rights don’t matter.” </p><p>“Ouch, that sucks big time,” You offered a sympathetic remark just as the Ferris wheel abruptly halted to a stop. Your booth was at the very top of the Ferris wheel and it was swinging back and forth due to the sudden stop. You glanced down at the ground to see the operator pushing buttons and pulling levers at the operating station, clearly panicking.</p><p>“Well, I guess this means we’re stuck here together” You commented, not particularly anxious about being stuck in a Ferris wheel with a very attractive and sweet girl. </p><p>“I don’t mind. Hey, can I have some of that cotton candy? It looks delicious,” Carol glanced at the cotton candy then looking up at you, an innocent, child-like look in her eyes. </p><p>“Sure!” You grabbed a tuft of cotton candy from the cone of cotton candy in your hand and handed it to Carol. Carol excitedly put the cotton candy in her mouth and ate it, smiling the whole time. </p><p>“Mm, this is amazing! I think this is the best cotton candy I’ve ever had in my life!” Carol commented, her smile widened as the sweetness of the cotton candy registering in her taste buds. </p><p>“It really is amazing,” You agreed, staring off into the distance and silently admiring the view. The sun was slowly sinking into the horizon and the sunset reflected into the smooth surface of the water’s lake. The view was as breathtaking as Kylee promised and you breathlessly thought aloud, “The view is really beautiful.”</p><p>“Quite honestly, I think you’re prettier than the sunset,” Carol quipped casually and then she noticed your intense blush spreading across your cheeks. Instinctively, she brought her hands up to her mouth and gasped, “Did I just say that out loud? Oh my gosh, I’m so sorry if I made you uncomfortable. I know you’re single and I respect that and I’m so sorry I said that. It totally just slipped from my mouth.” </p><p>“No, it’s okay! Don’t worry about it. And actually, I’ve been looking for ‘the one’ for a while but you know, since people dissolved and came back after five years, it’s hard to find somebody among all this chaos,” You lightheartedly replied, trying to laugh off the slightly harrowing topic you accidentally brought up. </p><p>“Oh, yeah I’m sorry. These past few years have been difficult,” Carol admitted, seeming to be a little lost in her memories of the past few years. You noticed how uncomfortable how quickly Carol’s demeanor changed at the mention of the dusting. </p><p>“No, it’s really okay. I, uh, think you’re really pretty too,” You bashfully flirted, feeling the blush returning to your face. Carol’s beautiful smile returned as she beamed at your remark.</p><p>“If we ever get off this thing, do you maybe want to ride the carousel or something together? I would love to get to know you better. You’re a really cool person.”</p><p>“Sure! But if we’re stuck up here forever, you better not finish all our food supply within the next twenty-two minutes,” You dramatically shielded your cotton candy from Carol, gaining a laugh from her. </p><p>“No worries. Even if I do finish our food supply, I can always scale the side of this giant wheel with you in my arms and safely land on the ground,” Carol retorted, a dead serious expression on her face that broke into delight when you broke out in wheezing laughter. </p><p>“Sound romantic,” You responded, grinning as Carol laughed along with you. Abruptly, the booth lurched forward as the Ferris wheel began working again. Your hand accidentally landed onto Carol’s as you almost crashed into her. You quickly apologized and you two sat silently in the booth, glancing shyly at each other as the booth reached the bottom of the Ferris wheel. </p><p>As you got off of the Ferris wheel, you saw Kylee and she quickly ran over to you, “You’re okay! I was worried about you! That was really scary. Xavier and I are going to get some hot dogs to calm down before going on any other rides. Want to come?”</p><p>You glanced over at Carol, who was expectantly waiting for you by the exit of the Ferris wheel and answered, “Actually, I think I’ll pass. I promised somebody a carousel ride.” </p><p>~</p><p>please feel free to send requests! check out my marvel page on my blog for more marvel fics!</p></p>",
                "content": "<p><h1>stuck here together (carol danvers x reader)</h1><p>Summary: (requested by <a href=\"https://tmblr.co/mVjYaBUQqzEP-IlJArO5SOA\" target=\"_blank\">@mystic-ender</a> ) you&rsquo;re stuck on a Ferris Wheel ride with someone you don&rsquo;t even know, simply because they wouldn&rsquo;t let you be alone in your booth.</p><p>Wc: 1475</p><p>a/n: this fic is written post endgame so just imagine carol with the short haircut she had in the movie!</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/de005dbe32a56ef6e3891da69badd3a3/tumblr_inline_pr0btqfyMU1umj62y_540.gif\" class=\"\"/></figure><p>After everybody came back from being dusted, people tried very hard to return back to normal and in your town, people decided that living life normally meant throwing a carnival. You weren&rsquo;t complaining and you promised that you were going to try to play pretend along with everybody so that you could return to your normal life, whatever your normal life was like five years ago.</p><p>Kylee, your best friend, invited you to come to the carnival with her boyfriend, Xavier and you agreed, hoping you would be reminded of the good old times you spent with Kylee. You three went on a couple rides together and the roller coasters were able to fit all of you three so splitting up the group wasn&rsquo;t a problem. After going on a couple rides, Kylee wanted to ride the Ferris wheel since she wanted to watch the romantic sunset with Xavier, claiming that it would be an amazing view since the Ferris wheel overlooked a glossy lake. </p><p>Before you got in line for the Ferris wheel, you got cotton candy and Kylee watched Xavier attempt to win a stuffed animal for her by throwing darts at balloons. Afterward, you guys went to board the Ferris wheel and to your disappointment, the Ferris wheel booths could only hold two people at a time so you allowed Kylee to go with Xavier. When you boarded onto the booth, the ride operator told you that you weren&rsquo;t allowed to be alone in your booth and a girl boarded the booth, sitting next to you. </p><p>At first, you felt a bit uncomfortable about being on a ride with a stranger but the girl was actually quite pretty. She wore a crocodile green jacket with jean shorts with a blue and red t-shirt. Her hair was cut in a short pixie bob cut and she radiated big lesbian energy. For some reason, she looked vaguely familiar but you couldn&rsquo;t recall where you saw her before. </p><p>&ldquo;Your shirt is really patriotic,&rdquo; You blurted out by accident as the ride started, the booth slowly ascending. The girl turned towards you, appearing to be pleasantly surprised as she tugged at the ends of her jacket.</p><p>&ldquo;Really? I didn&rsquo;t notice that! I guess I&rsquo;m just used to wearing these colors. I&rsquo;m Carol by the way,&rdquo; Carol stuck out a hand, her smile shining brighter than the light of the sun and stars combined. You shook her hand, smiling back as the panic mode in your brain turned on, reminding you that you hadn&rsquo;t talked with a pretty girl in ages. The last time you flirted with somebody, you stumbled over your words and ended up ruining the moment so you silently promised yourself that you were going to stay calm during this interaction.</p><p>&ldquo;Oh, I&rsquo;m Y/n! Um, how&rsquo;s your day going?&rdquo; You attempted to start a conversation to ease the slowly eroding tension since you knew that silence with strangers always made you uncomfortable. As the ride briefly stopped to let some more people on, the booth rocked slightly, causing a piece of Carol&rsquo;s hair to fall on her forehead. She casually pushed the hair back and you tried not to seem like that simple gesture stole your oxygen supply.</p><p>&ldquo;I&rsquo;ve been exploring the town for a bit. I haven&rsquo;t been here in a while because of traveling,&rdquo; Carol stared off into the distance, taking in the view of the town as she wistfully replied.</p><p>&ldquo;To where? If you don&rsquo;t mind me asking,&rdquo; Carol turned back to face you again, her lips curling into another small smile as you asked the question. </p><p>&ldquo;Let&rsquo;s just say somewhere very far from here. What are you here for?&rdquo; Her eyes flashed with a spark of something undetectable, possibly mischief or affection (although there is not much of a difference between those two), as she asked. </p><p>&ldquo;A friend invited me to come with her and her boyfriend. I wish this was a double date but as you can probably tell, I don&rsquo;t have a partner to ride romantic Ferris wheel rides with,&rdquo; You joked, hoping that she enjoyed sarcastic humor and to your delight, your remark earned a giggle from her.</p><p>&ldquo;Yeah, same here. My girlfriend broke up with me because I was &lsquo;too liberal&rsquo; for her,&rdquo; Carol explained, using air quotes to emphasize the absurdity of the accusation and rolled her eyes as she continued to explain. &ldquo;All I did was try to advocate for equal rights but I guess she didn&rsquo;t care and thought that equal rights don&rsquo;t matter.&rdquo; </p><p>&ldquo;Ouch, that sucks big time,&rdquo; You offered a sympathetic remark just as the Ferris wheel abruptly halted to a stop. Your booth was at the very top of the Ferris wheel and it was swinging back and forth due to the sudden stop. You glanced down at the ground to see the operator pushing buttons and pulling levers at the operating station, clearly panicking.</p><p>&ldquo;Well, I guess this means we&rsquo;re stuck here together&rdquo; You commented, not particularly anxious about being stuck in a Ferris wheel with a very attractive and sweet girl. </p><p>&ldquo;I don&rsquo;t mind. Hey, can I have some of that cotton candy? It looks delicious,&rdquo; Carol glanced at the cotton candy then looking up at you, an innocent, child-like look in her eyes. </p><p>&ldquo;Sure!&rdquo; You grabbed a tuft of cotton candy from the cone of cotton candy in your hand and handed it to Carol. Carol excitedly put the cotton candy in her mouth and ate it, smiling the whole time. </p><p>&ldquo;Mm, this is amazing! I think this is the best cotton candy I&rsquo;ve ever had in my life!&rdquo; Carol commented, her smile widened as the sweetness of the cotton candy registering in her taste buds. </p><p>&ldquo;It really is amazing,&rdquo; You agreed, staring off into the distance and silently admiring the view. The sun was slowly sinking into the horizon and the sunset reflected into the smooth surface of the water&rsquo;s lake. The view was as breathtaking as Kylee promised and you breathlessly thought aloud, &ldquo;The view is really beautiful.&rdquo;</p><p>&ldquo;Quite honestly, I think you&rsquo;re prettier than the sunset,&rdquo; Carol quipped casually and then she noticed your intense blush spreading across your cheeks. Instinctively, she brought her hands up to her mouth and gasped, &ldquo;Did I just say that out loud? Oh my gosh, I&rsquo;m so sorry if I made you uncomfortable. I know you&rsquo;re single and I respect that and I&rsquo;m so sorry I said that. It totally just slipped from my mouth.&rdquo; </p><p>&ldquo;No, it&rsquo;s okay! Don&rsquo;t worry about it. And actually, I&rsquo;ve been looking for &lsquo;the one&rsquo; for a while but you know, since people dissolved and came back after five years, it&rsquo;s hard to find somebody among all this chaos,&rdquo; You lightheartedly replied, trying to laugh off the slightly harrowing topic you accidentally brought up. </p><p>&ldquo;Oh, yeah I&rsquo;m sorry. These past few years have been difficult,&rdquo; Carol admitted, seeming to be a little lost in her memories of the past few years. You noticed how uncomfortable how quickly Carol&rsquo;s demeanor changed at the mention of the dusting. </p><p>&ldquo;No, it&rsquo;s really okay. I, uh, think you&rsquo;re really pretty too,&rdquo; You bashfully flirted, feeling the blush returning to your face. Carol&rsquo;s beautiful smile returned as she beamed at your remark.</p><p>&ldquo;If we ever get off this thing, do you maybe want to ride the carousel or something together? I would love to get to know you better. You&rsquo;re a really cool person.&rdquo;</p><p>&ldquo;Sure! But if we&rsquo;re stuck up here forever, you better not finish all our food supply within the next twenty-two minutes,&rdquo; You dramatically shielded your cotton candy from Carol, gaining a laugh from her. </p><p>&ldquo;No worries. Even if I do finish our food supply, I can always scale the side of this giant wheel with you in my arms and safely land on the ground,&rdquo; Carol retorted, a dead serious expression on her face that broke into delight when you broke out in wheezing laughter. </p><p>&ldquo;Sound romantic,&rdquo; You responded, grinning as Carol laughed along with you. Abruptly, the booth lurched forward as the Ferris wheel began working again. Your hand accidentally landed onto Carol&rsquo;s as you almost crashed into her. You quickly apologized and you two sat silently in the booth, glancing shyly at each other as the booth reached the bottom of the Ferris wheel. </p><p>As you got off of the Ferris wheel, you saw Kylee and she quickly ran over to you, &ldquo;You&rsquo;re okay! I was worried about you! That was really scary. Xavier and I are going to get some hot dogs to calm down before going on any other rides. Want to come?&rdquo;</p><p>You glanced over at Carol, who was expectantly waiting for you by the exit of the Ferris wheel and answered, &ldquo;Actually, I think I&rsquo;ll pass. I promised somebody a carousel ride.&rdquo; </p><p>~</p><p>please feel free to send requests! check out my marvel page on my blog for more marvel fics!</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "sword0fstorms",
        "blog": {
            "name": "sword0fstorms",
            "title": "hope surpassing reason",
            "description": " FFXIV sideblog: @senah3dot0",
            "url": "https://sword0fstorms.tumblr.com/",
            "uuid": "t:seGXteWnM0XNdbi_obIxGw",
            "updated": 1561689466
        },
        "id": 184807407921,
        "post_url": "https://sword0fstorms.tumblr.com/post/184807407921/what-were-all-hoping-for-marvel-to-be-like",
        "slug": "what-were-all-hoping-for-marvel-to-be-like",
        "date": "2019-05-11 18:05:07 GMT",
        "timestamp": 1557597907,
        "state": "published",
        "format": "html",
        "reblog_key": "GzdIvtt2",
        "tags": [
            "mcu",
            "it sounds like something that would happen",
            "captain marvel"
        ],
        "short_url": "https://tmblr.co/ZGBCxw2i7OK4n",
        "summary": "What we're all hoping for: Marvel to be like \"Carol Danvers is the first openly gay MCU character!\"\nWhat will probably happen...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 100,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>What we&rsquo;re all hoping for:</b> Marvel to be like &ldquo;Carol Danvers is the first openly gay MCU character!&rdquo;</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>What will probably happen instead:</b> &ldquo;Remember how Adam Warlock was teased in a end credits scene in Guardians of the Galaxy 2? He&rsquo;s gay!&rdquo;</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>What we’re all hoping for:</b> Marvel to be like “Carol Danvers is the first openly gay MCU character!”</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>What will probably happen instead:</b> “Remember how Adam Warlock was teased in a end credits scene in Guardians of the Galaxy 2? He’s gay!”</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "sword0fstorms",
                    "active": true,
                    "theme": {
                        "header_full_width": 1200,
                        "header_full_height": 628,
                        "header_focus_width": 1117,
                        "header_focus_height": 628,
                        "avatar_shape": "circle",
                        "background_color": "#CCCCCC",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1158,628,41",
                        "header_image": "https://static.tumblr.com/c56c2f1a8c8318ed33a136271d1e070f/ufu6cn7/3rOpr037p/tumblr_static_4ceyeen8wn6sco4gckcc0scwg.jpg",
                        "header_image_focused": "https://static.tumblr.com/8e617ffdd7b933e6a7711f746f484673/ufu6cn7/aMlpr037r/tumblr_static_tumblr_static_4ceyeen8wn6sco4gckcc0scwg_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/c56c2f1a8c8318ed33a136271d1e070f/ufu6cn7/3rOpr037p/tumblr_static_4ceyeen8wn6sco4gckcc0scwg_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#644b74",
                        "title_font": "Streetscript",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184807407921"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>What we’re all hoping for:</b> Marvel to be like “Carol Danvers is the first openly gay MCU character!”</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>What will probably happen instead:</b> “Remember how Adam Warlock was teased in a end credits scene in Guardians of the Galaxy 2? He’s gay!”</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>What we&rsquo;re all hoping for:</b> Marvel to be like &ldquo;Carol Danvers is the first openly gay MCU character!&rdquo;</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>What will probably happen instead:</b> &ldquo;Remember how Adam Warlock was teased in a end credits scene in Guardians of the Galaxy 2? He&rsquo;s gay!&rdquo;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "firyfox",
        "blog": {
            "name": "firyfox",
            "title": "FiryFox",
            "description": "<p>She / her : I mainly post Queens of the Stone Age , Them Crooked Vultures , Archer , bioshock , and spn . I reblog a lot of random posts as well</p>",
            "url": "https://firyfox.tumblr.com/",
            "uuid": "t:8M6Zb7-Q6qAcDNAkDNV0Fg",
            "updated": 1561750746
        },
        "id": 184807359105,
        "post_url": "https://firyfox.tumblr.com/post/184807359105",
        "slug": "",
        "date": "2019-05-11 18:02:07 GMT",
        "timestamp": 1557597727,
        "state": "published",
        "format": "html",
        "reblog_key": "3lvfirAx",
        "tags": [
            "avengers endgame",
            "avengers",
            "the avengers",
            "captain marvel",
            "brie larson",
            "carol danvers",
            "avengers : endgame",
            "original post"
        ],
        "short_url": "https://tmblr.co/ZAaeff2i7O8A1",
        "summary": "☕️☕️☕️",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 4500,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"554\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/f8d1b64528b41358aef03587bb57fc54/tumblr_prcq3iuPM91uxpooy_540.jpg\" data-orig-height=\"554\" data-orig-width=\"750\"/></figure><p>☕️☕️☕️</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"554\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/f8d1b64528b41358aef03587bb57fc54/tumblr_prcq3iuPM91uxpooy_540.jpg\" data-orig-height=\"554\" data-orig-width=\"750\"></figure><p>☕️☕️☕️</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "firyfox",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 1280,
                        "header_focus_width": 1280,
                        "header_focus_height": 720,
                        "avatar_shape": "square",
                        "background_color": "#000015",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "130,1280,850,0",
                        "header_image": "https://static.tumblr.com/3ee3ccf84669539e6b908b94ec4f40c2/vev7gzu/Pk4ps5f44/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/65639cf49c8cab7f5206a5940835cef5/vev7gzu/pVips5f4c/tumblr_static_tumblr_static__focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/3ee3ccf84669539e6b908b94ec4f40c2/vev7gzu/Pk4ps5f44/tumblr_static__2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#F40025",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184807359105"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"554\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/f8d1b64528b41358aef03587bb57fc54/tumblr_prcq3iuPM91uxpooy_540.jpg\" data-orig-height=\"554\" data-orig-width=\"750\"></figure><p>☕️☕️☕️</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/f8d1b64528b41358aef03587bb57fc54/tumblr_prcq3iuPM91uxpooy_540.jpg\" class=\"\"/></figure><p>&#9749;&#65039;&#9749;&#65039;&#9749;&#65039;</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "solopadawan",
        "blog": {
            "name": "solopadawan",
            "title": "Anthony Janthony Crowley",
            "description": "XVII | Lesbian | Aries | UK | Manchester |",
            "url": "https://solopadawan.tumblr.com/",
            "uuid": "t:wwQmYxXXyHMg2jkGYyCzWg",
            "updated": 1561749874
        },
        "id": 184807302930,
        "post_url": "https://solopadawan.tumblr.com/post/184807302930/brie-larson-i-will-100-take-you-to-see",
        "slug": "brie-larson-i-will-100-take-you-to-see",
        "date": "2019-05-11 17:59:10 GMT",
        "timestamp": 1557597550,
        "state": "published",
        "format": "html",
        "reblog_key": "UErGaluZ",
        "tags": [
            "brie larson",
            "captain marvel",
            "carol danvers",
            "detective pikachu",
            "redgs",
            "solopadawan",
            "marvel",
            "mcu"
        ],
        "short_url": "https://tmblr.co/ZzI45e2i7NwSI",
        "summary": "@ Brie Larson I will 100% take you to see Detective Pikachu, hmu",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 67,
        "title": null,
        "body": "<p>@ Brie Larson I will 100% take you to see Detective Pikachu, hmu</p>",
        "reblog": {
            "comment": "<p>@ Brie Larson I will 100% take you to see Detective Pikachu, hmu</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "solopadawan",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 710,
                        "header_focus_width": 500,
                        "header_focus_height": 281,
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "94,500,375,0",
                        "header_image": "https://static.tumblr.com/24ab5080b45ef62e165b783820c83d57/v0lljhb/z73ptpx3g/tumblr_static_-2094807728-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/df8e81bae49d33bee7c5219d6c6e2ef1/v0lljhb/ZYdptpx3h/tumblr_static_tumblr_static_-2094807728-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/24ab5080b45ef62e165b783820c83d57/v0lljhb/z73ptpx3g/tumblr_static_-2094807728-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#808080",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#004E6D",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184807302930"
                },
                "content_raw": "<p>@ Brie Larson I will 100% take you to see Detective Pikachu, hmu</p>",
                "content": "<p>@ Brie Larson I will 100% take you to see Detective Pikachu, hmu</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "nikkeester",
        "blog": {
            "name": "nikkeester",
            "title": "Kiki",
            "description": "<p>Heyy, I’m Nikki but some people call me Kiki and I kinda like that. This blog is kinda random and all over the place and I  blame that on the fact that im just a messy teenager</p><p>also thats my cat in the profile picture, shes cute(:</p>",
            "url": "https://nikkeester.tumblr.com/",
            "uuid": "t:hv_nV_Y80wgpf-DV45L2eA",
            "updated": 1559423259
        },
        "id": 184807184140,
        "post_url": "https://nikkeester.tumblr.com/post/184807184140",
        "slug": "",
        "date": "2019-05-11 17:52:10 GMT",
        "timestamp": 1557597130,
        "state": "published",
        "format": "html",
        "reblog_key": "LLnnoqAO",
        "tags": [
            "marvels endgame",
            "endgame spoilers",
            "endgame",
            "tony stark",
            "captain marvel",
            "superhero"
        ],
        "short_url": "https://tmblr.co/Zd33rf2i7NTSC",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 4,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"254\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/9def36f625413474e2841400ffa64f3d/tumblr_prcpmyGq321uvj4ye_540.jpg\" data-orig-height=\"254\" data-orig-width=\"750\"/></figure>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"254\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/9def36f625413474e2841400ffa64f3d/tumblr_prcpmyGq321uvj4ye_540.jpg\" data-orig-height=\"254\" data-orig-width=\"750\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "nikkeester",
                    "active": true,
                    "theme": {
                        "header_full_width": 425,
                        "header_full_height": 1280,
                        "header_focus_width": 425,
                        "header_focus_height": 239,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "957,425,1196,0",
                        "header_image": "https://static.tumblr.com/de01c7c14507bb276c9d424af563dcce/avu6nqv/oZWpay9c8/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/de01c7c14507bb276c9d424af563dcce/avu6nqv/2wmpay9cb/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/de01c7c14507bb276c9d424af563dcce/avu6nqv/oZWpay9c8/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#102029",
                        "title_font": "Arquitecta",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184807184140"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"254\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/9def36f625413474e2841400ffa64f3d/tumblr_prcpmyGq321uvj4ye_540.jpg\" data-orig-height=\"254\" data-orig-width=\"750\"></figure></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/9def36f625413474e2841400ffa64f3d/tumblr_prcpmyGq321uvj4ye_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "scavengingforwords",
        "blog": {
            "name": "scavengingforwords",
            "title": "Fandom!\n(largely Marvel Fandom)",
            "description": "<p>I'm a nerd who gets sucked into tons of fandoms, here is where I will gather my fandom love. Let’s be honest though, at this point this is like 99.99% Marvel and of that percentage 99% of it is Avengers Academy related. </p>",
            "url": "https://scavengingforwords.tumblr.com/",
            "uuid": "t:Uc-jMT_ZG8aicv_SxianqA",
            "updated": 1561279715
        },
        "id": 184807038784,
        "post_url": "https://scavengingforwords.tumblr.com/post/184807038784",
        "slug": "",
        "date": "2019-05-11 17:43:11 GMT",
        "timestamp": 1557596591,
        "state": "published",
        "format": "html",
        "reblog_key": "x5po8MWr",
        "tags": [
            "avac",
            "avengers academy",
            "marvel",
            "captain marvel",
            "carol danvers",
            "mar vell"
        ],
        "short_url": "https://tmblr.co/ZHp1Oj2i7Mvz0",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 3,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/2c9da21394eab046c7b29c08589105d1/tumblr_pr6t9iQhpf1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/fec837aa8c877caa839a3f249b0bbc9e/tumblr_pr6t9j2a9R1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/c9f65c4faf3f8ea8dedd99e653daba93/tumblr_pr6t9k40oi1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/29bdb28e54bae7b474737e90a415e663/tumblr_pr6t9l7Pb11spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"/></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/a5a5310c0275c9d976c54b6a686f40d9/tumblr_pr6t9m4doj1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/87acc0e1658c77f7b4a3f312ebbd7a61/tumblr_pr6t9oWdEi1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"/></figure></div>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/2c9da21394eab046c7b29c08589105d1/tumblr_pr6t9iQhpf1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"></figure><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/fec837aa8c877caa839a3f249b0bbc9e/tumblr_pr6t9j2a9R1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/c9f65c4faf3f8ea8dedd99e653daba93/tumblr_pr6t9k40oi1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"></figure><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/29bdb28e54bae7b474737e90a415e663/tumblr_pr6t9l7Pb11spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/a5a5310c0275c9d976c54b6a686f40d9/tumblr_pr6t9m4doj1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"></figure><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/87acc0e1658c77f7b4a3f312ebbd7a61/tumblr_pr6t9oWdEi1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"></figure></div></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "scavengingforwords",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 960,
                        "header_focus_width": 1206,
                        "header_focus_height": 679,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "194,1206,873,0",
                        "header_image": "https://static.tumblr.com/69fea8871def427c22b651608ec7ff65/gmeht5r/xjMpprtrw/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/957f41ed8a76b73a9e93694449a32437/gmeht5r/aZWpprts1/tumblr_static_tumblr_static__focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/69fea8871def427c22b651608ec7ff65/gmeht5r/xjMpprtrw/tumblr_static__2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184807038784"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/2c9da21394eab046c7b29c08589105d1/tumblr_pr6t9iQhpf1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"></figure><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/fec837aa8c877caa839a3f249b0bbc9e/tumblr_pr6t9j2a9R1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/c9f65c4faf3f8ea8dedd99e653daba93/tumblr_pr6t9k40oi1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"></figure><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/29bdb28e54bae7b474737e90a415e663/tumblr_pr6t9l7Pb11spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"></figure></div><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/a5a5310c0275c9d976c54b6a686f40d9/tumblr_pr6t9m4doj1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"></figure><figure class=\"tmblr-full\" data-orig-height=\"960\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/87acc0e1658c77f7b4a3f312ebbd7a61/tumblr_pr6t9oWdEi1spod81_540.png\" data-orig-height=\"960\" data-orig-width=\"1280\"></figure></div></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/2c9da21394eab046c7b29c08589105d1/tumblr_pr6t9iQhpf1spod81_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/fec837aa8c877caa839a3f249b0bbc9e/tumblr_pr6t9j2a9R1spod81_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/c9f65c4faf3f8ea8dedd99e653daba93/tumblr_pr6t9k40oi1spod81_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/29bdb28e54bae7b474737e90a415e663/tumblr_pr6t9l7Pb11spod81_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/a5a5310c0275c9d976c54b6a686f40d9/tumblr_pr6t9m4doj1spod81_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/87acc0e1658c77f7b4a3f312ebbd7a61/tumblr_pr6t9oWdEi1spod81_540.png\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": true,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "black-angel-manips",
        "blog": {
            "name": "black-angel-manips",
            "title": "Black Angel Manips",
            "description": "My name is Kamila.\nI'm from Brazil.\nI only accept manips of those who follow the blog.\nBlog dedicated to manips, actors, series, movies ..\nDark Angel is an extension of Blog Fallen manips, which has been disabled.\nI Do manips of all kinds and of all series / movies and what more you want. I hope you enjoy.",
            "url": "https://black-angel-manips.tumblr.com/",
            "uuid": "t:RaUxIaUv0LO1-mXOjLRnYw",
            "updated": 1561744836
        },
        "id": 184806910142,
        "post_url": "https://black-angel-manips.tumblr.com/post/184806910142/request-by-thatguy311001",
        "slug": "request-by-thatguy311001",
        "date": "2019-05-11 17:35:30 GMT",
        "timestamp": 1557596130,
        "state": "published",
        "format": "html",
        "reblog_key": "DiotdduR",
        "tags": [
            "thatguy311001",
            "brie larson",
            "carol danvers",
            "captain marvel",
            "the avengers",
            "pregnancy",
            "mines"
        ],
        "short_url": "https://tmblr.co/ZsqZ_g2i7MQY_",
        "summary": "Request by   thatguy311001",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "followed": false,
        "liked": false,
        "note_count": 34,
        "caption": "<blockquote><p>\n\n<i>Request by   <a href=\"http://thatguy311001.tumblr.com/\">thatguy311001</a> </i>\n\n<br/></p></blockquote>",
        "reblog": {
            "comment": "<p><blockquote><p>\n\n<i>Request by   <a href=\"http://thatguy311001.tumblr.com/\">thatguy311001</a> </i>\n\n<br></p></blockquote></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "black-angel-manips",
                    "active": true,
                    "theme": {
                        "header_full_width": 540,
                        "header_full_height": 628,
                        "header_focus_width": 540,
                        "header_focus_height": 304,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "20,540,324,0",
                        "header_image": "https://static.tumblr.com/6f4378b172e835f73eec6a9e6083b62f/0i0adp2/WMdpqp9ft/tumblr_static_a88ci8pu7sgsww08gk8ks88k4.jpg",
                        "header_image_focused": "https://static.tumblr.com/10d4f398b9124099d20f51a5d036549c/0i0adp2/4h6pqp9fu/tumblr_static_tumblr_static_a88ci8pu7sgsww08gk8ks88k4_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/6f4378b172e835f73eec6a9e6083b62f/0i0adp2/WMdpqp9ft/tumblr_static_a88ci8pu7sgsww08gk8ks88k4_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184806910142"
                },
                "content_raw": "<p><blockquote><p>\n\n<i>Request by   <a href=\"http://thatguy311001.tumblr.com/\">thatguy311001</a> </i>\n\n<br></p></blockquote></p>",
                "content": "<p><blockquote><p>\n\n<i>Request by &nbsp; <a href=\"http://thatguy311001.tumblr.com/\">thatguy311001</a> </i>\n\n<br /></p></blockquote></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://black-angel-manips.tumblr.com/image/184806910142",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/a30bd9136ad5542902adb426ad744c6f/tumblr_prcov6zTuS1vv2ex6o1_640.jpg",
                    "width": 594,
                    "height": 760
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/a30bd9136ad5542902adb426ad744c6f/tumblr_prcov6zTuS1vv2ex6o1_640.jpg",
                        "width": 594,
                        "height": 760
                    },
                    {
                        "url": "https://66.media.tumblr.com/a30bd9136ad5542902adb426ad744c6f/tumblr_prcov6zTuS1vv2ex6o1_540.jpg",
                        "width": 540,
                        "height": 691
                    },
                    {
                        "url": "https://66.media.tumblr.com/a30bd9136ad5542902adb426ad744c6f/tumblr_prcov6zTuS1vv2ex6o1_500.jpg",
                        "width": 500,
                        "height": 640
                    },
                    {
                        "url": "https://66.media.tumblr.com/a30bd9136ad5542902adb426ad744c6f/tumblr_prcov6zTuS1vv2ex6o1_400.jpg",
                        "width": 400,
                        "height": 512
                    },
                    {
                        "url": "https://66.media.tumblr.com/a30bd9136ad5542902adb426ad744c6f/tumblr_prcov6zTuS1vv2ex6o1_250.jpg",
                        "width": 250,
                        "height": 320
                    },
                    {
                        "url": "https://66.media.tumblr.com/a30bd9136ad5542902adb426ad744c6f/tumblr_prcov6zTuS1vv2ex6o1_100.jpg",
                        "width": 100,
                        "height": 128
                    },
                    {
                        "url": "https://66.media.tumblr.com/a30bd9136ad5542902adb426ad744c6f/tumblr_prcov6zTuS1vv2ex6o1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": true,
        "can_reblog": true,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]