[
    {
        "type": "text",
        "blog_name": "cherriontopx",
        "blog": {
            "name": "cherriontopx",
            "title": "CherriOnTop",
            "description": "",
            "url": "https://cherriontopx.tumblr.com/",
            "uuid": "t:ejZwumF-GLTieOhT5mqj1A",
            "updated": 1561563192
        },
        "id": 184882237025,
        "post_url": "https://cherriontopx.tumblr.com/post/184882237025/broken",
        "slug": "broken",
        "date": "2019-05-14 23:45:26 GMT",
        "timestamp": 1557877526,
        "state": "published",
        "format": "html",
        "reblog_key": "ZOTVhTMj",
        "tags": [
            "marvel",
            "iron man",
            "spiderman",
            "peter parker",
            "tony stark",
            "tony and peter",
            "broken bones",
            "broken arm",
            "mcu",
            "pepper potts",
            "father son",
            "aunt may",
            "bullied",
            "bullying",
            "tom holland",
            "robert downey jr"
        ],
        "short_url": "https://tmblr.co/Z7K6SZ2iBrmvX",
        "summary": "Broken",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 13,
        "title": "Broken",
        "body": "<p>                &quot;Tony,\nyou have a visitor.&ldquo;</p><p>                Tony\nStark looked up from the paper he was reviewing at the sound of his wife,\ngiving her a wave as his eyes traveled back down to what he was working on.\n&quot;Send them in, unless they&rsquo;re some big shot newspaper company. I don&rsquo;t need\nany more journalists-&rdquo; </p><p>                &quot;Mr.\nStark,&ldquo; a voice interrupted, entirely too cheerful and out of place in\nTony&rsquo;s office. But it still made the man break into a smile as he pushed the\npapers away and stood up from his chair. </p><p>                &quot;Peter,&rdquo;\nhe greeted, rounding the desk to wrap his arms around the teen, hugging him\ntightly to his chest. The boy had broken into a relieved smile, hugging him\nback with one arm around his broad frame, the other hidden behind his back.\nTony didn&rsquo;t seem to notice, patting Peter on the back and then holding him at\narms length, getting a good look at him. &ldquo;How&rsquo;s school been, kid? You\npassing all of your classes?&rdquo; </p><p>                Peter\nnods, offering the same, almost hesitant smile Tony had seen before. He didn&rsquo;t\npress for answers quite yet, taking his time as he went back to his chair,\nplopping down almost ungracefully. &ldquo;Yeah, I&rsquo;m top of all my classes. My\nEnglish teacher thinks that I could apply for this really big scholarship\nthrough the school where they would basically pay for my whole first\nyear.&rdquo; Peter&rsquo;s eyes practically light up at the thought, before they\ndimmed quickly. &ldquo;But I don&rsquo;t think I&rsquo;m going to apply for it.&rdquo; </p><p>                Tony&rsquo;s\nforehead scrunched in confusion, watching the boy. &ldquo;Why not? I&rsquo;m sure\nyou&rsquo;d get it, kid, you&rsquo;re smart enough.&rdquo; </p><p>                &quot;I\nknow.&ldquo; The boy fidgets in his spot a little, glancing at a chair for a\nbrief moment but remains standing. Tony opens his mouth to ask about it, but\nPeter keeps talking. &quot;It would only cover one year. I&rsquo;d have to drop out\nafter that, and it would be unfair to someone else who needs to\nscholarship.&rdquo; </p><p>                &quot;Drop\nout? What for, kid? You planning to get pregnant mid semester?&ldquo; Tony\njokes, laughing at himself. Peter huffs slightly, and the corners of his mouth\ncurve upwards, but he doesn&rsquo;t give the smile that Tony secretly likes to see. </p><p>                &quot;I\ncan&rsquo;t afford to go to college,&rdquo; Peter explains, almost sadly.\n&ldquo;Besides, I&rsquo;m too busy being-&rdquo; he glances around briefly, as if to\nmake sure no one was listening before continuing &ldquo;-Spiderman. I wouldn&rsquo;t\nhave time to do my studies and to get a job. Like, a paid job. I don&rsquo;t want to\nlive with aunt May forever and keep draining her income to take care of me. She\ndeserves better than that. I need to get myself an apartment and I can&rsquo;t do\nthat if I&rsquo;m going to college.&rdquo; </p><p>                Tony\nwatches Peter for a moment, studying him as if he were a puzzle, complex and\nindecipherable. &ldquo;Okay, then I&rsquo;ll pay for college.&rdquo; </p><p>                Across\nthe desk, Peter gaped at him, like it was the craziest thing he had ever heard.\nIt was enough of a shock that the boy brought his other arm out from behind his\nback, and then it was Tony&rsquo;s turn to gape. </p><p>                &quot;Peter,\noh my god, what happened?&ldquo; He was up and out of his seat in a flash,\nrounding the desk in three steps before he was at the boy&rsquo;s side, grabbing his\narm before Peter could protest. &quot;Pete, this is broken.&rdquo; The arm was\nbent mid forearm, the pieces of bone pressed against opposite sides of the\nboy&rsquo;s arm. Tony ran his thumb over the break in the bone, and Peter hissed,\nweakly trying to pull it back. </p><p>                &quot;It&rsquo;s\nnothing, Mr. Stark. Just a minor injury.&ldquo; </p><p>                &quot;Minor?\nYou call this minor?&rdquo; Tony snipped, outraged that something like this had\nhappened. &ldquo;How did you break it?&rdquo; </p><p>                Peter\nseemed hesitant, but Tony didn&rsquo;t push, letting the boy get there on his own. &ldquo;Mr.\nStark,&rdquo; Peter started, trailing off for a moment. He took a deep breath\nbefore lifting his eyes off the ground and to the other man&rsquo;s face. &ldquo;I was\npracticing some cool new flips and swings and I accidentally undershot how far\naway a building was. I landed on my arm and broke it.&rdquo; </p><p>                Tony scowled,\nface scrunching up. &ldquo;Bullshit.&rdquo; He called, trying hard not to either\naccidentally hurt the kid by squeezing or scare him by yelling. &ldquo;Tell me\nthe truth. What really happened?&rdquo; </p><p>                &quot;Mr.\nStark, really, I don&rsquo;t think it&rsquo;s that big of a deal. Why can&rsquo;t we just forget\nabout it?&ldquo; </p><p>                &quot;If\nit wasn&rsquo;t that big of a deal, why didn&rsquo;t you go to the hospital and get it\nfixed up? Peter, it can&rsquo;t fix itself like this! It needs to be in a cast.&rdquo;\n</p><p>                &quot;Some\nkid pushed me down the stairs at school, okay?&ldquo; Peter interrupted, his\nface bright red, though with anger or embarrassment, Tony wasn&rsquo;t sure.\n&quot;He&rsquo;s been picking on me for a few weeks now, and he pushed me down the\nstairs and I broke my arm but I didn&rsquo;t want to tell anyone because then they&rsquo;ll\njust laugh at me and I just want to make it through the last month without any\nissues.&rdquo; </p><p>                Tony\nwas shocked, his mouth hanging open. Bullied? Peter Parker? It didn&rsquo;t seem\npossible, but the boy in front of him refused to meet his eyes, and Tony knew\nhe wasn&rsquo;t lying this time. He gently set Peter&rsquo;s arm down by his side, then\ngrabbed his keys off his desk. </p><p>                &quot;Come\non, kid, we&rsquo;re going to get this fixed, and don&rsquo;t worry, I&rsquo;m paying for\nit.&ldquo; </p><p>                Tony\nset a hand on Peter&rsquo;s shoulder, steering him carefully out of the room and\ntowards the garage. Peter didn&rsquo;t even protest, just relaxing under the man&rsquo;s\nhand and allowing himself to be led. Tony couldn&rsquo;t imagine the pain he was in,\nor how he could go this long without breaking down even a little bit. </p><p>                &quot;As\nsoon as we get in the car, I&rsquo;ll call aunt May and let her know what&rsquo;s\ngoing-&rdquo; </p><p>                &quot;No!&ldquo;\nPeter cried, eyes wide and frantic as he turned to the other man. &quot;Mr.\nStark, please, don&rsquo;t tell her about the other kids. I don&rsquo;t want to worry her.\nPlease, Mr. Stark.&rdquo; </p><p>                One\nlook in Peter&rsquo;s large, doe eyes, and Tony gave a sigh, caving easily. It was\nhard to say no to the boy, and he wondered how in the world the other kids had\nthe heart to push him down the stairs. &ldquo;Alright, alright, I won&rsquo;t tell her\nabout the other kids. But I&rsquo;m still going to tell her that your arm is broken.\nShe has a right to know.&rdquo; </p><p>                Peter\nnodded, giving that soft, almost gummy smile that Tony liked to see before he\nwinced, rubbing over his arm lightly. Tony pulled the boy close to his side,\nhooking an arm over his shoulder. </p><p>                &quot;Okay,\ntough guy, let&rsquo;s go get you patched up.&ldquo; </p>",
        "reblog": {
            "comment": "<p>                \"Tony,\nyou have a visitor.“</p><p>                Tony\nStark looked up from the paper he was reviewing at the sound of his wife,\ngiving her a wave as his eyes traveled back down to what he was working on.\n\"Send them in, unless they’re some big shot newspaper company. I don’t need\nany more journalists-” </p><p>                \"Mr.\nStark,“ a voice interrupted, entirely too cheerful and out of place in\nTony’s office. But it still made the man break into a smile as he pushed the\npapers away and stood up from his chair. </p><p>                \"Peter,”\nhe greeted, rounding the desk to wrap his arms around the teen, hugging him\ntightly to his chest. The boy had broken into a relieved smile, hugging him\nback with one arm around his broad frame, the other hidden behind his back.\nTony didn’t seem to notice, patting Peter on the back and then holding him at\narms length, getting a good look at him. “How’s school been, kid? You\npassing all of your classes?” </p><p>                Peter\nnods, offering the same, almost hesitant smile Tony had seen before. He didn’t\npress for answers quite yet, taking his time as he went back to his chair,\nplopping down almost ungracefully. “Yeah, I’m top of all my classes. My\nEnglish teacher thinks that I could apply for this really big scholarship\nthrough the school where they would basically pay for my whole first\nyear.” Peter’s eyes practically light up at the thought, before they\ndimmed quickly. “But I don’t think I’m going to apply for it.” </p><p>                Tony’s\nforehead scrunched in confusion, watching the boy. “Why not? I’m sure\nyou’d get it, kid, you’re smart enough.” </p><p>                \"I\nknow.“ The boy fidgets in his spot a little, glancing at a chair for a\nbrief moment but remains standing. Tony opens his mouth to ask about it, but\nPeter keeps talking. \"It would only cover one year. I’d have to drop out\nafter that, and it would be unfair to someone else who needs to\nscholarship.” </p><p>                \"Drop\nout? What for, kid? You planning to get pregnant mid semester?“ Tony\njokes, laughing at himself. Peter huffs slightly, and the corners of his mouth\ncurve upwards, but he doesn’t give the smile that Tony secretly likes to see. </p><p>                \"I\ncan’t afford to go to college,” Peter explains, almost sadly.\n“Besides, I’m too busy being-” he glances around briefly, as if to\nmake sure no one was listening before continuing “-Spiderman. I wouldn’t\nhave time to do my studies and to get a job. Like, a paid job. I don’t want to\nlive with aunt May forever and keep draining her income to take care of me. She\ndeserves better than that. I need to get myself an apartment and I can’t do\nthat if I’m going to college.” </p><p>                Tony\nwatches Peter for a moment, studying him as if he were a puzzle, complex and\nindecipherable. “Okay, then I’ll pay for college.” </p><p>                Across\nthe desk, Peter gaped at him, like it was the craziest thing he had ever heard.\nIt was enough of a shock that the boy brought his other arm out from behind his\nback, and then it was Tony’s turn to gape. </p><p>                \"Peter,\noh my god, what happened?“ He was up and out of his seat in a flash,\nrounding the desk in three steps before he was at the boy’s side, grabbing his\narm before Peter could protest. \"Pete, this is broken.” The arm was\nbent mid forearm, the pieces of bone pressed against opposite sides of the\nboy’s arm. Tony ran his thumb over the break in the bone, and Peter hissed,\nweakly trying to pull it back. </p><p>                \"It’s\nnothing, Mr. Stark. Just a minor injury.“ </p><p>                \"Minor?\nYou call this minor?” Tony snipped, outraged that something like this had\nhappened. “How did you break it?” </p><p>                Peter\nseemed hesitant, but Tony didn’t push, letting the boy get there on his own. “Mr.\nStark,” Peter started, trailing off for a moment. He took a deep breath\nbefore lifting his eyes off the ground and to the other man’s face. “I was\npracticing some cool new flips and swings and I accidentally undershot how far\naway a building was. I landed on my arm and broke it.” </p><p>                Tony scowled,\nface scrunching up. “Bullshit.” He called, trying hard not to either\naccidentally hurt the kid by squeezing or scare him by yelling. “Tell me\nthe truth. What really happened?” </p><p>                \"Mr.\nStark, really, I don’t think it’s that big of a deal. Why can’t we just forget\nabout it?“ </p><p>                \"If\nit wasn’t that big of a deal, why didn’t you go to the hospital and get it\nfixed up? Peter, it can’t fix itself like this! It needs to be in a cast.”\n</p><p>                \"Some\nkid pushed me down the stairs at school, okay?“ Peter interrupted, his\nface bright red, though with anger or embarrassment, Tony wasn’t sure.\n\"He’s been picking on me for a few weeks now, and he pushed me down the\nstairs and I broke my arm but I didn’t want to tell anyone because then they’ll\njust laugh at me and I just want to make it through the last month without any\nissues.” </p><p>                Tony\nwas shocked, his mouth hanging open. Bullied? Peter Parker? It didn’t seem\npossible, but the boy in front of him refused to meet his eyes, and Tony knew\nhe wasn’t lying this time. He gently set Peter’s arm down by his side, then\ngrabbed his keys off his desk. </p><p>                \"Come\non, kid, we’re going to get this fixed, and don’t worry, I’m paying for\nit.“ </p><p>                Tony\nset a hand on Peter’s shoulder, steering him carefully out of the room and\ntowards the garage. Peter didn’t even protest, just relaxing under the man’s\nhand and allowing himself to be led. Tony couldn’t imagine the pain he was in,\nor how he could go this long without breaking down even a little bit. </p><p>                \"As\nsoon as we get in the car, I’ll call aunt May and let her know what’s\ngoing-” </p><p>                \"No!“\nPeter cried, eyes wide and frantic as he turned to the other man. \"Mr.\nStark, please, don’t tell her about the other kids. I don’t want to worry her.\nPlease, Mr. Stark.” </p><p>                One\nlook in Peter’s large, doe eyes, and Tony gave a sigh, caving easily. It was\nhard to say no to the boy, and he wondered how in the world the other kids had\nthe heart to push him down the stairs. “Alright, alright, I won’t tell her\nabout the other kids. But I’m still going to tell her that your arm is broken.\nShe has a right to know.” </p><p>                Peter\nnodded, giving that soft, almost gummy smile that Tony liked to see before he\nwinced, rubbing over his arm lightly. Tony pulled the boy close to his side,\nhooking an arm over his shoulder. </p><p>                \"Okay,\ntough guy, let’s go get you patched up.“ </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "cherriontopx",
                    "active": true,
                    "theme": {
                        "header_full_width": 691,
                        "header_full_height": 390,
                        "header_focus_width": 624,
                        "header_focus_height": 350,
                        "avatar_shape": "circle",
                        "background_color": "#FAFF96",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "2,691,352,67",
                        "header_image": "https://static.tumblr.com/15917e9aa48bec80c09050c88a6f90e0/aw1of0h/iAHpn09ki/tumblr_static_-2094871399-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/60a24d963b2532dd0341f752239603a6/aw1of0h/EKwpn09kj/tumblr_static_tumblr_static_-2094871399-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/15917e9aa48bec80c09050c88a6f90e0/aw1of0h/iAHpn09ki/tumblr_static_-2094871399-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#F2E0EB",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFD731",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184882237025"
                },
                "content_raw": "<p>                \"Tony,\nyou have a visitor.“</p><p>                Tony\nStark looked up from the paper he was reviewing at the sound of his wife,\ngiving her a wave as his eyes traveled back down to what he was working on.\n\"Send them in, unless they’re some big shot newspaper company. I don’t need\nany more journalists-” </p><p>                \"Mr.\nStark,“ a voice interrupted, entirely too cheerful and out of place in\nTony’s office. But it still made the man break into a smile as he pushed the\npapers away and stood up from his chair. </p><p>                \"Peter,”\nhe greeted, rounding the desk to wrap his arms around the teen, hugging him\ntightly to his chest. The boy had broken into a relieved smile, hugging him\nback with one arm around his broad frame, the other hidden behind his back.\nTony didn’t seem to notice, patting Peter on the back and then holding him at\narms length, getting a good look at him. “How’s school been, kid? You\npassing all of your classes?” </p><p>                Peter\nnods, offering the same, almost hesitant smile Tony had seen before. He didn’t\npress for answers quite yet, taking his time as he went back to his chair,\nplopping down almost ungracefully. “Yeah, I’m top of all my classes. My\nEnglish teacher thinks that I could apply for this really big scholarship\nthrough the school where they would basically pay for my whole first\nyear.” Peter’s eyes practically light up at the thought, before they\ndimmed quickly. “But I don’t think I’m going to apply for it.” </p><p>                Tony’s\nforehead scrunched in confusion, watching the boy. “Why not? I’m sure\nyou’d get it, kid, you’re smart enough.” </p><p>                \"I\nknow.“ The boy fidgets in his spot a little, glancing at a chair for a\nbrief moment but remains standing. Tony opens his mouth to ask about it, but\nPeter keeps talking. \"It would only cover one year. I’d have to drop out\nafter that, and it would be unfair to someone else who needs to\nscholarship.” </p><p>                \"Drop\nout? What for, kid? You planning to get pregnant mid semester?“ Tony\njokes, laughing at himself. Peter huffs slightly, and the corners of his mouth\ncurve upwards, but he doesn’t give the smile that Tony secretly likes to see. </p><p>                \"I\ncan’t afford to go to college,” Peter explains, almost sadly.\n“Besides, I’m too busy being-” he glances around briefly, as if to\nmake sure no one was listening before continuing “-Spiderman. I wouldn’t\nhave time to do my studies and to get a job. Like, a paid job. I don’t want to\nlive with aunt May forever and keep draining her income to take care of me. She\ndeserves better than that. I need to get myself an apartment and I can’t do\nthat if I’m going to college.” </p><p>                Tony\nwatches Peter for a moment, studying him as if he were a puzzle, complex and\nindecipherable. “Okay, then I’ll pay for college.” </p><p>                Across\nthe desk, Peter gaped at him, like it was the craziest thing he had ever heard.\nIt was enough of a shock that the boy brought his other arm out from behind his\nback, and then it was Tony’s turn to gape. </p><p>                \"Peter,\noh my god, what happened?“ He was up and out of his seat in a flash,\nrounding the desk in three steps before he was at the boy’s side, grabbing his\narm before Peter could protest. \"Pete, this is broken.” The arm was\nbent mid forearm, the pieces of bone pressed against opposite sides of the\nboy’s arm. Tony ran his thumb over the break in the bone, and Peter hissed,\nweakly trying to pull it back. </p><p>                \"It’s\nnothing, Mr. Stark. Just a minor injury.“ </p><p>                \"Minor?\nYou call this minor?” Tony snipped, outraged that something like this had\nhappened. “How did you break it?” </p><p>                Peter\nseemed hesitant, but Tony didn’t push, letting the boy get there on his own. “Mr.\nStark,” Peter started, trailing off for a moment. He took a deep breath\nbefore lifting his eyes off the ground and to the other man’s face. “I was\npracticing some cool new flips and swings and I accidentally undershot how far\naway a building was. I landed on my arm and broke it.” </p><p>                Tony scowled,\nface scrunching up. “Bullshit.” He called, trying hard not to either\naccidentally hurt the kid by squeezing or scare him by yelling. “Tell me\nthe truth. What really happened?” </p><p>                \"Mr.\nStark, really, I don’t think it’s that big of a deal. Why can’t we just forget\nabout it?“ </p><p>                \"If\nit wasn’t that big of a deal, why didn’t you go to the hospital and get it\nfixed up? Peter, it can’t fix itself like this! It needs to be in a cast.”\n</p><p>                \"Some\nkid pushed me down the stairs at school, okay?“ Peter interrupted, his\nface bright red, though with anger or embarrassment, Tony wasn’t sure.\n\"He’s been picking on me for a few weeks now, and he pushed me down the\nstairs and I broke my arm but I didn’t want to tell anyone because then they’ll\njust laugh at me and I just want to make it through the last month without any\nissues.” </p><p>                Tony\nwas shocked, his mouth hanging open. Bullied? Peter Parker? It didn’t seem\npossible, but the boy in front of him refused to meet his eyes, and Tony knew\nhe wasn’t lying this time. He gently set Peter’s arm down by his side, then\ngrabbed his keys off his desk. </p><p>                \"Come\non, kid, we’re going to get this fixed, and don’t worry, I’m paying for\nit.“ </p><p>                Tony\nset a hand on Peter’s shoulder, steering him carefully out of the room and\ntowards the garage. Peter didn’t even protest, just relaxing under the man’s\nhand and allowing himself to be led. Tony couldn’t imagine the pain he was in,\nor how he could go this long without breaking down even a little bit. </p><p>                \"As\nsoon as we get in the car, I’ll call aunt May and let her know what’s\ngoing-” </p><p>                \"No!“\nPeter cried, eyes wide and frantic as he turned to the other man. \"Mr.\nStark, please, don’t tell her about the other kids. I don’t want to worry her.\nPlease, Mr. Stark.” </p><p>                One\nlook in Peter’s large, doe eyes, and Tony gave a sigh, caving easily. It was\nhard to say no to the boy, and he wondered how in the world the other kids had\nthe heart to push him down the stairs. “Alright, alright, I won’t tell her\nabout the other kids. But I’m still going to tell her that your arm is broken.\nShe has a right to know.” </p><p>                Peter\nnodded, giving that soft, almost gummy smile that Tony liked to see before he\nwinced, rubbing over his arm lightly. Tony pulled the boy close to his side,\nhooking an arm over his shoulder. </p><p>                \"Okay,\ntough guy, let’s go get you patched up.“ </p>",
                "content": "<p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"Tony,\nyou have a visitor.&ldquo;</p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Tony\nStark looked up from the paper he was reviewing at the sound of his wife,\ngiving her a wave as his eyes traveled back down to what he was working on.\n\"Send them in, unless they&rsquo;re some big shot newspaper company. I don&rsquo;t need\nany more journalists-&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"Mr.\nStark,&ldquo; a voice interrupted, entirely too cheerful and out of place in\nTony&rsquo;s office. But it still made the man break into a smile as he pushed the\npapers away and stood up from his chair. </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"Peter,&rdquo;\nhe greeted, rounding the desk to wrap his arms around the teen, hugging him\ntightly to his chest. The boy had broken into a relieved smile, hugging him\nback with one arm around his broad frame, the other hidden behind his back.\nTony didn&rsquo;t seem to notice, patting Peter on the back and then holding him at\narms length, getting a good look at him. &ldquo;How&rsquo;s school been, kid? You\npassing all of your classes?&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Peter\nnods, offering the same, almost hesitant smile Tony had seen before. He didn&rsquo;t\npress for answers quite yet, taking his time as he went back to his chair,\nplopping down almost ungracefully. &ldquo;Yeah, I&rsquo;m top of all my classes. My\nEnglish teacher thinks that I could apply for this really big scholarship\nthrough the school where they would basically pay for my whole first\nyear.&rdquo; Peter&rsquo;s eyes practically light up at the thought, before they\ndimmed quickly. &ldquo;But I don&rsquo;t think I&rsquo;m going to apply for it.&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Tony&rsquo;s\nforehead scrunched in confusion, watching the boy. &ldquo;Why not? I&rsquo;m sure\nyou&rsquo;d get it, kid, you&rsquo;re smart enough.&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"I\nknow.&ldquo; The boy fidgets in his spot a little, glancing at a chair for a\nbrief moment but remains standing. Tony opens his mouth to ask about it, but\nPeter keeps talking. \"It would only cover one year. I&rsquo;d have to drop out\nafter that, and it would be unfair to someone else who needs to\nscholarship.&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"Drop\nout? What for, kid? You planning to get pregnant mid semester?&ldquo; Tony\njokes, laughing at himself. Peter huffs slightly, and the corners of his mouth\ncurve upwards, but he doesn&rsquo;t give the smile that Tony secretly likes to see. </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"I\ncan&rsquo;t afford to go to college,&rdquo; Peter explains, almost sadly.\n&ldquo;Besides, I&rsquo;m too busy being-&rdquo; he glances around briefly, as if to\nmake sure no one was listening before continuing &ldquo;-Spiderman. I wouldn&rsquo;t\nhave time to do my studies and to get a job. Like, a paid job. I don&rsquo;t want to\nlive with aunt May forever and keep draining her income to take care of me. She\ndeserves better than that. I need to get myself an apartment and I can&rsquo;t do\nthat if I&rsquo;m going to college.&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Tony\nwatches Peter for a moment, studying him as if he were a puzzle, complex and\nindecipherable. &ldquo;Okay, then I&rsquo;ll pay for college.&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Across\nthe desk, Peter gaped at him, like it was the craziest thing he had ever heard.\nIt was enough of a shock that the boy brought his other arm out from behind his\nback, and then it was Tony&rsquo;s turn to gape. </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"Peter,\noh my god, what happened?&ldquo; He was up and out of his seat in a flash,\nrounding the desk in three steps before he was at the boy&rsquo;s side, grabbing his\narm before Peter could protest. \"Pete, this is broken.&rdquo; The arm was\nbent mid forearm, the pieces of bone pressed against opposite sides of the\nboy&rsquo;s arm. Tony ran his thumb over the break in the bone, and Peter hissed,\nweakly trying to pull it back. </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"It&rsquo;s\nnothing, Mr. Stark. Just a minor injury.&ldquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"Minor?\nYou call this minor?&rdquo; Tony snipped, outraged that something like this had\nhappened. &ldquo;How did you break it?&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Peter\nseemed hesitant, but Tony didn&rsquo;t push, letting the boy get there on his own. &ldquo;Mr.\nStark,&rdquo; Peter started, trailing off for a moment. He took a deep breath\nbefore lifting his eyes off the ground and to the other man&rsquo;s face. &ldquo;I was\npracticing some cool new flips and swings and I accidentally undershot how far\naway a building was. I landed on my arm and broke it.&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Tony scowled,\nface scrunching up. &ldquo;Bullshit.&rdquo; He called, trying hard not to either\naccidentally hurt the kid by squeezing or scare him by yelling. &ldquo;Tell me\nthe truth. What really happened?&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"Mr.\nStark, really, I don&rsquo;t think it&rsquo;s that big of a deal. Why can&rsquo;t we just forget\nabout it?&ldquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"If\nit wasn&rsquo;t that big of a deal, why didn&rsquo;t you go to the hospital and get it\nfixed up? Peter, it can&rsquo;t fix itself like this! It needs to be in a cast.&rdquo;\n</p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"Some\nkid pushed me down the stairs at school, okay?&ldquo; Peter interrupted, his\nface bright red, though with anger or embarrassment, Tony wasn&rsquo;t sure.\n\"He&rsquo;s been picking on me for a few weeks now, and he pushed me down the\nstairs and I broke my arm but I didn&rsquo;t want to tell anyone because then they&rsquo;ll\njust laugh at me and I just want to make it through the last month without any\nissues.&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Tony\nwas shocked, his mouth hanging open. Bullied? Peter Parker? It didn&rsquo;t seem\npossible, but the boy in front of him refused to meet his eyes, and Tony knew\nhe wasn&rsquo;t lying this time. He gently set Peter&rsquo;s arm down by his side, then\ngrabbed his keys off his desk. </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"Come\non, kid, we&rsquo;re going to get this fixed, and don&rsquo;t worry, I&rsquo;m paying for\nit.&ldquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Tony\nset a hand on Peter&rsquo;s shoulder, steering him carefully out of the room and\ntowards the garage. Peter didn&rsquo;t even protest, just relaxing under the man&rsquo;s\nhand and allowing himself to be led. Tony couldn&rsquo;t imagine the pain he was in,\nor how he could go this long without breaking down even a little bit. </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"As\nsoon as we get in the car, I&rsquo;ll call aunt May and let her know what&rsquo;s\ngoing-&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"No!&ldquo;\nPeter cried, eyes wide and frantic as he turned to the other man. \"Mr.\nStark, please, don&rsquo;t tell her about the other kids. I don&rsquo;t want to worry her.\nPlease, Mr. Stark.&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;One\nlook in Peter&rsquo;s large, doe eyes, and Tony gave a sigh, caving easily. It was\nhard to say no to the boy, and he wondered how in the world the other kids had\nthe heart to push him down the stairs. &ldquo;Alright, alright, I won&rsquo;t tell her\nabout the other kids. But I&rsquo;m still going to tell her that your arm is broken.\nShe has a right to know.&rdquo; </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Peter\nnodded, giving that soft, almost gummy smile that Tony liked to see before he\nwinced, rubbing over his arm lightly. Tony pulled the boy close to his side,\nhooking an arm over his shoulder. </p><p> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"Okay,\ntough guy, let&rsquo;s go get you patched up.&ldquo; </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "kurisu-80",
        "blog": {
            "name": "kurisu-80",
            "title": "Art Art Art",
            "description": "Kurisu for you. Currently a freelance (fan)artist. Just a simple sideblog for all my art that doesn't find it's way on my other blogs",
            "url": "https://kurisu-80.tumblr.com/",
            "uuid": "t:E-2dIlQE9nB7SYNd-TiPog",
            "updated": 1561493694
        },
        "id": 184882114167,
        "post_url": "https://kurisu-80.tumblr.com/post/184882114167/not-to-be-horny-on-main-but-those-hips-dont-lie",
        "slug": "not-to-be-horny-on-main-but-those-hips-dont-lie",
        "date": "2019-05-14 23:38:42 GMT",
        "timestamp": 1557877122,
        "state": "published",
        "format": "html",
        "reblog_key": "AyZ8T05L",
        "tags": [
            "iron man",
            "aka nutting over iron man",
            "is that a tag i used before? cause it still applies",
            "fanart",
            "marvel"
        ],
        "short_url": "https://tmblr.co/Z2zjLb2iBrIvt",
        "summary": "not to be horny on main but those hips dont lie ",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 3070,
        "caption": "<p>not to be horny on main but those hips dont lie </p>",
        "reblog": {
            "comment": "<p>not to be horny on main but those hips dont lie </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "kurisu-80",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#0d0207",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/629a6a456bf719785eef5c19ae129a9a/nieptoy/6HEpo9vml/tumblr_static_b0n60cw41544s8gocg4ws0c80.png",
                        "header_image_focused": "https://static.tumblr.com/629a6a456bf719785eef5c19ae129a9a/nieptoy/6HEpo9vml/tumblr_static_b0n60cw41544s8gocg4ws0c80_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/629a6a456bf719785eef5c19ae129a9a/nieptoy/6HEpo9vml/tumblr_static_b0n60cw41544s8gocg4ws0c80_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#b62e6d",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#9b2259",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184882114167"
                },
                "content_raw": "<p>not to be horny on main but those hips dont lie </p>",
                "content": "<p>not to be horny on main but those hips dont lie&nbsp;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://kurisu-80.tumblr.com/image/184882114167",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/2bff500ab100d1da71376b60b3ecf384/tumblr_pripoizHYH1x2r7yzo1_1280.png",
                    "width": 1280,
                    "height": 1670
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/2bff500ab100d1da71376b60b3ecf384/tumblr_pripoizHYH1x2r7yzo1_1280.png",
                        "width": 1280,
                        "height": 1670
                    },
                    {
                        "url": "https://66.media.tumblr.com/2bff500ab100d1da71376b60b3ecf384/tumblr_pripoizHYH1x2r7yzo1_640.png",
                        "width": 640,
                        "height": 835
                    },
                    {
                        "url": "https://66.media.tumblr.com/2bff500ab100d1da71376b60b3ecf384/tumblr_pripoizHYH1x2r7yzo1_540.png",
                        "width": 540,
                        "height": 705
                    },
                    {
                        "url": "https://66.media.tumblr.com/2bff500ab100d1da71376b60b3ecf384/tumblr_pripoizHYH1x2r7yzo1_500.png",
                        "width": 500,
                        "height": 652
                    },
                    {
                        "url": "https://66.media.tumblr.com/2bff500ab100d1da71376b60b3ecf384/tumblr_pripoizHYH1x2r7yzo1_400.png",
                        "width": 400,
                        "height": 522
                    },
                    {
                        "url": "https://66.media.tumblr.com/2bff500ab100d1da71376b60b3ecf384/tumblr_pripoizHYH1x2r7yzo1_250.png",
                        "width": 250,
                        "height": 326
                    },
                    {
                        "url": "https://66.media.tumblr.com/2bff500ab100d1da71376b60b3ecf384/tumblr_pripoizHYH1x2r7yzo1_100.png",
                        "width": 100,
                        "height": 130
                    },
                    {
                        "url": "https://66.media.tumblr.com/2bff500ab100d1da71376b60b3ecf384/tumblr_pripoizHYH1x2r7yzo1_75sq.png",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "revengersfundedbytonystark",
        "blog": {
            "name": "revengersfundedbytonystark",
            "title": "Ask The Avengers",
            "description": "<p>Rp/ask blog for the avengers and co (Gardians, Winter Soldier, Dr. Strange etc.) Have a question or comment it will be answered. Some posts may contain spoliers but will be tagged. Feel free to interact as you wish. Any ships between characters are accpeted. Will also accpet writing prompts.</p>",
            "url": "https://revengersfundedbytonystark.tumblr.com/",
            "uuid": "t:a0S0RgW34Ez-TNfrJsm3uA",
            "updated": 1561766465
        },
        "id": 184882067110,
        "post_url": "https://revengersfundedbytonystark.tumblr.com/post/184882067110/ironstrange-and-peter-domestic-pranking-peter",
        "slug": "ironstrange-and-peter-domestic-pranking-peter",
        "date": "2019-05-14 23:36:20 GMT",
        "timestamp": 1557876980,
        "state": "published",
        "format": "html",
        "reblog_key": "ifLII45t",
        "tags": [
            "ironstrange",
            "iron man",
            "iron man rp",
            "ironstrange rp",
            "spiderman",
            "spider man",
            "spiderman rp",
            "dr strange",
            "dr strange rp",
            "tony stark",
            "stephen strange",
            "peter parker",
            "peter parker rp",
            "avengers imagine",
            "marvel",
            "avengers",
            "avengers rp",
            "marvel rp",
            "marvel imagine",
            "avengers headcanon",
            "ironstrange headconon",
            "dad tony stark",
            "ironstrange family"
        ],
        "short_url": "https://tmblr.co/ZWkrqW2iBr7Qc",
        "summary": "Ironstrange and Peter domestic pranking Peter sometime just attaching himself to the ceiling and descending in front of people...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 367,
        "title": null,
        "body": "<h2>Ironstrange and Peter domestic pranking</h2><p>Peter sometime just attaching himself to the ceiling and descending in front of people just to scare them. Some take well to this and laugh, others&hellip;well let’s just say it doesn’t end well.</p><p>Stephen creating portals behind Tony just to wrap his arms around him (sometime he just pokes him and goes back through, Tony thinks he’s going insane).</p><p>Tony tries using his powers in ways like the other two but he’s spent so much time showing off that it doesn’t have much of an effect. Peter starts to feel bad so he acts like he’s surprised. He’s not great at acting though and Tony knows it’s fake</p>",
        "reblog": {
            "comment": "<p><h2>Ironstrange and Peter domestic pranking</h2><p>Peter sometime just attaching himself to the ceiling and descending in front of people just to scare them. Some take well to this and laugh, others…well let’s just say it doesn’t end well.</p><p>Stephen creating portals behind Tony just to wrap his arms around him (sometime he just pokes him and goes back through, Tony thinks he’s going insane).</p><p>Tony tries using his powers in ways like the other two but he’s spent so much time showing off that it doesn’t have much of an effect. Peter starts to feel bad so he acts like he’s surprised. He’s not great at acting though and Tony knows it’s fake</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "revengersfundedbytonystark",
                    "active": true,
                    "theme": {
                        "header_full_width": 1256,
                        "header_full_height": 710,
                        "header_focus_width": 1256,
                        "header_focus_height": 707,
                        "avatar_shape": "circle",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "1,1256,708,0",
                        "header_image": "https://static.tumblr.com/ddf0c4ef062d49edd095c25fbd9ec512/guftpe3/gnFpr5wkl/tumblr_static_hzclo4fdt68sw8k0wgc8wk4c.jpg",
                        "header_image_focused": "https://static.tumblr.com/51bcd944edb970177827c2c56d314b72/guftpe3/enCpr5wkm/tumblr_static_tumblr_static_hzclo4fdt68sw8k0wgc8wk4c_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/ddf0c4ef062d49edd095c25fbd9ec512/guftpe3/gnFpr5wkl/tumblr_static_hzclo4fdt68sw8k0wgc8wk4c_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#E20B0B",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#427ea3",
                        "title_font": "Square Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184882067110"
                },
                "content_raw": "<p><h2>Ironstrange and Peter domestic pranking</h2><p>Peter sometime just attaching himself to the ceiling and descending in front of people just to scare them. Some take well to this and laugh, others…well let’s just say it doesn’t end well.</p><p>Stephen creating portals behind Tony just to wrap his arms around him (sometime he just pokes him and goes back through, Tony thinks he’s going insane).</p><p>Tony tries using his powers in ways like the other two but he’s spent so much time showing off that it doesn’t have much of an effect. Peter starts to feel bad so he acts like he’s surprised. He’s not great at acting though and Tony knows it’s fake</p></p>",
                "content": "<p><h2>Ironstrange and Peter domestic pranking</h2><p>Peter sometime just attaching himself to the ceiling and descending in front of people just to scare them. Some take well to this and laugh, others&hellip;well let&rsquo;s just say it doesn&rsquo;t end well.</p><p>Stephen creating portals behind Tony just to wrap his arms around him (sometime he just pokes him and goes back through, Tony thinks he&rsquo;s going insane).</p><p>Tony tries using his powers in ways like the other two but he&rsquo;s spent so much time showing off that it doesn&rsquo;t have much of an effect. Peter starts to feel bad so he acts like he&rsquo;s surprised. He&rsquo;s not great at acting though and Tony knows it&rsquo;s fake</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "cyberdelph",
        "blog": {
            "name": "cyberdelph",
            "title": "Delph's World",
            "description": "I love reading...I like quotes and girly stuff...\n\nFan of the Cut & Run Serie & MM romance. \n\nAlso a Black Dagger Brotherhood addict and a THIRDs nerds.\n\nMy favorite TV shows are : The Vampire Diaries, Teen Wolf, Buffy the vampire Slayer, Beauty & the Beast, Nikita, Bitten, Sherlock, Almost Human,Veronica Mars, The Following, Flash,iZombie,Supernatural, Marvel's Agents of S.H.I.E.L.D, MCU...\n\nSometimes NSFW, so be warned...\n\nMultifandom blog - Hate free blog. \nMulti shipper - Ship all the ships...No drama zone.",
            "url": "https://cyberdelph.tumblr.com/",
            "uuid": "t:CKIbuoi84jRjSiyQHsFQVQ",
            "updated": 1561752544
        },
        "id": 184882050222,
        "post_url": "https://cyberdelph.tumblr.com/post/184882050222/you-did-well-today-kid-by-whalepurple",
        "slug": "you-did-well-today-kid-by-whalepurple",
        "date": "2019-05-14 23:35:11 GMT",
        "timestamp": 1557876911,
        "state": "published",
        "format": "html",
        "reblog_key": "SdPJOYuO",
        "tags": [
            "ironspider",
            "iron man",
            "spiderman",
            "irondad",
            "marvel"
        ],
        "short_url": "https://tmblr.co/Z0M0Vs2iBr3Ik",
        "summary": "You did well today, kid by\n\n@whalepurple_",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 70,
        "source_url": "https://t.umblr.com/redirect?z=https%3A%2F%2Ftwitter.com%2Fwhalepurple_%2Fstatus%2F1128265304033742848&t=OGVlNTNhOGU3MjQ5OThkZGViYTFhYzkxN2ViYjk2OGI5NGViYTYyNywxODQ4ODIwNTAyMjI%3D&b=t%3ACKIbuoi84jRjSiyQHsFQVQ&p=https%3A%2F%2Fcyberdelph.tumblr.com%2Fpost%2F184882050222%2Fyou-did-well-today-kid-by-whalepurple&m=0",
        "source_title": "twitter.com",
        "caption": "<p><a href=\"https://twitter.com/whalepurple_/status/1128265304033742848\" target=\"_blank\">You did well today, kid</a> by\n\n<a href=\"https://twitter.com/whalepurple_\" target=\"_blank\">@<b>whalepurple_</b></a>\n\n</p>",
        "reblog": {
            "comment": "<p><a href=\"https://twitter.com/whalepurple_/status/1128265304033742848\" target=\"_blank\">You did well today, kid</a> by\n\n<a href=\"https://twitter.com/whalepurple_\" target=\"_blank\">@<b>whalepurple_</b></a>\n\n</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "cyberdelph",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#F6F6F6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/fbf904bbac647655f786c4f86d8660a3/ddsgxfi/Paunjq04a/tumblr_static_filename.png",
                        "header_image_focused": "https://static.tumblr.com/fbf904bbac647655f786c4f86d8660a3/ddsgxfi/Paunjq04a/tumblr_static_filename_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/fbf904bbac647655f786c4f86d8660a3/ddsgxfi/Paunjq04a/tumblr_static_filename_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184882050222"
                },
                "content_raw": "<p><a href=\"https://twitter.com/whalepurple_/status/1128265304033742848\" target=\"_blank\">You did well today, kid</a> by\n\n<a href=\"https://twitter.com/whalepurple_\" target=\"_blank\">@<b>whalepurple_</b></a>\n\n</p>",
                "content": "<p><a href=\"https://twitter.com/whalepurple_/status/1128265304033742848\" target=\"_blank\">You did well today, kid</a>&nbsp;by\n\n<a href=\"https://twitter.com/whalepurple_\" target=\"_blank\">@<b>whalepurple_</b></a>\n\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://cyberdelph.tumblr.com/image/184882050222",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/c7d6a3a1371a349e1dbd6414d189805c/tumblr_pri3t5M3fq1so4kw0o1_1280.jpg",
                    "width": 1033,
                    "height": 1200
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/c7d6a3a1371a349e1dbd6414d189805c/tumblr_pri3t5M3fq1so4kw0o1_1280.jpg",
                        "width": 1033,
                        "height": 1200
                    },
                    {
                        "url": "https://66.media.tumblr.com/c7d6a3a1371a349e1dbd6414d189805c/tumblr_pri3t5M3fq1so4kw0o1_640.jpg",
                        "width": 640,
                        "height": 743
                    },
                    {
                        "url": "https://66.media.tumblr.com/c7d6a3a1371a349e1dbd6414d189805c/tumblr_pri3t5M3fq1so4kw0o1_540.jpg",
                        "width": 540,
                        "height": 627
                    },
                    {
                        "url": "https://66.media.tumblr.com/c7d6a3a1371a349e1dbd6414d189805c/tumblr_pri3t5M3fq1so4kw0o1_500.jpg",
                        "width": 500,
                        "height": 581
                    },
                    {
                        "url": "https://66.media.tumblr.com/c7d6a3a1371a349e1dbd6414d189805c/tumblr_pri3t5M3fq1so4kw0o1_400.jpg",
                        "width": 400,
                        "height": 465
                    },
                    {
                        "url": "https://66.media.tumblr.com/c7d6a3a1371a349e1dbd6414d189805c/tumblr_pri3t5M3fq1so4kw0o1_250.jpg",
                        "width": 250,
                        "height": 290
                    },
                    {
                        "url": "https://66.media.tumblr.com/c7d6a3a1371a349e1dbd6414d189805c/tumblr_pri3t5M3fq1so4kw0o1_100.jpg",
                        "width": 100,
                        "height": 116
                    },
                    {
                        "url": "https://66.media.tumblr.com/c7d6a3a1371a349e1dbd6414d189805c/tumblr_pri3t5M3fq1so4kw0o1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "shwerns",
        "blog": {
            "name": "shwerns",
            "title": "●●●",
            "description": "<div align= \"center\">                                                                                                   Illustrator<BR>\nBased in RVA <BR><BR>\nCommissions are open!\n</div>",
            "url": "https://shwerns.tumblr.com/",
            "uuid": "t:M6GhAE8Buk5AEt9_B1bzaw",
            "updated": 1559252026
        },
        "id": 184882034043,
        "post_url": "https://shwerns.tumblr.com/post/184882034043/i-am-iron-man",
        "slug": "i-am-iron-man",
        "date": "2019-05-14 23:34:17 GMT",
        "timestamp": 1557876857,
        "state": "published",
        "format": "html",
        "reblog_key": "RqL8uyqN",
        "tags": [
            "Tony Stark",
            "avengers endgame",
            "iron man",
            "Robert Downey jr",
            "rdj",
            "avengers",
            "marvel",
            "artists on tumblr",
            "my art"
        ],
        "short_url": "https://tmblr.co/ZvbuSx2iBq-Lx",
        "summary": "“I am Iron Man”",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 490,
        "caption": "<p>“I am Iron Man”</p>",
        "reblog": {
            "comment": "<p>“I am Iron Man”</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "shwerns",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#B3D3D6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/3462ee7be9769aac96048513d1682f04/wtovlhk/REQpsa3ub/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/3462ee7be9769aac96048513d1682f04/wtovlhk/REQpsa3ub/tumblr_static__2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/3462ee7be9769aac96048513d1682f04/wtovlhk/REQpsa3ub/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#B21818",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184882034043"
                },
                "content_raw": "<p>“I am Iron Man”</p>",
                "content": "<p>&ldquo;I am Iron Man&rdquo;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://shwerns.tumblr.com/image/184882034043",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/8207f939b3cccb524e84caf76e9d52c7/tumblr_priph3fs0X1qkviaao1_1280.jpg",
                    "width": 1280,
                    "height": 1317
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/8207f939b3cccb524e84caf76e9d52c7/tumblr_priph3fs0X1qkviaao1_1280.jpg",
                        "width": 1280,
                        "height": 1317
                    },
                    {
                        "url": "https://66.media.tumblr.com/8207f939b3cccb524e84caf76e9d52c7/tumblr_priph3fs0X1qkviaao1_640.jpg",
                        "width": 640,
                        "height": 658
                    },
                    {
                        "url": "https://66.media.tumblr.com/8207f939b3cccb524e84caf76e9d52c7/tumblr_priph3fs0X1qkviaao1_540.jpg",
                        "width": 540,
                        "height": 555
                    },
                    {
                        "url": "https://66.media.tumblr.com/8207f939b3cccb524e84caf76e9d52c7/tumblr_priph3fs0X1qkviaao1_500.jpg",
                        "width": 500,
                        "height": 514
                    },
                    {
                        "url": "https://66.media.tumblr.com/8207f939b3cccb524e84caf76e9d52c7/tumblr_priph3fs0X1qkviaao1_400.jpg",
                        "width": 400,
                        "height": 411
                    },
                    {
                        "url": "https://66.media.tumblr.com/8207f939b3cccb524e84caf76e9d52c7/tumblr_priph3fs0X1qkviaao1_250.jpg",
                        "width": 250,
                        "height": 257
                    },
                    {
                        "url": "https://66.media.tumblr.com/8207f939b3cccb524e84caf76e9d52c7/tumblr_priph3fs0X1qkviaao1_100.jpg",
                        "width": 100,
                        "height": 103
                    },
                    {
                        "url": "https://66.media.tumblr.com/8207f939b3cccb524e84caf76e9d52c7/tumblr_priph3fs0X1qkviaao1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "sneckerdoodle",
        "blog": {
            "name": "sneckerdoodle",
            "title": "mischief to do",
            "description": "I created this blog primarily to scream about Avengers.  Please scream with me.\nMy ao3",
            "url": "https://sneckerdoodle.tumblr.com/",
            "uuid": "t:9AA_2v64EX5WyVdefyrZ1g",
            "updated": 1561763559
        },
        "id": 184881759197,
        "post_url": "https://sneckerdoodle.tumblr.com/post/184881759197/can-i-just-say-that-pepper-becoming-rescue-is",
        "slug": "can-i-just-say-that-pepper-becoming-rescue-is",
        "date": "2019-05-14 23:19:15 GMT",
        "timestamp": 1557875955,
        "state": "published",
        "format": "html",
        "reblog_key": "MPygBdfQ",
        "tags": [
            "avengers",
            "endgame",
            "endgame spoilers",
            "pepper potts",
            "iron man",
            "spoilers",
            "rescue"
        ],
        "short_url": "https://tmblr.co/ZiZ6uW2iBpyFT",
        "summary": "Can I just say that Pepper becoming Rescue is something I have been waiting for for YEARS and almost makes up for everything...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 7,
        "title": null,
        "body": "<p>Can I just say that Pepper becoming Rescue is something I have been waiting for for YEARS and almost makes up for everything else.</p>",
        "reblog": {
            "comment": "<p>Can I just say that Pepper becoming Rescue is something I have been waiting for for YEARS and almost makes up for everything else.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "sneckerdoodle",
                    "active": true,
                    "theme": {
                        "header_full_width": 478,
                        "header_full_height": 646,
                        "header_focus_width": 478,
                        "header_focus_height": 268,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,478,268,0",
                        "header_image": "https://static.tumblr.com/a518a60bd4e3f7885ba1f24b0170b292/fmuugyn/e9Zpqos7t/tumblr_static_7j7rzr021wg0sgk0k00kgc4cg.jpg",
                        "header_image_focused": "https://static.tumblr.com/b484653248c18ac3d01dd20d6797a7b8/fmuugyn/LFfpqos7u/tumblr_static_tumblr_static_7j7rzr021wg0sgk0k00kgc4cg_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/a518a60bd4e3f7885ba1f24b0170b292/fmuugyn/e9Zpqos7t/tumblr_static_7j7rzr021wg0sgk0k00kgc4cg_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#213f52",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881759197"
                },
                "content_raw": "<p>Can I just say that Pepper becoming Rescue is something I have been waiting for for YEARS and almost makes up for everything else.</p>",
                "content": "<p>Can I just say that Pepper becoming Rescue is something I have been waiting for for YEARS and almost makes up for everything else.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "justanotherfilmfanatic",
        "blog": {
            "name": "justanotherfilmfanatic",
            "title": "Leave The Gun, Take The Cannoli",
            "description": "<p>Lover of all things Movies, Marvel, Michael Scott and Malcolm Tucker</p><p>If you want to see what true love looks like, check out my Steve Rogers tag ♥️ Previously Justanotherhornyhuman.</p><p>Ask away!</p><p>Nothing is mine unless stated</p>",
            "url": "https://justanotherfilmfanatic.tumblr.com/",
            "uuid": "t:4sX5JFFG3hUpI58dkVkGyQ",
            "updated": 1561763557
        },
        "id": 184881637501,
        "post_url": "https://justanotherfilmfanatic.tumblr.com/post/184881637501/my-babies-have-come-so-far",
        "slug": "my-babies-have-come-so-far",
        "date": "2019-05-14 23:12:25 GMT",
        "timestamp": 1557875545,
        "state": "published",
        "format": "html",
        "reblog_key": "pJfpRSdC",
        "tags": [
            "marvel",
            "mcu",
            "avengers",
            "captain america",
            "iron man",
            "stony",
            "steve x tony",
            "steve rogers",
            "tony stark",
            "chris evans",
            "robert downey jr",
            "rdj",
            "avengers assemble",
            "2012",
            "avengers endgame",
            "endgame",
            "2019",
            "movie",
            "film",
            "actor",
            "cinema",
            "joss whedon",
            "russo brothers",
            "joe russo",
            "anthony russo"
        ],
        "short_url": "https://tmblr.co/ZwHsoX2iBpUXz",
        "summary": "My babies have come so far ♥️👨‍❤️‍👨👬",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1078,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/d2919f61a09464e22b359d28395f0f33/tumblr_prf1b8libU1tnfye6_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"/></figure><p>My babies have come so far ♥️👨‍❤️‍👨👬</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/d2919f61a09464e22b359d28395f0f33/tumblr_prf1b8libU1tnfye6_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"></figure><p>My babies have come so far ♥️👨‍❤️‍👨👬</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "justanotherfilmfanatic",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 1136,
                        "header_focus_width": 640,
                        "header_focus_height": 360,
                        "avatar_shape": "circle",
                        "background_color": "#2C2B2B",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "535,640,895,0",
                        "header_image": "https://static.tumblr.com/22c3b6bb1aec66ea8d9124451afced0b/2nf2tid/zL3pj8mni/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/317306de46045dcddfa861695e99bf29/2nf2tid/A8jpj8moz/tumblr_static_tumblr_static__focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/22c3b6bb1aec66ea8d9124451afced0b/2nf2tid/zL3pj8mni/tumblr_static__2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#C11E1E",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881637501"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/d2919f61a09464e22b359d28395f0f33/tumblr_prf1b8libU1tnfye6_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"1280\"></figure><p>My babies have come so far ♥️👨‍❤️‍👨👬</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d2919f61a09464e22b359d28395f0f33/tumblr_prf1b8libU1tnfye6_540.jpg\" class=\"\"/></figure><p>My babies have come so far &hearts;&#65039;&#128104;&zwj;&#10084;&#65039;&zwj;&#128104;&#128108;</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "cheshiremona",
        "blog": {
            "name": "cheshiremona",
            "title": "cheshire mona",
            "description": "<p>i like to draw. don’t expect much. </p><p>redbubble: cheshiremona. </p><p>youtube: cheshire mona.</p>",
            "url": "https://cheshiremona.tumblr.com/",
            "uuid": "t:RyOMEHEwPgyWlX_5UuIEfw",
            "updated": 1561208814
        },
        "id": 184881616736,
        "post_url": "https://cheshiremona.tumblr.com/post/184881616736/tony-stop-eating-candy-morgan-holding-a-candy",
        "slug": "tony-stop-eating-candy-morgan-holding-a-candy",
        "date": "2019-05-14 23:11:25 GMT",
        "timestamp": 1557875485,
        "state": "published",
        "format": "html",
        "reblog_key": "2RGyzWtD",
        "tags": [
            "morgan stark",
            "tony stark",
            "iron man",
            "iron dad",
            "incorrect marvel quotes",
            "incorrect quotes",
            "marvel",
            "mcu"
        ],
        "short_url": "https://tmblr.co/ZoSsjb2iBpPTW",
        "summary": "tony: stop eating candy!\nmorgan, holding a candy: i haven’t even started!",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 43,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>tony:</b> stop eating candy!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>morgan, holding a candy:</b> i haven’t even started!</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>tony:</b> stop eating candy!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>morgan, holding a candy:</b> i haven’t even started!</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "cheshiremona",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FFB9B9",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/f88840ff71fd61dc96f7482757dbdbf4/7vq7lu0/ewnp74thk/tumblr_static_92o65ex44f8kw4ckwksoc0sww.png",
                        "header_image_focused": "https://static.tumblr.com/f88840ff71fd61dc96f7482757dbdbf4/7vq7lu0/ewnp74thk/tumblr_static_92o65ex44f8kw4ckwksoc0sww_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/f88840ff71fd61dc96f7482757dbdbf4/7vq7lu0/ewnp74thk/tumblr_static_92o65ex44f8kw4ckwksoc0sww_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#FFCA69",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#102029",
                        "title_font": "Typewriter FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881616736"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>tony:</b> stop eating candy!</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>morgan, holding a candy:</b> i haven’t even started!</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>tony:</b> stop eating candy!</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>morgan, holding a candy:</b> i haven&rsquo;t even started!</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "flight-by-night",
        "blog": {
            "name": "flight-by-night",
            "title": "flight-by-night",
            "description": "<p>🌺Ky~♋️~23~Xamaycana🌺</p><p>I don’t have an aesthetic. Everything here I either relate to or just like. Enjoy 😊</p>",
            "url": "https://flight-by-night.tumblr.com/",
            "uuid": "t:3Y3z9o2Sph8loMpJWBntVA",
            "updated": 1561761171
        },
        "id": 184881545693,
        "post_url": "https://flight-by-night.tumblr.com/post/184881545693/so-no-one-wants-riri-williams-in-the-mcu",
        "slug": "so-no-one-wants-riri-williams-in-the-mcu",
        "date": "2019-05-14 23:07:07 GMT",
        "timestamp": 1557875227,
        "state": "published",
        "format": "html",
        "reblog_key": "H0uk1exc",
        "tags": [
            "avengers: endgame",
            "iron man",
            "rdj",
            "robert downey jr",
            "i love you 3000",
            "ironheart",
            "riri williams",
            "marvel phase 4",
            "harley keener"
        ],
        "short_url": "https://tmblr.co/ZErdSo2iBp87T",
        "summary": "So no one wants Riri Williams in the MCU? Wow...okay.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 29,
        "title": null,
        "body": "<p>So no one wants Riri Williams in the MCU? Wow&hellip;okay.</p>",
        "reblog": {
            "comment": "<p>So no one wants Riri Williams in the MCU? Wow…okay.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "flight-by-night",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 667,
                        "header_focus_width": 455,
                        "header_focus_height": 255,
                        "avatar_shape": "square",
                        "background_color": "#9686B5",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "252,477,507,22",
                        "header_image": "https://static.tumblr.com/47519ebc87c2ab4ad64af4adaff3925f/fveys4g/YdCnip1cp/tumblr_static_f4aqgdy1gs0so0o4wkcgskk4w.jpg",
                        "header_image_focused": "https://static.tumblr.com/47519ebc87c2ab4ad64af4adaff3925f/fveys4g/NSTnip1cq/tumblr_static_tumblr_static_f4aqgdy1gs0so0o4wkcgskk4w_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/47519ebc87c2ab4ad64af4adaff3925f/fveys4g/YdCnip1cp/tumblr_static_f4aqgdy1gs0so0o4wkcgskk4w_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#F9FCFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881545693"
                },
                "content_raw": "<p>So no one wants Riri Williams in the MCU? Wow…okay.</p>",
                "content": "<p>So no one wants Riri Williams in the MCU? Wow&hellip;okay.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "pawprinterfanfic",
        "blog": {
            "name": "pawprinterfanfic",
            "title": "i love you 3000",
            "description": "<p>Essie | Pawprinter | Fanfic: <a href=\"https://archiveofourown.org/users/Pawprinter\">AO3</a> | She/Her | Slytherin | 20-something-year-old | Multifandom | Currently all about Iron Dad &amp; MCU and Bellarke &amp; The 100 | <a href=\"https://pawprinterfanfic.tumblr.com/about\">About</a> | <a href=\"https://pawprinterfanfic.tumblr.com/fandoms\">Fandoms</a> | <a href=\"https://pawprinterfanfic.tumblr.com/ships\">Ships</a> | <a href=\"https://pawprinterfanfic.tumblr.com/navigation\">Fan content navigation</a> [Icon by @bb-8]</p>",
            "url": "https://pawprinterfanfic.tumblr.com/",
            "uuid": "t:3DqDYTQ34mjLG4YuZ51LHA",
            "updated": 1561763552
        },
        "id": 184881532312,
        "post_url": "https://pawprinterfanfic.tumblr.com/post/184881532312/i-miss-tony-stark-so-much",
        "slug": "i-miss-tony-stark-so-much",
        "date": "2019-05-14 23:06:26 GMT",
        "timestamp": 1557875186,
        "state": "published",
        "format": "html",
        "reblog_key": "gkrhsYm5",
        "tags": [
            "tony stark",
            "iron man",
            "mcu",
            "marvel",
            "avengers endgame",
            "endgame spoilers",
            "bring him BACK"
        ],
        "short_url": "https://tmblr.co/ZGYewc2iBp4sO",
        "summary": "i miss tony stark so much",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 3,
        "title": null,
        "body": "<p>i miss tony stark so much</p>",
        "reblog": {
            "comment": "<p>i miss tony stark so much</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "pawprinterfanfic",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#666666",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/098909c3ff9bc0f170053f29bacb6dbb/vgqmb3w/0sops4f7t/tumblr_static_.gif",
                        "header_image_focused": "https://static.tumblr.com/098909c3ff9bc0f170053f29bacb6dbb/vgqmb3w/0sops4f7t/tumblr_static__2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/098909c3ff9bc0f170053f29bacb6dbb/vgqmb3w/0sops4f7t/tumblr_static__2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#ffffff",
                        "title_font": "News Gothic FS",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881532312"
                },
                "content_raw": "<p>i miss tony stark so much</p>",
                "content": "<p>i miss tony stark so much</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "snowflake251",
        "blog": {
            "name": "snowflake251",
            "title": "Welcome to my World",
            "description": "Visit my Fanfiction & Ao3 Account: MusicHeart08 and read my stories.",
            "url": "https://snowflake251.tumblr.com/",
            "uuid": "t:b0RwVCNOqprUH7rsuulBwQ",
            "updated": 1561391362
        },
        "id": 184881291980,
        "post_url": "https://snowflake251.tumblr.com/post/184881291980/irondad-spiderson-aladdin",
        "slug": "irondad-spiderson-aladdin",
        "date": "2019-05-14 22:52:43 GMT",
        "timestamp": 1557874363,
        "state": "published",
        "format": "html",
        "reblog_key": "KM0FRVuD",
        "tags": [
            "iron dad and spider son",
            "tony stark",
            "iron man",
            "peter parker",
            "aladdin au",
            "because i'm going to ignore endgame",
            "endgame doesn't exist here!!",
            "imagine tony singing friend like me",
            "or should it be mentor like me?",
            "avengers au"
        ],
        "short_url": "https://tmblr.co/Z6nLPl2iBoABC",
        "summary": "IronDad & SpiderSon Aladdin",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 7,
        "title": null,
        "body": "<h1>IronDad &amp; SpiderSon Aladdin</h1><p>Okay, so I’m getting into the new Aladdin since the clip of <a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DlgrQlO7Us2Q&amp;t=OGQ3NjI3NmQ1ZTc5ZDZlNTYyMDMyNTJlNTM4ZTU1ZDU1NDAzZWJhMSwzNGM1YzBhNjBjY2NhNmFjOTVkZjU4YTViNDQzMDJjMDgyNmUzZWZj\">Will Smith’s Prince Ali</a>, and thus this Au was born.</p><p>Tony Stark as Genie</p><p>Peter Parker as Aladdin</p><p><b>I mean Imagine:</b></p><ul><li>In my version, No Jasmine, unless y’all want that trope. MJ would be a good candidate.</li><li>My idea was that this version of Agrabah, <i>(or New York)</i> has been the main city of crime for years, aside from all the rich cats, who pretty much have it all and give away none of it.</li><li>And in the middle of it all, poor Street Rat, Peter Parker is orphaned and alone in the large city. Constantly being picked on and mugged, even when he’s got nothing to offer. But, he always stands up for the ones who can’t fight back.</li><li>One day, he was approached by Adrian Toomes who offered him a large sum of money if he goes into the Ancient Ruined Tower, that only allows those with a heroes heart to enter, and retrieves an old, broken <i>Arc Reactor</i>.</li><li>With his pure heart, Peter was able to enter the tower and retrieve the reactor. However, when Toomes entered and tried to steal the reactor away, the Tower sensed his dark heart, and banished him out. In the process, locking Peter and the Arc Reactor inside the tower.</li><li>While trapped inside, Peter found tools and managed to fix the strange device, which released the hero: Iron Man.</li><li>For setting him free, and proving himself worthy, Iron Man offered Peter any power that he desired.</li><li>The only thing Peter really wanted to use his power for, was to help out all the little guys, to save more than he could before.</li><li>And thus, Tony gave Peter a suit to conceal his identity and granted him the powers of a Spider.</li><li>Using his powers, Spider-Man brought hope to the people of New York.</li><li>And of course, Tony being all: <i>“You may look like a hero on the outside but I didn’t change anything on the inside”</i></li></ul><p>Yada, Yada! You know the rest.</p><p>I’m just giving the idea here. Feel free to add on.</p><p>My idea for the ending, is when Peter wished Tony to be set free from the Arc Reactor, Tony decides to adopt him.</p>",
        "reblog": {
            "comment": "<p><h1>IronDad &amp; SpiderSon Aladdin</h1><p>Okay, so I’m getting into the new Aladdin since the clip of <a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DlgrQlO7Us2Q&amp;t=OGQ3NjI3NmQ1ZTc5ZDZlNTYyMDMyNTJlNTM4ZTU1ZDU1NDAzZWJhMSwzNGM1YzBhNjBjY2NhNmFjOTVkZjU4YTViNDQzMDJjMDgyNmUzZWZj\">Will Smith’s Prince Ali</a>, and thus this Au was born.</p><p>Tony Stark as Genie</p><p>Peter Parker as Aladdin</p><p><b>I mean Imagine:</b></p><ul><li>In my version, No Jasmine, unless y’all want that trope. MJ would be a good candidate.</li><li>My idea was that this version of Agrabah, <i>(or New York)</i> has been the main city of crime for years, aside from all the rich cats, who pretty much have it all and give away none of it.</li><li>And in the middle of it all, poor Street Rat, Peter Parker is orphaned and alone in the large city. Constantly being picked on and mugged, even when he’s got nothing to offer. But, he always stands up for the ones who can’t fight back.</li><li>One day, he was approached by Adrian Toomes who offered him a large sum of money if he goes into the Ancient Ruined Tower, that only allows those with a heroes heart to enter, and retrieves an old, broken <i>Arc Reactor</i>.</li><li>With his pure heart, Peter was able to enter the tower and retrieve the reactor. However, when Toomes entered and tried to steal the reactor away, the Tower sensed his dark heart, and banished him out. In the process, locking Peter and the Arc Reactor inside the tower.</li><li>While trapped inside, Peter found tools and managed to fix the strange device, which released the hero: Iron Man.</li><li>For setting him free, and proving himself worthy, Iron Man offered Peter any power that he desired.</li><li>The only thing Peter really wanted to use his power for, was to help out all the little guys, to save more than he could before.</li><li>And thus, Tony gave Peter a suit to conceal his identity and granted him the powers of a Spider.</li><li>Using his powers, Spider-Man brought hope to the people of New York.</li><li>And of course, Tony being all: <i>“You may look like a hero on the outside but I didn’t change anything on the inside”</i></li></ul><p>Yada, Yada! You know the rest.</p><p>I’m just giving the idea here. Feel free to add on.</p><p>My idea for the ending, is when Peter wished Tony to be set free from the Arc Reactor, Tony decides to adopt him.</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "snowflake251",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#009FFE",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/7971cf72dd77383fe76bc3f6ce7bc973/xnsbguy/qNbp9v89b/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/7971cf72dd77383fe76bc3f6ce7bc973/xnsbguy/qNbp9v89b/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/7971cf72dd77383fe76bc3f6ce7bc973/xnsbguy/qNbp9v89b/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Sans Serif",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881291980"
                },
                "content_raw": "<p><h1>IronDad &amp; SpiderSon Aladdin</h1><p>Okay, so I’m getting into the new Aladdin since the clip of <a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DlgrQlO7Us2Q&amp;t=OGQ3NjI3NmQ1ZTc5ZDZlNTYyMDMyNTJlNTM4ZTU1ZDU1NDAzZWJhMSwzNGM1YzBhNjBjY2NhNmFjOTVkZjU4YTViNDQzMDJjMDgyNmUzZWZj\">Will Smith’s Prince Ali</a>, and thus this Au was born.</p><p>Tony Stark as Genie</p><p>Peter Parker as Aladdin</p><p><b>I mean Imagine:</b></p><ul><li>In my version, No Jasmine, unless y’all want that trope. MJ would be a good candidate.</li><li>My idea was that this version of Agrabah, <i>(or New York)</i> has been the main city of crime for years, aside from all the rich cats, who pretty much have it all and give away none of it.</li><li>And in the middle of it all, poor Street Rat, Peter Parker is orphaned and alone in the large city. Constantly being picked on and mugged, even when he’s got nothing to offer. But, he always stands up for the ones who can’t fight back.</li><li>One day, he was approached by Adrian Toomes who offered him a large sum of money if he goes into the Ancient Ruined Tower, that only allows those with a heroes heart to enter, and retrieves an old, broken <i>Arc Reactor</i>.</li><li>With his pure heart, Peter was able to enter the tower and retrieve the reactor. However, when Toomes entered and tried to steal the reactor away, the Tower sensed his dark heart, and banished him out. In the process, locking Peter and the Arc Reactor inside the tower.</li><li>While trapped inside, Peter found tools and managed to fix the strange device, which released the hero: Iron Man.</li><li>For setting him free, and proving himself worthy, Iron Man offered Peter any power that he desired.</li><li>The only thing Peter really wanted to use his power for, was to help out all the little guys, to save more than he could before.</li><li>And thus, Tony gave Peter a suit to conceal his identity and granted him the powers of a Spider.</li><li>Using his powers, Spider-Man brought hope to the people of New York.</li><li>And of course, Tony being all: <i>“You may look like a hero on the outside but I didn’t change anything on the inside”</i></li></ul><p>Yada, Yada! You know the rest.</p><p>I’m just giving the idea here. Feel free to add on.</p><p>My idea for the ending, is when Peter wished Tony to be set free from the Arc Reactor, Tony decides to adopt him.</p></p>",
                "content": "<p><h1>IronDad &amp; SpiderSon Aladdin</h1><p>Okay, so I&rsquo;m getting into the new Aladdin since the clip of <a href=\"https://t.umblr.com/redirect?z=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DlgrQlO7Us2Q&amp;t=OGQ3NjI3NmQ1ZTc5ZDZlNTYyMDMyNTJlNTM4ZTU1ZDU1NDAzZWJhMSwzNGM1YzBhNjBjY2NhNmFjOTVkZjU4YTViNDQzMDJjMDgyNmUzZWZj\">Will Smith&rsquo;s Prince Ali</a>, and thus this Au was born.</p><p>Tony Stark as Genie</p><p>Peter Parker as Aladdin</p><p><b>I mean Imagine:</b></p><ul><li>In my version, No Jasmine, unless y&rsquo;all want that trope. MJ would be a good candidate.</li><li>My idea was that this version of Agrabah, <i>(or New York)</i> has been the main city of crime for years, aside from all the rich cats, who pretty much have it all and give away none of it.</li><li>And in the middle of it all, poor Street Rat, Peter Parker is orphaned and alone in the large city. Constantly being picked on and mugged, even when he&rsquo;s got nothing to offer. But, he always stands up for the ones who can&rsquo;t fight back.</li><li>One day, he was approached by Adrian Toomes who offered him a large sum of money if he goes into the Ancient Ruined Tower, that only allows those with a heroes heart to enter, and retrieves an old, broken&nbsp;<i>Arc Reactor</i>.</li><li>With his pure heart, Peter was able to enter the tower and retrieve the reactor. However, when Toomes entered and tried to steal the reactor away, the Tower sensed his dark heart, and banished him out. In the process, locking Peter and the Arc Reactor inside the tower.</li><li>While trapped inside, Peter found tools and managed to fix the strange device, which released the hero: Iron Man.</li><li>For setting him free, and proving himself worthy, Iron Man offered Peter any power that he desired.</li><li>The only thing Peter really wanted to use his power for, was to help out all the little guys, to save more than he could before.</li><li>And thus, Tony gave Peter a suit to conceal his identity and granted him the powers of a Spider.</li><li>Using his powers, Spider-Man brought hope to the people of New York.</li><li>And of course, Tony being all:&nbsp;<i>&ldquo;You may look like a hero on the outside but I didn&rsquo;t change anything on the inside&rdquo;</i></li></ul><p>Yada, Yada! You know the rest.</p><p>I&rsquo;m just giving the idea here. Feel free to add on.</p><p>My idea for the ending, is when Peter wished Tony to be set free from the Arc Reactor, Tony decides to adopt him.</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "fanfrick-and-beyond",
        "blog": {
            "name": "fanfrick-and-beyond",
            "title": "I’m A Fangirl With About A Million Causes",
            "description": "<p>|Jules|20|Texas|I am in more fandoms than I can keep track of at this point|Love film|Love music|Christian|</p>",
            "url": "https://fanfrick-and-beyond.tumblr.com/",
            "uuid": "t:5hWmGPjLffjVy2R7qnDe7g",
            "updated": 1561692678
        },
        "id": 184881286639,
        "post_url": "https://fanfrick-and-beyond.tumblr.com/post/184881286639/so-after-a-nice-conversation-with-irisseireth",
        "slug": "so-after-a-nice-conversation-with-irisseireth",
        "date": "2019-05-14 22:52:15 GMT",
        "timestamp": 1557874335,
        "state": "published",
        "format": "html",
        "reblog_key": "5f2rUmut",
        "tags": [
            "marvel",
            "mcu",
            "tony stark",
            "i love and appreciate all Iron Man movies",
            "iron man",
            "iron man 2",
            "iron man 3",
            "robert downy jr",
            "rdj",
            "funny",
            "avengers",
            "tony stark appreciation post",
            "pepper potts",
            "rescue",
            "gwyneth paltrow",
            "james rhodes",
            "rhodey",
            "war machine",
            "iron patriot",
            "ben kingsley",
            "micky rourke",
            "jeff bridges",
            "guy pierce",
            "sam rockwell",
            "justin hammer",
            "whiplash",
            "jon favreau",
            "happy hogan",
            "black widow",
            "scarlett johansson"
        ],
        "short_url": "https://tmblr.co/ZcMDae2iBo8tl",
        "summary": "So after a nice conversation with @irisseireth I’ve decided to make a post dedicated to any and all of the best Tony Stark...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 5,
        "title": null,
        "body": "<h1>Iron Man Appreciation Post:</h1><p>So after a nice conversation with <a class=\"tumblelog\" href=\"https://tmblr.co/m_44Crcp0nuFgknENhxwxHA\">@irisseireth</a> I’ve decided to make a post dedicated to any and all of the best Tony Stark moments or moments from the Iron Man trilogy altogether. Feel free to drop any favorite one-liner, expression, or moments of him with another character here. It can be in a gifset or whatever works for you. </p><figure class=\"tmblr-full\" data-orig-height=\"206\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/411c59da834690de5cc07bea8e60399f/tumblr_prizq1zVDA1ug6bap_540.gif\" data-orig-height=\"206\" data-orig-width=\"500\"/></figure>",
        "reblog": {
            "comment": "<p><h1>Iron Man Appreciation Post:</h1><p>So after a nice conversation with <a class=\"tumblelog\" href=\"https://tmblr.co/m_44Crcp0nuFgknENhxwxHA\">@irisseireth</a> I’ve decided to make a post dedicated to any and all of the best Tony Stark moments or moments from the Iron Man trilogy altogether. Feel free to drop any favorite one-liner, expression, or moments of him with another character here. It can be in a gifset or whatever works for you. </p><figure class=\"tmblr-full\" data-orig-height=\"206\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/411c59da834690de5cc07bea8e60399f/tumblr_prizq1zVDA1ug6bap_540.gif\" data-orig-height=\"206\" data-orig-width=\"500\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fanfrick-and-beyond",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#1B95C4",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/eadd63c426b79ce365c77f0010e7909a/qlmtwbc/tITpqr9dk/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/eadd63c426b79ce365c77f0010e7909a/qlmtwbc/tITpqr9dk/tumblr_static__2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/eadd63c426b79ce365c77f0010e7909a/qlmtwbc/tITpqr9dk/tumblr_static__2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#E5F8FF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#E1F4FF",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881286639"
                },
                "content_raw": "<p><h1>Iron Man Appreciation Post:</h1><p>So after a nice conversation with <a class=\"tumblelog\" href=\"https://tmblr.co/m_44Crcp0nuFgknENhxwxHA\">@irisseireth</a> I’ve decided to make a post dedicated to any and all of the best Tony Stark moments or moments from the Iron Man trilogy altogether. Feel free to drop any favorite one-liner, expression, or moments of him with another character here. It can be in a gifset or whatever works for you. </p><figure class=\"tmblr-full\" data-orig-height=\"206\" data-orig-width=\"500\"><img src=\"https://66.media.tumblr.com/411c59da834690de5cc07bea8e60399f/tumblr_prizq1zVDA1ug6bap_540.gif\" data-orig-height=\"206\" data-orig-width=\"500\"></figure></p>",
                "content": "<p><h1>Iron Man Appreciation Post:</h1><p>So after a nice conversation with <a href=\"https://tmblr.co/m_44Crcp0nuFgknENhxwxHA\">@irisseireth</a> I&rsquo;ve decided to make a post dedicated to any and all of the best Tony Stark moments or moments from the Iron Man trilogy altogether. Feel free to drop any favorite one-liner, expression, or moments of him with another character here. It can be in a gifset or whatever works for you. </p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/411c59da834690de5cc07bea8e60399f/tumblr_prizq1zVDA1ug6bap_540.gif\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "delicatewastelandperson",
        "blog": {
            "name": "delicatewastelandperson",
            "title": "Welcome To My Tumblaaaaaaaaaaaaa?!?",
            "description": "<p>This tumblr is a mess. It’s either super political and serious or ranting about the latest marvel and dc movie Soooooooooo 🙃</p>",
            "url": "https://delicatewastelandperson.tumblr.com/",
            "uuid": "t:QCbbltItbru73ds3Iw1pqQ",
            "updated": 1560980542
        },
        "id": 184881157378,
        "post_url": "https://delicatewastelandperson.tumblr.com/post/184881157378",
        "slug": "",
        "date": "2019-05-14 22:45:12 GMT",
        "timestamp": 1557873912,
        "state": "published",
        "format": "html",
        "reblog_key": "ArIpWTAB",
        "tags": [
            "iron man",
            "avengers",
            "thor odinson",
            "thor",
            "avengers 4",
            "avengers endgame",
            "tony stark",
            "the big lebowski",
            "lol"
        ],
        "short_url": "https://tmblr.co/ZhLKJk2iBnfK2",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 8,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"654\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/914a31ed6a2ffa42f0465974bfb78fd2/tumblr_prin7cViuH1tw7yss_540.jpg\" data-orig-height=\"654\" data-orig-width=\"720\"/></figure>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"654\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/914a31ed6a2ffa42f0465974bfb78fd2/tumblr_prin7cViuH1tw7yss_540.jpg\" data-orig-height=\"654\" data-orig-width=\"720\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "delicatewastelandperson",
                    "active": true,
                    "theme": {
                        "header_full_width": 245,
                        "header_full_height": 250,
                        "header_focus_width": 230,
                        "header_focus_height": 130,
                        "avatar_shape": "square",
                        "background_color": "#5C2F69",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "25,239,155,9",
                        "header_image": "https://static.tumblr.com/c3973d483ff7150b7f3bc55a062be013/znkyu3c/zxDpg50jz/tumblr_static_.gif",
                        "header_image_focused": "https://static.tumblr.com/c3973d483ff7150b7f3bc55a062be013/znkyu3c/7Dspg50k0/tumblr_static_tumblr_static__focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/c3973d483ff7150b7f3bc55a062be013/znkyu3c/zxDpg50jz/tumblr_static__2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#B4D5E9",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#9ABBD0",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881157378"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"654\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/914a31ed6a2ffa42f0465974bfb78fd2/tumblr_prin7cViuH1tw7yss_540.jpg\" data-orig-height=\"654\" data-orig-width=\"720\"></figure></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/914a31ed6a2ffa42f0465974bfb78fd2/tumblr_prin7cViuH1tw7yss_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "red-king-4",
        "blog": {
            "name": "red-king-4",
            "title": "Red King",
            "description": "Icon by @devilguineapig |\n\n\n||Unidad, Fe y Disciplina ||",
            "url": "https://red-king-4.tumblr.com/",
            "uuid": "t:F5AJjeEFuk7Ew0Tpbi3rIg",
            "updated": 1561760930
        },
        "id": 184881142420,
        "post_url": "https://red-king-4.tumblr.com/post/184881142420",
        "slug": "",
        "date": "2019-05-14 22:44:22 GMT",
        "timestamp": 1557873862,
        "state": "published",
        "format": "html",
        "reblog_key": "RIDf8RIc",
        "tags": [
            "Marvel",
            "Iron man",
            "Yinsen",
            "Mcu",
            "Muslim",
            "Hero"
        ],
        "short_url": "https://tmblr.co/ZHAkio2iBnbgK",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 9,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"699\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/4afcd59e7fe8cf9691f546e495be404a/tumblr_prin5yDuAO1sxuvc2_540.png\" data-orig-height=\"699\" data-orig-width=\"1080\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1264\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/2fa86e6ad9bfe3152bf45a19558af3cf/tumblr_prin5xt9yL1sxuvc2_540.png\" data-orig-height=\"1264\" data-orig-width=\"1080\"/></figure>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"699\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/4afcd59e7fe8cf9691f546e495be404a/tumblr_prin5yDuAO1sxuvc2_540.png\" data-orig-height=\"699\" data-orig-width=\"1080\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1264\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/2fa86e6ad9bfe3152bf45a19558af3cf/tumblr_prin5xt9yL1sxuvc2_540.png\" data-orig-height=\"1264\" data-orig-width=\"1080\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "red-king-4",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#4A0C22",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/e1ebabb3ac3ad1dec96b19ccf7287b8b/wgmo63x/0Jcoz6b6e/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/e1ebabb3ac3ad1dec96b19ccf7287b8b/wgmo63x/0Jcoz6b6e/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/e1ebabb3ac3ad1dec96b19ccf7287b8b/wgmo63x/0Jcoz6b6e/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#4BB0ED",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#F7F7F7",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881142420"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"699\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/4afcd59e7fe8cf9691f546e495be404a/tumblr_prin5yDuAO1sxuvc2_540.png\" data-orig-height=\"699\" data-orig-width=\"1080\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1264\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/2fa86e6ad9bfe3152bf45a19558af3cf/tumblr_prin5xt9yL1sxuvc2_540.png\" data-orig-height=\"1264\" data-orig-width=\"1080\"></figure></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/4afcd59e7fe8cf9691f546e495be404a/tumblr_prin5yDuAO1sxuvc2_540.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/2fa86e6ad9bfe3152bf45a19558af3cf/tumblr_prin5xt9yL1sxuvc2_540.png\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "marvel3thousand",
        "blog": {
            "name": "marvel3thousand",
            "title": "wetried.jpg",
            "description": "hi! im a dumbass marvel stan, i post headcanons and dumb shit",
            "url": "https://marvel3thousand.tumblr.com/",
            "uuid": "t:-YLcHVfUVlqPKR-ejOSyew",
            "updated": 1559186527
        },
        "id": 184881130640,
        "post_url": "https://marvel3thousand.tumblr.com/post/184881130640/ok-but-imagine-an-endgame-that-wasnt-the-end-of",
        "slug": "ok-but-imagine-an-endgame-that-wasnt-the-end-of",
        "date": "2019-05-14 22:43:42 GMT",
        "timestamp": 1557873822,
        "state": "published",
        "format": "html",
        "reblog_key": "9hsqRbOH",
        "tags": [
            "endgame spoilers",
            "can you tell who i stan the most",
            "anthony edward stark is a legend",
            "iron man",
            "thor",
            "nat",
            "clint",
            "bruce",
            "im sorry i HATED professor hulk",
            "cap",
            "ill probably add more/edit this is pure shit",
            "endgame",
            "endgame au",
            "?????"
        ],
        "short_url": "https://tmblr.co/ZFZ25e2iBnYoG",
        "summary": "ok but imagine an Endgame that wasn’t the end of an era but a renewal, a beginning of something new ENDGAME SPOILERS AHEAD PLS...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1,
        "title": null,
        "body": "<p>ok but imagine an Endgame that wasn’t the end of an era but a renewal, a beginning of something new</p><p>ENDGAME SPOILERS AHEAD PLS DONT READ IF YOU HAVENT WATCHED </p><p>so life changes for the OG6, but goes on </p><p>if I had a hand in writing this, it would primarily be about shifting the OG character’s roles</p><p><br/></p><p><br/></p><p>for bruce/hulk or professor hulk ig: </p><p>he snaps his fingers and his body and his mind stretch. he feels the energy of the universe coursing through his veins and mixing with the gamma radiation woven into his cells; he wills the fallen home. they return, but it burns. </p><p>the radiation is used up in the process, ripped from his cells. he’s not sure how, but he’s not very interested.</p><p>hulk is still with him; they are still one but he is no longer big and green. they’re alright. </p><p>bruce moves on, continuing to search for ways to help people. he does research on everything under the sun. he helps analyse asgardian anatomy and biology, allowing their healers to acclimate to earth’s medicine. he goes back to india, this time with stark industries resources behind him to help the same people he had been unable to help before. </p><p>the world learned to love the hulk, and now that he seems to be gone, they learn to love dr. banner too</p><p><br/></p><p><br/></p><p>for thor: </p><p>valkyrie lands the ship on earth days after the decimation, after he’s killed thanos. he’s numb from the losses he has already faced only to find his people have been halved yet again. </p><p>he is their king. he settles the matter of settlement, the matter of trade and food, he negotiates and delegates and works day and night to protect them. but he never speaks to them, returning only in the dead of night to drink in loneliness. </p><p>he loses himself more and more for the next years, meeting with the avengers even less. he speaks only with valkyrie, who settles matters on his behalf. she doesn’t know how to help him, she couldn’t help herself. </p><p>the avengers find him like this, telling him they have time travel, they can undo the deaths. except they can’t. unlike the majority of the universe, his loved ones, his people were slaughtered. when the dusted come back they will not be returned to him. </p><p>he convinces himself, for their sakes, that this is a sweeter revenge. that undoing his life’s work will harm thanos more severely than an axe in the chest.</p><p>then they win. </p><p>he rejoices for all the rest of the fallen that have risen, truly and honestly, but half of his people, his brother, his friends are still dead. he’s empty and broken, but not alone anymore.</p><p>somewhere in the heat of battle he realized how he had missed the avengers nearly as much as the dead, though they were right there waiting for him. </p><p>he is reassured to know he’s still worthy still of his own power, worthy of his rank among earth’s mightiest heroes and now he wishes to be worthy of his people’s trust. </p><p>the battle is won. revenge has been taken for his fallen but now he must take care of his living. he was not desperate for the crown, but he devotes himself to being a good king and a good man. learning the balance with some help from t’challa. </p><p>though his heart is with his people, he is still an avenger always, and he loves his second family. they all build up asgardia together. </p><p><br/></p><p><br/></p><p>for clint:</p><p>his shift is more simple, one he’s been promising to make for years. he’s retiring from the avengers business, actually this time. when he tells them all, they laugh. he does too. </p><p>he moves his family to new york. his kids are older, and he wants them to get a good education. \n\nthe farm was safe but now it feels isolated.\n\nin new york there are plenty criminals and enemies lurking in alleyways, but there are many more heroes.</p><p>so he takes out a few muggers, it’s just low level crime. no one is complaining and he’s certainly not breaking <i>too much </i>of a sweat. </p><p>sure clint can’t do this forever; he’s getting older. but so is lila, and she’s a damn good shot. </p><p><br/></p><p><br/></p><p>for natasha:</p><p>in all honesty, she hasn’t been a spy for a long time. </p><p>she’s already given away her box of secrets and lies don’t come without a cost. she isn’t inclined to pay any extra fees.</p><p> for 5 years she sits in the compound, solving problems, big and small, keeping everyone together when they are universes apart. she clings tight to the ones she still has.</p><p>she tells steve that she can’t lose <i>this</i>, can’t lose being an avenger. but being an avenger was never something she could lose, she could only lose them. </p><p>then scott appears, and they come together again. she’s never been so relieved in her life. </p><p>these last 5 years have made her a better leader and a teacher. she’s not the strongest of gods, mutants, and super soldiers, but she’s never had to be. her job was always people and she’s damn good at it. </p><p>she is one of the originals. the avengers, the mightiest heroes of earth, trust her. as new kids bounce into the game on the heels of their older brothers, sisters, fathers and mothers, they don’t hesitate to call aunt nat for help. peter parker, the suspiciously familiar new hawkeye, harley keener, kamala khan and so many other come through her open door. she teaches them.</p><p>she was born the black widow, and now she’s learned to be natasha. </p><p><br/></p><p><br/></p><p><br/></p><p>for cap:</p><p>there’s the problem of the soul stone. a sacrifice needs to be made. cap knows which one.</p><p>he looks tony in the eye and tells them that he will take care of it. they all blink at him. he tells them he will come home. they don’t believe him, but he is stubborn.</p><p>he stares the ghost of his past in the face and he thinks that this must be a sign. he walks straight to the edge and he whispers “you can have him”. the stone hears him.</p><p>his whole body is on fire for a second and he falls to his knees. they ache.</p><p>captain america went to the cliff, and steven grant rogers came home. he smiles, soul stone in hand.</p><p>bucky comes home, and hugs him tight, and steve laughs as he mutters “i swear you were bigger”</p><p>he becomes an activist, steve rogers was the fighter, the captain was a soldier. there’s a difference. he’s a leader, he works with nat often to help the new heroes.</p><p>steve has everything and everyone he needs right there. he hands the shield to sam with a grin, “don’t lose it,” he advises, “but one day you can hand it over.” it’s honest advice. </p><p><br/></p><p><br/></p><p>for tony:</p><p>he comes home on a ship with nebula. she’s a sweet woman, capable of such kindness but depraved of it. </p><p>he screams at steve. they could have saved everyone if they had just listened to him. if steve had believed in him, trusted him, they wouldn’t be in this mess. </p><p>he faints, waking up to hear good and bad news. thanos is dead. they can’t bring them back. </p><p>that day, when he wakes up in the hospital room, pepper is there and so is may. he apologizes over and over. she shakes her head and hands him a picture frame. he remembers it. peter had rambled on about the picture, explaining that bunny ears were different than a peace sign. tony had only laughed, not having the heart to tell him he knew that. </p><p>he stares at the picture, wanting to hug it tight so badly but not having the strength to tear his eyes away. </p><p>finally he puts it in his lap, he calls harley and gets him and his sister the first flight to new york. </p><p>he helps thor settle the refugees and integrate them into society. supplying them with whatever they need. though he tries to speak to him face to face, he finds himself speaking to valkyrie instead. he keeps trying.</p><p>harley is nearly an adult, and incredibly independant. he and his sister move to new york. tony helps him and his sister settle and sets them up at school. he hires harley as soon as he starts looking for a job. </p><p>he keeps a close eye on nebula and rhodey. they are far away, too far. he can barely handle the distance. pepper very gently tells him he’s clinging too tight but he finds himself anxiously worrying over their safety every time they go on a mission. he never figures out how to get rid of that. </p><p>of course, he and pepper start a family. morgan is born. she’s lovely and smart and too fast. she’s growing up to fast. he’s scared she’ll be gone if he blinks too slowly. </p><p>though they stay in new york and remain active in the community, the starks fade into the background like the rest of the avengers during those 5 years. it’s hard to care for heroes and celebrities these days. natasha visits often, with a worn but genuine smile. rhodey spoils her rotten. nebula is oddly charming with her blunt nature. morgan loves her aunts and uncles. </p><p>then steve comes, knocking down his door telling him that time travel is possible. tony disagrees and ends the conversation there. </p><p>then he looks at peter’s picture on the mantle; it wouldn’t hurt to try. </p><p>he figures it out of course, and the plan works. they retrieve the stones, and revive the fallen, but then comes the battle. this time, when he snaps his fingers, he falls limp, and wakes up in the same cot. </p><p>peter is sitting there as he comes to, grinning, telling him they won. </p><p>tony looks at his right arm, it’s absolutely fried, he can barely feel it. there’s far more damage, his heart is weaker. it’s understandable, given all he’s gone through. it’s too weak for him to be flying around fighting petty crime lords. </p><p>so he retires iron man. he goes back to stark industries and service. he begins experimenting with emergency medical nanotech, with shields and defensive measures for earth, with new medical care and programs for those in poverty. he builds armor for every new hero. he’s the futurist and these kids meant to be their future. he creates a program for the orphans and victims of the snap who didn’t get their loved ones back. </p><p>iron man has retired, but no one misses him. they watch as tony stark builds a suit of armor around the world. </p>",
        "reblog": {
            "comment": "<p>ok but imagine an Endgame that wasn’t the end of an era but a renewal, a beginning of something new</p><p>ENDGAME SPOILERS AHEAD PLS DONT READ IF YOU HAVENT WATCHED </p><p>so life changes for the OG6, but goes on </p><p>if I had a hand in writing this, it would primarily be about shifting the OG character’s roles</p><p><br></p><p><br></p><p>for bruce/hulk or professor hulk ig: </p><p>he snaps his fingers and his body and his mind stretch. he feels the energy of the universe coursing through his veins and mixing with the gamma radiation woven into his cells; he wills the fallen home. they return, but it burns. </p><p>the radiation is used up in the process, ripped from his cells. he’s not sure how, but he’s not very interested.</p><p>hulk is still with him; they are still one but he is no longer big and green. they’re alright. </p><p>bruce moves on, continuing to search for ways to help people. he does research on everything under the sun. he helps analyse asgardian anatomy and biology, allowing their healers to acclimate to earth’s medicine. he goes back to india, this time with stark industries resources behind him to help the same people he had been unable to help before. </p><p>the world learned to love the hulk, and now that he seems to be gone, they learn to love dr. banner too</p><p><br></p><p><br></p><p>for thor: </p><p>valkyrie lands the ship on earth days after the decimation, after he’s killed thanos. he’s numb from the losses he has already faced only to find his people have been halved yet again. </p><p>he is their king. he settles the matter of settlement, the matter of trade and food, he negotiates and delegates and works day and night to protect them. but he never speaks to them, returning only in the dead of night to drink in loneliness. </p><p>he loses himself more and more for the next years, meeting with the avengers even less. he speaks only with valkyrie, who settles matters on his behalf. she doesn’t know how to help him, she couldn’t help herself. </p><p>the avengers find him like this, telling him they have time travel, they can undo the deaths. except they can’t. unlike the majority of the universe, his loved ones, his people were slaughtered. when the dusted come back they will not be returned to him. </p><p>he convinces himself, for their sakes, that this is a sweeter revenge. that undoing his life’s work will harm thanos more severely than an axe in the chest.</p><p>then they win. </p><p>he rejoices for all the rest of the fallen that have risen, truly and honestly, but half of his people, his brother, his friends are still dead. he’s empty and broken, but not alone anymore.</p><p>somewhere in the heat of battle he realized how he had missed the avengers nearly as much as the dead, though they were right there waiting for him. </p><p>he is reassured to know he’s still worthy still of his own power, worthy of his rank among earth’s mightiest heroes and now he wishes to be worthy of his people’s trust. </p><p>the battle is won. revenge has been taken for his fallen but now he must take care of his living. he was not desperate for the crown, but he devotes himself to being a good king and a good man. learning the balance with some help from t’challa. </p><p>though his heart is with his people, he is still an avenger always, and he loves his second family. they all build up asgardia together. </p><p><br></p><p><br></p><p>for clint:</p><p>his shift is more simple, one he’s been promising to make for years. he’s retiring from the avengers business, actually this time. when he tells them all, they laugh. he does too. </p><p>he moves his family to new york. his kids are older, and he wants them to get a good education. \n\nthe farm was safe but now it feels isolated.\n\nin new york there are plenty criminals and enemies lurking in alleyways, but there are many more heroes.</p><p>so he takes out a few muggers, it’s just low level crime. no one is complaining and he’s certainly not breaking <i>too much </i>of a sweat. </p><p>sure clint can’t do this forever; he’s getting older. but so is lila, and she’s a damn good shot. </p><p><br></p><p><br></p><p>for natasha:</p><p>in all honesty, she hasn’t been a spy for a long time. </p><p>she’s already given away her box of secrets and lies don’t come without a cost. she isn’t inclined to pay any extra fees.</p><p> for 5 years she sits in the compound, solving problems, big and small, keeping everyone together when they are universes apart. she clings tight to the ones she still has.</p><p>she tells steve that she can’t lose <i>this</i>, can’t lose being an avenger. but being an avenger was never something she could lose, she could only lose them. </p><p>then scott appears, and they come together again. she’s never been so relieved in her life. </p><p>these last 5 years have made her a better leader and a teacher. she’s not the strongest of gods, mutants, and super soldiers, but she’s never had to be. her job was always people and she’s damn good at it. </p><p>she is one of the originals. the avengers, the mightiest heroes of earth, trust her. as new kids bounce into the game on the heels of their older brothers, sisters, fathers and mothers, they don’t hesitate to call aunt nat for help. peter parker, the suspiciously familiar new hawkeye, harley keener, kamala khan and so many other come through her open door. she teaches them.</p><p>she was born the black widow, and now she’s learned to be natasha. </p><p><br></p><p><br></p><p><br></p><p>for cap:</p><p>there’s the problem of the soul stone. a sacrifice needs to be made. cap knows which one.</p><p>he looks tony in the eye and tells them that he will take care of it. they all blink at him. he tells them he will come home. they don’t believe him, but he is stubborn.</p><p>he stares the ghost of his past in the face and he thinks that this must be a sign. he walks straight to the edge and he whispers “you can have him”. the stone hears him.</p><p>his whole body is on fire for a second and he falls to his knees. they ache.</p><p>captain america went to the cliff, and steven grant rogers came home. he smiles, soul stone in hand.</p><p>bucky comes home, and hugs him tight, and steve laughs as he mutters “i swear you were bigger”</p><p>he becomes an activist, steve rogers was the fighter, the captain was a soldier. there’s a difference. he’s a leader, he works with nat often to help the new heroes.</p><p>steve has everything and everyone he needs right there. he hands the shield to sam with a grin, “don’t lose it,” he advises, “but one day you can hand it over.” it’s honest advice. </p><p><br></p><p><br></p><p>for tony:</p><p>he comes home on a ship with nebula. she’s a sweet woman, capable of such kindness but depraved of it. </p><p>he screams at steve. they could have saved everyone if they had just listened to him. if steve had believed in him, trusted him, they wouldn’t be in this mess. </p><p>he faints, waking up to hear good and bad news. thanos is dead. they can’t bring them back. </p><p>that day, when he wakes up in the hospital room, pepper is there and so is may. he apologizes over and over. she shakes her head and hands him a picture frame. he remembers it. peter had rambled on about the picture, explaining that bunny ears were different than a peace sign. tony had only laughed, not having the heart to tell him he knew that. </p><p>he stares at the picture, wanting to hug it tight so badly but not having the strength to tear his eyes away. </p><p>finally he puts it in his lap, he calls harley and gets him and his sister the first flight to new york. </p><p>he helps thor settle the refugees and integrate them into society. supplying them with whatever they need. though he tries to speak to him face to face, he finds himself speaking to valkyrie instead. he keeps trying.</p><p>harley is nearly an adult, and incredibly independant. he and his sister move to new york. tony helps him and his sister settle and sets them up at school. he hires harley as soon as he starts looking for a job. </p><p>he keeps a close eye on nebula and rhodey. they are far away, too far. he can barely handle the distance. pepper very gently tells him he’s clinging too tight but he finds himself anxiously worrying over their safety every time they go on a mission. he never figures out how to get rid of that. </p><p>of course, he and pepper start a family. morgan is born. she’s lovely and smart and too fast. she’s growing up to fast. he’s scared she’ll be gone if he blinks too slowly. </p><p>though they stay in new york and remain active in the community, the starks fade into the background like the rest of the avengers during those 5 years. it’s hard to care for heroes and celebrities these days. natasha visits often, with a worn but genuine smile. rhodey spoils her rotten. nebula is oddly charming with her blunt nature. morgan loves her aunts and uncles. </p><p>then steve comes, knocking down his door telling him that time travel is possible. tony disagrees and ends the conversation there. </p><p>then he looks at peter’s picture on the mantle; it wouldn’t hurt to try. </p><p>he figures it out of course, and the plan works. they retrieve the stones, and revive the fallen, but then comes the battle. this time, when he snaps his fingers, he falls limp, and wakes up in the same cot. </p><p>peter is sitting there as he comes to, grinning, telling him they won. </p><p>tony looks at his right arm, it’s absolutely fried, he can barely feel it. there’s far more damage, his heart is weaker. it’s understandable, given all he’s gone through. it’s too weak for him to be flying around fighting petty crime lords. </p><p>so he retires iron man. he goes back to stark industries and service. he begins experimenting with emergency medical nanotech, with shields and defensive measures for earth, with new medical care and programs for those in poverty. he builds armor for every new hero. he’s the futurist and these kids meant to be their future. he creates a program for the orphans and victims of the snap who didn’t get their loved ones back. </p><p>iron man has retired, but no one misses him. they watch as tony stark builds a suit of armor around the world. </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "marvel3thousand",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#830e10",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/6beff730b4a4b1453b73b7b031ce521b/5beffvw/XjNpqr405/tumblr_static_366ixa1cxyiogcco48g84oss0.jpg",
                        "header_image_focused": "https://static.tumblr.com/6beff730b4a4b1453b73b7b031ce521b/5beffvw/XjNpqr405/tumblr_static_366ixa1cxyiogcco48g84oss0_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/6beff730b4a4b1453b73b7b031ce521b/5beffvw/XjNpqr405/tumblr_static_366ixa1cxyiogcco48g84oss0_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#072e45",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#28041f",
                        "title_font": "Brutal Type",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881130640"
                },
                "content_raw": "<p>ok but imagine an Endgame that wasn’t the end of an era but a renewal, a beginning of something new</p><p>ENDGAME SPOILERS AHEAD PLS DONT READ IF YOU HAVENT WATCHED </p><p>so life changes for the OG6, but goes on </p><p>if I had a hand in writing this, it would primarily be about shifting the OG character’s roles</p><p><br></p><p><br></p><p>for bruce/hulk or professor hulk ig: </p><p>he snaps his fingers and his body and his mind stretch. he feels the energy of the universe coursing through his veins and mixing with the gamma radiation woven into his cells; he wills the fallen home. they return, but it burns. </p><p>the radiation is used up in the process, ripped from his cells. he’s not sure how, but he’s not very interested.</p><p>hulk is still with him; they are still one but he is no longer big and green. they’re alright. </p><p>bruce moves on, continuing to search for ways to help people. he does research on everything under the sun. he helps analyse asgardian anatomy and biology, allowing their healers to acclimate to earth’s medicine. he goes back to india, this time with stark industries resources behind him to help the same people he had been unable to help before. </p><p>the world learned to love the hulk, and now that he seems to be gone, they learn to love dr. banner too</p><p><br></p><p><br></p><p>for thor: </p><p>valkyrie lands the ship on earth days after the decimation, after he’s killed thanos. he’s numb from the losses he has already faced only to find his people have been halved yet again. </p><p>he is their king. he settles the matter of settlement, the matter of trade and food, he negotiates and delegates and works day and night to protect them. but he never speaks to them, returning only in the dead of night to drink in loneliness. </p><p>he loses himself more and more for the next years, meeting with the avengers even less. he speaks only with valkyrie, who settles matters on his behalf. she doesn’t know how to help him, she couldn’t help herself. </p><p>the avengers find him like this, telling him they have time travel, they can undo the deaths. except they can’t. unlike the majority of the universe, his loved ones, his people were slaughtered. when the dusted come back they will not be returned to him. </p><p>he convinces himself, for their sakes, that this is a sweeter revenge. that undoing his life’s work will harm thanos more severely than an axe in the chest.</p><p>then they win. </p><p>he rejoices for all the rest of the fallen that have risen, truly and honestly, but half of his people, his brother, his friends are still dead. he’s empty and broken, but not alone anymore.</p><p>somewhere in the heat of battle he realized how he had missed the avengers nearly as much as the dead, though they were right there waiting for him. </p><p>he is reassured to know he’s still worthy still of his own power, worthy of his rank among earth’s mightiest heroes and now he wishes to be worthy of his people’s trust. </p><p>the battle is won. revenge has been taken for his fallen but now he must take care of his living. he was not desperate for the crown, but he devotes himself to being a good king and a good man. learning the balance with some help from t’challa. </p><p>though his heart is with his people, he is still an avenger always, and he loves his second family. they all build up asgardia together. </p><p><br></p><p><br></p><p>for clint:</p><p>his shift is more simple, one he’s been promising to make for years. he’s retiring from the avengers business, actually this time. when he tells them all, they laugh. he does too. </p><p>he moves his family to new york. his kids are older, and he wants them to get a good education. \n\nthe farm was safe but now it feels isolated.\n\nin new york there are plenty criminals and enemies lurking in alleyways, but there are many more heroes.</p><p>so he takes out a few muggers, it’s just low level crime. no one is complaining and he’s certainly not breaking <i>too much </i>of a sweat. </p><p>sure clint can’t do this forever; he’s getting older. but so is lila, and she’s a damn good shot. </p><p><br></p><p><br></p><p>for natasha:</p><p>in all honesty, she hasn’t been a spy for a long time. </p><p>she’s already given away her box of secrets and lies don’t come without a cost. she isn’t inclined to pay any extra fees.</p><p> for 5 years she sits in the compound, solving problems, big and small, keeping everyone together when they are universes apart. she clings tight to the ones she still has.</p><p>she tells steve that she can’t lose <i>this</i>, can’t lose being an avenger. but being an avenger was never something she could lose, she could only lose them. </p><p>then scott appears, and they come together again. she’s never been so relieved in her life. </p><p>these last 5 years have made her a better leader and a teacher. she’s not the strongest of gods, mutants, and super soldiers, but she’s never had to be. her job was always people and she’s damn good at it. </p><p>she is one of the originals. the avengers, the mightiest heroes of earth, trust her. as new kids bounce into the game on the heels of their older brothers, sisters, fathers and mothers, they don’t hesitate to call aunt nat for help. peter parker, the suspiciously familiar new hawkeye, harley keener, kamala khan and so many other come through her open door. she teaches them.</p><p>she was born the black widow, and now she’s learned to be natasha. </p><p><br></p><p><br></p><p><br></p><p>for cap:</p><p>there’s the problem of the soul stone. a sacrifice needs to be made. cap knows which one.</p><p>he looks tony in the eye and tells them that he will take care of it. they all blink at him. he tells them he will come home. they don’t believe him, but he is stubborn.</p><p>he stares the ghost of his past in the face and he thinks that this must be a sign. he walks straight to the edge and he whispers “you can have him”. the stone hears him.</p><p>his whole body is on fire for a second and he falls to his knees. they ache.</p><p>captain america went to the cliff, and steven grant rogers came home. he smiles, soul stone in hand.</p><p>bucky comes home, and hugs him tight, and steve laughs as he mutters “i swear you were bigger”</p><p>he becomes an activist, steve rogers was the fighter, the captain was a soldier. there’s a difference. he’s a leader, he works with nat often to help the new heroes.</p><p>steve has everything and everyone he needs right there. he hands the shield to sam with a grin, “don’t lose it,” he advises, “but one day you can hand it over.” it’s honest advice. </p><p><br></p><p><br></p><p>for tony:</p><p>he comes home on a ship with nebula. she’s a sweet woman, capable of such kindness but depraved of it. </p><p>he screams at steve. they could have saved everyone if they had just listened to him. if steve had believed in him, trusted him, they wouldn’t be in this mess. </p><p>he faints, waking up to hear good and bad news. thanos is dead. they can’t bring them back. </p><p>that day, when he wakes up in the hospital room, pepper is there and so is may. he apologizes over and over. she shakes her head and hands him a picture frame. he remembers it. peter had rambled on about the picture, explaining that bunny ears were different than a peace sign. tony had only laughed, not having the heart to tell him he knew that. </p><p>he stares at the picture, wanting to hug it tight so badly but not having the strength to tear his eyes away. </p><p>finally he puts it in his lap, he calls harley and gets him and his sister the first flight to new york. </p><p>he helps thor settle the refugees and integrate them into society. supplying them with whatever they need. though he tries to speak to him face to face, he finds himself speaking to valkyrie instead. he keeps trying.</p><p>harley is nearly an adult, and incredibly independant. he and his sister move to new york. tony helps him and his sister settle and sets them up at school. he hires harley as soon as he starts looking for a job. </p><p>he keeps a close eye on nebula and rhodey. they are far away, too far. he can barely handle the distance. pepper very gently tells him he’s clinging too tight but he finds himself anxiously worrying over their safety every time they go on a mission. he never figures out how to get rid of that. </p><p>of course, he and pepper start a family. morgan is born. she’s lovely and smart and too fast. she’s growing up to fast. he’s scared she’ll be gone if he blinks too slowly. </p><p>though they stay in new york and remain active in the community, the starks fade into the background like the rest of the avengers during those 5 years. it’s hard to care for heroes and celebrities these days. natasha visits often, with a worn but genuine smile. rhodey spoils her rotten. nebula is oddly charming with her blunt nature. morgan loves her aunts and uncles. </p><p>then steve comes, knocking down his door telling him that time travel is possible. tony disagrees and ends the conversation there. </p><p>then he looks at peter’s picture on the mantle; it wouldn’t hurt to try. </p><p>he figures it out of course, and the plan works. they retrieve the stones, and revive the fallen, but then comes the battle. this time, when he snaps his fingers, he falls limp, and wakes up in the same cot. </p><p>peter is sitting there as he comes to, grinning, telling him they won. </p><p>tony looks at his right arm, it’s absolutely fried, he can barely feel it. there’s far more damage, his heart is weaker. it’s understandable, given all he’s gone through. it’s too weak for him to be flying around fighting petty crime lords. </p><p>so he retires iron man. he goes back to stark industries and service. he begins experimenting with emergency medical nanotech, with shields and defensive measures for earth, with new medical care and programs for those in poverty. he builds armor for every new hero. he’s the futurist and these kids meant to be their future. he creates a program for the orphans and victims of the snap who didn’t get their loved ones back. </p><p>iron man has retired, but no one misses him. they watch as tony stark builds a suit of armor around the world. </p>",
                "content": "<p>ok but imagine an Endgame that wasn&rsquo;t the end of an era but a renewal, a beginning of something new</p><p>ENDGAME SPOILERS AHEAD PLS DONT READ IF YOU HAVENT WATCHED </p><p>so life changes for the OG6, but goes on </p><p>if I had a hand in writing this, it would primarily be about shifting the OG character&rsquo;s roles</p><p><br /></p><p><br /></p><p>for bruce/hulk or professor hulk ig: </p><p>he snaps his fingers and his body and his mind stretch. he feels the energy of the universe coursing through his veins and mixing with the gamma radiation woven into his cells; he wills the fallen home. they return, but it burns.&nbsp;</p><p>the radiation is used up in the process, ripped from his cells. he&rsquo;s not sure how, but he&rsquo;s not very interested.</p><p>hulk is still with him; they are still one but he is no longer big and green. they&rsquo;re alright. </p><p>bruce moves on, continuing to search for ways to help people. he does research on everything under the sun. he helps analyse asgardian anatomy and biology, allowing their healers to acclimate to earth&rsquo;s medicine. he goes back to india, this time with stark industries resources behind him to help the same people he had been unable to help before. </p><p>the world learned to love the hulk, and now that he seems to be gone, they learn to love dr. banner too</p><p><br /></p><p><br /></p><p>for thor: </p><p>valkyrie lands the ship on earth days after the decimation, after he&rsquo;s killed thanos. he&rsquo;s numb from the losses he has already faced only to find his people have been halved yet again.&nbsp;</p><p>he is their king. he settles the matter of settlement, the matter of trade and food, he negotiates and delegates and works day and night to protect them. but he never speaks to them, returning only in the dead of night to drink in loneliness.&nbsp;</p><p>he loses himself more and more for the next years, meeting with the avengers even less. he speaks only with valkyrie, who settles matters on his behalf. she doesn&rsquo;t know how to help him, she couldn&rsquo;t help herself.&nbsp;</p><p>the avengers find him like this, telling him they have time travel, they can undo the deaths. except they can&rsquo;t. unlike the majority of the universe, his loved ones, his people were slaughtered. when the dusted come back they will not be returned to him.&nbsp;</p><p>he convinces himself, for their sakes, that this is a sweeter revenge. that undoing his life&rsquo;s work will harm thanos more severely than an axe in the chest.</p><p>then they win.&nbsp;</p><p>he rejoices for all the rest of the fallen that have risen, truly and honestly, but half of his people, his brother, his friends are still dead. he&rsquo;s empty and broken, but not alone anymore.</p><p>somewhere in the heat of battle he realized how he had missed the avengers nearly as much as the dead, though they were right there waiting for him.&nbsp;</p><p>he is reassured to know he&rsquo;s still worthy still of his own power, worthy of his rank among earth&rsquo;s mightiest heroes and now he wishes to be worthy of his people&rsquo;s trust. </p><p>the battle is won. revenge has been taken for his fallen but now he must take care of his living. he was not desperate for the crown, but he devotes himself to being a good king and a good man. learning the balance with some help from t&rsquo;challa. </p><p>though his heart is with his people, he is still an avenger always, and he loves his second family. they all build up asgardia together. </p><p><br /></p><p><br /></p><p>for clint:</p><p>his shift is more simple, one he&rsquo;s been promising to make for years. he&rsquo;s retiring from the avengers business, actually this time. when he tells them all, they laugh. he does too.&nbsp;</p><p>he moves his family to new york. his kids are older, and he wants them to get a good education. \n\nthe farm was safe but now it feels isolated.\n\nin new york there are plenty criminals and enemies lurking in alleyways, but there are many more heroes.</p><p>so he takes out a few muggers, it&rsquo;s just low level crime. no one is complaining and he&rsquo;s certainly not breaking <i>too much </i>of a sweat. </p><p>sure clint can&rsquo;t do this forever; he&rsquo;s getting older. but so is lila, and she&rsquo;s a damn good shot. </p><p><br /></p><p><br /></p><p>for natasha:</p><p>in all honesty, she hasn&rsquo;t been a spy for a long time.&nbsp;</p><p>she&rsquo;s already given away her box of secrets and lies don&rsquo;t come without a cost. she isn&rsquo;t inclined to pay any extra fees.</p><p>&nbsp;for 5 years she sits in the compound, solving problems, big and small, keeping everyone together when they are universes apart. she clings tight to the ones she still has.</p><p>she tells steve that she can&rsquo;t lose <i>this</i>, can&rsquo;t lose being an avenger. but being an avenger was never something she could lose, she could only lose them.&nbsp;</p><p>then scott appears, and they come together again. she&rsquo;s never been so relieved in her life.&nbsp;</p><p>these last 5 years have made her a better leader and a teacher. she&rsquo;s not the strongest of gods, mutants, and super soldiers, but she&rsquo;s never had to be. her job was always people and she&rsquo;s damn good at it. </p><p>she is one of the originals. the avengers, the mightiest heroes of earth, trust her. as new kids bounce into the game on the heels of their older brothers, sisters, fathers and mothers, they don&rsquo;t hesitate to call aunt nat for help. peter parker, the suspiciously familiar new hawkeye, harley keener, kamala khan and so many other come through her open door. she teaches them.</p><p>she was born the black widow, and now she&rsquo;s learned to be natasha.&nbsp;</p><p><br /></p><p><br /></p><p><br /></p><p>for cap:</p><p>there&rsquo;s the problem of the soul stone. a sacrifice needs to be made. cap knows which one.</p><p>he looks tony in the eye and tells them that he will take care of it. they all blink at him. he tells them he will come home. they don&rsquo;t believe him, but he is stubborn.</p><p>he stares the ghost of his past in the face and he thinks that this must be a sign. he walks straight to the edge and he whispers &ldquo;you can have him&rdquo;. the stone hears him.</p><p>his whole body is on fire for a second and he falls to his knees. they ache.</p><p>captain america went to the cliff, and steven grant rogers came home. he smiles, soul stone in hand.</p><p>bucky comes home, and hugs him tight, and steve laughs as he mutters &ldquo;i swear you were bigger&rdquo;</p><p>he becomes an activist, steve rogers was the fighter, the captain was a soldier. there&rsquo;s a difference. he&rsquo;s a leader, he works with nat often to help the new heroes.</p><p>steve has everything and everyone he needs right there. he hands the shield to sam with a grin, &ldquo;don&rsquo;t lose it,&rdquo; he advises, &ldquo;but one day you can hand it over.&rdquo; it&rsquo;s honest advice. </p><p><br /></p><p><br /></p><p>for tony:</p><p>he comes home on a ship with nebula. she&rsquo;s a sweet woman, capable of such kindness but depraved of it.&nbsp;</p><p>he screams at steve. they could have saved everyone if they had just listened to him. if steve had believed in him, trusted him, they wouldn&rsquo;t be in this mess.&nbsp;</p><p>he faints, waking up to hear good and bad news. thanos is dead. they can&rsquo;t bring them back.&nbsp;</p><p>that day, when he wakes up in the hospital room, pepper is there and so is may. he apologizes over and over. she shakes her head and hands him a picture frame. he remembers it. peter had rambled on about the picture, explaining that bunny ears were different than a peace sign. tony had only laughed, not having the heart to tell him he knew that.&nbsp;</p><p>he stares at the picture, wanting to hug it tight so badly but not having the strength to tear his eyes away.&nbsp;</p><p>finally he puts it in his lap, he calls harley and gets him and his sister the first flight to new york.&nbsp;</p><p>he helps thor settle the refugees and integrate them into society. supplying them with whatever they need. though he tries to speak to him face to face, he finds himself speaking to valkyrie instead. he keeps trying.</p><p>harley is nearly an adult, and incredibly independant. he and his sister move to new york. tony helps him and his sister settle and sets them up at school. he hires harley as soon as he starts looking for a job.&nbsp;</p><p>he keeps a close eye on nebula and rhodey. they are far away, too far. he can barely handle the distance. pepper very gently tells him he&rsquo;s clinging too tight but he finds himself anxiously worrying over their safety every time they go on a mission. he never figures out how to get rid of that.&nbsp;</p><p>of course, he and pepper start a family. morgan is born. she&rsquo;s lovely and smart and too fast. she&rsquo;s growing up to fast. he&rsquo;s scared she&rsquo;ll be gone if he blinks too slowly.&nbsp;</p><p>though they stay in new york and remain active in the community, the starks fade into the background like the rest of the avengers during those 5 years. it&rsquo;s hard to care for heroes and celebrities these days. natasha visits often, with a worn but genuine smile. rhodey spoils her rotten. nebula is oddly charming with her blunt nature. morgan loves her aunts and uncles.&nbsp;</p><p>then steve comes, knocking down his door telling him that time travel is possible. tony disagrees and ends the conversation there.&nbsp;</p><p>then he looks at peter&rsquo;s picture on the mantle; it wouldn&rsquo;t hurt to try.&nbsp;</p><p>he figures it out of course, and the plan works. they retrieve the stones, and revive the fallen, but then comes the battle. this time, when he snaps his fingers, he falls limp, and wakes up in the same cot.&nbsp;</p><p>peter is sitting there as he comes to, grinning, telling him they won.&nbsp;</p><p>tony looks at his right arm, it&rsquo;s absolutely fried, he can barely feel it. there&rsquo;s far more damage, his heart is weaker. it&rsquo;s understandable, given all he&rsquo;s gone through. it&rsquo;s too weak for him to be flying around fighting petty crime lords.&nbsp;</p><p>so he retires iron man. he goes back to stark industries and service. he begins experimenting with emergency medical nanotech, with shields and defensive measures for earth, with new medical care and programs for those in poverty. he builds armor for every new hero.&nbsp;he&rsquo;s the futurist and these kids meant to be their future. he creates a program for the orphans and victims of the snap who didn&rsquo;t get their loved ones back.&nbsp;</p><p>iron man has retired, but no one misses him. they watch as tony stark builds a suit of armor around the world.&nbsp;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "ao3feed-tonystark",
        "blog": {
            "name": "ao3feed-tonystark",
            "title": "Ao3-Feed: Tony Stark",
            "description": "This blog is an automated list of the stories posted on Archive Of Our Own under the Tony Stark tag. The stories are automatically posted here from the AO3 RSS feed.",
            "url": "https://ao3feed-tonystark.tumblr.com/",
            "uuid": "t:O3wJf2GJebW4NoTEp7bxNg",
            "updated": 1561764808
        },
        "id": 184881013012,
        "post_url": "https://ao3feed-tonystark.tumblr.com/post/184881013012/after-party",
        "slug": "after-party",
        "date": "2019-05-14 22:37:12 GMT",
        "timestamp": 1557873432,
        "state": "published",
        "format": "html",
        "reblog_key": "a4aSZkO4",
        "tags": [
            "IFTTT",
            "tony stark",
            "iron man",
            "the avengers",
            "marvel",
            "ao3",
            "ao3feed"
        ],
        "short_url": "https://tmblr.co/ZX12gl2iBn64K",
        "summary": "After Party",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": "After Party",
        "body": "read it on the AO3 at <strong><a href=\"http://bit.ly/2HoGoBj\" target=\"_blank\">http://bit.ly/2HoGoBj</a></strong><br/><p>by <a rel=\"author\" href=\"/users/IsisKitsune/pseuds/IsisKitsune\" target=\"_blank\">IsisKitsune</a></p><p>Celebrate good times<br/>Fury tries to call in a tow while the crew is in the middle of celebrating Morbie&rsquo;s birthday, that works out about as well as could be expected.<br/>Tony is so proud of his boys</p><p>Words: 2438, Chapters: 1/1, Language: English</p><p>Series: Part 34 of <a href=\"http://archiveofourown.org/series/1351078\" target=\"_blank\">Twilight is for Sookers</a></p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Morbius:%20The%20Living%20Vampire/works\" target=\"_blank\">Morbius: The Living Vampire</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spider-Man%20-%20All%20Media%20Types/works\" target=\"_blank\">Spider-Man - All Media Types</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Daredevil%20(TV)/works\" target=\"_blank\">Daredevil (TV)</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Teen%20And%20Up%20Audiences/works\" target=\"_blank\">Teen And Up Audiences</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\" target=\"_blank\">No Archive Warnings Apply</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/M*s*M/works\" target=\"_blank\">M/M</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Michael%20Morbius/works\" target=\"_blank\">Michael Morbius</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Jarvis%20(Iron%20Man%20movies)/works\" target=\"_blank\">Jarvis (Iron Man movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Clint%20Barton/works\" target=\"_blank\">Clint Barton</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Matt%20Murdock/works\" target=\"_blank\">Matt Murdock</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Franklin%20%22Foggy%22%20Nelson/works\" target=\"_blank\">Franklin &ldquo;Foggy&rdquo; Nelson</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Michael%20Morbius*s*Peter%20Parker/works\" target=\"_blank\">Michael Morbius/Peter Parker</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Family%20Feels/works\" target=\"_blank\">Family Feels</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Family%20Fluff/works\" target=\"_blank\">Family Fluff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Avengers%20Family/works\" target=\"_blank\">Avengers Family</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Parent%20Tony%20Stark/works\" target=\"_blank\">Parent Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Drinking/works\" target=\"_blank\">Drinking</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Celebrations/works\" target=\"_blank\">Celebrations</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Birthday%20Party/works\" target=\"_blank\">Birthday Party</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Awesome%20Jarvis%20(Iron%20Man%20movies)/works\" target=\"_blank\">Awesome Jarvis (Iron Man movies)</a></li></ul><br/><br/>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2HoGoBj\" target=\"_blank\">http://bit.ly/2HoGoBj</a></strong>",
        "reblog": {
            "comment": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2HoGoBj\" target=\"_blank\">http://bit.ly/2HoGoBj</a></strong><br><p>by <a rel=\"author\" href=\"/users/IsisKitsune/pseuds/IsisKitsune\" target=\"_blank\">IsisKitsune</a></p><p>Celebrate good times<br>Fury tries to call in a tow while the crew is in the middle of celebrating Morbie’s birthday, that works out about as well as could be expected.<br>Tony is so proud of his boys</p><p>Words: 2438, Chapters: 1/1, Language: English</p><p>Series: Part 34 of <a href=\"http://archiveofourown.org/series/1351078\" target=\"_blank\">Twilight is for Sookers</a></p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Morbius:%20The%20Living%20Vampire/works\" target=\"_blank\">Morbius: The Living Vampire</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spider-Man%20-%20All%20Media%20Types/works\" target=\"_blank\">Spider-Man - All Media Types</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Daredevil%20(TV)/works\" target=\"_blank\">Daredevil (TV)</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Teen%20And%20Up%20Audiences/works\" target=\"_blank\">Teen And Up Audiences</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\" target=\"_blank\">No Archive Warnings Apply</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/M*s*M/works\" target=\"_blank\">M/M</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Michael%20Morbius/works\" target=\"_blank\">Michael Morbius</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Jarvis%20(Iron%20Man%20movies)/works\" target=\"_blank\">Jarvis (Iron Man movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Clint%20Barton/works\" target=\"_blank\">Clint Barton</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Matt%20Murdock/works\" target=\"_blank\">Matt Murdock</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Franklin%20%22Foggy%22%20Nelson/works\" target=\"_blank\">Franklin “Foggy” Nelson</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Michael%20Morbius*s*Peter%20Parker/works\" target=\"_blank\">Michael Morbius/Peter Parker</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Family%20Feels/works\" target=\"_blank\">Family Feels</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Family%20Fluff/works\" target=\"_blank\">Family Fluff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Avengers%20Family/works\" target=\"_blank\">Avengers Family</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Parent%20Tony%20Stark/works\" target=\"_blank\">Parent Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Drinking/works\" target=\"_blank\">Drinking</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Celebrations/works\" target=\"_blank\">Celebrations</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Birthday%20Party/works\" target=\"_blank\">Birthday Party</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Awesome%20Jarvis%20(Iron%20Man%20movies)/works\" target=\"_blank\">Awesome Jarvis (Iron Man movies)</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2HoGoBj\" target=\"_blank\">http://bit.ly/2HoGoBj</a></strong></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ao3feed-tonystark",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Avalon",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881013012"
                },
                "content_raw": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2HoGoBj\" target=\"_blank\">http://bit.ly/2HoGoBj</a></strong><br><p>by <a rel=\"author\" href=\"/users/IsisKitsune/pseuds/IsisKitsune\" target=\"_blank\">IsisKitsune</a></p><p>Celebrate good times<br>Fury tries to call in a tow while the crew is in the middle of celebrating Morbie’s birthday, that works out about as well as could be expected.<br>Tony is so proud of his boys</p><p>Words: 2438, Chapters: 1/1, Language: English</p><p>Series: Part 34 of <a href=\"http://archiveofourown.org/series/1351078\" target=\"_blank\">Twilight is for Sookers</a></p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Morbius:%20The%20Living%20Vampire/works\" target=\"_blank\">Morbius: The Living Vampire</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spider-Man%20-%20All%20Media%20Types/works\" target=\"_blank\">Spider-Man - All Media Types</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Daredevil%20(TV)/works\" target=\"_blank\">Daredevil (TV)</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Teen%20And%20Up%20Audiences/works\" target=\"_blank\">Teen And Up Audiences</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\" target=\"_blank\">No Archive Warnings Apply</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/M*s*M/works\" target=\"_blank\">M/M</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Michael%20Morbius/works\" target=\"_blank\">Michael Morbius</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Jarvis%20(Iron%20Man%20movies)/works\" target=\"_blank\">Jarvis (Iron Man movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Clint%20Barton/works\" target=\"_blank\">Clint Barton</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Matt%20Murdock/works\" target=\"_blank\">Matt Murdock</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Franklin%20%22Foggy%22%20Nelson/works\" target=\"_blank\">Franklin “Foggy” Nelson</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Michael%20Morbius*s*Peter%20Parker/works\" target=\"_blank\">Michael Morbius/Peter Parker</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Family%20Feels/works\" target=\"_blank\">Family Feels</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Family%20Fluff/works\" target=\"_blank\">Family Fluff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Avengers%20Family/works\" target=\"_blank\">Avengers Family</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Parent%20Tony%20Stark/works\" target=\"_blank\">Parent Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Drinking/works\" target=\"_blank\">Drinking</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Celebrations/works\" target=\"_blank\">Celebrations</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Birthday%20Party/works\" target=\"_blank\">Birthday Party</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Awesome%20Jarvis%20(Iron%20Man%20movies)/works\" target=\"_blank\">Awesome Jarvis (Iron Man movies)</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2HoGoBj\" target=\"_blank\">http://bit.ly/2HoGoBj</a></strong></p>",
                "content": "<p><p>read it on the AO3 at <strong><a href=\"http://bit.ly/2HoGoBj\" target=\"_blank\">http://bit.ly/2HoGoBj</a></strong><br /></p><p>by <a href=\"/users/IsisKitsune/pseuds/IsisKitsune\" target=\"_blank\">IsisKitsune</a></p><p>Celebrate good times<br />Fury tries to call in a tow while the crew is in the middle of celebrating Morbie&rsquo;s birthday, that works out about as well as could be expected.<br />Tony is so proud of his boys</p><p>Words: 2438, Chapters: 1/1, Language: English</p><p>Series: Part 34 of <a href=\"http://archiveofourown.org/series/1351078\" target=\"_blank\">Twilight is for Sookers</a></p><ul><li>Fandoms: <a href=\"http://archiveofourown.org/tags/Morbius:%20The%20Living%20Vampire/works\" target=\"_blank\">Morbius: The Living Vampire</a>, <a href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a href=\"http://archiveofourown.org/tags/Spider-Man%20-%20All%20Media%20Types/works\" target=\"_blank\">Spider-Man - All Media Types</a>, <a href=\"http://archiveofourown.org/tags/Daredevil%20(TV)/works\" target=\"_blank\">Daredevil (TV)</a></li><li>Rating: <a href=\"http://archiveofourown.org/tags/Teen%20And%20Up%20Audiences/works\" target=\"_blank\">Teen And Up Audiences</a></li><li>Warnings: <a href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\" target=\"_blank\">No Archive Warnings Apply</a></li><li>Categories: <a href=\"http://archiveofourown.org/tags/M*s*M/works\" target=\"_blank\">M/M</a></li><li>Characters: <a href=\"http://archiveofourown.org/tags/Michael%20Morbius/works\" target=\"_blank\">Michael Morbius</a>, <a href=\"http://archiveofourown.org/tags/Jarvis%20(Iron%20Man%20movies)/works\" target=\"_blank\">Jarvis (Iron Man movies)</a>, <a href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a href=\"http://archiveofourown.org/tags/Clint%20Barton/works\" target=\"_blank\">Clint Barton</a>, <a href=\"http://archiveofourown.org/tags/Matt%20Murdock/works\" target=\"_blank\">Matt Murdock</a>, <a href=\"http://archiveofourown.org/tags/Franklin%20%22Foggy%22%20Nelson/works\" target=\"_blank\">Franklin &ldquo;Foggy&rdquo; Nelson</a></li><li>Relationships: <a href=\"http://archiveofourown.org/tags/Michael%20Morbius*s*Peter%20Parker/works\" target=\"_blank\">Michael Morbius/Peter Parker</a></li><li>Additional Tags: <a href=\"http://archiveofourown.org/tags/Family%20Feels/works\" target=\"_blank\">Family Feels</a>, <a href=\"http://archiveofourown.org/tags/Family%20Fluff/works\" target=\"_blank\">Family Fluff</a>, <a href=\"http://archiveofourown.org/tags/Avengers%20Family/works\" target=\"_blank\">Avengers Family</a>, <a href=\"http://archiveofourown.org/tags/Parent%20Tony%20Stark/works\" target=\"_blank\">Parent Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/Drinking/works\" target=\"_blank\">Drinking</a>, <a href=\"http://archiveofourown.org/tags/Celebrations/works\" target=\"_blank\">Celebrations</a>, <a href=\"http://archiveofourown.org/tags/Birthday%20Party/works\" target=\"_blank\">Birthday Party</a>, <a href=\"http://archiveofourown.org/tags/Awesome%20Jarvis%20(Iron%20Man%20movies)/works\" target=\"_blank\">Awesome Jarvis (Iron Man movies)</a></li></ul><br /><br />\nread it on the AO3 at <strong><a href=\"http://bit.ly/2HoGoBj\" target=\"_blank\">http://bit.ly/2HoGoBj</a></strong></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "ao3feed-tonystark",
        "blog": {
            "name": "ao3feed-tonystark",
            "title": "Ao3-Feed: Tony Stark",
            "description": "This blog is an automated list of the stories posted on Archive Of Our Own under the Tony Stark tag. The stories are automatically posted here from the AO3 RSS feed.",
            "url": "https://ao3feed-tonystark.tumblr.com/",
            "uuid": "t:O3wJf2GJebW4NoTEp7bxNg",
            "updated": 1561764808
        },
        "id": 184881013077,
        "post_url": "https://ao3feed-tonystark.tumblr.com/post/184881013077/one-job",
        "slug": "one-job",
        "date": "2019-05-14 22:37:12 GMT",
        "timestamp": 1557873432,
        "state": "published",
        "format": "html",
        "reblog_key": "JQNklIpQ",
        "tags": [
            "IFTTT",
            "tony stark",
            "iron man",
            "the avengers",
            "marvel",
            "ao3",
            "ao3feed"
        ],
        "short_url": "https://tmblr.co/ZX12gl2iBn65L",
        "summary": "one job",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": "one job",
        "body": "read it on the AO3 at <strong><a href=\"http://bit.ly/2WOnjze\" target=\"_blank\">http://bit.ly/2WOnjze</a></strong><br/><p>by <a rel=\"author\" href=\"/users/katierosefun/pseuds/katierosefun\" target=\"_blank\">katierosefun</a></p><p>“You had one job.” </p><p>Peter lifted his shoulders into what he hoped was an apologetic shrug, but it was hard, especially with the smile that kept trying to creep back on his face—but Tony didn’t look altogether amused. </p><p>“One. Job,” Tony said, pressing his forehead against his palm. “Do you want to tell me what you didn’t do?” </p><p>Peter looked around the kitchen. Or, more specifically, what could have and should have been a kitchen but now looked more like a restrained explosion of flour, egg yolks, egg shells, squished berries, and butter. And the best part of it all was Morgan, swinging her legs off the kitchen counter and calmly snacking on blueberries from a paper cup. She extended the cup to Tony and Peter. “Want one?” she asked. </p><p>[or, Peter Parker is a terrible baby-sitter. Fulfills prompt #999 for Irondad 1000 Feelings, &lsquo;the glee of having completely screwed up a task you resented&rsquo;.]</p><p>Words: 2073, Chapters: 1/1, Language: English</p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\" target=\"_blank\">Marvel Cinematic Universe</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Iron%20Man%20(Movies)/works\" target=\"_blank\">Iron Man (Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spider-Man:%20Homecoming%20(2017)/works\" target=\"_blank\">Spider-Man: Homecoming (2017)</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/General%20Audiences/works\" target=\"_blank\">General Audiences</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\" target=\"_blank\">No Archive Warnings Apply</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Gen/works\" target=\"_blank\">Gen</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Morgan%20Stark%20(Marvel%20Cinematic%20Universe)/works\" target=\"_blank\">Morgan Stark (Marvel Cinematic Universe)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pepper%20Potts/works\" target=\"_blank\">Pepper Potts</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Tony%20Stark/works\" target=\"_blank\">Peter Parker &amp; Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Morgan%20Stark%20(Marvel%20Cinematic%20Universe)%20*a*%20Tony%20Stark/works\" target=\"_blank\">Peter Parker &amp; Morgan Stark (Marvel Cinematic Universe) &amp; Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Morgan%20Stark%20(Marvel%20Cinematic%20Universe)/works\" target=\"_blank\">Peter Parker &amp; Morgan Stark (Marvel Cinematic Universe)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pepper%20Potts*s*Tony%20Stark/works\" target=\"_blank\">Pepper Potts/Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Pepper%20Potts%20*a*%20Morgan%20Stark%20(Marvel%20Cinematic%20Universe)%20*a*%20Tony%20Stark/works\" target=\"_blank\">Peter Parker &amp; Pepper Potts &amp; Morgan Stark (Marvel Cinematic Universe) &amp; Tony Stark</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20is%20a%20Good%20Bro/works\" target=\"_blank\">Peter Parker is a Good Bro</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Parent%20Tony%20Stark/works\" target=\"_blank\">Parent Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark%20Has%20A%20Heart/works\" target=\"_blank\">Tony Stark Has A Heart</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20Has%20a%20Family/works\" target=\"_blank\">Peter Parker Has a Family</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Parent%20Pepper%20Potts/works\" target=\"_blank\">Parent Pepper Potts</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Babysitting/works\" target=\"_blank\">Babysitting</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Family%20Fluff/works\" target=\"_blank\">Family Fluff</a></li></ul><br/><br/>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2WOnjze\" target=\"_blank\">http://bit.ly/2WOnjze</a></strong>",
        "reblog": {
            "comment": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2WOnjze\" target=\"_blank\">http://bit.ly/2WOnjze</a></strong><br><p>by <a rel=\"author\" href=\"/users/katierosefun/pseuds/katierosefun\" target=\"_blank\">katierosefun</a></p><p>“You had one job.” </p><p>Peter lifted his shoulders into what he hoped was an apologetic shrug, but it was hard, especially with the smile that kept trying to creep back on his face—but Tony didn’t look altogether amused. </p><p>“One. Job,” Tony said, pressing his forehead against his palm. “Do you want to tell me what you didn’t do?” </p><p>Peter looked around the kitchen. Or, more specifically, what could have and should have been a kitchen but now looked more like a restrained explosion of flour, egg yolks, egg shells, squished berries, and butter. And the best part of it all was Morgan, swinging her legs off the kitchen counter and calmly snacking on blueberries from a paper cup. She extended the cup to Tony and Peter. “Want one?” she asked. </p><p>[or, Peter Parker is a terrible baby-sitter. Fulfills prompt #999 for Irondad 1000 Feelings, ‘the glee of having completely screwed up a task you resented’.]</p><p>Words: 2073, Chapters: 1/1, Language: English</p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\" target=\"_blank\">Marvel Cinematic Universe</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Iron%20Man%20(Movies)/works\" target=\"_blank\">Iron Man (Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spider-Man:%20Homecoming%20(2017)/works\" target=\"_blank\">Spider-Man: Homecoming (2017)</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/General%20Audiences/works\" target=\"_blank\">General Audiences</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\" target=\"_blank\">No Archive Warnings Apply</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Gen/works\" target=\"_blank\">Gen</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Morgan%20Stark%20(Marvel%20Cinematic%20Universe)/works\" target=\"_blank\">Morgan Stark (Marvel Cinematic Universe)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pepper%20Potts/works\" target=\"_blank\">Pepper Potts</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Tony%20Stark/works\" target=\"_blank\">Peter Parker &amp; Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Morgan%20Stark%20(Marvel%20Cinematic%20Universe)%20*a*%20Tony%20Stark/works\" target=\"_blank\">Peter Parker &amp; Morgan Stark (Marvel Cinematic Universe) &amp; Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Morgan%20Stark%20(Marvel%20Cinematic%20Universe)/works\" target=\"_blank\">Peter Parker &amp; Morgan Stark (Marvel Cinematic Universe)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pepper%20Potts*s*Tony%20Stark/works\" target=\"_blank\">Pepper Potts/Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Pepper%20Potts%20*a*%20Morgan%20Stark%20(Marvel%20Cinematic%20Universe)%20*a*%20Tony%20Stark/works\" target=\"_blank\">Peter Parker &amp; Pepper Potts &amp; Morgan Stark (Marvel Cinematic Universe) &amp; Tony Stark</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20is%20a%20Good%20Bro/works\" target=\"_blank\">Peter Parker is a Good Bro</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Parent%20Tony%20Stark/works\" target=\"_blank\">Parent Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark%20Has%20A%20Heart/works\" target=\"_blank\">Tony Stark Has A Heart</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20Has%20a%20Family/works\" target=\"_blank\">Peter Parker Has a Family</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Parent%20Pepper%20Potts/works\" target=\"_blank\">Parent Pepper Potts</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Babysitting/works\" target=\"_blank\">Babysitting</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Family%20Fluff/works\" target=\"_blank\">Family Fluff</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2WOnjze\" target=\"_blank\">http://bit.ly/2WOnjze</a></strong></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ao3feed-tonystark",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Avalon",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881013077"
                },
                "content_raw": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2WOnjze\" target=\"_blank\">http://bit.ly/2WOnjze</a></strong><br><p>by <a rel=\"author\" href=\"/users/katierosefun/pseuds/katierosefun\" target=\"_blank\">katierosefun</a></p><p>“You had one job.” </p><p>Peter lifted his shoulders into what he hoped was an apologetic shrug, but it was hard, especially with the smile that kept trying to creep back on his face—but Tony didn’t look altogether amused. </p><p>“One. Job,” Tony said, pressing his forehead against his palm. “Do you want to tell me what you didn’t do?” </p><p>Peter looked around the kitchen. Or, more specifically, what could have and should have been a kitchen but now looked more like a restrained explosion of flour, egg yolks, egg shells, squished berries, and butter. And the best part of it all was Morgan, swinging her legs off the kitchen counter and calmly snacking on blueberries from a paper cup. She extended the cup to Tony and Peter. “Want one?” she asked. </p><p>[or, Peter Parker is a terrible baby-sitter. Fulfills prompt #999 for Irondad 1000 Feelings, ‘the glee of having completely screwed up a task you resented’.]</p><p>Words: 2073, Chapters: 1/1, Language: English</p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\" target=\"_blank\">Marvel Cinematic Universe</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Iron%20Man%20(Movies)/works\" target=\"_blank\">Iron Man (Movies)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Spider-Man:%20Homecoming%20(2017)/works\" target=\"_blank\">Spider-Man: Homecoming (2017)</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/General%20Audiences/works\" target=\"_blank\">General Audiences</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\" target=\"_blank\">No Archive Warnings Apply</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Gen/works\" target=\"_blank\">Gen</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Morgan%20Stark%20(Marvel%20Cinematic%20Universe)/works\" target=\"_blank\">Morgan Stark (Marvel Cinematic Universe)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pepper%20Potts/works\" target=\"_blank\">Pepper Potts</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Tony%20Stark/works\" target=\"_blank\">Peter Parker &amp; Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Morgan%20Stark%20(Marvel%20Cinematic%20Universe)%20*a*%20Tony%20Stark/works\" target=\"_blank\">Peter Parker &amp; Morgan Stark (Marvel Cinematic Universe) &amp; Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Morgan%20Stark%20(Marvel%20Cinematic%20Universe)/works\" target=\"_blank\">Peter Parker &amp; Morgan Stark (Marvel Cinematic Universe)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pepper%20Potts*s*Tony%20Stark/works\" target=\"_blank\">Pepper Potts/Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Pepper%20Potts%20*a*%20Morgan%20Stark%20(Marvel%20Cinematic%20Universe)%20*a*%20Tony%20Stark/works\" target=\"_blank\">Peter Parker &amp; Pepper Potts &amp; Morgan Stark (Marvel Cinematic Universe) &amp; Tony Stark</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20is%20a%20Good%20Bro/works\" target=\"_blank\">Peter Parker is a Good Bro</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Parent%20Tony%20Stark/works\" target=\"_blank\">Parent Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark%20Has%20A%20Heart/works\" target=\"_blank\">Tony Stark Has A Heart</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker%20Has%20a%20Family/works\" target=\"_blank\">Peter Parker Has a Family</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Parent%20Pepper%20Potts/works\" target=\"_blank\">Parent Pepper Potts</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Babysitting/works\" target=\"_blank\">Babysitting</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Family%20Fluff/works\" target=\"_blank\">Family Fluff</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2WOnjze\" target=\"_blank\">http://bit.ly/2WOnjze</a></strong></p>",
                "content": "<p><p>read it on the AO3 at <strong><a href=\"http://bit.ly/2WOnjze\" target=\"_blank\">http://bit.ly/2WOnjze</a></strong><br /></p><p>by <a href=\"/users/katierosefun/pseuds/katierosefun\" target=\"_blank\">katierosefun</a></p><p>&ldquo;You had one job.&rdquo; </p><p>Peter lifted his shoulders into what he hoped was an apologetic shrug, but it was hard, especially with the smile that kept trying to creep back on his face&mdash;but Tony didn&rsquo;t look altogether amused. </p><p>&ldquo;One. Job,&rdquo; Tony said, pressing his forehead against his palm. &ldquo;Do you want to tell me what you didn&rsquo;t do?&rdquo; </p><p>Peter looked around the kitchen. Or, more specifically, what could have and should have been a kitchen but now looked more like a restrained explosion of flour, egg yolks, egg shells, squished berries, and butter. And the best part of it all was Morgan, swinging her legs off the kitchen counter and calmly snacking on blueberries from a paper cup. She extended the cup to Tony and Peter. &ldquo;Want one?&rdquo; she asked. </p><p>[or, Peter Parker is a terrible baby-sitter. Fulfills prompt #999 for Irondad 1000 Feelings, &lsquo;the glee of having completely screwed up a task you resented&rsquo;.]</p><p>Words: 2073, Chapters: 1/1, Language: English</p><ul><li>Fandoms: <a href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\" target=\"_blank\">Marvel Cinematic Universe</a>, <a href=\"http://archiveofourown.org/tags/The%20Avengers%20(Marvel%20Movies)/works\" target=\"_blank\">The Avengers (Marvel Movies)</a>, <a href=\"http://archiveofourown.org/tags/Iron%20Man%20(Movies)/works\" target=\"_blank\">Iron Man (Movies)</a>, <a href=\"http://archiveofourown.org/tags/Spider-Man:%20Homecoming%20(2017)/works\" target=\"_blank\">Spider-Man: Homecoming (2017)</a></li><li>Rating: <a href=\"http://archiveofourown.org/tags/General%20Audiences/works\" target=\"_blank\">General Audiences</a></li><li>Warnings: <a href=\"http://archiveofourown.org/tags/No%20Archive%20Warnings%20Apply/works\" target=\"_blank\">No Archive Warnings Apply</a></li><li>Categories: <a href=\"http://archiveofourown.org/tags/Gen/works\" target=\"_blank\">Gen</a></li><li>Characters: <a href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/Morgan%20Stark%20(Marvel%20Cinematic%20Universe)/works\" target=\"_blank\">Morgan Stark (Marvel Cinematic Universe)</a>, <a href=\"http://archiveofourown.org/tags/Pepper%20Potts/works\" target=\"_blank\">Pepper Potts</a></li><li>Relationships: <a href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Tony%20Stark/works\" target=\"_blank\">Peter Parker &amp; Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Morgan%20Stark%20(Marvel%20Cinematic%20Universe)%20*a*%20Tony%20Stark/works\" target=\"_blank\">Peter Parker &amp; Morgan Stark (Marvel Cinematic Universe) &amp; Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Morgan%20Stark%20(Marvel%20Cinematic%20Universe)/works\" target=\"_blank\">Peter Parker &amp; Morgan Stark (Marvel Cinematic Universe)</a>, <a href=\"http://archiveofourown.org/tags/Pepper%20Potts*s*Tony%20Stark/works\" target=\"_blank\">Pepper Potts/Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/Peter%20Parker%20*a*%20Pepper%20Potts%20*a*%20Morgan%20Stark%20(Marvel%20Cinematic%20Universe)%20*a*%20Tony%20Stark/works\" target=\"_blank\">Peter Parker &amp; Pepper Potts &amp; Morgan Stark (Marvel Cinematic Universe) &amp; Tony Stark</a></li><li>Additional Tags: <a href=\"http://archiveofourown.org/tags/Peter%20Parker%20is%20a%20Good%20Bro/works\" target=\"_blank\">Peter Parker is a Good Bro</a>, <a href=\"http://archiveofourown.org/tags/Parent%20Tony%20Stark/works\" target=\"_blank\">Parent Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/Tony%20Stark%20Has%20A%20Heart/works\" target=\"_blank\">Tony Stark Has A Heart</a>, <a href=\"http://archiveofourown.org/tags/Peter%20Parker%20Has%20a%20Family/works\" target=\"_blank\">Peter Parker Has a Family</a>, <a href=\"http://archiveofourown.org/tags/Parent%20Pepper%20Potts/works\" target=\"_blank\">Parent Pepper Potts</a>, <a href=\"http://archiveofourown.org/tags/Babysitting/works\" target=\"_blank\">Babysitting</a>, <a href=\"http://archiveofourown.org/tags/Family%20Fluff/works\" target=\"_blank\">Family Fluff</a></li></ul><br /><br />\nread it on the AO3 at <strong><a href=\"http://bit.ly/2WOnjze\" target=\"_blank\">http://bit.ly/2WOnjze</a></strong></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "ao3feed-tonystark",
        "blog": {
            "name": "ao3feed-tonystark",
            "title": "Ao3-Feed: Tony Stark",
            "description": "This blog is an automated list of the stories posted on Archive Of Our Own under the Tony Stark tag. The stories are automatically posted here from the AO3 RSS feed.",
            "url": "https://ao3feed-tonystark.tumblr.com/",
            "uuid": "t:O3wJf2GJebW4NoTEp7bxNg",
            "updated": 1561764808
        },
        "id": 184881012907,
        "post_url": "https://ao3feed-tonystark.tumblr.com/post/184881012907/the-things-i-have-seen",
        "slug": "the-things-i-have-seen",
        "date": "2019-05-14 22:37:11 GMT",
        "timestamp": 1557873431,
        "state": "published",
        "format": "html",
        "reblog_key": "ERKUy4kJ",
        "tags": [
            "IFTTT",
            "tony stark",
            "iron man",
            "the avengers",
            "marvel",
            "ao3",
            "ao3feed"
        ],
        "short_url": "https://tmblr.co/ZX12gl2iBn62h",
        "summary": "The Things I Have Seen",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1,
        "title": "The Things I Have Seen",
        "body": "read it on the AO3 at <strong><a href=\"http://bit.ly/2vYvJrS\" target=\"_blank\">http://bit.ly/2vYvJrS</a></strong><br/><p>by <a rel=\"author\" href=\"/users/TearaBlackwing/pseuds/TearaBlackwing\" target=\"_blank\">TearaBlackwing</a></p><p>I am pretty odd even for normal standards and knew there was something wrong with me growing up. I could see my friends on their vacations half a world away and I was still in my grandmothers’ backyard. I could see as if I was looking through their eyes as well as a third person view that could explore. It was odd and I thought I was going crazy. I didn’t tell anyone because they would have packed me off the nearest loony bin before you could say, ‘loco en la cabeza’.</p><p>Words: 10074, Chapters: 2/?, Language: English</p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\" target=\"_blank\">Marvel Cinematic Universe</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Mature/works\" target=\"_blank\">Mature</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\" target=\"_blank\">Graphic Depictions Of Violence</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/F*s*M/works\" target=\"_blank\">F/M</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Steve%20Rogers/works\" target=\"_blank\">Steve Rogers</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Bruce%20Banner/works\" target=\"_blank\">Bruce Banner</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wanda%20Maximoff/works\" target=\"_blank\">Wanda Maximoff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Thor%20(Marvel)/works\" target=\"_blank\">Thor (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pietro%20Maximoff/works\" target=\"_blank\">Pietro Maximoff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Vision%20(Marvel)/works\" target=\"_blank\">Vision (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/James%20%22Bucky%22%20Barnes/works\" target=\"_blank\">James &ldquo;Bucky&rdquo; Barnes</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pepper%20Potts/works\" target=\"_blank\">Pepper Potts</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Nick%20Fury/works\" target=\"_blank\">Nick Fury</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Maria%20Hill/works\" target=\"_blank\">Maria Hill</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/James%20%22Bucky%22%20Barnes*s*Original%20Female%20Character(s)/works\" target=\"_blank\">James &ldquo;Bucky&rdquo; Barnes/Original Female Character(s)</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Banter/works\" target=\"_blank\">Banter</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Angst%20and%20Humor/works\" target=\"_blank\">Angst and Humor</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Hurt*s*Comfort/works\" target=\"_blank\">Hurt/Comfort</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20Canon%20Divergence/works\" target=\"_blank\">Alternate Universe - Canon Divergence</a></li></ul><br/><br/>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2vYvJrS\" target=\"_blank\">http://bit.ly/2vYvJrS</a></strong>",
        "reblog": {
            "comment": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2vYvJrS\" target=\"_blank\">http://bit.ly/2vYvJrS</a></strong><br><p>by <a rel=\"author\" href=\"/users/TearaBlackwing/pseuds/TearaBlackwing\" target=\"_blank\">TearaBlackwing</a></p><p>I am pretty odd even for normal standards and knew there was something wrong with me growing up. I could see my friends on their vacations half a world away and I was still in my grandmothers’ backyard. I could see as if I was looking through their eyes as well as a third person view that could explore. It was odd and I thought I was going crazy. I didn’t tell anyone because they would have packed me off the nearest loony bin before you could say, ‘loco en la cabeza’.</p><p>Words: 10074, Chapters: 2/?, Language: English</p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\" target=\"_blank\">Marvel Cinematic Universe</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Mature/works\" target=\"_blank\">Mature</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\" target=\"_blank\">Graphic Depictions Of Violence</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/F*s*M/works\" target=\"_blank\">F/M</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Steve%20Rogers/works\" target=\"_blank\">Steve Rogers</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Bruce%20Banner/works\" target=\"_blank\">Bruce Banner</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wanda%20Maximoff/works\" target=\"_blank\">Wanda Maximoff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Thor%20(Marvel)/works\" target=\"_blank\">Thor (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pietro%20Maximoff/works\" target=\"_blank\">Pietro Maximoff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Vision%20(Marvel)/works\" target=\"_blank\">Vision (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/James%20%22Bucky%22%20Barnes/works\" target=\"_blank\">James “Bucky” Barnes</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pepper%20Potts/works\" target=\"_blank\">Pepper Potts</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Nick%20Fury/works\" target=\"_blank\">Nick Fury</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Maria%20Hill/works\" target=\"_blank\">Maria Hill</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/James%20%22Bucky%22%20Barnes*s*Original%20Female%20Character(s)/works\" target=\"_blank\">James “Bucky” Barnes/Original Female Character(s)</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Banter/works\" target=\"_blank\">Banter</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Angst%20and%20Humor/works\" target=\"_blank\">Angst and Humor</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Hurt*s*Comfort/works\" target=\"_blank\">Hurt/Comfort</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20Canon%20Divergence/works\" target=\"_blank\">Alternate Universe - Canon Divergence</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2vYvJrS\" target=\"_blank\">http://bit.ly/2vYvJrS</a></strong></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ao3feed-tonystark",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/7eeb08c02a76ad1860e759900e734a2f/q0qi0lo/U7ioy6m54/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Avalon",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881012907"
                },
                "content_raw": "<p>read it on the AO3 at <strong><a href=\"http://bit.ly/2vYvJrS\" target=\"_blank\">http://bit.ly/2vYvJrS</a></strong><br><p>by <a rel=\"author\" href=\"/users/TearaBlackwing/pseuds/TearaBlackwing\" target=\"_blank\">TearaBlackwing</a></p><p>I am pretty odd even for normal standards and knew there was something wrong with me growing up. I could see my friends on their vacations half a world away and I was still in my grandmothers’ backyard. I could see as if I was looking through their eyes as well as a third person view that could explore. It was odd and I thought I was going crazy. I didn’t tell anyone because they would have packed me off the nearest loony bin before you could say, ‘loco en la cabeza’.</p><p>Words: 10074, Chapters: 2/?, Language: English</p><ul><li>Fandoms: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\" target=\"_blank\">Marvel Cinematic Universe</a></li><li>Rating: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Mature/works\" target=\"_blank\">Mature</a></li><li>Warnings: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\" target=\"_blank\">Graphic Depictions Of Violence</a></li><li>Categories: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/F*s*M/works\" target=\"_blank\">F/M</a></li><li>Characters: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Steve%20Rogers/works\" target=\"_blank\">Steve Rogers</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Bruce%20Banner/works\" target=\"_blank\">Bruce Banner</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Wanda%20Maximoff/works\" target=\"_blank\">Wanda Maximoff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Thor%20(Marvel)/works\" target=\"_blank\">Thor (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pietro%20Maximoff/works\" target=\"_blank\">Pietro Maximoff</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Vision%20(Marvel)/works\" target=\"_blank\">Vision (Marvel)</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/James%20%22Bucky%22%20Barnes/works\" target=\"_blank\">James “Bucky” Barnes</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Pepper%20Potts/works\" target=\"_blank\">Pepper Potts</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Nick%20Fury/works\" target=\"_blank\">Nick Fury</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Maria%20Hill/works\" target=\"_blank\">Maria Hill</a></li><li>Relationships: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/James%20%22Bucky%22%20Barnes*s*Original%20Female%20Character(s)/works\" target=\"_blank\">James “Bucky” Barnes/Original Female Character(s)</a></li><li>Additional Tags: <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Banter/works\" target=\"_blank\">Banter</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Angst%20and%20Humor/works\" target=\"_blank\">Angst and Humor</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Hurt*s*Comfort/works\" target=\"_blank\">Hurt/Comfort</a>, <a full_path=\"true\" class=\"tag\" href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20Canon%20Divergence/works\" target=\"_blank\">Alternate Universe - Canon Divergence</a></li></ul><br><br>\nread it on the AO3 at <strong><a href=\"http://bit.ly/2vYvJrS\" target=\"_blank\">http://bit.ly/2vYvJrS</a></strong></p>",
                "content": "<p><p>read it on the AO3 at <strong><a href=\"http://bit.ly/2vYvJrS\" target=\"_blank\">http://bit.ly/2vYvJrS</a></strong><br /></p><p>by <a href=\"/users/TearaBlackwing/pseuds/TearaBlackwing\" target=\"_blank\">TearaBlackwing</a></p><p>I am pretty odd even for normal standards and knew there was something wrong with me growing up. I could see my friends on their vacations half a world away and I was still in my grandmothers&rsquo; backyard. I could see as if I was looking through their eyes as well as a third person view that could explore. It was odd and I thought I was going crazy. I didn&rsquo;t tell anyone because they would have packed me off the nearest loony bin before you could say, &lsquo;loco en la cabeza&rsquo;.</p><p>Words: 10074, Chapters: 2/?, Language: English</p><ul><li>Fandoms: <a href=\"http://archiveofourown.org/tags/Marvel%20Cinematic%20Universe/works\" target=\"_blank\">Marvel Cinematic Universe</a></li><li>Rating: <a href=\"http://archiveofourown.org/tags/Mature/works\" target=\"_blank\">Mature</a></li><li>Warnings: <a href=\"http://archiveofourown.org/tags/Graphic%20Depictions%20Of%20Violence/works\" target=\"_blank\">Graphic Depictions Of Violence</a></li><li>Categories: <a href=\"http://archiveofourown.org/tags/F*s*M/works\" target=\"_blank\">F/M</a></li><li>Characters: <a href=\"http://archiveofourown.org/tags/Steve%20Rogers/works\" target=\"_blank\">Steve Rogers</a>, <a href=\"http://archiveofourown.org/tags/Natasha%20Romanov%20(Marvel)/works\" target=\"_blank\">Natasha Romanov (Marvel)</a>, <a href=\"http://archiveofourown.org/tags/Tony%20Stark/works\" target=\"_blank\">Tony Stark</a>, <a href=\"http://archiveofourown.org/tags/Bruce%20Banner/works\" target=\"_blank\">Bruce Banner</a>, <a href=\"http://archiveofourown.org/tags/Wanda%20Maximoff/works\" target=\"_blank\">Wanda Maximoff</a>, <a href=\"http://archiveofourown.org/tags/Thor%20(Marvel)/works\" target=\"_blank\">Thor (Marvel)</a>, <a href=\"http://archiveofourown.org/tags/Pietro%20Maximoff/works\" target=\"_blank\">Pietro Maximoff</a>, <a href=\"http://archiveofourown.org/tags/Peter%20Parker/works\" target=\"_blank\">Peter Parker</a>, <a href=\"http://archiveofourown.org/tags/Vision%20(Marvel)/works\" target=\"_blank\">Vision (Marvel)</a>, <a href=\"http://archiveofourown.org/tags/James%20%22Bucky%22%20Barnes/works\" target=\"_blank\">James &ldquo;Bucky&rdquo; Barnes</a>, <a href=\"http://archiveofourown.org/tags/Pepper%20Potts/works\" target=\"_blank\">Pepper Potts</a>, <a href=\"http://archiveofourown.org/tags/Nick%20Fury/works\" target=\"_blank\">Nick Fury</a>, <a href=\"http://archiveofourown.org/tags/Maria%20Hill/works\" target=\"_blank\">Maria Hill</a></li><li>Relationships: <a href=\"http://archiveofourown.org/tags/James%20%22Bucky%22%20Barnes*s*Original%20Female%20Character(s)/works\" target=\"_blank\">James &ldquo;Bucky&rdquo; Barnes/Original Female Character(s)</a></li><li>Additional Tags: <a href=\"http://archiveofourown.org/tags/Banter/works\" target=\"_blank\">Banter</a>, <a href=\"http://archiveofourown.org/tags/Angst%20and%20Humor/works\" target=\"_blank\">Angst and Humor</a>, <a href=\"http://archiveofourown.org/tags/Hurt*s*Comfort/works\" target=\"_blank\">Hurt/Comfort</a>, <a href=\"http://archiveofourown.org/tags/Alternate%20Universe%20-%20Canon%20Divergence/works\" target=\"_blank\">Alternate Universe - Canon Divergence</a></li></ul><br /><br />\nread it on the AO3 at <strong><a href=\"http://bit.ly/2vYvJrS\" target=\"_blank\">http://bit.ly/2vYvJrS</a></strong></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "wecantgiggleitsafandom",
        "blog": {
            "name": "wecantgiggleitsafandom",
            "title": "The Rantings Of A Beautiful Mind",
            "description": "\"it was beautiful, then sad, then sadder, I laughed, I cried, I puked in my mouth a little\" Welcome to my hot mess of a blog, pull up a seat everybody is welcome here.\nEmma / Bi/ Just a American teen with her head in the clouds. Requests are OPEN. This blog is a safe place for everybody. Follow my Instagram @oh.no.my.potato",
            "url": "https://wecantgiggleitsafandom.tumblr.com/",
            "uuid": "t:jb4bTMBfdvSVcxE5jZKKFw",
            "updated": 1561765405
        },
        "id": 184881009799,
        "post_url": "https://wecantgiggleitsafandom.tumblr.com/post/184881009799/tony-tired-dad-try-to-teach-younglings-ok-ok-lets",
        "slug": "tony-tired-dad-try-to-teach-younglings-ok-ok-lets",
        "date": "2019-05-14 22:36:54 GMT",
        "timestamp": 1557873414,
        "state": "published",
        "format": "html",
        "reblog_key": "TVnAjoJL",
        "tags": [
            "avengers endgame",
            "marvel",
            "spiderman",
            "iron man",
            "iron dad",
            "spider son",
            "lolz"
        ],
        "short_url": "https://tmblr.co/ZipgtW2iBn5I7",
        "summary": "Tony tired dad try to teach younglings: ok ok lets say your at the mall and theres a shooting. What do you do?\nPeter: call the...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 13,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony tired dad try to teach younglings:</b> ok ok lets say your at the mall and theres a shooting. What do you do?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Peter:</b> call the aven- </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony:</b> yOU ARE THE AVENGERS</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony tired dad try to teach younglings:</b> ok ok lets say your at the mall and theres a shooting. What do you do?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Peter:</b> call the aven- </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony:</b> yOU ARE THE AVENGERS</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "wecantgiggleitsafandom",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#4A2980",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/5419ca01e9b19d7ec69aa8953f25a131/poxgkip/sJlptay1z/tumblr_static_-689118848-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/5419ca01e9b19d7ec69aa8953f25a131/poxgkip/sJlptay1z/tumblr_static_-689118848-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/5419ca01e9b19d7ec69aa8953f25a131/poxgkip/sJlptay1z/tumblr_static_-689118848-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#1A6983",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184881009799"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony tired dad try to teach younglings:</b> ok ok lets say your at the mall and theres a shooting. What do you do?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Peter:</b> call the aven- </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Tony:</b> yOU ARE THE AVENGERS</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Tony tired dad try to teach younglings:</b> ok ok lets say your at the mall and theres a shooting. What do you do?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Peter:</b> call the aven- </p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Tony:</b> yOU ARE THE AVENGERS</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "marveley",
        "blog": {
            "name": "marveley",
            "title": "‘ WE WON MR STARK ’",
            "description": "<p><a href=\"https://www.wattpad.com/user/-online/\">kasari!</a> - <a href=\"https://marveley.tumblr.com/post/184834624047/masterlist/\">masterlist!</a> - <a href=\"https://marveley.tumblr.com/ask/\">ask!</a></p>",
            "url": "https://marveley.tumblr.com/",
            "uuid": "t:nHriQdnBDPmfa9akmXz62g",
            "updated": 1561659137
        },
        "id": 184880912617,
        "post_url": "https://marveley.tumblr.com/post/184880912617/hey-shifter",
        "slug": "hey-shifter",
        "date": "2019-05-14 22:31:34 GMT",
        "timestamp": 1557873094,
        "state": "published",
        "format": "html",
        "reblog_key": "7IC0koBs",
        "tags": [
            "spiderman",
            "avengers memes",
            "iron man",
            "peter parker",
            "robert downey jr",
            "robert downey junior",
            "tom holland",
            "peter parker imagine",
            "peter parker smut",
            "peter parker x y/n",
            "peter parker x you",
            "peter parker x reader",
            "tom holland x y/n",
            "tom holland x you",
            "tom holland x reader",
            "tom holland imagine"
        ],
        "short_url": "https://tmblr.co/ZwU2bb2iBmjZf",
        "summary": "HEY, SHIFTER",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 200,
        "title": null,
        "body": "<h1><i><b>HEY, SHIFTER</b></i></h1><figure class=\"tmblr-full\" data-orig-height=\"280\" data-orig-width=\"540\" data-tumblr-attribution=\"bens-hardy:Nb0_9iqZ10dVwTeX-2npHQ:ZDGLzt2hs-Fy4\"><img src=\"https://66.media.tumblr.com/df187fe58a5b383c68c6af79c610f9ef/tumblr_pqqje9RofO1rjrkjio1_540.gif\" data-orig-height=\"280\" data-orig-width=\"540\"/></figure><p><i><b>requested by anonymous</b></i>: good afternoon i hope this isnt too specific of a request but may i request an imagine of the reader having shapshifting powers and became an avenger (reluctantly) and now dwells on the idea of not being able to have a normal life because there will always be responsibilities to fulfill and crime needed to be stop and one night theyre crying and peter finds them and tries to comfort them (im sorry this is kind of long but feel free to edit any parts you want).</p><p>-</p><p>   Ever since you discovered your powers, the magical ‘gift’ of shape shifting. You never felt the same way you did before that fateful day. You remembered it clearly, because you remembered the feeling so distinctly that it was still there weighing down in your chest. You were told the avengers would help, that it would feel normal because you were surrounded with a family that understood. But oh how wrong she was to believe it. A family, yes. That was for sure, but you definitely did not feel normal. </p><p>   It would be too much to say that you hated yourself, because you weren’t the type of person to let something take over your life on a whole. It became a part of yourself that you kind of pushed to the side, the ignored section of yourself. But when helping the Avengers with missions that definitely changed. That was something you couldn’t prevent, you love helping them, it made you feel better that you were using your abilities for good. </p><p>   There were multiple nights when she would lay awake in her bedroom at the compound, staring up at the blank ceiling with the window slightly ajar to let the cool air blow in. She thought about a lot of things, but the main topic on her mind was normally what it would be like if the powers hadn’t have occurred to her. She’d probably be in high school, with a group of friends or maybe a relationship. A crush at the very least. She’d be stressing out over homework, but hey it’s better than stressing about what mission you were gonna die on. It’s a heavy topic, one that could bring tears to your eyes. How much were you really missing out on? </p><p>   “Hey, shifter.” You got so used to the surprises that they became casual events for the two of you. The spider-boy and the shifter. He showed up to your window the most he could, but he had never seen you crying. Peter had seen you in a lot of states, on the brink of death even, but he had not once seen a tear fall from your eyes. “Hey, what’s up?”</p><p>   “It’s nothing.” You let out a light laugh. Not because you found the situation funny, but you found it amusing how you could let yourself cry over something you couldn’t control. Peter on the other hand, as horrible as it sounded, wished you would cry sometimes. Because it showed him that you weren’t going to keep anything inside.</p><p>   “It’s not nothing if you’re crying.” Peter replied, climbing through the window and closing it behind him. He dropped onto the bed next to her, looking up at her with curious eyes. Eyes that showed her he would listen.</p><p>   “Yeah, maybe I’m not as tough as I make myself out to be.” Your eyes casted down, Peters fingers moving to interlocking with yours. He gave your hand a reassuring squeeze. “I just feel like I’m missing out on being a teenager, you know?”</p><p>   “You’d want to be a teenager over an avenger?” Peter asked, eyebrows furrowed. To him, being an avenger had been more than a life goal to him. It had been a dream, one that so luckily came true. For you, it was cool but it was a full time thing. It wasn’t something she had to work for, it was too normal.</p><p><br/></p><p>   “You only say that because you get to be both, Peter.” You sighed, and Peter nodded slowly in agreement. At school, he got to be Peter Parker, and then he got to be Spider-Man too. He got both, but you got one thing all the time.</p><p>     “What if you could be both?” Peter looked like he had an idea, a small smile creeping up on his face. As much as he wanted to know that you could cry about things, that you would let yourself let go of things for a while. He hated seeing you upset, and he wanted to do something to help take that away.</p><p><br/></p><p>   “I’ve tried, I’m doomed to be locked in this feeling of not being regular.” You threw your head back into the pillow with a puff of air, slightly leaning it to the side to look at the brunette boy next to you. </p><p><br/></p><p>   “Not for tonight you’re not.” </p><p><br/></p><p>   “What are you talking about?” You asked, a smile creeping upon your own face as you watched Peter suddenly sit up from your bed excitedly.</p><p><br/></p><p>   “We’ll probably get in trouble, but tonight I’m gonna take you to all the teenagery things there are in town.” He grabbed your hands, pulling you up from the bed with a grin on his face. You looked at him intrigued, but you didn’t want him to waste his time on you. He had been on patrol, so he was most likely tired and wanted to go home. </p><p><br/></p><p>   “You don’t have to do that, Pete.” You shook your head as Peter held both your hands and stood in front of you. He stood taller, but not too much. </p><p><br/></p><p>    “I want to.” He promised, staring into your eyes. You smiled, before rolling your eyes and nodding. Peter was sweet and he cared about his friends more than anything. And that night you believed that not only did you get to experience some of the things with Peter, but you also got to experience the social part. Because that night you definitely developed a crush for the spider boy.</p><h2>-</h2><p><b><i>I’m sorry this is so bad? I’ve been going back to it and seeing what I could do but this is what came out of it lol. Hope you enjoyed anyway x</i></b></p>",
        "reblog": {
            "comment": "<p><h1><i><b>HEY, SHIFTER</b></i></h1><figure class=\"tmblr-full\" data-orig-height=\"280\" data-orig-width=\"540\" data-tumblr-attribution=\"bens-hardy:Nb0_9iqZ10dVwTeX-2npHQ:ZDGLzt2hs-Fy4\"><img src=\"https://66.media.tumblr.com/df187fe58a5b383c68c6af79c610f9ef/tumblr_pqqje9RofO1rjrkjio1_540.gif\" data-orig-height=\"280\" data-orig-width=\"540\"></figure><p><i><b>requested by anonymous</b></i>: good afternoon i hope this isnt too specific of a request but may i request an imagine of the reader having shapshifting powers and became an avenger (reluctantly) and now dwells on the idea of not being able to have a normal life because there will always be responsibilities to fulfill and crime needed to be stop and one night theyre crying and peter finds them and tries to comfort them (im sorry this is kind of long but feel free to edit any parts you want).</p><p>-</p><p>   Ever since you discovered your powers, the magical ‘gift’ of shape shifting. You never felt the same way you did before that fateful day. You remembered it clearly, because you remembered the feeling so distinctly that it was still there weighing down in your chest. You were told the avengers would help, that it would feel normal because you were surrounded with a family that understood. But oh how wrong she was to believe it. A family, yes. That was for sure, but you definitely did not feel normal. </p><p>   It would be too much to say that you hated yourself, because you weren’t the type of person to let something take over your life on a whole. It became a part of yourself that you kind of pushed to the side, the ignored section of yourself. But when helping the Avengers with missions that definitely changed. That was something you couldn’t prevent, you love helping them, it made you feel better that you were using your abilities for good. </p><p>   There were multiple nights when she would lay awake in her bedroom at the compound, staring up at the blank ceiling with the window slightly ajar to let the cool air blow in. She thought about a lot of things, but the main topic on her mind was normally what it would be like if the powers hadn’t have occurred to her. She’d probably be in high school, with a group of friends or maybe a relationship. A crush at the very least. She’d be stressing out over homework, but hey it’s better than stressing about what mission you were gonna die on. It’s a heavy topic, one that could bring tears to your eyes. How much were you really missing out on? </p><p>   “Hey, shifter.” You got so used to the surprises that they became casual events for the two of you. The spider-boy and the shifter. He showed up to your window the most he could, but he had never seen you crying. Peter had seen you in a lot of states, on the brink of death even, but he had not once seen a tear fall from your eyes. “Hey, what’s up?”</p><p>   “It’s nothing.” You let out a light laugh. Not because you found the situation funny, but you found it amusing how you could let yourself cry over something you couldn’t control. Peter on the other hand, as horrible as it sounded, wished you would cry sometimes. Because it showed him that you weren’t going to keep anything inside.</p><p>   “It’s not nothing if you’re crying.” Peter replied, climbing through the window and closing it behind him. He dropped onto the bed next to her, looking up at her with curious eyes. Eyes that showed her he would listen.</p><p>   “Yeah, maybe I’m not as tough as I make myself out to be.” Your eyes casted down, Peters fingers moving to interlocking with yours. He gave your hand a reassuring squeeze. “I just feel like I’m missing out on being a teenager, you know?”</p><p>   “You’d want to be a teenager over an avenger?” Peter asked, eyebrows furrowed. To him, being an avenger had been more than a life goal to him. It had been a dream, one that so luckily came true. For you, it was cool but it was a full time thing. It wasn’t something she had to work for, it was too normal.</p><p><br></p><p>   “You only say that because you get to be both, Peter.” You sighed, and Peter nodded slowly in agreement. At school, he got to be Peter Parker, and then he got to be Spider-Man too. He got both, but you got one thing all the time.</p><p>     “What if you could be both?” Peter looked like he had an idea, a small smile creeping up on his face. As much as he wanted to know that you could cry about things, that you would let yourself let go of things for a while. He hated seeing you upset, and he wanted to do something to help take that away.</p><p><br></p><p>   “I’ve tried, I’m doomed to be locked in this feeling of not being regular.” You threw your head back into the pillow with a puff of air, slightly leaning it to the side to look at the brunette boy next to you. </p><p><br></p><p>   “Not for tonight you’re not.” </p><p><br></p><p>   “What are you talking about?” You asked, a smile creeping upon your own face as you watched Peter suddenly sit up from your bed excitedly.</p><p><br></p><p>   “We’ll probably get in trouble, but tonight I’m gonna take you to all the teenagery things there are in town.” He grabbed your hands, pulling you up from the bed with a grin on his face. You looked at him intrigued, but you didn’t want him to waste his time on you. He had been on patrol, so he was most likely tired and wanted to go home. </p><p><br></p><p>   “You don’t have to do that, Pete.” You shook your head as Peter held both your hands and stood in front of you. He stood taller, but not too much. </p><p><br></p><p>    “I want to.” He promised, staring into your eyes. You smiled, before rolling your eyes and nodding. Peter was sweet and he cared about his friends more than anything. And that night you believed that not only did you get to experience some of the things with Peter, but you also got to experience the social part. Because that night you definitely developed a crush for the spider boy.</p><h2>-</h2><p><b><i>I’m sorry this is so bad? I’ve been going back to it and seeing what I could do but this is what came out of it lol. Hope you enjoyed anyway x</i></b></p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "marveley",
                    "active": true,
                    "theme": {
                        "header_full_width": 540,
                        "header_full_height": 250,
                        "header_focus_width": 342,
                        "header_focus_height": 193,
                        "avatar_shape": "circle",
                        "background_color": "#B8B8B8",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "10,469,203,127",
                        "header_image": "https://static.tumblr.com/26699df6e799fc42da4f2207de230c33/v2klrie/gn8pr220j/tumblr_static_.gif",
                        "header_image_focused": "https://static.tumblr.com/26699df6e799fc42da4f2207de230c33/v2klrie/2QHpr220m/tumblr_static_tumblr_static__focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/26699df6e799fc42da4f2207de230c33/v2klrie/gn8pr220j/tumblr_static__2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Bodoni Recut FS",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "184880912617"
                },
                "content_raw": "<p><h1><i><b>HEY, SHIFTER</b></i></h1><figure class=\"tmblr-full\" data-orig-height=\"280\" data-orig-width=\"540\" data-tumblr-attribution=\"bens-hardy:Nb0_9iqZ10dVwTeX-2npHQ:ZDGLzt2hs-Fy4\"><img src=\"https://66.media.tumblr.com/df187fe58a5b383c68c6af79c610f9ef/tumblr_pqqje9RofO1rjrkjio1_540.gif\" data-orig-height=\"280\" data-orig-width=\"540\"></figure><p><i><b>requested by anonymous</b></i>: good afternoon i hope this isnt too specific of a request but may i request an imagine of the reader having shapshifting powers and became an avenger (reluctantly) and now dwells on the idea of not being able to have a normal life because there will always be responsibilities to fulfill and crime needed to be stop and one night theyre crying and peter finds them and tries to comfort them (im sorry this is kind of long but feel free to edit any parts you want).</p><p>-</p><p>   Ever since you discovered your powers, the magical ‘gift’ of shape shifting. You never felt the same way you did before that fateful day. You remembered it clearly, because you remembered the feeling so distinctly that it was still there weighing down in your chest. You were told the avengers would help, that it would feel normal because you were surrounded with a family that understood. But oh how wrong she was to believe it. A family, yes. That was for sure, but you definitely did not feel normal. </p><p>   It would be too much to say that you hated yourself, because you weren’t the type of person to let something take over your life on a whole. It became a part of yourself that you kind of pushed to the side, the ignored section of yourself. But when helping the Avengers with missions that definitely changed. That was something you couldn’t prevent, you love helping them, it made you feel better that you were using your abilities for good. </p><p>   There were multiple nights when she would lay awake in her bedroom at the compound, staring up at the blank ceiling with the window slightly ajar to let the cool air blow in. She thought about a lot of things, but the main topic on her mind was normally what it would be like if the powers hadn’t have occurred to her. She’d probably be in high school, with a group of friends or maybe a relationship. A crush at the very least. She’d be stressing out over homework, but hey it’s better than stressing about what mission you were gonna die on. It’s a heavy topic, one that could bring tears to your eyes. How much were you really missing out on? </p><p>   “Hey, shifter.” You got so used to the surprises that they became casual events for the two of you. The spider-boy and the shifter. He showed up to your window the most he could, but he had never seen you crying. Peter had seen you in a lot of states, on the brink of death even, but he had not once seen a tear fall from your eyes. “Hey, what’s up?”</p><p>   “It’s nothing.” You let out a light laugh. Not because you found the situation funny, but you found it amusing how you could let yourself cry over something you couldn’t control. Peter on the other hand, as horrible as it sounded, wished you would cry sometimes. Because it showed him that you weren’t going to keep anything inside.</p><p>   “It’s not nothing if you’re crying.” Peter replied, climbing through the window and closing it behind him. He dropped onto the bed next to her, looking up at her with curious eyes. Eyes that showed her he would listen.</p><p>   “Yeah, maybe I’m not as tough as I make myself out to be.” Your eyes casted down, Peters fingers moving to interlocking with yours. He gave your hand a reassuring squeeze. “I just feel like I’m missing out on being a teenager, you know?”</p><p>   “You’d want to be a teenager over an avenger?” Peter asked, eyebrows furrowed. To him, being an avenger had been more than a life goal to him. It had been a dream, one that so luckily came true. For you, it was cool but it was a full time thing. It wasn’t something she had to work for, it was too normal.</p><p><br></p><p>   “You only say that because you get to be both, Peter.” You sighed, and Peter nodded slowly in agreement. At school, he got to be Peter Parker, and then he got to be Spider-Man too. He got both, but you got one thing all the time.</p><p>     “What if you could be both?” Peter looked like he had an idea, a small smile creeping up on his face. As much as he wanted to know that you could cry about things, that you would let yourself let go of things for a while. He hated seeing you upset, and he wanted to do something to help take that away.</p><p><br></p><p>   “I’ve tried, I’m doomed to be locked in this feeling of not being regular.” You threw your head back into the pillow with a puff of air, slightly leaning it to the side to look at the brunette boy next to you. </p><p><br></p><p>   “Not for tonight you’re not.” </p><p><br></p><p>   “What are you talking about?” You asked, a smile creeping upon your own face as you watched Peter suddenly sit up from your bed excitedly.</p><p><br></p><p>   “We’ll probably get in trouble, but tonight I’m gonna take you to all the teenagery things there are in town.” He grabbed your hands, pulling you up from the bed with a grin on his face. You looked at him intrigued, but you didn’t want him to waste his time on you. He had been on patrol, so he was most likely tired and wanted to go home. </p><p><br></p><p>   “You don’t have to do that, Pete.” You shook your head as Peter held both your hands and stood in front of you. He stood taller, but not too much. </p><p><br></p><p>    “I want to.” He promised, staring into your eyes. You smiled, before rolling your eyes and nodding. Peter was sweet and he cared about his friends more than anything. And that night you believed that not only did you get to experience some of the things with Peter, but you also got to experience the social part. Because that night you definitely developed a crush for the spider boy.</p><h2>-</h2><p><b><i>I’m sorry this is so bad? I’ve been going back to it and seeing what I could do but this is what came out of it lol. Hope you enjoyed anyway x</i></b></p></p>",
                "content": "<p><h1><i><b>HEY, SHIFTER</b></i></h1><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><p><i><b>requested by anonymous</b></i>: good afternoon i hope this isnt too specific of a request but may i request an imagine of the reader having shapshifting powers and became an avenger (reluctantly) and now dwells on the idea of not being able to have a normal life because there will always be responsibilities to fulfill and crime needed to be stop and one night theyre crying and peter finds them and tries to comfort them (im sorry this is kind of long but feel free to edit any parts you want).</p><p>-</p><p>   Ever since you discovered your powers, the magical &lsquo;gift&rsquo; of shape shifting. You never felt the same way you did before that fateful day. You remembered it clearly, because you remembered the feeling so distinctly that it was still there weighing down in your chest. You were told the avengers would help, that it would feel normal because you were surrounded with a family that understood. But oh how wrong she was to believe it. A family, yes. That was for sure, but you definitely did not feel normal. </p><p>   It would be too much to say that you hated yourself, because you weren&rsquo;t the type of person to let something take over your life on a whole. It became a part of yourself that you kind of pushed to the side, the ignored section of yourself. But when helping the Avengers with missions that definitely changed. That was something you couldn&rsquo;t prevent, you love helping them, it made you feel better that you were using your abilities for good. </p><p>   There were multiple nights when she would lay awake in her bedroom at the compound, staring up at the blank ceiling with the window slightly ajar to let the cool air blow in. She thought about a lot of things, but the main topic on her mind was normally what it would be like if the powers hadn&rsquo;t have occurred to her. She&rsquo;d probably be in high school, with a group of friends or maybe a relationship. A crush at the very least. She&rsquo;d be stressing out over homework, but hey it&rsquo;s better than stressing about what mission you were gonna die on. It&rsquo;s a heavy topic, one that could bring tears to your eyes. How much were you really missing out on? </p><p>   &ldquo;Hey, shifter.&rdquo; You got so used to the surprises that they became casual events for the two of you. The spider-boy and the shifter. He showed up to your window the most he could, but he had never seen you crying. Peter had seen you in a lot of states, on the brink of death even, but he had not once seen a tear fall from your eyes. &ldquo;Hey, what&rsquo;s up?&rdquo;</p><p>   &ldquo;It&rsquo;s nothing.&rdquo; You let out a light laugh. Not because you found the situation funny, but you found it amusing how you could let yourself cry over something you couldn&rsquo;t control. Peter on the other hand, as horrible as it sounded, wished you would cry sometimes. Because it showed him that you weren&rsquo;t going to keep anything inside.</p><p>   &ldquo;It&rsquo;s not nothing if you&rsquo;re crying.&rdquo; Peter replied, climbing through the window and closing it behind him. He dropped onto the bed next to her, looking up at her with curious eyes. Eyes that showed her he would listen.</p><p>   &ldquo;Yeah, maybe I&rsquo;m not as tough as I make myself out to be.&rdquo; Your eyes casted down, Peters fingers moving to interlocking with yours. He gave your hand a reassuring squeeze. &ldquo;I just feel like I&rsquo;m missing out on being a teenager, you know?&rdquo;</p><p>   &ldquo;You&rsquo;d want to be a teenager over an avenger?&rdquo; Peter asked, eyebrows furrowed. To him, being an avenger had been more than a life goal to him. It had been a dream, one that so luckily came true. For you, it was cool but it was a full time thing. It wasn&rsquo;t something she had to work for, it was too normal.</p><p><br /></p><p>   &ldquo;You only say that because you get to be both, Peter.&rdquo; You sighed, and Peter nodded slowly in agreement. At school, he got to be Peter Parker, and then he got to be Spider-Man too. He got both, but you got one thing all the time.</p><p>     &ldquo;What if you could be both?&rdquo; Peter looked like he had an idea, a small smile creeping up on his face. As much as he wanted to know that you could cry about things, that you would let yourself let go of things for a while. He hated seeing you upset, and he wanted to do something to help take that away.</p><p><br /></p><p>   &ldquo;I&rsquo;ve tried, I&rsquo;m doomed to be locked in this feeling of not being regular.&rdquo; You threw your head back into the pillow with a puff of air, slightly leaning it to the side to look at the brunette boy next to you. </p><p><br /></p><p>   &ldquo;Not for tonight you&rsquo;re not.&rdquo; </p><p><br /></p><p>   &ldquo;What are you talking about?&rdquo; You asked, a smile creeping upon your own face as you watched Peter suddenly sit up from your bed excitedly.</p><p><br /></p><p>   &ldquo;We&rsquo;ll probably get in trouble, but tonight I&rsquo;m gonna take you to all the teenagery things there are in town.&rdquo; He grabbed your hands, pulling you up from the bed with a grin on his face. You looked at him intrigued, but you didn&rsquo;t want him to waste his time on you. He had been on patrol, so he was most likely tired and wanted to go home. </p><p><br /></p><p>   &ldquo;You don&rsquo;t have to do that, Pete.&rdquo; You shook your head as Peter held both your hands and stood in front of you. He stood taller, but not too much. </p><p><br /></p><p>    &ldquo;I want to.&rdquo; He promised, staring into your eyes. You smiled, before rolling your eyes and nodding. Peter was sweet and he cared about his friends more than anything. And that night you believed that not only did you get to experience some of the things with Peter, but you also got to experience the social part. Because that night you definitely developed a crush for the spider boy.</p><h2>-</h2><p><b><i>I&rsquo;m sorry this is so bad? I&rsquo;ve been going back to it and seeing what I could do but this is what came out of it lol. Hope you enjoyed anyway x</i></b></p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]