[
    {
        "type": "text",
        "blog_name": "julibf",
        "blog": {
            "name": "julibf",
            "title": "A Song of Ice and Fire",
            "description": "",
            "url": "https://julibf.tumblr.com/",
            "uuid": "t:Jf2fGlBmkHh-SC8RKexAQQ",
            "updated": 1561351500
        },
        "id": 182430848706,
        "post_url": "https://julibf.tumblr.com/post/182430848706/my-ending-game-theory",
        "slug": "my-ending-game-theory",
        "date": "2019-01-30 20:18:17 GMT",
        "timestamp": 1548879497,
        "state": "published",
        "format": "html",
        "reblog_key": "xsz3o93l",
        "tags": [
            "jon snow",
            "sansa stark",
            "arya stark",
            "jonsa",
            "actually jonsa",
            "game of thrones"
        ],
        "short_url": "https://tmblr.co/ZVSYTn2fvkTR2",
        "summary": "MY ENDING GAME THEORY.....",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 259,
        "title": "MY ENDING GAME THEORY.....",
        "body": "<ul><li>Jon Snow and Sansa Stark will be the King and Queen of the 7 Kingdoms;<br/></li><li>Jon Snow will father a bastard daughter;<br/></li><li>Jon Snow will have half of his face burned down in the final battle and will be blind from one eye;<br/></li><li>Jon and Sansa will lie to protect the bastard girl and raise her as their trueborn child;<br/></li><li>Sansa is the “Younger and More Beautiful Queen” who will cast down Cersei;<br/></li><li>Sansa Stark will be known as THE QUEEN. She will be the one changing the laws of succession, allowing girls to be the heirs in front of their younger brothers;<br/></li><li>Jon Snow will be the one killing Cersei, he will be the Valonqar of the prophecy;<br/></li><li>The North will never bend the knee to a southern ruler ever again, but it may join the Realm in a new political division.<br/></li><li>Arya Stark will call the banners and lead the Northern armies in the new Rebellion;<br/></li><li>Arya Stark will be The Queen in the North;<br/></li><li>Bran Stark will be the most important player against the Night King, not the dragons;<br/></li><li>Daenerys will abandon the fight against the Army of the dead and march south, leaving the North to fight for themselves;<br/></li><li>We will have a Second Dance of Dragons between Jon Snow and Daenerys Targaryen;<br/></li><li>Daenerys arrival to Westeros will enter the history books as one of the worst events in the History of the 7 Kingdoms;<br/></li><li>Jaime Lannister will be the Hand of the King for Jon Snow; Jaime Lannister will marry Brienne of Tarth and restore House Lannister to their former glory;<br/></li><li>Tyrion Lannister will face his third trial, but this time he will be guilty of all his crimes;<br/></li><li>Tyrion Lannister will lose his tongue and be sent into exile to Essos;<br/></li><li>Daenerys will be the last antagonist of this story and will be remembered as THE QUEEN OF ASHES;<br/></li><li>House Targaryen will come to an end;<br/></li><li>Theon will be the King of the Iron Islands;<br/></li><li>The new capital of the realm will be in HighGarden;<br/></li><li>Episode 3 will be the Fight against the Army of the Dead;<br/></li><li>Episode 5 will be the Dance of Dragons.<br/></li><li>The Starks will rule the kingdom in the end, bringing a Time for Wolves.<br/></li></ul><p>________________________________________________________________</p><h2>JON SNOW AND SANSA STARK MARRIAGE……</h2><figure data-orig-width=\"400\" data-orig-height=\"400\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/9297104892701461ba194b2ee03af372/tumblr_inline_pm5u1kAW181sgp768_540.jpg\" alt=\"image\" data-orig-width=\"400\" data-orig-height=\"400\"/></figure><p><br/></p><p>Jon Snow and Sansa Stark will be the final King and Queen of the 7 Kingdoms. Their romance has been foreshadow pretty much since book 1 and season 1 and their marriage will bring peace and prosperity to Westeros. The wars of Ice and Fire will destroy the kingdom and they will be the ones rebuilding the realm to its former glory; Jon and Sansa storyline are in a perfect parallel and they have been groomed to be king and queen of Westeros for the whole storyline in the books.</p><h2>JON SNOW HAS ALWAYS LOVED SANSA STARK;</h2><p><br/></p><p>Jon Snow has always been in love with his cousin Sansa Stark, which is why he decided to go to the wall after Ned Stark accepted Sansa’s engagement to Joffrey Baratheon. Jon was written as a mirror to Jaime Lannister and one of the reasons Jaime decided to join the kingsguard was because he could never marry his sister and lover Cersei. Once the secret of Lyanna and Rheagar is finally out, Jon and Sansa will be free to be together. Their love story is the main romance of the books.</p><p>BTW, don’t be surprised if they reveal the romance between Jon and Sansa in the end of the first episode of season 8. The episode will start mirroring the pilot episode, when King Robert arrived at Winterfell with his Lannister family and we all know the episode ended with the reveal of Cersei and Jaime incestual romance.</p><p><br/></p><h2>JON SNOW IS GOING TO BE A STARK;</h2><p>Jon Snow is going to take Sansa Stark name and pass the Stark name to all his children. He will be finally be a Stark and die as a true son by law of Eddard Stark, just like he always dreamed of in the books. This was foreshadowed in season 6 episode 5, when Sansa cloaked Jon Snow with a Stark Cloak.</p><p><br/></p><h2>JON WILL FATHER A BASTARD</h2><p>Jon Snow will father a bastard. He will have trueborn sons with his wife Sansa Stark, but he will have a bastard girl with Daenerys. The books have foreshadowed this event to death. Jon and Sansa will pass this bastard girl as their own trueborn child and give her their Stark name. Sansa will raise this child as her own daughter and make her a Stark. That’s why the show wrote that scene with Catelyn Stark and Talissa on season 3 where Catelyn says that she failed to love and care for her husband bastard child, Sansa will do the opposite and love and care for Jon’s bastard daughter.</p><p>Jon will do the inverse of his uncle Ned, who lied and raised his trueborn nephew as a bastard. The story of Game of Thrones started with Ned Stark starting a war to prevent a bastard son of Cersei Lannister to sit in the Throne and it will end with a bastard daughter of Jon Snow as the heir of the Throne. History repeat itself and in the end, there wont be much difference between Starks and Lannister, they all lie to protect the ones they love.</p><p>“The things we do for love” will still be the theme of the story in the end….</p><p><br/></p><h2>THIS IS A STORY OF FATHER’S DAUGHTERS….</h2><p><br/></p><p>A SONG OF ICE AND FIRE its many tales in one; this is a tale of a Dragon prince madly in love with a Wolf girl; this is also a tale about home and families; about the things we do for love; it’s a story about tyranny and fear; its also a story about slow learners, who make several mistakes, but that eventually do learn, but ALSO, A SONG OF ICE AND FIRE, is a story about father’s daughters.</p><p>And that’s exactly what Arya, Sansa, Cersei, Daenerys, Brienne all are. These women are their father’s daughters. That’s why the show gave so much importance on those character’s fathers and hardly touched the mothers relevance.</p><p>No one thought Sansa and Daenerys had much of their fathers in themselves, those two characters were always associated with their mothers, yet they will prove to all of us that they carry much of Eddar and Aerys inside of them, in the last part of this story.</p><p><br/></p><h2>THE STARK SISTERS WILL GET EVERYTHING THEY EVER WANTED…</h2><blockquote><br/></blockquote><p><br/></p><figure data-orig-width=\"640\" data-orig-height=\"360\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/2f7beda43cf2d3363b1942b24764016c/tumblr_inline_pm5u2jBCaP1sgp768_540.png\" alt=\"image\" data-orig-width=\"640\" data-orig-height=\"360\"/></figure><blockquote><p>Arya: “We both wanted to be the other people when we were younger. You wanted to be a queen and sit next to a handsome, young king on the Iron Throne. I wanted to be a knight, to pick up a sword like father and go off to battle. Neither of us got to be that other person, did we? The world doesnt just let girls decide what they are going to be.”’</p><p>(SEASON 7 EPISODE 6)</p><p><br/></p></blockquote><h2>AND THEY ARE GOING TO BE QUEENS….</h2><p>Yes, we will have two queens. Game of Thrones started with two queens. Daenerys and Cersei; one a conqueror, the second a consort queen. Two women, whose obsession for the Iron Throne, left a trail of death and destruction on Essos and Westeros. So, we will finish this story with two queens, who will restore the Kingdom and improve the lives of their people. Sansa will be the consort queen of Jon Snow and Arya will be the warrior, the conquering queen that will lead the armies of North, Vale and Riverlands into war in season 8.</p><p><br/></p><h2>SANSA STARK WILL BE “THE QUEEN”;</h2><p><br/></p><p>Queen Sansa Stark will change the Law of Succession allowing girls to be heirs in front of their younger brothers. Sansa it’s the YMBQ of the prophecy and she will be the one casting Cersei Lannister down; Sansa will be very political active queen, changing laws and improving the lives of the people of Westeros and making important changes in the realm; She will be loved by her people and called THE QUEEN.</p><p>Sansa was always meant to be the final queen and the one who will rebuild the kingdom after the wars. Sansa entire storyline in the books was about observing the major players of the game make their moves and see the ramifications of those decisions. In Kings Landing, Sansa saw it first hand how ruling can affect the lives of the people in Westeros. She was able to see what to do, when in power, but also, what NOT to do as a king or queen. She learned a lot from Cersei, Margaery, Ollena, the Tyrells, The Lannisters, Littlefinger and will use this education for good use as a queen.</p><p>All Sansa’s dreams will come true and she will be a living proof that “life is a song”. She will marry her brave and gentle hero; she will have children and rebuild her family and she will be a very beloved queen, admired for her beauty and kindness.</p><p><br/></p><h2>ARYA WILL BE THE QUEEN IN THE NORTH;</h2><p><br/></p><p>Arys Stark will rule the North as a Regent Queen. Arya storyline in season 8 will be a copy of Papa Ned in the first Rebellion against the Mad King. She will call the banners and lead the North armies into battle in the final war of this story. George RRMartin himself said that she would conquer the world in the final part of this tale.</p><p><br/></p><h2>ARYA WILL BE VERY IMPORTANT IN THE FINAL SEASON !!!!!</h2><p><br/></p><p>Arya is season 8 will be a huge warrior, with the help of Nymeria and their pack of wolves, she is going to lead their armies into battle, defeating Daenerys armies in combat (yes, the Dothraki bitches!!!!!!) They will probably meet in the Riverlands, where Rheagar and Robert had their first and final confrontation. She will be the one who will kill the mountain, avenging the people that he cruelly killed in the Riverlands and the Hound. Just like papa Ned became famous for killing Ser Arthur Dane, Arya will be legendary for killing the Mountain. They will write songs about her for years and years to come……</p><p><br/></p><h2>BRAN STARK WILL BE THE MAGICAL FORCE TO STOP THE ARMY OF THE DEAD…</h2><h2><br/></h2><figure data-orig-width=\"628\" data-orig-height=\"646\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/cb5a9eeba9a21e09fa027a4d5e29bee9/tumblr_inline_pm5u5aiMqM1sgp768_540.png\" alt=\"image\" data-orig-width=\"628\" data-orig-height=\"646\"/></figure><h2><br/></h2><p>I know the audience expects Daenerys and her dragons to be the magical force used to stop the Army of the Dead, but, don’t be shocked if she decides to abandon the cause in the middle of the fight and leave the North before the big battle against the Night King. There is a lot of Stannis in Daenerys character arc on season 7 and in the end, Stannis left Jon and the Nights Watch on their own to fight the Night King on Hardhome, and went to march to Winterfell to fight the Boltons. Stannis could never let it go completely of the Iron Throne and I expect Dany to do the same.</p><p>Its Bran Stark, who has been preparing himself to face this threat since the beginning of this story. Its Bran Stark who has been foreshadowed by the books and tv show to be the one who will matter the most in the end. Not the dragons. I suspect we will see the ghosts of the Kings of Winter, coming out from the crypts of Winterfell, to fight the final battle against the Army of the Dead.</p><p>Bran: What else have you seen it? Jojen: The ONLY think that matters. YOU.</p><p>(Season 3 Episode 2)</p><p>Also, in the first Long Night, there was no Targaryens; The North was left to fight on its own with the help of the Children of the Forest and George likes to repeat his stories very closely to the original. Defeating the Army of the Dead wont be Bran only job in season 8, he has also been written as a foil to Daenerys, so I believe he will be involved on her final defeat.</p><p><br/></p><h2>DAENERYS WILL BE THE FINAL ANTAGONIST IN SEASON 8 AND WE WILL HAVE A SECOND DANCE OF DRAGONS BETWEEN JON AND DANY……</h2><p><br/></p><figure data-orig-width=\"750\" data-orig-height=\"563\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/21fdccfff8b756b781f5c03f45e95a7e/tumblr_inline_pm5u5w9MAV1sgp768_540.jpg\" alt=\"image\" data-orig-width=\"750\" data-orig-height=\"563\"/></figure><h2><br/></h2><blockquote><p>Jon Snow: <b>“They will see it you for “what you are”.</b></p><p><b>(</b>SEASON 7 EPISODE 6)</p><p><br/></p></blockquote><p>In the beginning of this story we saw Sansa Stark falling madly in love with a beautiful prince, only to have her heart broken in a million of pieces in the end of season 1, when Joffrey shocked her by cutting her father’s head, finally showing how cruel and monstrous he really was. In the beginning of the series, we also had the audience falling madly in love with the beautiful Daenerys Targaryen, believing she was the hero of this story and just like Sansa, the audience will be shocked by Daenerys actions in season 8 and they will have their hearts completely broken in a million of pieces. Daenerys will finally show to the audience the monster that she really is. I expect to see a lot of shades of Joffrey on Daenerys in season 8. Remember, Joffrey believed his whole life he was the true heir of the Iron Throne, until a Stark man showed up in his life, telling him that this was a lie. This is exactely what is going to happen to Daenerys in season 8.</p><p>Remember when Sansa Stark fell madly in love with a monster and trusted a beautiful queen blindly when she was warned against it? You are all Sansas, you just don’t know yet.</p><p>Daenerys could never be the villain of her own story. That’s why it was always necessary for her to create a lie that painted her as the hero. She invaded Astapor to save the Unsulied from the evil wise masters; she conquered Meereen to pay back the slavers for crucifying the children slaves; she destroyed the sacred temple of Vaes Dothrak and killed all the Khalls, but she did for the Dothraki widows who didnt wish to stay in the Dosh khaleen. Now in Westeros she had no more excuses, there is no slavery or evil masters torturing young boys in the 7 Kingdoms, so she was forced to create a new excuse to defend her invasion of Westeros.</p><p>So, she told the audience that she wants to break the wheel of power that crushes the poor and the weak on Westeros. It makes no sense of course. She wants to break the wheel, by building a new wheel, this time, with only her family on top, crushing those under her. This is a phony ridiculous excuse and its supposed to be ridiculous. It’s a silly lie, all Daenerys wants in the Iron Throne, but she cant admit it afraid it will make her look bad, so she created this silly little lie and the audience (just like Sansa fell into Cersei silly lies in season 1) fell right into. What Dany really wants is install an absolute monarchy, with only HER in power.</p><p>Daenerys is a false prophet, who invented a sacred mission to convince her people and those who follow her of her good intentions, yet all her actions are motivated from the desire to take The Iron Throne, that’s the one thing who truly matters for Daenerys and now in season 8, when her claim to the Throne will be contested by the bombastic news of Jon Snow stronger claim to the Throne. That’s whe she will finally show to the audience who she really is.</p><p><br/></p><h2>WHAT HAPPENS WHEN WE BLINDLY FOLLOW, GOD AND HEROS;</h2><p><br/></p><p>By writing Daenerys Targaryen, George RRMartin wanted to show us how dictators and cult leaders are created. They started magical and inspiring, making beautiful speeches and promising great things, but in end, most of them are motivated by selfish desires and allow power to corrupt them. Daenerys story is also a warning about following leaders without questioning their motivations or decisions. Daenerys is adored as a goddess by her followers and never has her decision questioned by them. Unlike Jon Snow who is always questioned by Sansa, The North Lords and the Wildlings about his decisions. The Dothraki and the Unsullied just blindly follow Daenerys around, like children following their mothers, never questioning her real motives, or even contemplating if the move to Westeros has actually any benefits for them. And as we are about to see in season 8, following leaders blindly can be a very dangerous thing because it can lead us to our graves. The audience, the Dothraki and the Unsullied never thought that their hero could just simply be lying to them……No matter how much destruction and death she causes, her followers and advisers keep believing in her, defending her decisions, turning a blind eye to her questionable actions, finding excuses to her terrible acts. They know that she can be impulsive and dangerous but believe that in the end she is motivated by great ideals and will always listen to her advisers……..</p><p>Daenerys first instinct is always destruction and violence, but most of the time, she is restrained by her advisers………. But the rope that holds her together is about to be ripped apart in season 8.</p><p><br/></p><blockquote><p>Daario Naharis: <b>“I pity the Lords of Westeros, they have no idea what is coming for them”</b></p><p>(SEASON 6 EPISODE 10)</p><p><br/></p></blockquote><p>Daenerys was always meant to be the final antagonist of the story, her time in Essos was not about learning to be a good queen, she was learning to be a ruthless conqueror, which she learned very well. Don’t be surprised if she marries Euron Greyjoy, they marriage has been foreshadowed on books and tv show. Daenerys its gonna shock the audience, she is going to behave in a way that will surprise a lot of people.<br/></p><p>Jon and Daenerys relationship will mirror Rhaenyra and Aegon tragic battle for the Throne; This will be the final battle on episode 5, the fight for the Throne has always been the main focus of the story and this battle its what is going to put an end to this tale. Westeros will finally be united against the common enemy, which is Daenerys and her dragons.</p><p>The Army of the Dead and the Night King were always a red herring, its was always Daenerys and her dragons the major threat for Westeros. I believe that more than half of the population of Westeros will perish during the final wars; many who survive the war will latter die during the winter without the food that was destroyed by Daenerys dragons in the Field of Fire 2.0; in her short period in Westeros, Daenerys will cause a lot of deaths and destruction and she will be remembered as the Queen of Ashes.</p><p>The stallion that mounts the world was never Rhaego. It was always going to be Daenerys. Essos will also be throw into chaos, without Daenerys dragons to impose order, the masters of Astapor, Meereen and the local cities will raise again and the region will probably be engulfed into a civil war. It will probably take centuries for the world to recover from Daenerys reign of terror.</p><p><br/></p><h2>WINTER WILL COME TO HOUSE TARGARYEN;</h2><p><b><br/></b></p><p>Daenerys final battle on episode 5, will turn Kings Landing into ashes, but she wont be destroying just the capital of the realm, she will also put an end to House Targaryen. Their dynasty started with the destruction of Harrenhall and will end with the destruction of the capital that The Targaryens themselves build, closing a cycle of tyranny, fear and terror. Daenerys will be the last dragon.</p><h2>DRAGONSTONE WILL FAIL;</h2><p><br/></p><figure data-orig-width=\"2000\" data-orig-height=\"1120\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/31e728bb18f6e03ee2f8869ca038918f/tumblr_inline_pm5u98wcWp1sgp768_540.png\" alt=\"image\" data-orig-width=\"2000\" data-orig-height=\"1120\"/></figure><h2><br/></h2><p>I believe that Dragonstone will be destroyed in the end. The Castle in the remote island serves no purpose for Westeros. It can not be used for grains production or animal livestock, the only use for Dragonstone in the past centuries was to be used as base for a foreign invasion, the castle will probably be destroyed in the end. Also important, Daenerys spent this entire story threatening to destroy other’s peoples houses and cities. To have her own ancestral House destroyed in the end would be very fitting to the story.<br/></p><p><br/></p><blockquote><p><i>“so comes snow, after fire and even dragons have their ending” </i></p><p>J. R.R TOKIEN</p></blockquote><p><br/></p><h2>WE WILL HAVE A SECOND REBELLION AND A SECOND DANCE OF THE DRAGONS…</h2><p><br/></p><blockquote><p>Don&rsquo;t fight in the North. Or the South. Fight every battle, everywhere, always, in your mind. Everyone is your enemy, everyone is your friend&hellip; every possible series of events is happening all at once. Live that way and nothing will surprise you, ……..everything that happens will be something that you have seen before.</p><p>(Litllefinger SEASON 7 EPISODE 2)</p><p><br/></p></blockquote><p><br/></p><p>Everything that happened in the past will happen again in season 8. Robert’s Rebelion will happen again. Sansa will be kidnapped at some point, just like aunt Lyanna Stark; Arya will lead the North armies south to save her sister (just like Ned Stark did in Robert’s Rebellion). The Riverlands, the North and the Vale will once again gather forces and go to war.</p><p><br/></p><p><br/></p><blockquote><p>Stannis: “What are you reading?”</p><p>Shireen: <b>&ldquo;The Dance of Dragons.&rdquo;</b></p><p>Stannis: “What&rsquo;s it about? It&rsquo;s the story of the fight between Rhaenyra Targaryen and her half-brother Aegon for control over the Seven Kingdoms. Both of them thought they belonged on the Iron Throne. When people started declaring for one of them or the other, their fight divided the kingdoms in two. <b>Brothers fought brothers, dragons fought dragons. By the time it was over, thousands were dead. And it was a disaster for the Targaryens as well. They never truly recovered.</b></p><p>(GAME OF THRONES SEASON 5 EPISODE 9)</p><p><br/></p><p><br/></p></blockquote><p>We will have a second Dance of Dragons, with the kingdom divided between Jon Snow and Daenerys Targaryen. The Lannisters will be divided too by this war. Tyrion (the flop) will choose Daenerys side and Jaime will choose Jon Snow and the Starks. This will be the decision that will change Jaime Lannister legacy forever.</p><p>Millions will die, but in the end Jon Snow and his armies will defeat Daenerys and her dragons. This war will not only destroy the realm but finally bring an end to the Targaryen dynasty. This battle will probably happens on episode 5.</p><p><br/></p><h2>SANSA’S PLANS TO CAST DOWN CERSEI…</h2><p><br/></p><figure data-orig-width=\"500\" data-orig-height=\"287\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/606011674977c01975eb40f294e3fd29/tumblr_inline_pm5uanuNnL1sgp768_540.png\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"287\"/></figure><h2><br/></h2><h2><br/></h2><p>Sansa will be kidnapped in season 8, probably by Cersei, but don’t be surprised if this kidnapping has a twist. In season 1, in the scene where Cersei and the small council is forcing Sansa to write down a letter to Rob Stark demanding him to bend the knee to King Joffrey., we have Maester Pycelle warning Cersei that Sansa may be so sweet and innocent now, but once she is older, she may hatch some treasons!!!!</p><blockquote><p>“she (Sansa) may be a sweet thing now Your Grace, but in 10 YEARS, who knows what treasons she may hatch!!!!”</p><p>(SEASON 1 EPISODE 8)</p><p><br/></p></blockquote><p>Now, we know that Sansa did learn a lot from Cersei and maybe now she is finally ready to outsmart her former teacher… This was the first foreshadowing of Sansa’s plans to cast down Cersei.</p><p>And in season 6, we have another foreshadowing of how Sansa will plot against Cersei in the end, When Arya is in Braavos, she watches a Bravossi Theather play telling the events that happened in Westeros. In that storyline, the actress that plays Sansa hires a faceless man to kill the actress who plays Cersei, Lady Crane. I believe this was another foreshadowing of the events that will happen in season 8. Its Sansa who is taking Cersei down. The little dove will prove to the queen that she learned all her lessons. But I believe Jon Snow will be the one killing Cersei.</p><p><br/></p><h2>EPISODE 5 WILL BE THE DANCE OF DRAGONS;</h2><p><br/></p><blockquote><p>He was no dragon, Dany thought, curiously calm. Fire cannot kill a dragon.</p><p>(A Game of Thrones - Daenerys V)</p><p><br/></p></blockquote><p><br/></p><p>Well I believe thats exactly whats its gonna happen. In order to defeat Daenerys you have to kill her last dragon, Drogon, which we know will be flying over Kings Landing in the end of this story. Thats how the wildfire comes in. I actually think Jon and the Lannisters may set a trap for Dany and use the wildfire to kill the dragon and Daenery’s remain armies. Maybe Bran was behind King Aerys decision to cover KL with wildfire, already preparing to use against Daenerys in the finall battle for the Throne. if we rewatch season 5 episode 7 we had a little hint about this idea.</p><p><br/></p><blockquote><p>DAARIO: On the day of the Great Games, gather all the great masters, and wise masters, and worthy masters you can find, and slaughter them all.</p><p>DAENERYS: I am a queen. Not a butcher.</p><p>DAARIO: All rulers are either butchers or meat.</p><p><br/></p></blockquote><p><br/></p><p>Remember that Bran’s first chapter he is forced to watch his father doing the Kings’s justice and Ned explains to him that “the man who passes the sentence, must swing the sword”. This is one of the most important themes in the story.</p><p>Also, in season 4 episode 2, we have Bran having a vision of the events that will happen for the first time. This is THE vision where he sees the dragon flying over KL. After the vision he tells Jojen and Meera: “I know where we have to go”. The show then cuts to a scene in Kings Landing.</p><p>So, I do believe Bran will be involved with the explosion of Kings Landing and using the wildfire as a last weapon to defeat Daenerys and her last dragon. Thats the only way Westeros will ever be free of the Targaryens.</p><p>BTW, gathering all your enemies in a closed space and destroying them with fire has been used by both mad queens, Cersei and Daenerys, so maybe now we will see the Starks using this idea to finally get rid of Daenerys, her armies and her dragon.</p><p><br/></p><h2>THE FUTURE OF HOUSE LANNISTER</h2><p>No, House Lannister will not fall into nothing like the Targaryens. The House will be saved by Jaime Lannister, who will marry Brienne of Tarth and restore his family and legacy.</p><p><br/></p><h2>JAIME LANNISTER ITS GOING TO BE THE FINAL HAND AND ITS GOING TO END THIS STORY AS A GREAT HERO;</h2><p><br/></p><figure data-orig-width=\"980\" data-orig-height=\"490\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/73b5389c30d8ef91064c03b6c0a5f945/tumblr_inline_pm5ueyWqgV1sgp768_540.jpg\" alt=\"image\" data-orig-width=\"980\" data-orig-height=\"490\"/></figure><p>Jaime Lannister will choose Jon Snow, this will be the turning point for Jaime and the choice that will change his legacy. There is some very good foreshadowing in the books that hint to us that Jaime will side with Jon Snow in the final battle and help him to defeat Daenerys and her dragons.<br/></p><p>I believe it will be Jaime who will kill Daenerys last dragon, Drogon, and becoming famous as a DRAGONSLAYER; Jaime Lannister will have a big role in the final part of this story, not only helping defeat the ARMY OF THE DEAD, but also defeating Daenerys Targaryen and saving the Kingdom once again from a tyrannical Targaryen; only this time he will finally receive the thank you, from the people of Westeros;</p><p>Jaime will be greeted as a hero and will end this story beloved and admired by the people. I believe at some point in season 8 Jaime will die and will be brought back to life, his character was written as a mirror to Jon Snow and Jon died on season 5, so this storyline may be possible.</p><p>Jaime will be the Hand of the King for Jon Snow (there is a lot of foreshadowing for this, in both books and tv show) and he will be able to finish his history in the white book as a hero. He will go down in history as one of the greatest Hands in the history of the 7 kingdoms. Jaime will be the last Lannister left on Westeros.</p><p><br/></p><h2>TYRION WILL BE SENT INTO EXILE;</h2><p><br/></p><p>Tyrion will have to face a trial for a third time and this time he will be guilty of his crimes. Yeah, that is not a prediction, it’s a spoiler, but I already expected that. George loves his 3. Tyrion its one of the characters that will have a very tragic ending. He was the fool who brought Daenerys to Westeros believing he could control her, the same mistake his sister Cersei tried to do with Joffrey. He invited Jon Snow under false premises to Dragonstone without mentioning to Jon about Daenerys demands to bend the knee.</p><p>He made a deal with Cersei that was never disclosed to the audience and I believe he may be behind Sansa’s kidnapping story in season 8. He keeps making one mistake after the other, always believing to be smarter than the people around him, always under estimating the players of the game.</p><p>But I don’t believe he will die. In the House videos released for season 8, they had the Lannisters brothers, Jaime and Tyrion, saying goodbye to each other and I believe we will see them say good bye one last time. I think Tyrion will be sent into exile to Essos, and banned from returning to Westeros.</p><p><br/></p><h2>CERSEI WILL DIE;</h2><p>There has been a lot of foreshadowing about Cersei death and its one of the events many believe it happen for sure. The show made sure to write us a scene when her ending is predicted.</p><p><br/></p><blockquote><p>“I will hurt you for this. A day will come when you think you’re safe and happy and your joy will turn to ashes in your mouth. And you will know the debt is paid.”</p><p>(Tyrion - SEASON 2 EPISODE 8)</p><p><br/></p></blockquote><p><br/></p><p>This episode was written by George RRMartin himself, so, I always assumed this was Cersei Lannister ending… Then in season 7, we had Jon Snow threatening to kill Littlefinger is he ever touched Sansa. In that scene we have Jon Snow choking Baelish with his cold hands and I believe this scene could be a foreshadow of Jon finally killing Cersei, for trying to hurt Sansa in season 8. The prophecy says that Cersei will be killed by the “little brother” and Jon Snow fits that role as the younger son of Rheagar Targaryen.</p><p>_______________________________________________________________</p><p><br/></p><h2>THEON WILL BE KING OF THE IRON ISLANDS;</h2><p>He lifted his head to look at her. &ldquo;Catelyn,&rdquo; he said. His voice was distant and formal. &ldquo;Where are the children?&rdquo;</p><p>A Game of Thrones - Catelyn I</p><p>I believe the children of Wintefell were always meant to be the heroes of this story. That’s why George made sure to have a Greyjoy, a Targaryen be raised close to the Stark children. Those children now are gonna be the rulers of Westeros and they will be the ones passing Ned Stark legacy forward, building a new and better world.</p><p>Thast why I believe Theon will kill Euron Greyjoy and be the king of the Iron Islands; Theon probably has a bastard child with the captain’s daughter he met in season 2 on his journey to Pike, he will recognize the child and raise them as his heir;</p><h2>A TIME FOR WOLVES;</h2><p><b><br/></b></p><figure data-orig-width=\"599\" data-orig-height=\"287\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/e6eaee32c64120ed47c03b3bc7061f9d/tumblr_inline_pm5uvnO0W51sgp768_540.png\" alt=\"image\" data-orig-width=\"599\" data-orig-height=\"287\"/></figure><p><br/></p><p>It will be a Time for Wolves; a new period for Westeros. Jon will rule surrounded by Starks, carrying the Stark name with Sansa and Bran by his side; The capital will probably be transferred to HighGarden, not only the castle it is still intact but its also located in the most fertile area of Westeros. It seems like a very interesting political decision. Again, I found a lot of foreshadowing for this in the books.</p><p>Jon Snow will rule over a graveyard, as he predicted in season 7. But the ending will be very sweet, with kids playing around in gardens and celebrating. We will see Jon, the Stark kids, Jaime and Brienne, Sam and Guilly, Theon….. ect all enjoying spring and celebrating their happy ending.</p><p><br/></p><p><br/></p><h2>THE VERY LAST SCENE OF THE STORY…..</h2><p><br/></p><p>Daniel Abraham is the man responsible for converting the Game of Thrones book into a comic, mentioned that there is a particular line of dialog in the game of thrones book, which is very important for the last scene of &ldquo;A Dream of Spring&rdquo;.</p><p>Have you collaborated at all with George R.R. Martin in the process of adapting the novel to comics? If so, what’s the creative process there?</p><p>Daniel: &ldquo;I’ve spoken to George a lot in the process. The biggest issues we have are continuity questions. There are things about this story that only he knows, and they aren’t all obvious. There was one scene I had to rework because there’s a particular line of dialog – and you wouldn’t know it to look at – that’s important in the last scene of “A Dream of Spring.”- Daniel Abraham</p><p>On episode 1, when King Robert goes to visit Winterfell, he and Ned go down in the crypts to pay their respects to Lyanna Stark, the wolf girl he lost to Rheagar Targeryen. In that scene, the dialogue is different from what we have in the books.</p><p><br/></p><blockquote><p>ROBERT: Did you have to bury her in a place like this? She should be on a hill somewhere with the sun and the clouds above her.</p><p>NED: She was my sister. This is where she belongs.</p><p><br/></p></blockquote><p>In the books, this conversation is different:</p><p><br/></p><p><br/></p><blockquote><p>&quot;Ah, damn it, Ned, did you have to bury her in a place like this?&rdquo; His voice was hoarse with remembered grief. &ldquo;She deserved more than darkness …&rdquo;</p><p>&ldquo;She was a Stark of Winterfell,&rdquo; Ned said quietly. &ldquo;This is her place.&rdquo;</p><p>A Game of Thrones - Eddard I</p><p><br/></p></blockquote><p>I think this is the scene. I believe we will end this story with King Jon visiting his late wife Sansa Stark in the crypts of Winterfell and someone will ask him why did he buried her there, why not building a monument for her, so that she could be on display and that’s how he will reply:<br/></p><p><br/></p><blockquote><p>She was a Stark of Winterfell, this is where she belongs….</p><p><br/></p></blockquote><p>What made me believe this, were two momments of the story: First of all, Lady’s death. After Sansa direwolf is killed on her way to the south, Ned Stark makes sure to send a group of men back to the North and Winterfell, so that she can be buried in Northerner soil. Lady represented a little bit of Sansa, who died on that day and I dont think it was a silly detail George rrmartin make sure that her direwolf body was buried on Winterfell, I think that this scene, was much more important than most people think about it.</p><p><br/></p><blockquote><p>When it was over, he said, “Choose four men and have them take the body north. <b>Bury her at Winterfell</b>.”</p><p>“All that way?” Jory said, astonished.“All that way,” Ned affirmed. “The Lannister woman shall never have this skin.”</p><p>A Game of Thrones - Eddard III</p><p><br/></p></blockquote><p>Another momment in the story was Ygritte death. In both books and show, Jon Snow takes her body and goes to bury her up North, where she belonged.</p><p><br/></p><blockquote><p>Tormund: Did you love her? She loved you.</p><p>Jon: She told you?</p><p>Tormund: No. All she ever talked about was killing you. That’s how I know. <b>She belongs in the North. The real North.</b> You understand me?</p><p><br/></p></blockquote><p><br/></p><p>Look at the excuse Tormund gives Jon to why Ygritte needs to be buried North of the Wall, its the same Ned Stark used to explain to King Robert why Lyanna had to be buried in the Crypts of Winterfell. Because thats where she belongs…….</p><p>I also believe this ending could bring the story to a full circle, because there is also the theme of the audience never really thinking as Sansa as a TRUE STARK. There is still the notion that Sansa is not really a Stark like Jon or Arya.</p><p>Sansa Starkiness was always a topic of contention among fans of the books and series. Many like to refer to Sansa as Lady Lannister or Lady Bolton, so to have Sansa finally resting in the Winterfell crypts, by the end of this story, as a Stark, would be a very satisfying ending. Her hair maybe red and some of her manners may be more southern like, but Sansa IS A STARK.</p><p>And in fact, she is the Stark who took back the North and Winterfell, she is the Stark who made possible for the family to reunite and be safe; she is the Stark who stood by Jon side when he was made King in the North and supported his claim; she was the Stark who prepared the North for the wars and the winter and she will be the Stark who will rule the 7 Kingdoms together with her husband.</p><p>Both Jon and Sansa are foreshadowed to live very long lives and I expect their ruling period to last decades. They will be the ones restoring and rebuilding the kingdom after the wars of Ice and Fire. But I do believe Jon will live longer based on a quote from the books.</p><p><br/></p><blockquote><p>Tyrion shared around his skin of wine until even Yoren grew mellow. <b>One by one the company drifted off to their shelters and to sleep, all but Jon Snow, who had drawn the night’s first watch.</b> Tyrion was the last to retire, as always. As he stepped into the shelter his men had built for him, he paused and looked back at Jon Snow. The boy stood near the fire, his face still and hard, looking deep into the flames. Tyrion Lannister smiled sadly and went to bed. -<br/>AGOT Tyrion II</p></blockquote><p><br/></p><p>And because of this line, I believe Jon Snow ill be the last one to die, he will live a very long life and will be forced to see all the ones he loved pass away, one by one.</p><p><br/></p><p><br/></p><h2>THE END OF GAME OF THRONES…</h2>",
        "reblog": {
            "comment": "<p><ul><li>Jon Snow and Sansa Stark will be the King and Queen of the 7 Kingdoms;<br></li><li>Jon Snow will father a bastard daughter;<br></li><li>Jon Snow will have half of his face burned down in the final battle and will be blind from one eye;<br></li><li>Jon and Sansa will lie to protect the bastard girl and raise her as their trueborn child;<br></li><li>Sansa is the “Younger and More Beautiful Queen” who will cast down Cersei;<br></li><li>Sansa Stark will be known as THE QUEEN. She will be the one changing the laws of succession, allowing girls to be the heirs in front of their younger brothers;<br></li><li>Jon Snow will be the one killing Cersei, he will be the Valonqar of the prophecy;<br></li><li>The North will never bend the knee to a southern ruler ever again, but it may join the Realm in a new political division.<br></li><li>Arya Stark will call the banners and lead the Northern armies in the new Rebellion;<br></li><li>Arya Stark will be The Queen in the North;<br></li><li>Bran Stark will be the most important player against the Night King, not the dragons;<br></li><li>Daenerys will abandon the fight against the Army of the dead and march south, leaving the North to fight for themselves;<br></li><li>We will have a Second Dance of Dragons between Jon Snow and Daenerys Targaryen;<br></li><li>Daenerys arrival to Westeros will enter the history books as one of the worst events in the History of the 7 Kingdoms;<br></li><li>Jaime Lannister will be the Hand of the King for Jon Snow; Jaime Lannister will marry Brienne of Tarth and restore House Lannister to their former glory;<br></li><li>Tyrion Lannister will face his third trial, but this time he will be guilty of all his crimes;<br></li><li>Tyrion Lannister will lose his tongue and be sent into exile to Essos;<br></li><li>Daenerys will be the last antagonist of this story and will be remembered as THE QUEEN OF ASHES;<br></li><li>House Targaryen will come to an end;<br></li><li>Theon will be the King of the Iron Islands;<br></li><li>The new capital of the realm will be in HighGarden;<br></li><li>Episode 3 will be the Fight against the Army of the Dead;<br></li><li>Episode 5 will be the Dance of Dragons.<br></li><li>The Starks will rule the kingdom in the end, bringing a Time for Wolves.<br></li></ul><p>________________________________________________________________</p><h2>JON SNOW AND SANSA STARK MARRIAGE……</h2><figure data-orig-width=\"400\" data-orig-height=\"400\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/9297104892701461ba194b2ee03af372/tumblr_inline_pm5u1kAW181sgp768_540.jpg\" alt=\"image\" data-orig-width=\"400\" data-orig-height=\"400\"></figure><p><br></p><p>Jon Snow and Sansa Stark will be the final King and Queen of the 7 Kingdoms. Their romance has been foreshadow pretty much since book 1 and season 1 and their marriage will bring peace and prosperity to Westeros. The wars of Ice and Fire will destroy the kingdom and they will be the ones rebuilding the realm to its former glory; Jon and Sansa storyline are in a perfect parallel and they have been groomed to be king and queen of Westeros for the whole storyline in the books.</p><h2>JON SNOW HAS ALWAYS LOVED SANSA STARK;</h2><p><br></p><p>Jon Snow has always been in love with his cousin Sansa Stark, which is why he decided to go to the wall after Ned Stark accepted Sansa’s engagement to Joffrey Baratheon. Jon was written as a mirror to Jaime Lannister and one of the reasons Jaime decided to join the kingsguard was because he could never marry his sister and lover Cersei. Once the secret of Lyanna and Rheagar is finally out, Jon and Sansa will be free to be together. Their love story is the main romance of the books.</p><p>BTW, don’t be surprised if they reveal the romance between Jon and Sansa in the end of the first episode of season 8. The episode will start mirroring the pilot episode, when King Robert arrived at Winterfell with his Lannister family and we all know the episode ended with the reveal of Cersei and Jaime incestual romance.</p><p><br></p><h2>JON SNOW IS GOING TO BE A STARK;</h2><p>Jon Snow is going to take Sansa Stark name and pass the Stark name to all his children. He will be finally be a Stark and die as a true son by law of Eddard Stark, just like he always dreamed of in the books. This was foreshadowed in season 6 episode 5, when Sansa cloaked Jon Snow with a Stark Cloak.</p><p><br></p><h2>JON WILL FATHER A BASTARD</h2><p>Jon Snow will father a bastard. He will have trueborn sons with his wife Sansa Stark, but he will have a bastard girl with Daenerys. The books have foreshadowed this event to death. Jon and Sansa will pass this bastard girl as their own trueborn child and give her their Stark name. Sansa will raise this child as her own daughter and make her a Stark. That’s why the show wrote that scene with Catelyn Stark and Talissa on season 3 where Catelyn says that she failed to love and care for her husband bastard child, Sansa will do the opposite and love and care for Jon’s bastard daughter.</p><p>Jon will do the inverse of his uncle Ned, who lied and raised his trueborn nephew as a bastard. The story of Game of Thrones started with Ned Stark starting a war to prevent a bastard son of Cersei Lannister to sit in the Throne and it will end with a bastard daughter of Jon Snow as the heir of the Throne. History repeat itself and in the end, there wont be much difference between Starks and Lannister, they all lie to protect the ones they love.</p><p>“The things we do for love” will still be the theme of the story in the end….</p><p><br></p><h2>THIS IS A STORY OF FATHER’S DAUGHTERS….</h2><p><br></p><p>A SONG OF ICE AND FIRE its many tales in one; this is a tale of a Dragon prince madly in love with a Wolf girl; this is also a tale about home and families; about the things we do for love; it’s a story about tyranny and fear; its also a story about slow learners, who make several mistakes, but that eventually do learn, but ALSO, A SONG OF ICE AND FIRE, is a story about father’s daughters.</p><p>And that’s exactly what Arya, Sansa, Cersei, Daenerys, Brienne all are. These women are their father’s daughters. That’s why the show gave so much importance on those character’s fathers and hardly touched the mothers relevance.</p><p>No one thought Sansa and Daenerys had much of their fathers in themselves, those two characters were always associated with their mothers, yet they will prove to all of us that they carry much of Eddar and Aerys inside of them, in the last part of this story.</p><p><br></p><h2>THE STARK SISTERS WILL GET EVERYTHING THEY EVER WANTED…</h2><blockquote><br></blockquote><p><br></p><figure data-orig-width=\"640\" data-orig-height=\"360\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/2f7beda43cf2d3363b1942b24764016c/tumblr_inline_pm5u2jBCaP1sgp768_540.png\" alt=\"image\" data-orig-width=\"640\" data-orig-height=\"360\"></figure><blockquote><p>Arya: “We both wanted to be the other people when we were younger. You wanted to be a queen and sit next to a handsome, young king on the Iron Throne. I wanted to be a knight, to pick up a sword like father and go off to battle. Neither of us got to be that other person, did we? The world doesnt just let girls decide what they are going to be.”’</p><p>(SEASON 7 EPISODE 6)</p><p><br></p></blockquote><h2>AND THEY ARE GOING TO BE QUEENS….</h2><p>Yes, we will have two queens. Game of Thrones started with two queens. Daenerys and Cersei; one a conqueror, the second a consort queen. Two women, whose obsession for the Iron Throne, left a trail of death and destruction on Essos and Westeros. So, we will finish this story with two queens, who will restore the Kingdom and improve the lives of their people. Sansa will be the consort queen of Jon Snow and Arya will be the warrior, the conquering queen that will lead the armies of North, Vale and Riverlands into war in season 8.</p><p><br></p><h2>SANSA STARK WILL BE “THE QUEEN”;</h2><p><br></p><p>Queen Sansa Stark will change the Law of Succession allowing girls to be heirs in front of their younger brothers. Sansa it’s the YMBQ of the prophecy and she will be the one casting Cersei Lannister down; Sansa will be very political active queen, changing laws and improving the lives of the people of Westeros and making important changes in the realm; She will be loved by her people and called THE QUEEN.</p><p>Sansa was always meant to be the final queen and the one who will rebuild the kingdom after the wars. Sansa entire storyline in the books was about observing the major players of the game make their moves and see the ramifications of those decisions. In Kings Landing, Sansa saw it first hand how ruling can affect the lives of the people in Westeros. She was able to see what to do, when in power, but also, what NOT to do as a king or queen. She learned a lot from Cersei, Margaery, Ollena, the Tyrells, The Lannisters, Littlefinger and will use this education for good use as a queen.</p><p>All Sansa’s dreams will come true and she will be a living proof that “life is a song”. She will marry her brave and gentle hero; she will have children and rebuild her family and she will be a very beloved queen, admired for her beauty and kindness.</p><p><br></p><h2>ARYA WILL BE THE QUEEN IN THE NORTH;</h2><p><br></p><p>Arys Stark will rule the North as a Regent Queen. Arya storyline in season 8 will be a copy of Papa Ned in the first Rebellion against the Mad King. She will call the banners and lead the North armies into battle in the final war of this story. George RRMartin himself said that she would conquer the world in the final part of this tale.</p><p><br></p><h2>ARYA WILL BE VERY IMPORTANT IN THE FINAL SEASON !!!!!</h2><p><br></p><p>Arya is season 8 will be a huge warrior, with the help of Nymeria and their pack of wolves, she is going to lead their armies into battle, defeating Daenerys armies in combat (yes, the Dothraki bitches!!!!!!) They will probably meet in the Riverlands, where Rheagar and Robert had their first and final confrontation. She will be the one who will kill the mountain, avenging the people that he cruelly killed in the Riverlands and the Hound. Just like papa Ned became famous for killing Ser Arthur Dane, Arya will be legendary for killing the Mountain. They will write songs about her for years and years to come……</p><p><br></p><h2>BRAN STARK WILL BE THE MAGICAL FORCE TO STOP THE ARMY OF THE DEAD…</h2><h2><br></h2><figure data-orig-width=\"628\" data-orig-height=\"646\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/cb5a9eeba9a21e09fa027a4d5e29bee9/tumblr_inline_pm5u5aiMqM1sgp768_540.png\" alt=\"image\" data-orig-width=\"628\" data-orig-height=\"646\"></figure><h2><br></h2><p>I know the audience expects Daenerys and her dragons to be the magical force used to stop the Army of the Dead, but, don’t be shocked if she decides to abandon the cause in the middle of the fight and leave the North before the big battle against the Night King. There is a lot of Stannis in Daenerys character arc on season 7 and in the end, Stannis left Jon and the Nights Watch on their own to fight the Night King on Hardhome, and went to march to Winterfell to fight the Boltons. Stannis could never let it go completely of the Iron Throne and I expect Dany to do the same.</p><p>Its Bran Stark, who has been preparing himself to face this threat since the beginning of this story. Its Bran Stark who has been foreshadowed by the books and tv show to be the one who will matter the most in the end. Not the dragons. I suspect we will see the ghosts of the Kings of Winter, coming out from the crypts of Winterfell, to fight the final battle against the Army of the Dead.</p><p>Bran: What else have you seen it? Jojen: The ONLY think that matters. YOU.</p><p>(Season 3 Episode 2)</p><p>Also, in the first Long Night, there was no Targaryens; The North was left to fight on its own with the help of the Children of the Forest and George likes to repeat his stories very closely to the original. Defeating the Army of the Dead wont be Bran only job in season 8, he has also been written as a foil to Daenerys, so I believe he will be involved on her final defeat.</p><p><br></p><h2>DAENERYS WILL BE THE FINAL ANTAGONIST IN SEASON 8 AND WE WILL HAVE A SECOND DANCE OF DRAGONS BETWEEN JON AND DANY……</h2><p><br></p><figure data-orig-width=\"750\" data-orig-height=\"563\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/21fdccfff8b756b781f5c03f45e95a7e/tumblr_inline_pm5u5w9MAV1sgp768_540.jpg\" alt=\"image\" data-orig-width=\"750\" data-orig-height=\"563\"></figure><h2><br></h2><blockquote><p>Jon Snow: <b>“They will see it you for “what you are”.</b></p><p><b>(</b>SEASON 7 EPISODE 6)</p><p><br></p></blockquote><p>In the beginning of this story we saw Sansa Stark falling madly in love with a beautiful prince, only to have her heart broken in a million of pieces in the end of season 1, when Joffrey shocked her by cutting her father’s head, finally showing how cruel and monstrous he really was. In the beginning of the series, we also had the audience falling madly in love with the beautiful Daenerys Targaryen, believing she was the hero of this story and just like Sansa, the audience will be shocked by Daenerys actions in season 8 and they will have their hearts completely broken in a million of pieces. Daenerys will finally show to the audience the monster that she really is. I expect to see a lot of shades of Joffrey on Daenerys in season 8. Remember, Joffrey believed his whole life he was the true heir of the Iron Throne, until a Stark man showed up in his life, telling him that this was a lie. This is exactely what is going to happen to Daenerys in season 8.</p><p>Remember when Sansa Stark fell madly in love with a monster and trusted a beautiful queen blindly when she was warned against it? You are all Sansas, you just don’t know yet.</p><p>Daenerys could never be the villain of her own story. That’s why it was always necessary for her to create a lie that painted her as the hero. She invaded Astapor to save the Unsulied from the evil wise masters; she conquered Meereen to pay back the slavers for crucifying the children slaves; she destroyed the sacred temple of Vaes Dothrak and killed all the Khalls, but she did for the Dothraki widows who didnt wish to stay in the Dosh khaleen. Now in Westeros she had no more excuses, there is no slavery or evil masters torturing young boys in the 7 Kingdoms, so she was forced to create a new excuse to defend her invasion of Westeros.</p><p>So, she told the audience that she wants to break the wheel of power that crushes the poor and the weak on Westeros. It makes no sense of course. She wants to break the wheel, by building a new wheel, this time, with only her family on top, crushing those under her. This is a phony ridiculous excuse and its supposed to be ridiculous. It’s a silly lie, all Daenerys wants in the Iron Throne, but she cant admit it afraid it will make her look bad, so she created this silly little lie and the audience (just like Sansa fell into Cersei silly lies in season 1) fell right into. What Dany really wants is install an absolute monarchy, with only HER in power.</p><p>Daenerys is a false prophet, who invented a sacred mission to convince her people and those who follow her of her good intentions, yet all her actions are motivated from the desire to take The Iron Throne, that’s the one thing who truly matters for Daenerys and now in season 8, when her claim to the Throne will be contested by the bombastic news of Jon Snow stronger claim to the Throne. That’s whe she will finally show to the audience who she really is.</p><p><br></p><h2>WHAT HAPPENS WHEN WE BLINDLY FOLLOW, GOD AND HEROS;</h2><p><br></p><p>By writing Daenerys Targaryen, George RRMartin wanted to show us how dictators and cult leaders are created. They started magical and inspiring, making beautiful speeches and promising great things, but in end, most of them are motivated by selfish desires and allow power to corrupt them. Daenerys story is also a warning about following leaders without questioning their motivations or decisions. Daenerys is adored as a goddess by her followers and never has her decision questioned by them. Unlike Jon Snow who is always questioned by Sansa, The North Lords and the Wildlings about his decisions. The Dothraki and the Unsullied just blindly follow Daenerys around, like children following their mothers, never questioning her real motives, or even contemplating if the move to Westeros has actually any benefits for them. And as we are about to see in season 8, following leaders blindly can be a very dangerous thing because it can lead us to our graves. The audience, the Dothraki and the Unsullied never thought that their hero could just simply be lying to them……No matter how much destruction and death she causes, her followers and advisers keep believing in her, defending her decisions, turning a blind eye to her questionable actions, finding excuses to her terrible acts. They know that she can be impulsive and dangerous but believe that in the end she is motivated by great ideals and will always listen to her advisers……..</p><p>Daenerys first instinct is always destruction and violence, but most of the time, she is restrained by her advisers………. But the rope that holds her together is about to be ripped apart in season 8.</p><p><br></p><blockquote><p>Daario Naharis: <b>“I pity the Lords of Westeros, they have no idea what is coming for them”</b></p><p>(SEASON 6 EPISODE 10)</p><p><br></p></blockquote><p>Daenerys was always meant to be the final antagonist of the story, her time in Essos was not about learning to be a good queen, she was learning to be a ruthless conqueror, which she learned very well. Don’t be surprised if she marries Euron Greyjoy, they marriage has been foreshadowed on books and tv show. Daenerys its gonna shock the audience, she is going to behave in a way that will surprise a lot of people.<br></p><p>Jon and Daenerys relationship will mirror Rhaenyra and Aegon tragic battle for the Throne; This will be the final battle on episode 5, the fight for the Throne has always been the main focus of the story and this battle its what is going to put an end to this tale. Westeros will finally be united against the common enemy, which is Daenerys and her dragons.</p><p>The Army of the Dead and the Night King were always a red herring, its was always Daenerys and her dragons the major threat for Westeros. I believe that more than half of the population of Westeros will perish during the final wars; many who survive the war will latter die during the winter without the food that was destroyed by Daenerys dragons in the Field of Fire 2.0; in her short period in Westeros, Daenerys will cause a lot of deaths and destruction and she will be remembered as the Queen of Ashes.</p><p>The stallion that mounts the world was never Rhaego. It was always going to be Daenerys. Essos will also be throw into chaos, without Daenerys dragons to impose order, the masters of Astapor, Meereen and the local cities will raise again and the region will probably be engulfed into a civil war. It will probably take centuries for the world to recover from Daenerys reign of terror.</p><p><br></p><h2>WINTER WILL COME TO HOUSE TARGARYEN;</h2><p><b><br></b></p><p>Daenerys final battle on episode 5, will turn Kings Landing into ashes, but she wont be destroying just the capital of the realm, she will also put an end to House Targaryen. Their dynasty started with the destruction of Harrenhall and will end with the destruction of the capital that The Targaryens themselves build, closing a cycle of tyranny, fear and terror. Daenerys will be the last dragon.</p><h2>DRAGONSTONE WILL FAIL;</h2><p><br></p><figure data-orig-width=\"2000\" data-orig-height=\"1120\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/31e728bb18f6e03ee2f8869ca038918f/tumblr_inline_pm5u98wcWp1sgp768_540.png\" alt=\"image\" data-orig-width=\"2000\" data-orig-height=\"1120\"></figure><h2><br></h2><p>I believe that Dragonstone will be destroyed in the end. The Castle in the remote island serves no purpose for Westeros. It can not be used for grains production or animal livestock, the only use for Dragonstone in the past centuries was to be used as base for a foreign invasion, the castle will probably be destroyed in the end. Also important, Daenerys spent this entire story threatening to destroy other’s peoples houses and cities. To have her own ancestral House destroyed in the end would be very fitting to the story.<br></p><p><br></p><blockquote><p><i>“so comes snow, after fire and even dragons have their ending” </i></p><p>J. R.R TOKIEN</p></blockquote><p><br></p><h2>WE WILL HAVE A SECOND REBELLION AND A SECOND DANCE OF THE DRAGONS…</h2><p><br></p><blockquote><p>Don’t fight in the North. Or the South. Fight every battle, everywhere, always, in your mind. Everyone is your enemy, everyone is your friend… every possible series of events is happening all at once. Live that way and nothing will surprise you, ……..everything that happens will be something that you have seen before.</p><p>(Litllefinger SEASON 7 EPISODE 2)</p><p><br></p></blockquote><p><br></p><p>Everything that happened in the past will happen again in season 8. Robert’s Rebelion will happen again. Sansa will be kidnapped at some point, just like aunt Lyanna Stark; Arya will lead the North armies south to save her sister (just like Ned Stark did in Robert’s Rebellion). The Riverlands, the North and the Vale will once again gather forces and go to war.</p><p><br></p><p><br></p><blockquote><p>Stannis: “What are you reading?”</p><p>Shireen: <b>“The Dance of Dragons.”</b></p><p>Stannis: “What’s it about? It’s the story of the fight between Rhaenyra Targaryen and her half-brother Aegon for control over the Seven Kingdoms. Both of them thought they belonged on the Iron Throne. When people started declaring for one of them or the other, their fight divided the kingdoms in two. <b>Brothers fought brothers, dragons fought dragons. By the time it was over, thousands were dead. And it was a disaster for the Targaryens as well. They never truly recovered.</b></p><p>(GAME OF THRONES SEASON 5 EPISODE 9)</p><p><br></p><p><br></p></blockquote><p>We will have a second Dance of Dragons, with the kingdom divided between Jon Snow and Daenerys Targaryen. The Lannisters will be divided too by this war. Tyrion (the flop) will choose Daenerys side and Jaime will choose Jon Snow and the Starks. This will be the decision that will change Jaime Lannister legacy forever.</p><p>Millions will die, but in the end Jon Snow and his armies will defeat Daenerys and her dragons. This war will not only destroy the realm but finally bring an end to the Targaryen dynasty. This battle will probably happens on episode 5.</p><p><br></p><h2>SANSA’S PLANS TO CAST DOWN CERSEI…</h2><p><br></p><figure data-orig-width=\"500\" data-orig-height=\"287\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/606011674977c01975eb40f294e3fd29/tumblr_inline_pm5uanuNnL1sgp768_540.png\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"287\"></figure><h2><br></h2><h2><br></h2><p>Sansa will be kidnapped in season 8, probably by Cersei, but don’t be surprised if this kidnapping has a twist. In season 1, in the scene where Cersei and the small council is forcing Sansa to write down a letter to Rob Stark demanding him to bend the knee to King Joffrey., we have Maester Pycelle warning Cersei that Sansa may be so sweet and innocent now, but once she is older, she may hatch some treasons!!!!</p><blockquote><p>“she (Sansa) may be a sweet thing now Your Grace, but in 10 YEARS, who knows what treasons she may hatch!!!!”</p><p>(SEASON 1 EPISODE 8)</p><p><br></p></blockquote><p>Now, we know that Sansa did learn a lot from Cersei and maybe now she is finally ready to outsmart her former teacher… This was the first foreshadowing of Sansa’s plans to cast down Cersei.</p><p>And in season 6, we have another foreshadowing of how Sansa will plot against Cersei in the end, When Arya is in Braavos, she watches a Bravossi Theather play telling the events that happened in Westeros. In that storyline, the actress that plays Sansa hires a faceless man to kill the actress who plays Cersei, Lady Crane. I believe this was another foreshadowing of the events that will happen in season 8. Its Sansa who is taking Cersei down. The little dove will prove to the queen that she learned all her lessons. But I believe Jon Snow will be the one killing Cersei.</p><p><br></p><h2>EPISODE 5 WILL BE THE DANCE OF DRAGONS;</h2><p><br></p><blockquote><p>He was no dragon, Dany thought, curiously calm. Fire cannot kill a dragon.</p><p>(A Game of Thrones - Daenerys V)</p><p><br></p></blockquote><p><br></p><p>Well I believe thats exactly whats its gonna happen. In order to defeat Daenerys you have to kill her last dragon, Drogon, which we know will be flying over Kings Landing in the end of this story. Thats how the wildfire comes in. I actually think Jon and the Lannisters may set a trap for Dany and use the wildfire to kill the dragon and Daenery’s remain armies. Maybe Bran was behind King Aerys decision to cover KL with wildfire, already preparing to use against Daenerys in the finall battle for the Throne. if we rewatch season 5 episode 7 we had a little hint about this idea.</p><p><br></p><blockquote><p>DAARIO: On the day of the Great Games, gather all the great masters, and wise masters, and worthy masters you can find, and slaughter them all.</p><p>DAENERYS: I am a queen. Not a butcher.</p><p>DAARIO: All rulers are either butchers or meat.</p><p><br></p></blockquote><p><br></p><p>Remember that Bran’s first chapter he is forced to watch his father doing the Kings’s justice and Ned explains to him that “the man who passes the sentence, must swing the sword”. This is one of the most important themes in the story.</p><p>Also, in season 4 episode 2, we have Bran having a vision of the events that will happen for the first time. This is THE vision where he sees the dragon flying over KL. After the vision he tells Jojen and Meera: “I know where we have to go”. The show then cuts to a scene in Kings Landing.</p><p>So, I do believe Bran will be involved with the explosion of Kings Landing and using the wildfire as a last weapon to defeat Daenerys and her last dragon. Thats the only way Westeros will ever be free of the Targaryens.</p><p>BTW, gathering all your enemies in a closed space and destroying them with fire has been used by both mad queens, Cersei and Daenerys, so maybe now we will see the Starks using this idea to finally get rid of Daenerys, her armies and her dragon.</p><p><br></p><h2>THE FUTURE OF HOUSE LANNISTER</h2><p>No, House Lannister will not fall into nothing like the Targaryens. The House will be saved by Jaime Lannister, who will marry Brienne of Tarth and restore his family and legacy.</p><p><br></p><h2>JAIME LANNISTER ITS GOING TO BE THE FINAL HAND AND ITS GOING TO END THIS STORY AS A GREAT HERO;</h2><p><br></p><figure data-orig-width=\"980\" data-orig-height=\"490\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/73b5389c30d8ef91064c03b6c0a5f945/tumblr_inline_pm5ueyWqgV1sgp768_540.jpg\" alt=\"image\" data-orig-width=\"980\" data-orig-height=\"490\"></figure><p>Jaime Lannister will choose Jon Snow, this will be the turning point for Jaime and the choice that will change his legacy. There is some very good foreshadowing in the books that hint to us that Jaime will side with Jon Snow in the final battle and help him to defeat Daenerys and her dragons.<br></p><p>I believe it will be Jaime who will kill Daenerys last dragon, Drogon, and becoming famous as a DRAGONSLAYER; Jaime Lannister will have a big role in the final part of this story, not only helping defeat the ARMY OF THE DEAD, but also defeating Daenerys Targaryen and saving the Kingdom once again from a tyrannical Targaryen; only this time he will finally receive the thank you, from the people of Westeros;</p><p>Jaime will be greeted as a hero and will end this story beloved and admired by the people. I believe at some point in season 8 Jaime will die and will be brought back to life, his character was written as a mirror to Jon Snow and Jon died on season 5, so this storyline may be possible.</p><p>Jaime will be the Hand of the King for Jon Snow (there is a lot of foreshadowing for this, in both books and tv show) and he will be able to finish his history in the white book as a hero. He will go down in history as one of the greatest Hands in the history of the 7 kingdoms. Jaime will be the last Lannister left on Westeros.</p><p><br></p><h2>TYRION WILL BE SENT INTO EXILE;</h2><p><br></p><p>Tyrion will have to face a trial for a third time and this time he will be guilty of his crimes. Yeah, that is not a prediction, it’s a spoiler, but I already expected that. George loves his 3. Tyrion its one of the characters that will have a very tragic ending. He was the fool who brought Daenerys to Westeros believing he could control her, the same mistake his sister Cersei tried to do with Joffrey. He invited Jon Snow under false premises to Dragonstone without mentioning to Jon about Daenerys demands to bend the knee.</p><p>He made a deal with Cersei that was never disclosed to the audience and I believe he may be behind Sansa’s kidnapping story in season 8. He keeps making one mistake after the other, always believing to be smarter than the people around him, always under estimating the players of the game.</p><p>But I don’t believe he will die. In the House videos released for season 8, they had the Lannisters brothers, Jaime and Tyrion, saying goodbye to each other and I believe we will see them say good bye one last time. I think Tyrion will be sent into exile to Essos, and banned from returning to Westeros.</p><p><br></p><h2>CERSEI WILL DIE;</h2><p>There has been a lot of foreshadowing about Cersei death and its one of the events many believe it happen for sure. The show made sure to write us a scene when her ending is predicted.</p><p><br></p><blockquote><p>“I will hurt you for this. A day will come when you think you’re safe and happy and your joy will turn to ashes in your mouth. And you will know the debt is paid.”</p><p>(Tyrion - SEASON 2 EPISODE 8)</p><p><br></p></blockquote><p><br></p><p>This episode was written by George RRMartin himself, so, I always assumed this was Cersei Lannister ending… Then in season 7, we had Jon Snow threatening to kill Littlefinger is he ever touched Sansa. In that scene we have Jon Snow choking Baelish with his cold hands and I believe this scene could be a foreshadow of Jon finally killing Cersei, for trying to hurt Sansa in season 8. The prophecy says that Cersei will be killed by the “little brother” and Jon Snow fits that role as the younger son of Rheagar Targaryen.</p><p>_______________________________________________________________</p><p><br></p><h2>THEON WILL BE KING OF THE IRON ISLANDS;</h2><p>He lifted his head to look at her. “Catelyn,” he said. His voice was distant and formal. “Where are the children?”</p><p>A Game of Thrones - Catelyn I</p><p>I believe the children of Wintefell were always meant to be the heroes of this story. That’s why George made sure to have a Greyjoy, a Targaryen be raised close to the Stark children. Those children now are gonna be the rulers of Westeros and they will be the ones passing Ned Stark legacy forward, building a new and better world.</p><p>Thast why I believe Theon will kill Euron Greyjoy and be the king of the Iron Islands; Theon probably has a bastard child with the captain’s daughter he met in season 2 on his journey to Pike, he will recognize the child and raise them as his heir;</p><h2>A TIME FOR WOLVES;</h2><p><b><br></b></p><figure data-orig-width=\"599\" data-orig-height=\"287\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/e6eaee32c64120ed47c03b3bc7061f9d/tumblr_inline_pm5uvnO0W51sgp768_540.png\" alt=\"image\" data-orig-width=\"599\" data-orig-height=\"287\"></figure><p><br></p><p>It will be a Time for Wolves; a new period for Westeros. Jon will rule surrounded by Starks, carrying the Stark name with Sansa and Bran by his side; The capital will probably be transferred to HighGarden, not only the castle it is still intact but its also located in the most fertile area of Westeros. It seems like a very interesting political decision. Again, I found a lot of foreshadowing for this in the books.</p><p>Jon Snow will rule over a graveyard, as he predicted in season 7. But the ending will be very sweet, with kids playing around in gardens and celebrating. We will see Jon, the Stark kids, Jaime and Brienne, Sam and Guilly, Theon….. ect all enjoying spring and celebrating their happy ending.</p><p><br></p><p><br></p><h2>THE VERY LAST SCENE OF THE STORY…..</h2><p><br></p><p>Daniel Abraham is the man responsible for converting the Game of Thrones book into a comic, mentioned that there is a particular line of dialog in the game of thrones book, which is very important for the last scene of “A Dream of Spring”.</p><p>Have you collaborated at all with George R.R. Martin in the process of adapting the novel to comics? If so, what’s the creative process there?</p><p>Daniel: “I’ve spoken to George a lot in the process. The biggest issues we have are continuity questions. There are things about this story that only he knows, and they aren’t all obvious. There was one scene I had to rework because there’s a particular line of dialog – and you wouldn’t know it to look at – that’s important in the last scene of “A Dream of Spring.”- Daniel Abraham</p><p>On episode 1, when King Robert goes to visit Winterfell, he and Ned go down in the crypts to pay their respects to Lyanna Stark, the wolf girl he lost to Rheagar Targeryen. In that scene, the dialogue is different from what we have in the books.</p><p><br></p><blockquote><p>ROBERT: Did you have to bury her in a place like this? She should be on a hill somewhere with the sun and the clouds above her.</p><p>NED: She was my sister. This is where she belongs.</p><p><br></p></blockquote><p>In the books, this conversation is different:</p><p><br></p><p><br></p><blockquote><p>\"Ah, damn it, Ned, did you have to bury her in a place like this?” His voice was hoarse with remembered grief. “She deserved more than darkness …”</p><p>“She was a Stark of Winterfell,” Ned said quietly. “This is her place.”</p><p>A Game of Thrones - Eddard I</p><p><br></p></blockquote><p>I think this is the scene. I believe we will end this story with King Jon visiting his late wife Sansa Stark in the crypts of Winterfell and someone will ask him why did he buried her there, why not building a monument for her, so that she could be on display and that’s how he will reply:<br></p><p><br></p><blockquote><p>She was a Stark of Winterfell, this is where she belongs….</p><p><br></p></blockquote><p>What made me believe this, were two momments of the story: First of all, Lady’s death. After Sansa direwolf is killed on her way to the south, Ned Stark makes sure to send a group of men back to the North and Winterfell, so that she can be buried in Northerner soil. Lady represented a little bit of Sansa, who died on that day and I dont think it was a silly detail George rrmartin make sure that her direwolf body was buried on Winterfell, I think that this scene, was much more important than most people think about it.</p><p><br></p><blockquote><p>When it was over, he said, “Choose four men and have them take the body north. <b>Bury her at Winterfell</b>.”</p><p>“All that way?” Jory said, astonished.“All that way,” Ned affirmed. “The Lannister woman shall never have this skin.”</p><p>A Game of Thrones - Eddard III</p><p><br></p></blockquote><p>Another momment in the story was Ygritte death. In both books and show, Jon Snow takes her body and goes to bury her up North, where she belonged.</p><p><br></p><blockquote><p>Tormund: Did you love her? She loved you.</p><p>Jon: She told you?</p><p>Tormund: No. All she ever talked about was killing you. That’s how I know. <b>She belongs in the North. The real North.</b> You understand me?</p><p><br></p></blockquote><p><br></p><p>Look at the excuse Tormund gives Jon to why Ygritte needs to be buried North of the Wall, its the same Ned Stark used to explain to King Robert why Lyanna had to be buried in the Crypts of Winterfell. Because thats where she belongs…….</p><p>I also believe this ending could bring the story to a full circle, because there is also the theme of the audience never really thinking as Sansa as a TRUE STARK. There is still the notion that Sansa is not really a Stark like Jon or Arya.</p><p>Sansa Starkiness was always a topic of contention among fans of the books and series. Many like to refer to Sansa as Lady Lannister or Lady Bolton, so to have Sansa finally resting in the Winterfell crypts, by the end of this story, as a Stark, would be a very satisfying ending. Her hair maybe red and some of her manners may be more southern like, but Sansa IS A STARK.</p><p>And in fact, she is the Stark who took back the North and Winterfell, she is the Stark who made possible for the family to reunite and be safe; she is the Stark who stood by Jon side when he was made King in the North and supported his claim; she was the Stark who prepared the North for the wars and the winter and she will be the Stark who will rule the 7 Kingdoms together with her husband.</p><p>Both Jon and Sansa are foreshadowed to live very long lives and I expect their ruling period to last decades. They will be the ones restoring and rebuilding the kingdom after the wars of Ice and Fire. But I do believe Jon will live longer based on a quote from the books.</p><p><br></p><blockquote><p>Tyrion shared around his skin of wine until even Yoren grew mellow. <b>One by one the company drifted off to their shelters and to sleep, all but Jon Snow, who had drawn the night’s first watch.</b> Tyrion was the last to retire, as always. As he stepped into the shelter his men had built for him, he paused and looked back at Jon Snow. The boy stood near the fire, his face still and hard, looking deep into the flames. Tyrion Lannister smiled sadly and went to bed. -<br>AGOT Tyrion II</p></blockquote><p><br></p><p>And because of this line, I believe Jon Snow ill be the last one to die, he will live a very long life and will be forced to see all the ones he loved pass away, one by one.</p><p><br></p><p><br></p><h2>THE END OF GAME OF THRONES…</h2></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "julibf",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/78ccda4ed7dfffa4a7e42ecbae93f4e9/58drpjq/rGRppm99e/tumblr_static_35kw06ualbeogs4w4sswow8oo.png",
                        "header_image_focused": "https://static.tumblr.com/78ccda4ed7dfffa4a7e42ecbae93f4e9/58drpjq/rGRppm99e/tumblr_static_35kw06ualbeogs4w4sswow8oo_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/78ccda4ed7dfffa4a7e42ecbae93f4e9/58drpjq/rGRppm99e/tumblr_static_35kw06ualbeogs4w4sswow8oo_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#213f52",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#315f7a",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182430848706"
                },
                "content_raw": "<p><ul><li>Jon Snow and Sansa Stark will be the King and Queen of the 7 Kingdoms;<br></li><li>Jon Snow will father a bastard daughter;<br></li><li>Jon Snow will have half of his face burned down in the final battle and will be blind from one eye;<br></li><li>Jon and Sansa will lie to protect the bastard girl and raise her as their trueborn child;<br></li><li>Sansa is the “Younger and More Beautiful Queen” who will cast down Cersei;<br></li><li>Sansa Stark will be known as THE QUEEN. She will be the one changing the laws of succession, allowing girls to be the heirs in front of their younger brothers;<br></li><li>Jon Snow will be the one killing Cersei, he will be the Valonqar of the prophecy;<br></li><li>The North will never bend the knee to a southern ruler ever again, but it may join the Realm in a new political division.<br></li><li>Arya Stark will call the banners and lead the Northern armies in the new Rebellion;<br></li><li>Arya Stark will be The Queen in the North;<br></li><li>Bran Stark will be the most important player against the Night King, not the dragons;<br></li><li>Daenerys will abandon the fight against the Army of the dead and march south, leaving the North to fight for themselves;<br></li><li>We will have a Second Dance of Dragons between Jon Snow and Daenerys Targaryen;<br></li><li>Daenerys arrival to Westeros will enter the history books as one of the worst events in the History of the 7 Kingdoms;<br></li><li>Jaime Lannister will be the Hand of the King for Jon Snow; Jaime Lannister will marry Brienne of Tarth and restore House Lannister to their former glory;<br></li><li>Tyrion Lannister will face his third trial, but this time he will be guilty of all his crimes;<br></li><li>Tyrion Lannister will lose his tongue and be sent into exile to Essos;<br></li><li>Daenerys will be the last antagonist of this story and will be remembered as THE QUEEN OF ASHES;<br></li><li>House Targaryen will come to an end;<br></li><li>Theon will be the King of the Iron Islands;<br></li><li>The new capital of the realm will be in HighGarden;<br></li><li>Episode 3 will be the Fight against the Army of the Dead;<br></li><li>Episode 5 will be the Dance of Dragons.<br></li><li>The Starks will rule the kingdom in the end, bringing a Time for Wolves.<br></li></ul><p>________________________________________________________________</p><h2>JON SNOW AND SANSA STARK MARRIAGE……</h2><figure data-orig-width=\"400\" data-orig-height=\"400\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/9297104892701461ba194b2ee03af372/tumblr_inline_pm5u1kAW181sgp768_540.jpg\" alt=\"image\" data-orig-width=\"400\" data-orig-height=\"400\"></figure><p><br></p><p>Jon Snow and Sansa Stark will be the final King and Queen of the 7 Kingdoms. Their romance has been foreshadow pretty much since book 1 and season 1 and their marriage will bring peace and prosperity to Westeros. The wars of Ice and Fire will destroy the kingdom and they will be the ones rebuilding the realm to its former glory; Jon and Sansa storyline are in a perfect parallel and they have been groomed to be king and queen of Westeros for the whole storyline in the books.</p><h2>JON SNOW HAS ALWAYS LOVED SANSA STARK;</h2><p><br></p><p>Jon Snow has always been in love with his cousin Sansa Stark, which is why he decided to go to the wall after Ned Stark accepted Sansa’s engagement to Joffrey Baratheon. Jon was written as a mirror to Jaime Lannister and one of the reasons Jaime decided to join the kingsguard was because he could never marry his sister and lover Cersei. Once the secret of Lyanna and Rheagar is finally out, Jon and Sansa will be free to be together. Their love story is the main romance of the books.</p><p>BTW, don’t be surprised if they reveal the romance between Jon and Sansa in the end of the first episode of season 8. The episode will start mirroring the pilot episode, when King Robert arrived at Winterfell with his Lannister family and we all know the episode ended with the reveal of Cersei and Jaime incestual romance.</p><p><br></p><h2>JON SNOW IS GOING TO BE A STARK;</h2><p>Jon Snow is going to take Sansa Stark name and pass the Stark name to all his children. He will be finally be a Stark and die as a true son by law of Eddard Stark, just like he always dreamed of in the books. This was foreshadowed in season 6 episode 5, when Sansa cloaked Jon Snow with a Stark Cloak.</p><p><br></p><h2>JON WILL FATHER A BASTARD</h2><p>Jon Snow will father a bastard. He will have trueborn sons with his wife Sansa Stark, but he will have a bastard girl with Daenerys. The books have foreshadowed this event to death. Jon and Sansa will pass this bastard girl as their own trueborn child and give her their Stark name. Sansa will raise this child as her own daughter and make her a Stark. That’s why the show wrote that scene with Catelyn Stark and Talissa on season 3 where Catelyn says that she failed to love and care for her husband bastard child, Sansa will do the opposite and love and care for Jon’s bastard daughter.</p><p>Jon will do the inverse of his uncle Ned, who lied and raised his trueborn nephew as a bastard. The story of Game of Thrones started with Ned Stark starting a war to prevent a bastard son of Cersei Lannister to sit in the Throne and it will end with a bastard daughter of Jon Snow as the heir of the Throne. History repeat itself and in the end, there wont be much difference between Starks and Lannister, they all lie to protect the ones they love.</p><p>“The things we do for love” will still be the theme of the story in the end….</p><p><br></p><h2>THIS IS A STORY OF FATHER’S DAUGHTERS….</h2><p><br></p><p>A SONG OF ICE AND FIRE its many tales in one; this is a tale of a Dragon prince madly in love with a Wolf girl; this is also a tale about home and families; about the things we do for love; it’s a story about tyranny and fear; its also a story about slow learners, who make several mistakes, but that eventually do learn, but ALSO, A SONG OF ICE AND FIRE, is a story about father’s daughters.</p><p>And that’s exactly what Arya, Sansa, Cersei, Daenerys, Brienne all are. These women are their father’s daughters. That’s why the show gave so much importance on those character’s fathers and hardly touched the mothers relevance.</p><p>No one thought Sansa and Daenerys had much of their fathers in themselves, those two characters were always associated with their mothers, yet they will prove to all of us that they carry much of Eddar and Aerys inside of them, in the last part of this story.</p><p><br></p><h2>THE STARK SISTERS WILL GET EVERYTHING THEY EVER WANTED…</h2><blockquote><br></blockquote><p><br></p><figure data-orig-width=\"640\" data-orig-height=\"360\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/2f7beda43cf2d3363b1942b24764016c/tumblr_inline_pm5u2jBCaP1sgp768_540.png\" alt=\"image\" data-orig-width=\"640\" data-orig-height=\"360\"></figure><blockquote><p>Arya: “We both wanted to be the other people when we were younger. You wanted to be a queen and sit next to a handsome, young king on the Iron Throne. I wanted to be a knight, to pick up a sword like father and go off to battle. Neither of us got to be that other person, did we? The world doesnt just let girls decide what they are going to be.”’</p><p>(SEASON 7 EPISODE 6)</p><p><br></p></blockquote><h2>AND THEY ARE GOING TO BE QUEENS….</h2><p>Yes, we will have two queens. Game of Thrones started with two queens. Daenerys and Cersei; one a conqueror, the second a consort queen. Two women, whose obsession for the Iron Throne, left a trail of death and destruction on Essos and Westeros. So, we will finish this story with two queens, who will restore the Kingdom and improve the lives of their people. Sansa will be the consort queen of Jon Snow and Arya will be the warrior, the conquering queen that will lead the armies of North, Vale and Riverlands into war in season 8.</p><p><br></p><h2>SANSA STARK WILL BE “THE QUEEN”;</h2><p><br></p><p>Queen Sansa Stark will change the Law of Succession allowing girls to be heirs in front of their younger brothers. Sansa it’s the YMBQ of the prophecy and she will be the one casting Cersei Lannister down; Sansa will be very political active queen, changing laws and improving the lives of the people of Westeros and making important changes in the realm; She will be loved by her people and called THE QUEEN.</p><p>Sansa was always meant to be the final queen and the one who will rebuild the kingdom after the wars. Sansa entire storyline in the books was about observing the major players of the game make their moves and see the ramifications of those decisions. In Kings Landing, Sansa saw it first hand how ruling can affect the lives of the people in Westeros. She was able to see what to do, when in power, but also, what NOT to do as a king or queen. She learned a lot from Cersei, Margaery, Ollena, the Tyrells, The Lannisters, Littlefinger and will use this education for good use as a queen.</p><p>All Sansa’s dreams will come true and she will be a living proof that “life is a song”. She will marry her brave and gentle hero; she will have children and rebuild her family and she will be a very beloved queen, admired for her beauty and kindness.</p><p><br></p><h2>ARYA WILL BE THE QUEEN IN THE NORTH;</h2><p><br></p><p>Arys Stark will rule the North as a Regent Queen. Arya storyline in season 8 will be a copy of Papa Ned in the first Rebellion against the Mad King. She will call the banners and lead the North armies into battle in the final war of this story. George RRMartin himself said that she would conquer the world in the final part of this tale.</p><p><br></p><h2>ARYA WILL BE VERY IMPORTANT IN THE FINAL SEASON !!!!!</h2><p><br></p><p>Arya is season 8 will be a huge warrior, with the help of Nymeria and their pack of wolves, she is going to lead their armies into battle, defeating Daenerys armies in combat (yes, the Dothraki bitches!!!!!!) They will probably meet in the Riverlands, where Rheagar and Robert had their first and final confrontation. She will be the one who will kill the mountain, avenging the people that he cruelly killed in the Riverlands and the Hound. Just like papa Ned became famous for killing Ser Arthur Dane, Arya will be legendary for killing the Mountain. They will write songs about her for years and years to come……</p><p><br></p><h2>BRAN STARK WILL BE THE MAGICAL FORCE TO STOP THE ARMY OF THE DEAD…</h2><h2><br></h2><figure data-orig-width=\"628\" data-orig-height=\"646\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/cb5a9eeba9a21e09fa027a4d5e29bee9/tumblr_inline_pm5u5aiMqM1sgp768_540.png\" alt=\"image\" data-orig-width=\"628\" data-orig-height=\"646\"></figure><h2><br></h2><p>I know the audience expects Daenerys and her dragons to be the magical force used to stop the Army of the Dead, but, don’t be shocked if she decides to abandon the cause in the middle of the fight and leave the North before the big battle against the Night King. There is a lot of Stannis in Daenerys character arc on season 7 and in the end, Stannis left Jon and the Nights Watch on their own to fight the Night King on Hardhome, and went to march to Winterfell to fight the Boltons. Stannis could never let it go completely of the Iron Throne and I expect Dany to do the same.</p><p>Its Bran Stark, who has been preparing himself to face this threat since the beginning of this story. Its Bran Stark who has been foreshadowed by the books and tv show to be the one who will matter the most in the end. Not the dragons. I suspect we will see the ghosts of the Kings of Winter, coming out from the crypts of Winterfell, to fight the final battle against the Army of the Dead.</p><p>Bran: What else have you seen it? Jojen: The ONLY think that matters. YOU.</p><p>(Season 3 Episode 2)</p><p>Also, in the first Long Night, there was no Targaryens; The North was left to fight on its own with the help of the Children of the Forest and George likes to repeat his stories very closely to the original. Defeating the Army of the Dead wont be Bran only job in season 8, he has also been written as a foil to Daenerys, so I believe he will be involved on her final defeat.</p><p><br></p><h2>DAENERYS WILL BE THE FINAL ANTAGONIST IN SEASON 8 AND WE WILL HAVE A SECOND DANCE OF DRAGONS BETWEEN JON AND DANY……</h2><p><br></p><figure data-orig-width=\"750\" data-orig-height=\"563\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/21fdccfff8b756b781f5c03f45e95a7e/tumblr_inline_pm5u5w9MAV1sgp768_540.jpg\" alt=\"image\" data-orig-width=\"750\" data-orig-height=\"563\"></figure><h2><br></h2><blockquote><p>Jon Snow: <b>“They will see it you for “what you are”.</b></p><p><b>(</b>SEASON 7 EPISODE 6)</p><p><br></p></blockquote><p>In the beginning of this story we saw Sansa Stark falling madly in love with a beautiful prince, only to have her heart broken in a million of pieces in the end of season 1, when Joffrey shocked her by cutting her father’s head, finally showing how cruel and monstrous he really was. In the beginning of the series, we also had the audience falling madly in love with the beautiful Daenerys Targaryen, believing she was the hero of this story and just like Sansa, the audience will be shocked by Daenerys actions in season 8 and they will have their hearts completely broken in a million of pieces. Daenerys will finally show to the audience the monster that she really is. I expect to see a lot of shades of Joffrey on Daenerys in season 8. Remember, Joffrey believed his whole life he was the true heir of the Iron Throne, until a Stark man showed up in his life, telling him that this was a lie. This is exactely what is going to happen to Daenerys in season 8.</p><p>Remember when Sansa Stark fell madly in love with a monster and trusted a beautiful queen blindly when she was warned against it? You are all Sansas, you just don’t know yet.</p><p>Daenerys could never be the villain of her own story. That’s why it was always necessary for her to create a lie that painted her as the hero. She invaded Astapor to save the Unsulied from the evil wise masters; she conquered Meereen to pay back the slavers for crucifying the children slaves; she destroyed the sacred temple of Vaes Dothrak and killed all the Khalls, but she did for the Dothraki widows who didnt wish to stay in the Dosh khaleen. Now in Westeros she had no more excuses, there is no slavery or evil masters torturing young boys in the 7 Kingdoms, so she was forced to create a new excuse to defend her invasion of Westeros.</p><p>So, she told the audience that she wants to break the wheel of power that crushes the poor and the weak on Westeros. It makes no sense of course. She wants to break the wheel, by building a new wheel, this time, with only her family on top, crushing those under her. This is a phony ridiculous excuse and its supposed to be ridiculous. It’s a silly lie, all Daenerys wants in the Iron Throne, but she cant admit it afraid it will make her look bad, so she created this silly little lie and the audience (just like Sansa fell into Cersei silly lies in season 1) fell right into. What Dany really wants is install an absolute monarchy, with only HER in power.</p><p>Daenerys is a false prophet, who invented a sacred mission to convince her people and those who follow her of her good intentions, yet all her actions are motivated from the desire to take The Iron Throne, that’s the one thing who truly matters for Daenerys and now in season 8, when her claim to the Throne will be contested by the bombastic news of Jon Snow stronger claim to the Throne. That’s whe she will finally show to the audience who she really is.</p><p><br></p><h2>WHAT HAPPENS WHEN WE BLINDLY FOLLOW, GOD AND HEROS;</h2><p><br></p><p>By writing Daenerys Targaryen, George RRMartin wanted to show us how dictators and cult leaders are created. They started magical and inspiring, making beautiful speeches and promising great things, but in end, most of them are motivated by selfish desires and allow power to corrupt them. Daenerys story is also a warning about following leaders without questioning their motivations or decisions. Daenerys is adored as a goddess by her followers and never has her decision questioned by them. Unlike Jon Snow who is always questioned by Sansa, The North Lords and the Wildlings about his decisions. The Dothraki and the Unsullied just blindly follow Daenerys around, like children following their mothers, never questioning her real motives, or even contemplating if the move to Westeros has actually any benefits for them. And as we are about to see in season 8, following leaders blindly can be a very dangerous thing because it can lead us to our graves. The audience, the Dothraki and the Unsullied never thought that their hero could just simply be lying to them……No matter how much destruction and death she causes, her followers and advisers keep believing in her, defending her decisions, turning a blind eye to her questionable actions, finding excuses to her terrible acts. They know that she can be impulsive and dangerous but believe that in the end she is motivated by great ideals and will always listen to her advisers……..</p><p>Daenerys first instinct is always destruction and violence, but most of the time, she is restrained by her advisers………. But the rope that holds her together is about to be ripped apart in season 8.</p><p><br></p><blockquote><p>Daario Naharis: <b>“I pity the Lords of Westeros, they have no idea what is coming for them”</b></p><p>(SEASON 6 EPISODE 10)</p><p><br></p></blockquote><p>Daenerys was always meant to be the final antagonist of the story, her time in Essos was not about learning to be a good queen, she was learning to be a ruthless conqueror, which she learned very well. Don’t be surprised if she marries Euron Greyjoy, they marriage has been foreshadowed on books and tv show. Daenerys its gonna shock the audience, she is going to behave in a way that will surprise a lot of people.<br></p><p>Jon and Daenerys relationship will mirror Rhaenyra and Aegon tragic battle for the Throne; This will be the final battle on episode 5, the fight for the Throne has always been the main focus of the story and this battle its what is going to put an end to this tale. Westeros will finally be united against the common enemy, which is Daenerys and her dragons.</p><p>The Army of the Dead and the Night King were always a red herring, its was always Daenerys and her dragons the major threat for Westeros. I believe that more than half of the population of Westeros will perish during the final wars; many who survive the war will latter die during the winter without the food that was destroyed by Daenerys dragons in the Field of Fire 2.0; in her short period in Westeros, Daenerys will cause a lot of deaths and destruction and she will be remembered as the Queen of Ashes.</p><p>The stallion that mounts the world was never Rhaego. It was always going to be Daenerys. Essos will also be throw into chaos, without Daenerys dragons to impose order, the masters of Astapor, Meereen and the local cities will raise again and the region will probably be engulfed into a civil war. It will probably take centuries for the world to recover from Daenerys reign of terror.</p><p><br></p><h2>WINTER WILL COME TO HOUSE TARGARYEN;</h2><p><b><br></b></p><p>Daenerys final battle on episode 5, will turn Kings Landing into ashes, but she wont be destroying just the capital of the realm, she will also put an end to House Targaryen. Their dynasty started with the destruction of Harrenhall and will end with the destruction of the capital that The Targaryens themselves build, closing a cycle of tyranny, fear and terror. Daenerys will be the last dragon.</p><h2>DRAGONSTONE WILL FAIL;</h2><p><br></p><figure data-orig-width=\"2000\" data-orig-height=\"1120\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/31e728bb18f6e03ee2f8869ca038918f/tumblr_inline_pm5u98wcWp1sgp768_540.png\" alt=\"image\" data-orig-width=\"2000\" data-orig-height=\"1120\"></figure><h2><br></h2><p>I believe that Dragonstone will be destroyed in the end. The Castle in the remote island serves no purpose for Westeros. It can not be used for grains production or animal livestock, the only use for Dragonstone in the past centuries was to be used as base for a foreign invasion, the castle will probably be destroyed in the end. Also important, Daenerys spent this entire story threatening to destroy other’s peoples houses and cities. To have her own ancestral House destroyed in the end would be very fitting to the story.<br></p><p><br></p><blockquote><p><i>“so comes snow, after fire and even dragons have their ending” </i></p><p>J. R.R TOKIEN</p></blockquote><p><br></p><h2>WE WILL HAVE A SECOND REBELLION AND A SECOND DANCE OF THE DRAGONS…</h2><p><br></p><blockquote><p>Don’t fight in the North. Or the South. Fight every battle, everywhere, always, in your mind. Everyone is your enemy, everyone is your friend… every possible series of events is happening all at once. Live that way and nothing will surprise you, ……..everything that happens will be something that you have seen before.</p><p>(Litllefinger SEASON 7 EPISODE 2)</p><p><br></p></blockquote><p><br></p><p>Everything that happened in the past will happen again in season 8. Robert’s Rebelion will happen again. Sansa will be kidnapped at some point, just like aunt Lyanna Stark; Arya will lead the North armies south to save her sister (just like Ned Stark did in Robert’s Rebellion). The Riverlands, the North and the Vale will once again gather forces and go to war.</p><p><br></p><p><br></p><blockquote><p>Stannis: “What are you reading?”</p><p>Shireen: <b>“The Dance of Dragons.”</b></p><p>Stannis: “What’s it about? It’s the story of the fight between Rhaenyra Targaryen and her half-brother Aegon for control over the Seven Kingdoms. Both of them thought they belonged on the Iron Throne. When people started declaring for one of them or the other, their fight divided the kingdoms in two. <b>Brothers fought brothers, dragons fought dragons. By the time it was over, thousands were dead. And it was a disaster for the Targaryens as well. They never truly recovered.</b></p><p>(GAME OF THRONES SEASON 5 EPISODE 9)</p><p><br></p><p><br></p></blockquote><p>We will have a second Dance of Dragons, with the kingdom divided between Jon Snow and Daenerys Targaryen. The Lannisters will be divided too by this war. Tyrion (the flop) will choose Daenerys side and Jaime will choose Jon Snow and the Starks. This will be the decision that will change Jaime Lannister legacy forever.</p><p>Millions will die, but in the end Jon Snow and his armies will defeat Daenerys and her dragons. This war will not only destroy the realm but finally bring an end to the Targaryen dynasty. This battle will probably happens on episode 5.</p><p><br></p><h2>SANSA’S PLANS TO CAST DOWN CERSEI…</h2><p><br></p><figure data-orig-width=\"500\" data-orig-height=\"287\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/606011674977c01975eb40f294e3fd29/tumblr_inline_pm5uanuNnL1sgp768_540.png\" alt=\"image\" data-orig-width=\"500\" data-orig-height=\"287\"></figure><h2><br></h2><h2><br></h2><p>Sansa will be kidnapped in season 8, probably by Cersei, but don’t be surprised if this kidnapping has a twist. In season 1, in the scene where Cersei and the small council is forcing Sansa to write down a letter to Rob Stark demanding him to bend the knee to King Joffrey., we have Maester Pycelle warning Cersei that Sansa may be so sweet and innocent now, but once she is older, she may hatch some treasons!!!!</p><blockquote><p>“she (Sansa) may be a sweet thing now Your Grace, but in 10 YEARS, who knows what treasons she may hatch!!!!”</p><p>(SEASON 1 EPISODE 8)</p><p><br></p></blockquote><p>Now, we know that Sansa did learn a lot from Cersei and maybe now she is finally ready to outsmart her former teacher… This was the first foreshadowing of Sansa’s plans to cast down Cersei.</p><p>And in season 6, we have another foreshadowing of how Sansa will plot against Cersei in the end, When Arya is in Braavos, she watches a Bravossi Theather play telling the events that happened in Westeros. In that storyline, the actress that plays Sansa hires a faceless man to kill the actress who plays Cersei, Lady Crane. I believe this was another foreshadowing of the events that will happen in season 8. Its Sansa who is taking Cersei down. The little dove will prove to the queen that she learned all her lessons. But I believe Jon Snow will be the one killing Cersei.</p><p><br></p><h2>EPISODE 5 WILL BE THE DANCE OF DRAGONS;</h2><p><br></p><blockquote><p>He was no dragon, Dany thought, curiously calm. Fire cannot kill a dragon.</p><p>(A Game of Thrones - Daenerys V)</p><p><br></p></blockquote><p><br></p><p>Well I believe thats exactly whats its gonna happen. In order to defeat Daenerys you have to kill her last dragon, Drogon, which we know will be flying over Kings Landing in the end of this story. Thats how the wildfire comes in. I actually think Jon and the Lannisters may set a trap for Dany and use the wildfire to kill the dragon and Daenery’s remain armies. Maybe Bran was behind King Aerys decision to cover KL with wildfire, already preparing to use against Daenerys in the finall battle for the Throne. if we rewatch season 5 episode 7 we had a little hint about this idea.</p><p><br></p><blockquote><p>DAARIO: On the day of the Great Games, gather all the great masters, and wise masters, and worthy masters you can find, and slaughter them all.</p><p>DAENERYS: I am a queen. Not a butcher.</p><p>DAARIO: All rulers are either butchers or meat.</p><p><br></p></blockquote><p><br></p><p>Remember that Bran’s first chapter he is forced to watch his father doing the Kings’s justice and Ned explains to him that “the man who passes the sentence, must swing the sword”. This is one of the most important themes in the story.</p><p>Also, in season 4 episode 2, we have Bran having a vision of the events that will happen for the first time. This is THE vision where he sees the dragon flying over KL. After the vision he tells Jojen and Meera: “I know where we have to go”. The show then cuts to a scene in Kings Landing.</p><p>So, I do believe Bran will be involved with the explosion of Kings Landing and using the wildfire as a last weapon to defeat Daenerys and her last dragon. Thats the only way Westeros will ever be free of the Targaryens.</p><p>BTW, gathering all your enemies in a closed space and destroying them with fire has been used by both mad queens, Cersei and Daenerys, so maybe now we will see the Starks using this idea to finally get rid of Daenerys, her armies and her dragon.</p><p><br></p><h2>THE FUTURE OF HOUSE LANNISTER</h2><p>No, House Lannister will not fall into nothing like the Targaryens. The House will be saved by Jaime Lannister, who will marry Brienne of Tarth and restore his family and legacy.</p><p><br></p><h2>JAIME LANNISTER ITS GOING TO BE THE FINAL HAND AND ITS GOING TO END THIS STORY AS A GREAT HERO;</h2><p><br></p><figure data-orig-width=\"980\" data-orig-height=\"490\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/73b5389c30d8ef91064c03b6c0a5f945/tumblr_inline_pm5ueyWqgV1sgp768_540.jpg\" alt=\"image\" data-orig-width=\"980\" data-orig-height=\"490\"></figure><p>Jaime Lannister will choose Jon Snow, this will be the turning point for Jaime and the choice that will change his legacy. There is some very good foreshadowing in the books that hint to us that Jaime will side with Jon Snow in the final battle and help him to defeat Daenerys and her dragons.<br></p><p>I believe it will be Jaime who will kill Daenerys last dragon, Drogon, and becoming famous as a DRAGONSLAYER; Jaime Lannister will have a big role in the final part of this story, not only helping defeat the ARMY OF THE DEAD, but also defeating Daenerys Targaryen and saving the Kingdom once again from a tyrannical Targaryen; only this time he will finally receive the thank you, from the people of Westeros;</p><p>Jaime will be greeted as a hero and will end this story beloved and admired by the people. I believe at some point in season 8 Jaime will die and will be brought back to life, his character was written as a mirror to Jon Snow and Jon died on season 5, so this storyline may be possible.</p><p>Jaime will be the Hand of the King for Jon Snow (there is a lot of foreshadowing for this, in both books and tv show) and he will be able to finish his history in the white book as a hero. He will go down in history as one of the greatest Hands in the history of the 7 kingdoms. Jaime will be the last Lannister left on Westeros.</p><p><br></p><h2>TYRION WILL BE SENT INTO EXILE;</h2><p><br></p><p>Tyrion will have to face a trial for a third time and this time he will be guilty of his crimes. Yeah, that is not a prediction, it’s a spoiler, but I already expected that. George loves his 3. Tyrion its one of the characters that will have a very tragic ending. He was the fool who brought Daenerys to Westeros believing he could control her, the same mistake his sister Cersei tried to do with Joffrey. He invited Jon Snow under false premises to Dragonstone without mentioning to Jon about Daenerys demands to bend the knee.</p><p>He made a deal with Cersei that was never disclosed to the audience and I believe he may be behind Sansa’s kidnapping story in season 8. He keeps making one mistake after the other, always believing to be smarter than the people around him, always under estimating the players of the game.</p><p>But I don’t believe he will die. In the House videos released for season 8, they had the Lannisters brothers, Jaime and Tyrion, saying goodbye to each other and I believe we will see them say good bye one last time. I think Tyrion will be sent into exile to Essos, and banned from returning to Westeros.</p><p><br></p><h2>CERSEI WILL DIE;</h2><p>There has been a lot of foreshadowing about Cersei death and its one of the events many believe it happen for sure. The show made sure to write us a scene when her ending is predicted.</p><p><br></p><blockquote><p>“I will hurt you for this. A day will come when you think you’re safe and happy and your joy will turn to ashes in your mouth. And you will know the debt is paid.”</p><p>(Tyrion - SEASON 2 EPISODE 8)</p><p><br></p></blockquote><p><br></p><p>This episode was written by George RRMartin himself, so, I always assumed this was Cersei Lannister ending… Then in season 7, we had Jon Snow threatening to kill Littlefinger is he ever touched Sansa. In that scene we have Jon Snow choking Baelish with his cold hands and I believe this scene could be a foreshadow of Jon finally killing Cersei, for trying to hurt Sansa in season 8. The prophecy says that Cersei will be killed by the “little brother” and Jon Snow fits that role as the younger son of Rheagar Targaryen.</p><p>_______________________________________________________________</p><p><br></p><h2>THEON WILL BE KING OF THE IRON ISLANDS;</h2><p>He lifted his head to look at her. “Catelyn,” he said. His voice was distant and formal. “Where are the children?”</p><p>A Game of Thrones - Catelyn I</p><p>I believe the children of Wintefell were always meant to be the heroes of this story. That’s why George made sure to have a Greyjoy, a Targaryen be raised close to the Stark children. Those children now are gonna be the rulers of Westeros and they will be the ones passing Ned Stark legacy forward, building a new and better world.</p><p>Thast why I believe Theon will kill Euron Greyjoy and be the king of the Iron Islands; Theon probably has a bastard child with the captain’s daughter he met in season 2 on his journey to Pike, he will recognize the child and raise them as his heir;</p><h2>A TIME FOR WOLVES;</h2><p><b><br></b></p><figure data-orig-width=\"599\" data-orig-height=\"287\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/e6eaee32c64120ed47c03b3bc7061f9d/tumblr_inline_pm5uvnO0W51sgp768_540.png\" alt=\"image\" data-orig-width=\"599\" data-orig-height=\"287\"></figure><p><br></p><p>It will be a Time for Wolves; a new period for Westeros. Jon will rule surrounded by Starks, carrying the Stark name with Sansa and Bran by his side; The capital will probably be transferred to HighGarden, not only the castle it is still intact but its also located in the most fertile area of Westeros. It seems like a very interesting political decision. Again, I found a lot of foreshadowing for this in the books.</p><p>Jon Snow will rule over a graveyard, as he predicted in season 7. But the ending will be very sweet, with kids playing around in gardens and celebrating. We will see Jon, the Stark kids, Jaime and Brienne, Sam and Guilly, Theon….. ect all enjoying spring and celebrating their happy ending.</p><p><br></p><p><br></p><h2>THE VERY LAST SCENE OF THE STORY…..</h2><p><br></p><p>Daniel Abraham is the man responsible for converting the Game of Thrones book into a comic, mentioned that there is a particular line of dialog in the game of thrones book, which is very important for the last scene of “A Dream of Spring”.</p><p>Have you collaborated at all with George R.R. Martin in the process of adapting the novel to comics? If so, what’s the creative process there?</p><p>Daniel: “I’ve spoken to George a lot in the process. The biggest issues we have are continuity questions. There are things about this story that only he knows, and they aren’t all obvious. There was one scene I had to rework because there’s a particular line of dialog – and you wouldn’t know it to look at – that’s important in the last scene of “A Dream of Spring.”- Daniel Abraham</p><p>On episode 1, when King Robert goes to visit Winterfell, he and Ned go down in the crypts to pay their respects to Lyanna Stark, the wolf girl he lost to Rheagar Targeryen. In that scene, the dialogue is different from what we have in the books.</p><p><br></p><blockquote><p>ROBERT: Did you have to bury her in a place like this? She should be on a hill somewhere with the sun and the clouds above her.</p><p>NED: She was my sister. This is where she belongs.</p><p><br></p></blockquote><p>In the books, this conversation is different:</p><p><br></p><p><br></p><blockquote><p>\"Ah, damn it, Ned, did you have to bury her in a place like this?” His voice was hoarse with remembered grief. “She deserved more than darkness …”</p><p>“She was a Stark of Winterfell,” Ned said quietly. “This is her place.”</p><p>A Game of Thrones - Eddard I</p><p><br></p></blockquote><p>I think this is the scene. I believe we will end this story with King Jon visiting his late wife Sansa Stark in the crypts of Winterfell and someone will ask him why did he buried her there, why not building a monument for her, so that she could be on display and that’s how he will reply:<br></p><p><br></p><blockquote><p>She was a Stark of Winterfell, this is where she belongs….</p><p><br></p></blockquote><p>What made me believe this, were two momments of the story: First of all, Lady’s death. After Sansa direwolf is killed on her way to the south, Ned Stark makes sure to send a group of men back to the North and Winterfell, so that she can be buried in Northerner soil. Lady represented a little bit of Sansa, who died on that day and I dont think it was a silly detail George rrmartin make sure that her direwolf body was buried on Winterfell, I think that this scene, was much more important than most people think about it.</p><p><br></p><blockquote><p>When it was over, he said, “Choose four men and have them take the body north. <b>Bury her at Winterfell</b>.”</p><p>“All that way?” Jory said, astonished.“All that way,” Ned affirmed. “The Lannister woman shall never have this skin.”</p><p>A Game of Thrones - Eddard III</p><p><br></p></blockquote><p>Another momment in the story was Ygritte death. In both books and show, Jon Snow takes her body and goes to bury her up North, where she belonged.</p><p><br></p><blockquote><p>Tormund: Did you love her? She loved you.</p><p>Jon: She told you?</p><p>Tormund: No. All she ever talked about was killing you. That’s how I know. <b>She belongs in the North. The real North.</b> You understand me?</p><p><br></p></blockquote><p><br></p><p>Look at the excuse Tormund gives Jon to why Ygritte needs to be buried North of the Wall, its the same Ned Stark used to explain to King Robert why Lyanna had to be buried in the Crypts of Winterfell. Because thats where she belongs…….</p><p>I also believe this ending could bring the story to a full circle, because there is also the theme of the audience never really thinking as Sansa as a TRUE STARK. There is still the notion that Sansa is not really a Stark like Jon or Arya.</p><p>Sansa Starkiness was always a topic of contention among fans of the books and series. Many like to refer to Sansa as Lady Lannister or Lady Bolton, so to have Sansa finally resting in the Winterfell crypts, by the end of this story, as a Stark, would be a very satisfying ending. Her hair maybe red and some of her manners may be more southern like, but Sansa IS A STARK.</p><p>And in fact, she is the Stark who took back the North and Winterfell, she is the Stark who made possible for the family to reunite and be safe; she is the Stark who stood by Jon side when he was made King in the North and supported his claim; she was the Stark who prepared the North for the wars and the winter and she will be the Stark who will rule the 7 Kingdoms together with her husband.</p><p>Both Jon and Sansa are foreshadowed to live very long lives and I expect their ruling period to last decades. They will be the ones restoring and rebuilding the kingdom after the wars of Ice and Fire. But I do believe Jon will live longer based on a quote from the books.</p><p><br></p><blockquote><p>Tyrion shared around his skin of wine until even Yoren grew mellow. <b>One by one the company drifted off to their shelters and to sleep, all but Jon Snow, who had drawn the night’s first watch.</b> Tyrion was the last to retire, as always. As he stepped into the shelter his men had built for him, he paused and looked back at Jon Snow. The boy stood near the fire, his face still and hard, looking deep into the flames. Tyrion Lannister smiled sadly and went to bed. -<br>AGOT Tyrion II</p></blockquote><p><br></p><p>And because of this line, I believe Jon Snow ill be the last one to die, he will live a very long life and will be forced to see all the ones he loved pass away, one by one.</p><p><br></p><p><br></p><h2>THE END OF GAME OF THRONES…</h2></p>",
                "content": "<p><ul><li>Jon Snow and Sansa Stark will be the King and Queen of the 7 Kingdoms;<br /></li><li>Jon Snow will father a bastard daughter;<br /></li><li>Jon Snow will have half of his face burned down in the final battle and will be blind from one eye;<br /></li><li>Jon and Sansa will lie to protect the bastard girl and raise her as their trueborn child;<br /></li><li>Sansa is the &ldquo;Younger and More Beautiful Queen&rdquo; who will cast down Cersei;<br /></li><li>Sansa Stark will be known as THE QUEEN. She will be the one changing the laws of succession, allowing girls to be the heirs in front of their younger brothers;<br /></li><li>Jon Snow will be the one killing Cersei, he will be the Valonqar of the prophecy;<br /></li><li>The North will never bend the knee to a southern ruler ever again, but it may join the Realm in a new political division.<br /></li><li>Arya Stark will call the banners and lead the Northern armies in the new Rebellion;<br /></li><li>Arya Stark will be The Queen in the North;<br /></li><li>Bran Stark will be the most important player against the Night King, not the dragons;<br /></li><li>Daenerys will abandon the fight against the Army of the dead and march south, leaving the North to fight for themselves;<br /></li><li>We will have a Second Dance of Dragons between Jon Snow and Daenerys Targaryen;<br /></li><li>Daenerys arrival to Westeros will enter the history books as one of the worst events in the History of the 7 Kingdoms;<br /></li><li>Jaime Lannister will be the Hand of the King for Jon Snow; Jaime Lannister will marry Brienne of Tarth and restore House Lannister to their former glory;<br /></li><li>Tyrion Lannister will face his third trial, but this time he will be guilty of all his crimes;<br /></li><li>Tyrion Lannister will lose his tongue and be sent into exile to Essos;<br /></li><li>Daenerys will be the last antagonist of this story and will be remembered as THE QUEEN OF ASHES;<br /></li><li>House Targaryen will come to an end;<br /></li><li>Theon will be the King of the Iron Islands;<br /></li><li>The new capital of the realm will be in HighGarden;<br /></li><li>Episode 3 will be the Fight against the Army of the Dead;<br /></li><li>Episode 5 will be the Dance of Dragons.<br /></li><li>The Starks will rule the kingdom in the end, bringing a Time for Wolves.<br /></li></ul><p>________________________________________________________________</p><h2>JON SNOW AND SANSA STARK MARRIAGE&hellip;&hellip;</h2><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/9297104892701461ba194b2ee03af372/tumblr_inline_pm5u1kAW181sgp768_540.jpg\" class=\"\"/></figure><p><br /></p><p>Jon Snow and Sansa Stark will be the final King and Queen of the 7 Kingdoms. Their romance has been foreshadow pretty much since book 1 and season 1 and their marriage will bring peace and prosperity to Westeros. The wars of Ice and Fire will destroy the kingdom and they will be the ones rebuilding the realm to its former glory; Jon and Sansa storyline are in a perfect parallel and they have been groomed to be king and queen of Westeros for the whole storyline in the books.</p><h2>JON SNOW HAS ALWAYS LOVED SANSA STARK;</h2><p><br /></p><p>Jon Snow has always been in love with his cousin Sansa Stark, which is why he decided to go to the wall after Ned Stark accepted Sansa&rsquo;s engagement to Joffrey Baratheon. Jon was written as a mirror to Jaime Lannister and one of the reasons Jaime decided to join the kingsguard was because he could never marry his sister and lover Cersei. Once the secret of Lyanna and Rheagar is finally out, Jon and Sansa will be free to be together. Their love story is the main romance of the books.</p><p>BTW, don&rsquo;t be surprised if they reveal the romance between Jon and Sansa in the end of the first episode of season 8. The episode will start mirroring the pilot episode, when King Robert arrived at Winterfell with his Lannister family and we all know the episode ended with the reveal of Cersei and Jaime incestual romance.</p><p><br /></p><h2>JON SNOW IS GOING TO BE A STARK;</h2><p>Jon Snow is going to take Sansa Stark name and pass the Stark name to all his children. He will be finally be a Stark and die as a true son by law of Eddard Stark, just like he always dreamed of in the books. This was foreshadowed in season 6 episode 5, when Sansa cloaked Jon Snow with a Stark Cloak.</p><p><br /></p><h2>JON WILL FATHER A BASTARD</h2><p>Jon Snow will father a bastard. He will have trueborn sons with his wife Sansa Stark, but he will have a bastard girl with Daenerys. The books have foreshadowed this event to death. Jon and Sansa will pass this bastard girl as their own trueborn child and give her their Stark name. Sansa will raise this child as her own daughter and make her a Stark. That&rsquo;s why the show wrote that scene with Catelyn Stark and Talissa on season 3 where Catelyn says that she failed to love and care for her husband bastard child, Sansa will do the opposite and love and care for Jon&rsquo;s bastard daughter.</p><p>Jon will do the inverse of his uncle Ned, who lied and raised his trueborn nephew as a bastard. The story of Game of Thrones started with Ned Stark starting a war to prevent a bastard son of Cersei Lannister to sit in the Throne and it will end with a bastard daughter of Jon Snow as the heir of the Throne. History repeat itself and in the end, there wont be much difference between Starks and Lannister, they all lie to protect the ones they love.</p><p>&ldquo;The things we do for love&rdquo; will still be the theme of the story in the end&hellip;.</p><p><br /></p><h2>THIS IS A STORY OF FATHER&rsquo;S DAUGHTERS&hellip;.</h2><p><br /></p><p>A SONG OF ICE AND FIRE its many tales in one; this is a tale of a Dragon prince madly in love with a Wolf girl; this is also a tale about home and families; about the things we do for love; it&rsquo;s a story about tyranny and fear; its also a story about slow learners, who make several mistakes, but that eventually do learn, but ALSO, A SONG OF ICE AND FIRE, is a story about father&rsquo;s daughters.</p><p>And that&rsquo;s exactly what Arya, Sansa, Cersei, Daenerys, Brienne all are. These women are their father&rsquo;s daughters. That&rsquo;s why the show gave so much importance on those character&rsquo;s fathers and hardly touched the mothers relevance.</p><p>No one thought Sansa and Daenerys had much of their fathers in themselves, those two characters were always associated with their mothers, yet they will prove to all of us that they carry much of Eddar and Aerys inside of them, in the last part of this story.</p><p><br /></p><h2>THE STARK SISTERS WILL GET EVERYTHING THEY EVER WANTED&hellip;</h2><blockquote><p><br /></p></blockquote><p><br /></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/2f7beda43cf2d3363b1942b24764016c/tumblr_inline_pm5u2jBCaP1sgp768_540.png\" class=\"\"/></figure><blockquote><p>Arya: &ldquo;We both wanted to be the other people when we were younger. You wanted to be a queen and sit next to a handsome, young king on the Iron Throne. I wanted to be a knight, to pick up a sword like father and go off to battle. Neither of us got to be that other person, did we? The world doesnt just let girls decide what they are going to be.&rdquo;&rsquo;</p><p>(SEASON 7 EPISODE 6)</p><p><br /></p></blockquote><h2>AND THEY ARE GOING TO BE QUEENS&hellip;.</h2><p>Yes, we will have two queens. Game of Thrones started with two queens. Daenerys and Cersei; one a conqueror, the second a consort queen. Two women, whose obsession for the Iron Throne, left a trail of death and destruction on Essos and Westeros. So, we will finish this story with two queens, who will restore the Kingdom and improve the lives of their people. Sansa will be the consort queen of Jon Snow and Arya will be the warrior, the conquering queen that will lead the armies of North, Vale and Riverlands into war in season 8.</p><p><br /></p><h2>SANSA STARK WILL BE &ldquo;THE QUEEN&rdquo;;</h2><p><br /></p><p>Queen Sansa Stark will change the Law of Succession allowing girls to be heirs in front of their younger brothers. Sansa it&rsquo;s the YMBQ of the prophecy and she will be the one casting Cersei Lannister down; Sansa will be very political active queen, changing laws and improving the lives of the people of Westeros and making important changes in the realm; She will be loved by her people and called THE QUEEN.</p><p>Sansa was always meant to be the final queen and the one who will rebuild the kingdom after the wars. Sansa entire storyline in the books was about observing the major players of the game make their moves and see the ramifications of those decisions. In Kings Landing, Sansa saw it first hand how ruling can affect the lives of the people in Westeros. She was able to see what to do, when in power, but also, what NOT to do as a king or queen. She learned a lot from Cersei, Margaery, Ollena, the Tyrells, The Lannisters, Littlefinger and will use this education for good use as a queen.</p><p>All Sansa&rsquo;s dreams will come true and she will be a living proof that &ldquo;life is a song&rdquo;. She will marry her brave and gentle hero; she will have children and rebuild her family and she will be a very beloved queen, admired for her beauty and kindness.</p><p><br /></p><h2>ARYA WILL BE THE QUEEN IN THE NORTH;</h2><p><br /></p><p>Arys Stark will rule the North as a Regent Queen. Arya storyline in season 8 will be a copy of Papa Ned in the first Rebellion against the Mad King. She will call the banners and lead the North armies into battle in the final war of this story. George RRMartin himself said that she would conquer the world in the final part of this tale.</p><p><br /></p><h2>ARYA WILL BE VERY IMPORTANT IN THE FINAL SEASON !!!!!</h2><p><br /></p><p>Arya is season 8 will be a huge warrior, with the help of Nymeria and their pack of wolves, she is going to lead their armies into battle, defeating Daenerys armies in combat (yes, the Dothraki bitches!!!!!!) They will probably meet in the Riverlands, where Rheagar and Robert had their first and final confrontation. She will be the one who will kill the mountain, avenging the people that he cruelly killed in the Riverlands and the Hound. Just like papa Ned became famous for killing Ser Arthur Dane, Arya will be legendary for killing the Mountain. They will write songs about her for years and years to come&hellip;&hellip;</p><p><br /></p><h2>BRAN STARK WILL BE THE MAGICAL FORCE TO STOP THE ARMY OF THE DEAD&hellip;</h2><h2><br /></h2><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/cb5a9eeba9a21e09fa027a4d5e29bee9/tumblr_inline_pm5u5aiMqM1sgp768_540.png\" class=\"\"/></figure><h2><br /></h2><p>I know the audience expects Daenerys and her dragons to be the magical force used to stop the Army of the Dead, but, don&rsquo;t be shocked if she decides to abandon the cause in the middle of the fight and leave the North before the big battle against the Night King. There is a lot of Stannis in Daenerys character arc on season 7 and in the end, Stannis left Jon and the Nights Watch on their own to fight the Night King on Hardhome, and went to march to Winterfell to fight the Boltons. Stannis could never let it go completely of the Iron Throne and I expect Dany to do the same.</p><p>Its Bran Stark, who has been preparing himself to face this threat since the beginning of this story. Its Bran Stark who has been foreshadowed by the books and tv show to be the one who will matter the most in the end. Not the dragons. I suspect we will see the ghosts of the Kings of Winter, coming out from the crypts of Winterfell, to fight the final battle against the Army of the Dead.</p><p>Bran: What else have you seen it? Jojen: The ONLY think that matters. YOU.</p><p>(Season 3 Episode 2)</p><p>Also, in the first Long Night, there was no Targaryens; The North was left to fight on its own with the help of the Children of the Forest and George likes to repeat his stories very closely to the original. Defeating the Army of the Dead wont be Bran only job in season 8, he has also been written as a foil to Daenerys, so I believe he will be involved on her final defeat.</p><p><br /></p><h2>DAENERYS WILL BE THE FINAL ANTAGONIST IN SEASON 8 AND WE WILL HAVE A SECOND DANCE OF DRAGONS BETWEEN JON AND DANY&hellip;&hellip;</h2><p><br /></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/21fdccfff8b756b781f5c03f45e95a7e/tumblr_inline_pm5u5w9MAV1sgp768_540.jpg\" class=\"\"/></figure><h2><br /></h2><blockquote><p>Jon Snow: <b>&ldquo;They will see it you for &ldquo;what you are&rdquo;.</b></p><p><b>(</b>SEASON 7 EPISODE 6)</p><p><br /></p></blockquote><p>In the beginning of this story we saw Sansa Stark falling madly in love with a beautiful prince, only to have her heart broken in a million of pieces in the end of season 1, when Joffrey shocked her by cutting her father&rsquo;s head, finally showing how cruel and monstrous he really was. In the beginning of the series, we also had the audience falling madly in love with the beautiful Daenerys Targaryen, believing she was the hero of this story and just like Sansa, the audience will be shocked by Daenerys actions in season 8 and they will have their hearts completely broken in a million of pieces. Daenerys will finally show to the audience the monster that she really is. I expect to see a lot of shades of Joffrey on Daenerys in season 8. Remember, Joffrey believed his whole life he was the true heir of the Iron Throne, until a Stark man showed up in his life, telling him that this was a lie. This is exactely what is going to happen to Daenerys in season 8.</p><p>Remember when Sansa Stark fell madly in love with a monster and trusted a beautiful queen blindly when she was warned against it? You are all Sansas, you just don&rsquo;t know yet.</p><p>Daenerys could never be the villain of her own story. That&rsquo;s why it was always necessary for her to create a lie that painted her as the hero. She invaded Astapor to save the Unsulied from the evil wise masters; she conquered Meereen to pay back the slavers for crucifying the children slaves; she destroyed the sacred temple of Vaes Dothrak and killed all the Khalls, but she did for the Dothraki widows who didnt wish to stay in the Dosh khaleen. Now in Westeros she had no more excuses, there is no slavery or evil masters torturing young boys in the 7 Kingdoms, so she was forced to create a new excuse to defend her invasion of Westeros.</p><p>So, she told the audience that she wants to break the wheel of power that crushes the poor and the weak on Westeros. It makes no sense of course. She wants to break the wheel, by building a new wheel, this time, with only her family on top, crushing those under her. This is a phony ridiculous excuse and its supposed to be ridiculous. It&rsquo;s a silly lie, all Daenerys wants in the Iron Throne, but she cant admit it afraid it will make her look bad, so she created this silly little lie and the audience (just like Sansa fell into Cersei silly lies in season 1) fell right into. What Dany really wants is install an absolute monarchy, with only HER in power.</p><p>Daenerys is a false prophet, who invented a sacred mission to convince her people and those who follow her of her good intentions, yet all her actions are motivated from the desire to take The Iron Throne, that&rsquo;s the one thing who truly matters for Daenerys and now in season 8, when her claim to the Throne will be contested by the bombastic news of Jon Snow stronger claim to the Throne. That&rsquo;s whe she will finally show to the audience who she really is.</p><p><br /></p><h2>WHAT HAPPENS WHEN WE BLINDLY FOLLOW, GOD AND HEROS;</h2><p><br /></p><p>By writing Daenerys Targaryen, George RRMartin wanted to show us how dictators and cult leaders are created. They started magical and inspiring, making beautiful speeches and promising great things, but in end, most of them are motivated by selfish desires and allow power to corrupt them. Daenerys story is also a warning about following leaders without questioning their motivations or decisions. Daenerys is adored as a goddess by her followers and never has her decision questioned by them. Unlike Jon Snow who is always questioned by Sansa, The North Lords and the Wildlings about his decisions. The Dothraki and the Unsullied just blindly follow Daenerys around, like children following their mothers, never questioning her real motives, or even contemplating if the move to Westeros has actually any benefits for them. And as we are about to see in season 8, following leaders blindly can be a very dangerous thing because it can lead us to our graves. The audience, the Dothraki and the Unsullied never thought that their hero could just simply be lying to them&hellip;&hellip;No matter how much destruction and death she causes, her followers and advisers keep believing in her, defending her decisions, turning a blind eye to her questionable actions, finding excuses to her terrible acts. They know that she can be impulsive and dangerous but believe that in the end she is motivated by great ideals and will always listen to her advisers&hellip;&hellip;..</p><p>Daenerys first instinct is always destruction and violence, but most of the time, she is restrained by her advisers&hellip;&hellip;&hellip;. But the rope that holds her together is about to be ripped apart in season 8.</p><p><br /></p><blockquote><p>Daario Naharis: <b>&ldquo;I pity the Lords of Westeros, they have no idea what is coming for them&rdquo;</b></p><p>(SEASON 6 EPISODE 10)</p><p><br /></p></blockquote><p>Daenerys was always meant to be the final antagonist of the story, her time in Essos was not about learning to be a good queen, she was learning to be a ruthless conqueror, which she learned very well. Don&rsquo;t be surprised if she marries Euron Greyjoy, they marriage has been foreshadowed on books and tv show. Daenerys its gonna shock the audience, she is going to behave in a way that will surprise a lot of people.<br /></p><p>Jon and Daenerys relationship will mirror Rhaenyra and Aegon tragic battle for the Throne; This will be the final battle on episode 5, the fight for the Throne has always been the main focus of the story and this battle its what is going to put an end to this tale. Westeros will finally be united against the common enemy, which is Daenerys and her dragons.</p><p>The Army of the Dead and the Night King were always a red herring, its was always Daenerys and her dragons the major threat for Westeros. I believe that more than half of the population of Westeros will perish during the final wars; many who survive the war will latter die during the winter without the food that was destroyed by Daenerys dragons in the Field of Fire 2.0; in her short period in Westeros, Daenerys will cause a lot of deaths and destruction and she will be remembered as the Queen of Ashes.</p><p>The stallion that mounts the world was never Rhaego. It was always going to be Daenerys. Essos will also be throw into chaos, without Daenerys dragons to impose order, the masters of Astapor, Meereen and the local cities will raise again and the region will probably be engulfed into a civil war. It will probably take centuries for the world to recover from Daenerys reign of terror.</p><p><br /></p><h2>WINTER WILL COME TO HOUSE TARGARYEN;</h2><p><b><br /></b></p><p>Daenerys final battle on episode 5, will turn Kings Landing into ashes, but she wont be destroying just the capital of the realm, she will also put an end to House Targaryen. Their dynasty started with the destruction of Harrenhall and will end with the destruction of the capital that The Targaryens themselves build, closing a cycle of tyranny, fear and terror. Daenerys will be the last dragon.</p><h2>DRAGONSTONE WILL FAIL;</h2><p><br /></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/31e728bb18f6e03ee2f8869ca038918f/tumblr_inline_pm5u98wcWp1sgp768_540.png\" class=\"\"/></figure><h2><br /></h2><p>I believe that Dragonstone will be destroyed in the end. The Castle in the remote island serves no purpose for Westeros. It can not be used for grains production or animal livestock, the only use for Dragonstone in the past centuries was to be used as base for a foreign invasion, the castle will probably be destroyed in the end. Also important, Daenerys spent this entire story threatening to destroy other&rsquo;s peoples houses and cities. To have her own ancestral House destroyed in the end would be very fitting to the story.<br /></p><p><br /></p><blockquote><p><i>&ldquo;so comes snow, after fire and even dragons have their ending&rdquo;&nbsp;</i></p><p>J. R.R TOKIEN</p></blockquote><p><br /></p><h2>WE WILL HAVE A SECOND REBELLION AND A SECOND DANCE OF THE DRAGONS&hellip;</h2><p><br /></p><blockquote><p>Don&rsquo;t fight in the North. Or the South. Fight every battle, everywhere, always, in your mind. Everyone is your enemy, everyone is your friend&hellip; every possible series of events is happening all at once. Live that way and nothing will surprise you, &hellip;&hellip;..everything that happens will be something that you have seen before.</p><p>(Litllefinger SEASON 7 EPISODE 2)</p><p><br /></p></blockquote><p><br /></p><p>Everything that happened in the past will happen again in season 8. Robert&rsquo;s Rebelion will happen again. Sansa will be kidnapped at some point, just like aunt Lyanna Stark; Arya will lead the North armies south to save her sister (just like Ned Stark did in Robert&rsquo;s Rebellion). The Riverlands, the North and the Vale will once again gather forces and go to war.</p><p><br /></p><p><br /></p><blockquote><p>Stannis: &ldquo;What are you reading?&rdquo;</p><p>Shireen: <b>&ldquo;The Dance of Dragons.&rdquo;</b></p><p>Stannis: &ldquo;What&rsquo;s it about? It&rsquo;s the story of the fight between Rhaenyra Targaryen and her half-brother Aegon for control over the Seven Kingdoms. Both of them thought they belonged on the Iron Throne. When people started declaring for one of them or the other, their fight divided the kingdoms in two. <b>Brothers fought brothers, dragons fought dragons. By the time it was over, thousands were dead. And it was a disaster for the Targaryens as well. They never truly recovered.</b></p><p>(GAME OF THRONES SEASON 5 EPISODE 9)</p><p><br /></p><p><br /></p></blockquote><p>We will have a second Dance of Dragons, with the kingdom divided between Jon Snow and Daenerys Targaryen. The Lannisters will be divided too by this war. Tyrion (the flop) will choose Daenerys side and Jaime will choose Jon Snow and the Starks. This will be the decision that will change Jaime Lannister legacy forever.</p><p>Millions will die, but in the end Jon Snow and his armies will defeat Daenerys and her dragons. This war will not only destroy the realm but finally bring an end to the Targaryen dynasty. This battle will probably happens on episode 5.</p><p><br /></p><h2>SANSA&rsquo;S PLANS TO CAST DOWN CERSEI&hellip;</h2><p><br /></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/606011674977c01975eb40f294e3fd29/tumblr_inline_pm5uanuNnL1sgp768_540.png\" class=\"\"/></figure><h2><br /></h2><h2><br /></h2><p>Sansa will be kidnapped in season 8, probably by Cersei, but don&rsquo;t be surprised if this kidnapping has a twist. In season 1, in the scene where Cersei and the small council is forcing Sansa to write down a letter to Rob Stark demanding him to bend the knee to King Joffrey., we have Maester Pycelle warning Cersei that Sansa may be so sweet and innocent now, but once she is older, she may hatch some treasons!!!!</p><blockquote><p>&ldquo;she (Sansa) may be a sweet thing now Your Grace, but in 10 YEARS, who knows what treasons she may hatch!!!!&rdquo;</p><p>(SEASON 1 EPISODE 8)</p><p><br /></p></blockquote><p>Now, we know that Sansa did learn a lot from Cersei and maybe now she is finally ready to outsmart her former teacher&hellip; This was the first foreshadowing of Sansa&rsquo;s plans to cast down Cersei.</p><p>And in season 6, we have another foreshadowing of how Sansa will plot against Cersei in the end, When Arya is in Braavos, she watches a Bravossi Theather play telling the events that happened in Westeros. In that storyline, the actress that plays Sansa hires a faceless man to kill the actress who plays Cersei, Lady Crane. I believe this was another foreshadowing of the events that will happen in season 8. Its Sansa who is taking Cersei down. The little dove will prove to the queen that she learned all her lessons. But I believe Jon Snow will be the one killing Cersei.</p><p><br /></p><h2>EPISODE 5 WILL BE THE DANCE OF DRAGONS;</h2><p><br /></p><blockquote><p>He was no dragon, Dany thought, curiously calm. Fire cannot kill a dragon.</p><p>(A Game of Thrones - Daenerys V)</p><p><br /></p></blockquote><p><br /></p><p>Well I believe thats exactly whats its gonna happen. In order to defeat Daenerys you have to kill her last dragon, Drogon, which we know will be flying over Kings Landing in the end of this story. Thats how the wildfire comes in. I actually think Jon and the Lannisters may set a trap for Dany and use the wildfire to kill the dragon and Daenery&rsquo;s remain armies. Maybe Bran was behind King Aerys decision to cover KL with wildfire, already preparing to use against Daenerys in the finall battle for the Throne. if we rewatch season 5 episode 7 we had a little hint about this idea.</p><p><br /></p><blockquote><p>DAARIO: On the day of the Great Games, gather all the great masters, and wise masters, and worthy masters you can find, and slaughter them all.</p><p>DAENERYS: I am a queen. Not a butcher.</p><p>DAARIO: All rulers are either butchers or meat.</p><p><br /></p></blockquote><p><br /></p><p>Remember that Bran&rsquo;s first chapter he is forced to watch his father doing the Kings&rsquo;s justice and Ned explains to him that &ldquo;the man who passes the sentence, must swing the sword&rdquo;. This is one of the most important themes in the story.</p><p>Also, in season 4 episode 2, we have Bran having a vision of the events that will happen for the first time. This is THE vision where he sees the dragon flying over KL. After the vision he tells Jojen and Meera: &ldquo;I know where we have to go&rdquo;. The show then cuts to a scene in Kings Landing.</p><p>So, I do believe Bran will be involved with the explosion of Kings Landing and using the wildfire as a last weapon to defeat Daenerys and her last dragon. Thats the only way Westeros will ever be free of the Targaryens.</p><p>BTW, gathering all your enemies in a closed space and destroying them with fire has been used by both mad queens, Cersei and Daenerys, so maybe now we will see the Starks using this idea to finally get rid of Daenerys, her armies and her dragon.</p><p><br /></p><h2>THE FUTURE OF HOUSE LANNISTER</h2><p>No, House Lannister will not fall into nothing like the Targaryens. The House will be saved by Jaime Lannister, who will marry Brienne of Tarth and restore his family and legacy.</p><p><br /></p><h2>JAIME LANNISTER ITS GOING TO BE THE FINAL HAND AND ITS GOING TO END THIS STORY AS A GREAT HERO;</h2><p><br /></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/73b5389c30d8ef91064c03b6c0a5f945/tumblr_inline_pm5ueyWqgV1sgp768_540.jpg\" class=\"\"/></figure><p>Jaime Lannister will choose Jon Snow, this will be the turning point for Jaime and the choice that will change his legacy. There is some very good foreshadowing in the books that hint to us that Jaime will side with Jon Snow in the final battle and help him to defeat Daenerys and her dragons.<br /></p><p>I believe it will be Jaime who will kill Daenerys last dragon, Drogon, and becoming famous as a DRAGONSLAYER; Jaime Lannister will have a big role in the final part of this story, not only helping defeat the ARMY OF THE DEAD, but also defeating Daenerys Targaryen and saving the Kingdom once again from a tyrannical Targaryen; only this time he will finally receive the thank you, from the people of Westeros;</p><p>Jaime will be greeted as a hero and will end this story beloved and admired by the people. I believe at some point in season 8 Jaime will die and will be brought back to life, his character was written as a mirror to Jon Snow and Jon died on season 5, so this storyline may be possible.</p><p>Jaime will be the Hand of the King for Jon Snow (there is a lot of foreshadowing for this, in both books and tv show) and he will be able to finish his history in the white book as a hero. He will go down in history as one of the greatest Hands in the history of the 7 kingdoms. Jaime will be the last Lannister left on Westeros.</p><p><br /></p><h2>TYRION WILL BE SENT INTO EXILE;</h2><p><br /></p><p>Tyrion will have to face a trial for a third time and this time he will be guilty of his crimes. Yeah, that is not a prediction, it&rsquo;s a spoiler, but I already expected that. George loves his 3. Tyrion its one of the characters that will have a very tragic ending. He was the fool who brought Daenerys to Westeros believing he could control her, the same mistake his sister Cersei tried to do with Joffrey. He invited Jon Snow under false premises to Dragonstone without mentioning to Jon about Daenerys demands to bend the knee.</p><p>He made a deal with Cersei that was never disclosed to the audience and I believe he may be behind Sansa&rsquo;s kidnapping story in season 8. He keeps making one mistake after the other, always believing to be smarter than the people around him, always under estimating the players of the game.</p><p>But I don&rsquo;t believe he will die. In the House videos released for season 8, they had the Lannisters brothers, Jaime and Tyrion, saying goodbye to each other and I believe we will see them say good bye one last time. I think Tyrion will be sent into exile to Essos, and banned from returning to Westeros.</p><p><br /></p><h2>CERSEI WILL DIE;</h2><p>There has been a lot of foreshadowing about Cersei death and its one of the events many believe it happen for sure. The show made sure to write us a scene when her ending is predicted.</p><p><br /></p><blockquote><p>&ldquo;I will hurt you for this. A day will come when you think you&rsquo;re safe and happy and your joy will turn to ashes in your mouth. And you will know the debt is paid.&rdquo;</p><p>(Tyrion - SEASON 2 EPISODE 8)</p><p><br /></p></blockquote><p><br /></p><p>This episode was written by George RRMartin himself, so, I always assumed this was Cersei Lannister ending&hellip; Then in season 7, we had Jon Snow threatening to kill Littlefinger is he ever touched Sansa. In that scene we have Jon Snow choking Baelish with his cold hands and I believe this scene could be a foreshadow of Jon finally killing Cersei, for trying to hurt Sansa in season 8. The prophecy says that Cersei will be killed by the &ldquo;little brother&rdquo; and Jon Snow fits that role as the younger son of Rheagar Targaryen.</p><p>_______________________________________________________________</p><p><br /></p><h2>THEON WILL BE KING OF THE IRON ISLANDS;</h2><p>He lifted his head to look at her. &ldquo;Catelyn,&rdquo; he said. His voice was distant and formal. &ldquo;Where are the children?&rdquo;</p><p>A Game of Thrones - Catelyn I</p><p>I believe the children of Wintefell were always meant to be the heroes of this story. That&rsquo;s why George made sure to have a Greyjoy, a Targaryen be raised close to the Stark children. Those children now are gonna be the rulers of Westeros and they will be the ones passing Ned Stark legacy forward, building a new and better world.</p><p>Thast why I believe Theon will kill Euron Greyjoy and be the king of the Iron Islands; Theon probably has a bastard child with the captain&rsquo;s daughter he met in season 2 on his journey to Pike, he will recognize the child and raise them as his heir;</p><h2>A TIME FOR WOLVES;</h2><p><b><br /></b></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/e6eaee32c64120ed47c03b3bc7061f9d/tumblr_inline_pm5uvnO0W51sgp768_540.png\" class=\"\"/></figure><p><br /></p><p>It will be a Time for Wolves; a new period for Westeros. Jon will rule surrounded by Starks, carrying the Stark name with Sansa and Bran by his side; The capital will probably be transferred to HighGarden, not only the castle it is still intact but its also located in the most fertile area of Westeros. It seems like a very interesting political decision. Again, I found a lot of foreshadowing for this in the books.</p><p>Jon Snow will rule over a graveyard, as he predicted in season 7. But the ending will be very sweet, with kids playing around in gardens and celebrating. We will see Jon, the Stark kids, Jaime and Brienne, Sam and Guilly, Theon&hellip;.. ect all enjoying spring and celebrating their happy ending.</p><p><br /></p><p><br /></p><h2>THE VERY LAST SCENE OF THE STORY&hellip;..</h2><p><br /></p><p>Daniel Abraham is the man responsible for converting the Game of Thrones book into a comic, mentioned that there is a particular line of dialog in the game of thrones book, which is very important for the last scene of &ldquo;A Dream of Spring&rdquo;.</p><p>Have you collaborated at all with George R.R. Martin in the process of adapting the novel to comics? If so, what&rsquo;s the creative process there?</p><p>Daniel: &ldquo;I&rsquo;ve spoken to George a lot in the process. The biggest issues we have are continuity questions. There are things about this story that only he knows, and they aren&rsquo;t all obvious. There was one scene I had to rework because there&rsquo;s a particular line of dialog &ndash; and you wouldn&rsquo;t know it to look at &ndash; that&rsquo;s important in the last scene of &ldquo;A Dream of Spring.&rdquo;- Daniel Abraham</p><p>On episode 1, when King Robert goes to visit Winterfell, he and Ned go down in the crypts to pay their respects to Lyanna Stark, the wolf girl he lost to Rheagar Targeryen. In that scene, the dialogue is different from what we have in the books.</p><p><br /></p><blockquote><p>ROBERT: Did you have to bury her in a place like this? She should be on a hill somewhere with the sun and the clouds above her.</p><p>NED: She was my sister. This is where she belongs.</p><p><br /></p></blockquote><p>In the books, this conversation is different:</p><p><br /></p><p><br /></p><blockquote><p>\"Ah, damn it, Ned, did you have to bury her in a place like this?&rdquo; His voice was hoarse with remembered grief. &ldquo;She deserved more than darkness &hellip;&rdquo;</p><p>&ldquo;She was a Stark of Winterfell,&rdquo; Ned said quietly. &ldquo;This is her place.&rdquo;</p><p>A Game of Thrones - Eddard I</p><p><br /></p></blockquote><p>I think this is the scene. I believe we will end this story with King Jon visiting his late wife Sansa Stark in the crypts of Winterfell and someone will ask him why did he buried her there, why not building a monument for her, so that she could be on display and that&rsquo;s how he will reply:<br /></p><p><br /></p><blockquote><p>She was a Stark of Winterfell, this is where she belongs&hellip;.</p><p><br /></p></blockquote><p>What made me believe this, were two momments of the story: First of all, Lady&rsquo;s death. After Sansa direwolf is killed on her way to the south, Ned Stark makes sure to send a group of men back to the North and Winterfell, so that she can be buried in Northerner soil. Lady represented a little bit of Sansa, who died on that day and I dont think it was a silly detail George rrmartin make sure that her direwolf body was buried on Winterfell, I think that this scene, was much more important than most people think about it.</p><p><br /></p><blockquote><p>When it was over, he said, &ldquo;Choose four men and have them take the body north. <b>Bury her at Winterfell</b>.&rdquo;</p><p>&ldquo;All that way?&rdquo; Jory said, astonished.&ldquo;All that way,&rdquo; Ned affirmed. &ldquo;The Lannister woman shall never have this skin.&rdquo;</p><p>A Game of Thrones - Eddard III</p><p><br /></p></blockquote><p>Another momment in the story was Ygritte death. In both books and show, Jon Snow takes her body and goes to bury her up North, where she belonged.</p><p><br /></p><blockquote><p>Tormund: Did you love her? She loved you.</p><p>Jon: She told you?</p><p>Tormund: No. All she ever talked about was killing you. That&rsquo;s how I know. <b>She belongs in the North. The real North.</b> You understand me?</p><p><br /></p></blockquote><p><br /></p><p>Look at the excuse Tormund gives Jon to why Ygritte needs to be buried North of the Wall, its the same Ned Stark used to explain to King Robert why Lyanna had to be buried in the Crypts of Winterfell. Because thats where she belongs&hellip;&hellip;.</p><p>I also believe this ending could bring the story to a full circle, because there is also the theme of the audience never really thinking as Sansa as a TRUE STARK. There is still the notion that Sansa is not really a Stark like Jon or Arya.</p><p>Sansa Starkiness was always a topic of contention among fans of the books and series. Many like to refer to Sansa as Lady Lannister or Lady Bolton, so to have Sansa finally resting in the Winterfell crypts, by the end of this story, as a Stark, would be a very satisfying ending. Her hair maybe red and some of her manners may be more southern like, but Sansa IS A STARK.</p><p>And in fact, she is the Stark who took back the North and Winterfell, she is the Stark who made possible for the family to reunite and be safe; she is the Stark who stood by Jon side when he was made King in the North and supported his claim; she was the Stark who prepared the North for the wars and the winter and she will be the Stark who will rule the 7 Kingdoms together with her husband.</p><p>Both Jon and Sansa are foreshadowed to live very long lives and I expect their ruling period to last decades. They will be the ones restoring and rebuilding the kingdom after the wars of Ice and Fire. But I do believe Jon will live longer based on a quote from the books.</p><p><br /></p><blockquote><p>Tyrion shared around his skin of wine until even Yoren grew mellow. <b>One by one the company drifted off to their shelters and to sleep, all but Jon Snow, who had drawn the night&rsquo;s first watch.</b> Tyrion was the last to retire, as always. As he stepped into the shelter his men had built for him, he paused and looked back at Jon Snow. The boy stood near the fire, his face still and hard, looking deep into the flames. Tyrion Lannister smiled sadly and went to bed. -<br />AGOT Tyrion II</p></blockquote><p><br /></p><p>And because of this line, I believe Jon Snow ill be the last one to die, he will live a very long life and will be forced to see all the ones he loved pass away, one by one.</p><p><br /></p><p><br /></p><h2>THE END OF GAME OF THRONES&hellip;</h2></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "quote",
        "blog_name": "gendryaonline",
        "blog": {
            "name": "gendryaonline",
            "title": "a nice oak tree",
            "description": "a blog dedicated to arya stark and gendry from a song of ice and fire by george r.r. martin and hbo's game of thrones",
            "url": "https://gendryaonline.tumblr.com/",
            "uuid": "t:sXHFrIJvWXR_WDQPVxyctA",
            "updated": 1561752758
        },
        "id": 182430593251,
        "post_url": "https://gendryaonline.tumblr.com/post/182430593251/gendry-squinted-up-at-the-sun-evenfall-will-be",
        "slug": "gendry-squinted-up-at-the-sun-evenfall-will-be",
        "date": "2019-01-30 20:07:21 GMT",
        "timestamp": 1548878841,
        "state": "published",
        "format": "html",
        "reblog_key": "IZ1Cbnjj",
        "tags": [
            "arya stark",
            "gendry",
            "arya x gendry",
            "gendrya",
            "quote"
        ],
        "short_url": "https://tmblr.co/ZHGJQY2fvjV3Z",
        "summary": "Gendry squinted up at the sun. “Evenfall will be the best time to sneak in. I’ll go scout come dark.” \n“No, I’ll go,” Arya said....",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 84,
        "text": "Gendry squinted up at the sun. “Evenfall will be the best time to sneak in. I’ll go scout come dark.”<br/>\n“No, I’ll go,” Arya said. “You’re too noisy.”<br/>\nGendry got that look on his face. “We’ll both go.”[&hellip;]  &ldquo;Arry, let&rsquo;s go, I want to get near before the sun is down. Hot Pie, you keep Weasel here, I don&rsquo;t want her following.&rdquo;<br/>\n&ldquo;Last time she kicked me.&rdquo;<br/>\n&ldquo;I&rsquo;ll kick you if you don&rsquo;t keep her here.&rdquo; Without waiting for an answer, Gendry donned his steel helm and walked off.<br/>\nArya had to scamper to keep up. Gendry was five years older and a foot taller than she was, and long of leg as well. For a while he said nothing, just plowed on through the trees with an angry look on his face, making too much noise.",
        "source": "a Clash of Kings",
        "reblog": {
            "comment": "<p>a Clash of Kings</p>",
            "tree_html": ""
        },
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "arsenicandfinelace",
        "blog": {
            "name": "arsenicandfinelace",
            "title": "Arsenic and Fine Lace",
            "description": "Everything I say, I say from a place of sleep deprivation.",
            "url": "https://arsenicandfinelace.tumblr.com/",
            "uuid": "t:igalVvMUtuKoGmR9JoGp_A",
            "updated": 1561749669
        },
        "id": 182429923720,
        "post_url": "https://arsenicandfinelace.tumblr.com/post/182429923720/arya-and-i-know-now-im-never-going-to-be-queen",
        "slug": "arya-and-i-know-now-im-never-going-to-be-queen",
        "date": "2019-01-30 19:38:54 GMT",
        "timestamp": 1548877134,
        "state": "published",
        "format": "html",
        "reblog_key": "QQ3QzERq",
        "tags": [
            "got",
            "arya stark",
            "source: john mulaney"
        ],
        "short_url": "https://tmblr.co/Z1cQVm2fvgxc8",
        "summary": "Arya: And I know now I’m never going to be Queen. Not unless everyone gets real cool about a bunch of stuff really quickly.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 10,
        "title": null,
        "body": "<p><b>Arya:</b> And I know now I’m never going to be Queen. Not unless everyone gets real cool about a bunch of stuff really quickly.<br/></p>",
        "reblog": {
            "comment": "<p><b>Arya:</b> And I know now I’m never going to be Queen. Not unless everyone gets real cool about a bunch of stuff really quickly.<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "arsenicandfinelace",
                    "active": true,
                    "theme": {
                        "header_full_width": 1936,
                        "header_full_height": 1080,
                        "header_focus_width": 1919,
                        "header_focus_height": 1080,
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1927,1080,8",
                        "header_image": "https://static.tumblr.com/e420b42e12a207eed4aeff53d57362e1/4zfxp54/LuQp82vfd/tumblr_static_ap69q8t0lawcwgcc44og80c88.png",
                        "header_image_focused": "https://static.tumblr.com/e420b42e12a207eed4aeff53d57362e1/4zfxp54/n23p82vfh/tumblr_static_tumblr_static_ap69q8t0lawcwgcc44og80c88_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/e420b42e12a207eed4aeff53d57362e1/4zfxp54/LuQp82vfd/tumblr_static_ap69q8t0lawcwgcc44og80c88_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Avalon",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182429923720"
                },
                "content_raw": "<p><b>Arya:</b> And I know now I’m never going to be Queen. Not unless everyone gets real cool about a bunch of stuff really quickly.<br></p>",
                "content": "<p><b>Arya:</b> And I know now I&rsquo;m never going to be Queen. Not unless everyone gets real cool about a bunch of stuff really quickly.<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "danceyreagan",
        "blog": {
            "name": "danceyreagan",
            "title": "Im Goody Goody. You Just Do Your Thang Baby Smurf.",
            "description": "<p>Im a proud black woman. Brooklyn Nine-Nine, Peaky Blinders, Animal Kingdom, Game of Thrones and Queen Beyonce.</p><p>I write Isaiah Jesus</p><p>I do Headcanons. Inbox open.</p><p>Spoiler Free Zone! </p><p><a href=\"https://danceyreagan.tumblr.com/post/172251225294/masterlist\">MASTERLIST</a></p>",
            "url": "https://danceyreagan.tumblr.com/",
            "uuid": "t:lS7DD6OD1u1wI6_IxjBLUQ",
            "updated": 1561731283
        },
        "id": 182429275354,
        "post_url": "https://danceyreagan.tumblr.com/post/182429275354/pet-peeve",
        "slug": "pet-peeve",
        "date": "2019-01-30 19:10:01 GMT",
        "timestamp": 1548875401,
        "state": "published",
        "format": "html",
        "reblog_key": "VwIiazpl",
        "tags": [
            "arya stark",
            "game of thrones"
        ],
        "short_url": "https://tmblr.co/Z9cRQe2fveTJQ",
        "summary": "Pet Peeve!",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 8,
        "title": null,
        "body": "<h1>Pet Peeve! </h1><p>I dont understand why people portray Arya as having low self esteem in some fanfictions.  To me she exudes confidence. Maybe Im watching wrong. But I never read the books so I dont know. </p><p><br/></p><p>What do y’all think? </p>",
        "reblog": {
            "comment": "<p><h1>Pet Peeve! </h1><p>I dont understand why people portray Arya as having low self esteem in some fanfictions.  To me she exudes confidence. Maybe Im watching wrong. But I never read the books so I dont know. </p><p><br></p><p>What do y’all think? </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "danceyreagan",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 480,
                        "header_focus_width": 548,
                        "header_focus_height": 308,
                        "avatar_shape": "square",
                        "background_color": "#346B50",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "85,594,393,46",
                        "header_image": "https://static.tumblr.com/321349b553486da96ac05f753168faed/nsywmrq/2fTpcyp4t/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/321349b553486da96ac05f753168faed/nsywmrq/fyIpcyp4u/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/321349b553486da96ac05f753168faed/nsywmrq/2fTpcyp4t/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#234357",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#234357",
                        "title_font": "Quadrat",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182429275354"
                },
                "content_raw": "<p><h1>Pet Peeve! </h1><p>I dont understand why people portray Arya as having low self esteem in some fanfictions.  To me she exudes confidence. Maybe Im watching wrong. But I never read the books so I dont know. </p><p><br></p><p>What do y’all think? </p></p>",
                "content": "<p><h1>Pet Peeve! </h1><p>I dont understand why people portray Arya as having low self esteem in some fanfictions.  To me she exudes confidence. Maybe Im watching wrong. But I never read the books so I dont know. </p><p><br /></p><p>What do y&rsquo;all think? </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "fandom-geek17",
        "blog": {
            "name": "fandom-geek17",
            "title": "Fandom_geek17",
            "description": "Fandom-Geek17 on fanfiction.net Crazy, swedish fangirl obsessed with movies, TV-shows, books and the romance-genre! OTP: Gendrya!",
            "url": "https://fandom-geek17.tumblr.com/",
            "uuid": "t:r8l7b-cWa7HxX8mmY4E84w",
            "updated": 1560845941
        },
        "id": 182428985749,
        "post_url": "https://fandom-geek17.tumblr.com/post/182428985749/okay-so-can-someone-whos-good-at-editing-make-a",
        "slug": "okay-so-can-someone-whos-good-at-editing-make-a",
        "date": "2019-01-30 18:57:12 GMT",
        "timestamp": 1548874632,
        "state": "published",
        "format": "html",
        "reblog_key": "easncHHF",
        "tags": [
            "gendrya",
            "game of thrones",
            "gendry waters",
            "got",
            "arya stark",
            "a song of ice and fire",
            "arya x gendry",
            "asoiaf",
            "arya and gendry",
            "gendry and arya",
            "mariah hill",
            "one time"
        ],
        "short_url": "https://tmblr.co/ZmvaGm2fvdMcL",
        "summary": "Okay so can someone who’s good at editing make a modern au Gendrya vid with One Time by Mariah Hill?? Cuz that’s Gendrya mood af",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 63,
        "title": null,
        "body": "<h1>Okay so can someone who’s good at editing make a modern au Gendrya vid with One Time by Mariah Hill?? Cuz that’s Gendrya mood af</h1><figure class=\"tmblr-full\" data-orig-height=\"300\" data-orig-width=\"300\" data-tumblr-attribution=\"mrshaleyjames:T74cPKrS-KojAdiJoIvO3g:Z73Kfu1vPsCjq\"><img src=\"https://66.media.tumblr.com/3a3caec99e7cc9125c1b45169c4d8e9a/tumblr_nvm21wYIug1rcwgeco1_400.gif\" data-orig-height=\"300\" data-orig-width=\"300\"/></figure>",
        "reblog": {
            "comment": "<p><h1>Okay so can someone who’s good at editing make a modern au Gendrya vid with One Time by Mariah Hill?? Cuz that’s Gendrya mood af</h1><figure class=\"tmblr-full\" data-orig-height=\"300\" data-orig-width=\"300\" data-tumblr-attribution=\"mrshaleyjames:T74cPKrS-KojAdiJoIvO3g:Z73Kfu1vPsCjq\"><img src=\"https://66.media.tumblr.com/3a3caec99e7cc9125c1b45169c4d8e9a/tumblr_nvm21wYIug1rcwgeco1_400.gif\" data-orig-height=\"300\" data-orig-width=\"300\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fandom-geek17",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 851,
                        "header_focus_width": 1064,
                        "header_focus_height": 598,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "30,1180,628,116",
                        "header_image": "https://static.tumblr.com/35534d85bd0094402e92edaa1005d7f5/1ptzzxe/Pz8pqcpr2/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/ed0a83a5d3690cf41a8efc696f74dbed/1ptzzxe/NIRpqcpr4/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/35534d85bd0094402e92edaa1005d7f5/1ptzzxe/Pz8pqcpr2/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182428985749"
                },
                "content_raw": "<p><h1>Okay so can someone who’s good at editing make a modern au Gendrya vid with One Time by Mariah Hill?? Cuz that’s Gendrya mood af</h1><figure class=\"tmblr-full\" data-orig-height=\"300\" data-orig-width=\"300\" data-tumblr-attribution=\"mrshaleyjames:T74cPKrS-KojAdiJoIvO3g:Z73Kfu1vPsCjq\"><img src=\"https://66.media.tumblr.com/3a3caec99e7cc9125c1b45169c4d8e9a/tumblr_nvm21wYIug1rcwgeco1_400.gif\" data-orig-height=\"300\" data-orig-width=\"300\"></figure></p>",
                "content": "<p><h1>Okay so can someone who&rsquo;s good at editing make a modern au Gendrya vid with One Time by Mariah Hill?? Cuz that&rsquo;s Gendrya mood af</h1><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "ohemgee-world",
        "blog": {
            "name": "ohemgee-world",
            "title": "OhEmGee-World",
            "description": "A place of multiple fandom characters, places and universes from books, films, tv shows and stories... also other random stuff that catch my attention. Pringles xxx",
            "url": "https://ohemgee-world.tumblr.com/",
            "uuid": "t:uDSqCe8usN_ri7a-gGyD6A",
            "updated": 1561741240
        },
        "id": 182428622197,
        "post_url": "https://ohemgee-world.tumblr.com/post/182428622197/this-is-legit-what-a-jonsa-child-will-look-like",
        "slug": "this-is-legit-what-a-jonsa-child-will-look-like",
        "date": "2019-01-30 18:40:46 GMT",
        "timestamp": 1548873646,
        "state": "published",
        "format": "html",
        "reblog_key": "9oEmY3b6",
        "tags": [
            "got",
            "game of thrones",
            "sansa stark",
            "jon snow",
            "arya stark",
            "jonsa",
            "jon x sansa",
            "merida",
            "disney",
            "starks",
            "*"
        ],
        "short_url": "https://tmblr.co/Zp2xuX2fvbzrr",
        "summary": "This is legit what a Jonsa child will look like...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 510,
        "title": "This is legit what a Jonsa child will look like...",
        "body": "<figure data-orig-width=\"245\" data-orig-height=\"245\"><img src=\"https://66.media.tumblr.com/9fc7ce9d42b7f2aef360c1abf1b029ed/tumblr_inline_plvwi89dsx1wtu1cj_540.gif\" alt=\"image\" data-orig-width=\"245\" data-orig-height=\"245\"/></figure><p><b>Sansa’s red hair and blue eyes&hellip;</b><br/></p><figure data-orig-width=\"268\" data-orig-height=\"268\"><img src=\"https://66.media.tumblr.com/33c1ddd638cc6983c5fd1dcb3e339c80/tumblr_inline_pm5pszjcLv1wtu1cj_540.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"268\"/></figure><p><b>Jon’s curls and snarkiness&hellip;</b></p><figure data-orig-width=\"292\" data-orig-height=\"225\"><img src=\"https://66.media.tumblr.com/37a92e9e6f49e27d3a4eb898628ffd90/tumblr_inline_pm5q2cseuD1wtu1cj_540.gif\" alt=\"image\" data-orig-width=\"292\" data-orig-height=\"225\"/></figure><p><b>Arya’s fighting skills&hellip;</b></p><figure data-orig-width=\"400\" data-orig-height=\"224\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/1e6c6df287dcc5b3009847002f2fb17b/tumblr_inline_pm5qh1g0AQ1wtu1cj_540.gif\" alt=\"image\" data-orig-width=\"400\" data-orig-height=\"224\"/></figure>",
        "reblog": {
            "comment": "<p><figure data-orig-width=\"245\" data-orig-height=\"245\"><img src=\"https://66.media.tumblr.com/9fc7ce9d42b7f2aef360c1abf1b029ed/tumblr_inline_plvwi89dsx1wtu1cj_540.gif\" alt=\"image\" data-orig-width=\"245\" data-orig-height=\"245\"></figure><p><b>Sansa’s red hair and blue eyes…</b><br></p><figure data-orig-width=\"268\" data-orig-height=\"268\"><img src=\"https://66.media.tumblr.com/33c1ddd638cc6983c5fd1dcb3e339c80/tumblr_inline_pm5pszjcLv1wtu1cj_540.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"268\"></figure><p><b>Jon’s curls and snarkiness…</b></p><figure data-orig-width=\"292\" data-orig-height=\"225\"><img src=\"https://66.media.tumblr.com/37a92e9e6f49e27d3a4eb898628ffd90/tumblr_inline_pm5q2cseuD1wtu1cj_540.gif\" alt=\"image\" data-orig-width=\"292\" data-orig-height=\"225\"></figure><p><b>Arya’s fighting skills…</b></p><figure data-orig-width=\"400\" data-orig-height=\"224\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/1e6c6df287dcc5b3009847002f2fb17b/tumblr_inline_pm5qh1g0AQ1wtu1cj_540.gif\" alt=\"image\" data-orig-width=\"400\" data-orig-height=\"224\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ohemgee-world",
                    "active": true,
                    "theme": {
                        "header_full_width": 400,
                        "header_full_height": 268,
                        "header_focus_width": 400,
                        "header_focus_height": 225,
                        "avatar_shape": "square",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "21,400,246,0",
                        "header_image": "https://static.tumblr.com/8e697e06b5fe871a0291a3c22426213d/nwaxyxx/O8Bplg8h8/tumblr_static_8y6dbj40lv0o0kkcw0gssws0o.gif",
                        "header_image_focused": "https://static.tumblr.com/8e697e06b5fe871a0291a3c22426213d/nwaxyxx/R9Fplg8h9/tumblr_static_tumblr_static_8y6dbj40lv0o0kkcw0gssws0o_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/8e697e06b5fe871a0291a3c22426213d/nwaxyxx/O8Bplg8h8/tumblr_static_8y6dbj40lv0o0kkcw0gssws0o_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#d36a89",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182428622197"
                },
                "content_raw": "<p><figure data-orig-width=\"245\" data-orig-height=\"245\"><img src=\"https://66.media.tumblr.com/9fc7ce9d42b7f2aef360c1abf1b029ed/tumblr_inline_plvwi89dsx1wtu1cj_540.gif\" alt=\"image\" data-orig-width=\"245\" data-orig-height=\"245\"></figure><p><b>Sansa’s red hair and blue eyes…</b><br></p><figure data-orig-width=\"268\" data-orig-height=\"268\"><img src=\"https://66.media.tumblr.com/33c1ddd638cc6983c5fd1dcb3e339c80/tumblr_inline_pm5pszjcLv1wtu1cj_540.gif\" alt=\"image\" data-orig-width=\"268\" data-orig-height=\"268\"></figure><p><b>Jon’s curls and snarkiness…</b></p><figure data-orig-width=\"292\" data-orig-height=\"225\"><img src=\"https://66.media.tumblr.com/37a92e9e6f49e27d3a4eb898628ffd90/tumblr_inline_pm5q2cseuD1wtu1cj_540.gif\" alt=\"image\" data-orig-width=\"292\" data-orig-height=\"225\"></figure><p><b>Arya’s fighting skills…</b></p><figure data-orig-width=\"400\" data-orig-height=\"224\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/1e6c6df287dcc5b3009847002f2fb17b/tumblr_inline_pm5qh1g0AQ1wtu1cj_540.gif\" alt=\"image\" data-orig-width=\"400\" data-orig-height=\"224\"></figure></p>",
                "content": "<p><figure><img src=\"https://66.media.tumblr.com/9fc7ce9d42b7f2aef360c1abf1b029ed/tumblr_inline_plvwi89dsx1wtu1cj_540.gif\" class=\"\"/></figure><p><b>Sansa&rsquo;s red hair and blue eyes&hellip;</b><br /></p><figure><img src=\"https://66.media.tumblr.com/33c1ddd638cc6983c5fd1dcb3e339c80/tumblr_inline_pm5pszjcLv1wtu1cj_540.gif\" class=\"\"/></figure><p><b>Jon&rsquo;s curls and snarkiness&hellip;</b></p><figure><img src=\"https://66.media.tumblr.com/37a92e9e6f49e27d3a4eb898628ffd90/tumblr_inline_pm5q2cseuD1wtu1cj_540.gif\" class=\"\"/></figure><p><b>Arya&rsquo;s fighting skills&hellip;</b></p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/1e6c6df287dcc5b3009847002f2fb17b/tumblr_inline_pm5qh1g0AQ1wtu1cj_540.gif\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "piccolafangirl",
        "blog": {
            "name": "piccolafangirl",
            "title": "De Medici⚜",
            "description": "\"When the snows fall and the white winds blow, the lone wolf dies, but the pack survives\" 🐺",
            "url": "https://piccolafangirl.tumblr.com/",
            "uuid": "t:4MJ6-IOXpbq02HYiejLBbA",
            "updated": 1560814269
        },
        "id": 182428273646,
        "post_url": "https://piccolafangirl.tumblr.com/post/182428273646",
        "slug": "",
        "date": "2019-01-30 18:25:06 GMT",
        "timestamp": 1548872706,
        "state": "published",
        "format": "html",
        "reblog_key": "7JyY3R6J",
        "tags": [
            "maisie williams",
            "sophie turner",
            "game of thrones",
            "got",
            "arya stark",
            "sansa stark",
            "mophie"
        ],
        "short_url": "https://tmblr.co/ZnCJlh2fvaelk",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 47,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1080\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/e57e54be7a2dc0750780242214de8e10/tumblr_pm5pttkdYk1u3nhiy_540.jpg\" data-orig-height=\"1080\" data-orig-width=\"1080\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1350\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/e1759d2a9f000f92dd25b42495fc4b4e/tumblr_pm5ptu45tK1u3nhiy_540.jpg\" data-orig-height=\"1350\" data-orig-width=\"1080\"/></figure></div>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1080\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/e57e54be7a2dc0750780242214de8e10/tumblr_pm5pttkdYk1u3nhiy_540.jpg\" data-orig-height=\"1080\" data-orig-width=\"1080\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1350\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/e1759d2a9f000f92dd25b42495fc4b4e/tumblr_pm5ptu45tK1u3nhiy_540.jpg\" data-orig-height=\"1350\" data-orig-width=\"1080\"></figure></div></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "piccolafangirl",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 720,
                        "header_focus_width": 982,
                        "header_focus_height": 552,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "64,1280,616,298",
                        "header_image": "https://static.tumblr.com/c0b5ffaa77ed018a0e44de3a176b8297/i6u3kyn/AgQphmual/tumblr_static_1112807129-content.png",
                        "header_image_focused": "https://static.tumblr.com/c0b5ffaa77ed018a0e44de3a176b8297/i6u3kyn/ePKphmuao/tumblr_static_tumblr_static_1112807129-content_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/c0b5ffaa77ed018a0e44de3a176b8297/i6u3kyn/AgQphmual/tumblr_static_1112807129-content_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#E8A395",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#EEBAAF",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182428273646"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1080\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/e57e54be7a2dc0750780242214de8e10/tumblr_pm5pttkdYk1u3nhiy_540.jpg\" data-orig-height=\"1080\" data-orig-width=\"1080\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1350\" data-orig-width=\"1080\"><img src=\"https://66.media.tumblr.com/e1759d2a9f000f92dd25b42495fc4b4e/tumblr_pm5ptu45tK1u3nhiy_540.jpg\" data-orig-height=\"1350\" data-orig-width=\"1080\"></figure></div></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/e57e54be7a2dc0750780242214de8e10/tumblr_pm5pttkdYk1u3nhiy_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/e1759d2a9f000f92dd25b42495fc4b4e/tumblr_pm5ptu45tK1u3nhiy_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "mayaofatlantis",
        "blog": {
            "name": "mayaofatlantis",
            "title": "This Woman Has A Name",
            "description": "XXVII | Black American | Christian | Period Drama | History | Marvel & DC | Fantasy & Sci-Fi | Etc",
            "url": "https://mayaofatlantis.tumblr.com/",
            "uuid": "t:nofqvVNyk7rTqxR1-FR0pA",
            "updated": 1561745614
        },
        "id": 182427247334,
        "post_url": "https://mayaofatlantis.tumblr.com/post/182427247334/dany-vs-sansa",
        "slug": "dany-vs-sansa",
        "date": "2019-01-30 17:38:31 GMT",
        "timestamp": 1548869911,
        "state": "published",
        "format": "html",
        "reblog_key": "ADdmtkKE",
        "tags": [
            "game of thrones",
            "daenerys targaryen",
            "sansa stark",
            "arya stark",
            "fantasy",
            "mine"
        ],
        "short_url": "https://tmblr.co/ZPC9vf2fvWkBc",
        "summary": "Dany vs Sansa",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 27,
        "title": "Dany vs Sansa",
        "body": "<p><b>Women can be against one another.</b></p><p>Women can be against one another for a variety of reasons. Women can have issues with other women due to jealousy, pettiness, power tripping/power seeking behavior, bigotry (racism, internalized sexism, etc), personal issues, bad history between them, etc.</p><p>However, randomly pitting women against one another for no reason (meaning not addressing the issues behind it or willing to call it out for what it is) is another matter entirely.</p><p>As of now in Game of Thrones, I see Sansa being wary of Dany at the beginning, for obvious reasons such as Targaryen history and the obvious fact that Sansa doesn’t know Dany.  This is entirely different, from Sansa apparently seeking Dany’s downfall without just cause (or Arya, because I have seen some wild dumb theories about Arya killing Dany) or seeking to kill her.</p><p>Some of you are so wildly hypocritical and sexist it isn’t even funny. Now if Sansa was a man, and was hating Dany out the bat without just cause (different from being wary) and seeking her downfall, y'all would be willing to call a spade a spade and say, well, that’s because he is jealous, petty, insecure, and most likely a sexist that has issues with a woman in power. Now Sansa, for all intents doesn’t seem to have an issue with women in power, but how can any of you deny that if she actually was hateful towards Dany and wanting her downfall that she wouldn’t be petty, jealous, etc? You want to have your cake and eat it as well. Most of you who think this way, think of Sansa as an intelligent, kind woman, who wants to win people’s hearts through love and not fear and yet apparently you want her to seek the downfall of a woman she knows next to nothing about because&hellip;..what? But then again, if Dany was acting that way, she would be derided as trash, power hungry, a bitch, etc. So which is it?</p><p>That all aside, again, I think Sansa will be wary of Dany in the beginning (like Jon was) but that she’ll come around and they’ll be allies at the least in the war against the wights and the Night King. And I see the same thing with Arya. The theories about Arya killing Daenerys are utterly laughable and a disservice to Arya’s character. </p>",
        "reblog": {
            "comment": "<p><b>Women can be against one another.</b></p><p>Women can be against one another for a variety of reasons. Women can have issues with other women due to jealousy, pettiness, power tripping/power seeking behavior, bigotry (racism, internalized sexism, etc), personal issues, bad history between them, etc.</p><p>However, randomly pitting women against one another for no reason (meaning not addressing the issues behind it or willing to call it out for what it is) is another matter entirely.</p><p>As of now in Game of Thrones, I see Sansa being wary of Dany at the beginning, for obvious reasons such as Targaryen history and the obvious fact that Sansa doesn’t know Dany.  This is entirely different, from Sansa apparently seeking Dany’s downfall without just cause (or Arya, because I have seen some wild dumb theories about Arya killing Dany) or seeking to kill her.</p><p>Some of you are so wildly hypocritical and sexist it isn’t even funny. Now if Sansa was a man, and was hating Dany out the bat without just cause (different from being wary) and seeking her downfall, y'all would be willing to call a spade a spade and say, well, that’s because he is jealous, petty, insecure, and most likely a sexist that has issues with a woman in power. Now Sansa, for all intents doesn’t seem to have an issue with women in power, but how can any of you deny that if she actually was hateful towards Dany and wanting her downfall that she wouldn’t be petty, jealous, etc? You want to have your cake and eat it as well. Most of you who think this way, think of Sansa as an intelligent, kind woman, who wants to win people’s hearts through love and not fear and yet apparently you want her to seek the downfall of a woman she knows next to nothing about because…..what? But then again, if Dany was acting that way, she would be derided as trash, power hungry, a bitch, etc. So which is it?</p><p>That all aside, again, I think Sansa will be wary of Dany in the beginning (like Jon was) but that she’ll come around and they’ll be allies at the least in the war against the wights and the Night King. And I see the same thing with Arya. The theories about Arya killing Daenerys are utterly laughable and a disservice to Arya’s character. </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "mayaofatlantis",
                    "active": true,
                    "theme": {
                        "header_full_width": 816,
                        "header_full_height": 428,
                        "header_focus_width": 761,
                        "header_focus_height": 428,
                        "avatar_shape": "circle",
                        "background_color": "#11261c",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,788,428,27",
                        "header_image": "https://static.tumblr.com/8b19c045f9e5f2c94356d16a8f5cdfef/y5uaopt/aOjpjh5fb/tumblr_static_9ysy6eko7m88sc0w0c4ggos4k.jpg",
                        "header_image_focused": "https://static.tumblr.com/3d96d0077fd63ae22b6edd7bbf94dade/y5uaopt/Bpwpr5vmu/tumblr_static_tumblr_static_9ysy6eko7m88sc0w0c4ggos4k_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_08_focused_v3.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_stretch": true,
                        "link_color": "#213f52",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Garamond Classic FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182427247334"
                },
                "content_raw": "<p><b>Women can be against one another.</b></p><p>Women can be against one another for a variety of reasons. Women can have issues with other women due to jealousy, pettiness, power tripping/power seeking behavior, bigotry (racism, internalized sexism, etc), personal issues, bad history between them, etc.</p><p>However, randomly pitting women against one another for no reason (meaning not addressing the issues behind it or willing to call it out for what it is) is another matter entirely.</p><p>As of now in Game of Thrones, I see Sansa being wary of Dany at the beginning, for obvious reasons such as Targaryen history and the obvious fact that Sansa doesn’t know Dany.  This is entirely different, from Sansa apparently seeking Dany’s downfall without just cause (or Arya, because I have seen some wild dumb theories about Arya killing Dany) or seeking to kill her.</p><p>Some of you are so wildly hypocritical and sexist it isn’t even funny. Now if Sansa was a man, and was hating Dany out the bat without just cause (different from being wary) and seeking her downfall, y'all would be willing to call a spade a spade and say, well, that’s because he is jealous, petty, insecure, and most likely a sexist that has issues with a woman in power. Now Sansa, for all intents doesn’t seem to have an issue with women in power, but how can any of you deny that if she actually was hateful towards Dany and wanting her downfall that she wouldn’t be petty, jealous, etc? You want to have your cake and eat it as well. Most of you who think this way, think of Sansa as an intelligent, kind woman, who wants to win people’s hearts through love and not fear and yet apparently you want her to seek the downfall of a woman she knows next to nothing about because…..what? But then again, if Dany was acting that way, she would be derided as trash, power hungry, a bitch, etc. So which is it?</p><p>That all aside, again, I think Sansa will be wary of Dany in the beginning (like Jon was) but that she’ll come around and they’ll be allies at the least in the war against the wights and the Night King. And I see the same thing with Arya. The theories about Arya killing Daenerys are utterly laughable and a disservice to Arya’s character. </p>",
                "content": "<p><b>Women can be against one another.</b></p><p>Women can be against one another for a variety of reasons. Women can have issues with other women due to jealousy, pettiness, power tripping/power seeking behavior, bigotry (racism, internalized sexism, etc), personal issues, bad history between them, etc.</p><p>However, randomly pitting women against one another for no reason (meaning not addressing the issues behind it or willing to call it out for what it is) is another matter entirely.</p><p>As of now in Game of Thrones, I see Sansa being wary of Dany at the beginning, for obvious reasons such as Targaryen history and the obvious fact that Sansa doesn&rsquo;t know Dany.&nbsp;&nbsp;This is entirely different, from Sansa apparently seeking Dany&rsquo;s downfall without just cause (or Arya, because I have seen some wild dumb theories about Arya killing Dany) or seeking to kill her.</p><p>Some of you are so wildly hypocritical and sexist it isn&rsquo;t even funny. Now if Sansa was a man, and was hating Dany out the bat without just cause (different from being wary) and seeking her downfall, y'all would be willing to call a spade a spade and say, well, that&rsquo;s because he is jealous, petty, insecure, and most likely a sexist that has issues with a woman in power. Now Sansa, for all intents doesn&rsquo;t seem to have an issue with women in power, but how can any of you deny that if she actually was hateful towards Dany and wanting her downfall that she wouldn&rsquo;t be petty, jealous, etc? You want to have your cake and eat it as well. Most of you who think this way, think of Sansa as an intelligent, kind woman, who wants to win people&rsquo;s hearts through love and not fear and yet apparently you want her to seek the downfall of a woman she knows next to nothing about because&hellip;..what? But then again, if Dany was acting that way, she would be derided as trash, power hungry, a bitch, etc. So which is it?</p><p>That all aside, again, I think Sansa will be wary of Dany in the beginning (like Jon was) but that she&rsquo;ll come around and they&rsquo;ll be allies at the least in the war against the wights and the Night King. And I see the same thing with Arya. The theories about Arya killing Daenerys are utterly laughable and a disservice to Arya&rsquo;s character.&nbsp;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "asongofstarkandtargaryen",
        "blog": {
            "name": "asongofstarkandtargaryen",
            "title": "Dracarys!",
            "description": "Jon/Dany/Bran/Arya Stan. Salty about the got ending. Also likes: The 100,  Star Wars, Stranger Things.",
            "url": "https://asongofstarkandtargaryen.tumblr.com/",
            "uuid": "t:MQLEPrBfaW57QFv6zpyqYg",
            "updated": 1561668350
        },
        "id": 182424064229,
        "post_url": "https://asongofstarkandtargaryen.tumblr.com/post/182424064229/some-days-i-feel-like-appreciating-the-bond",
        "slug": "some-days-i-feel-like-appreciating-the-bond",
        "date": "2019-01-30 14:48:47 GMT",
        "timestamp": 1548859727,
        "state": "published",
        "format": "html",
        "reblog_key": "dXBRT5Pt",
        "tags": [
            "I'd love if Martin had given us a positive relationship between sisters",
            "but I can't pretend that Sansa and Arya is one",
            "sansa and arya",
            "house stark",
            "arya stark"
        ],
        "short_url": "https://tmblr.co/ZYQPae2fvKb3b",
        "summary": "Some days I feel like appreciating the bond between Arya and Sansa but then I remember this quote exists: \n\n\"I'm not like Arya,\"...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 31,
        "title": null,
        "body": "<p>Some days I feel like appreciating the bond between Arya and Sansa but then I remember this quote exists:</p><blockquote><p>\n\n&ldquo;I&rsquo;m not like Arya,&rdquo; Sansa blurted. &ldquo;She has the traitor&rsquo;s blood, not me. I&rsquo;m good, ask Septa Mordane, she&rsquo;ll tell you, I only want to be Joffrey&rsquo;s loyal and loving wife.&rdquo;\n\n<br/></p></blockquote>",
        "reblog": {
            "comment": "<p><p>Some days I feel like appreciating the bond between Arya and Sansa but then I remember this quote exists:</p><blockquote><p>\n\n“I’m not like Arya,” Sansa blurted. “She has the traitor’s blood, not me. I’m good, ask Septa Mordane, she’ll tell you, I only want to be Joffrey’s loyal and loving wife.”\n\n<br></p></blockquote></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "asongofstarkandtargaryen",
                    "active": true,
                    "theme": {
                        "header_full_width": 3733,
                        "header_full_height": 2100,
                        "header_focus_width": 2048,
                        "header_focus_height": 1151,
                        "avatar_shape": "circle",
                        "background_color": "#4D7067",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,3733,2099,0",
                        "header_image": "https://static.tumblr.com/f58918c2f25d80e89164372631e3619f/dsaln5x/dAXpr4llt/tumblr_static_e7l949alh68sg4owow484osw0.jpg",
                        "header_image_focused": "https://static.tumblr.com/c6762f3a09d3cd190c7423978fce1be7/dsaln5x/2sfpr4llw/tumblr_static_tumblr_static_e7l949alh68sg4owow484osw0_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f58918c2f25d80e89164372631e3619f/dsaln5x/dAXpr4llt/tumblr_static_e7l949alh68sg4owow484osw0_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182424064229"
                },
                "content_raw": "<p><p>Some days I feel like appreciating the bond between Arya and Sansa but then I remember this quote exists:</p><blockquote><p>\n\n“I’m not like Arya,” Sansa blurted. “She has the traitor’s blood, not me. I’m good, ask Septa Mordane, she’ll tell you, I only want to be Joffrey’s loyal and loving wife.”\n\n<br></p></blockquote></p>",
                "content": "<p><p>Some days I feel like appreciating the bond between Arya and Sansa but then I remember this quote exists:</p><blockquote><p>\n\n&ldquo;I&rsquo;m not like Arya,&rdquo; Sansa blurted. &ldquo;She has the traitor&rsquo;s blood, not me. I&rsquo;m good, ask Septa Mordane, she&rsquo;ll tell you, I only want to be Joffrey&rsquo;s loyal and loving wife.&rdquo;\n\n<br /></p></blockquote></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "margaerytyrels",
        "blog": {
            "name": "margaerytyrels",
            "title": "was cassandrarailly",
            "description": "Katie. Twenty-one. Ravenclaw. INFJ. bi(tter). Main Blog of thefibrodiaries. raven reyes and bellamy blake enthusiast. sansa stark and beth greene protection squad. previous urls; linseymorgan &amp; hilkersnadia",
            "url": "https://margaerytyrels.tumblr.com/",
            "uuid": "t:OmI1km5KFoFtmHySaC0ohw",
            "updated": 1561750829
        },
        "id": 182424038808,
        "post_url": "https://margaerytyrels.tumblr.com/post/182424038808/one-time-someone-compared-octvia-blake-to-arya",
        "slug": "one-time-someone-compared-octvia-blake-to-arya",
        "date": "2019-01-30 14:47:01 GMT",
        "timestamp": 1548859621,
        "state": "published",
        "format": "html",
        "reblog_key": "1b4lFP74",
        "tags": [
            "I just remembered this and it all came flooding back please send help",
            "anti octavia",
            "arya stark",
            "game of thrones"
        ],
        "short_url": "https://tmblr.co/ZZqa_n2fvKUsO",
        "summary": "one time someone compared oct*via blake to arya stark and im still upset ",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 14,
        "title": null,
        "body": "<p>one time someone compared oct*via blake to arya stark and im still upset </p>",
        "reblog": {
            "comment": "<p>one time someone compared oct*via blake to arya stark and im still upset </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "margaerytyrels",
                    "active": true,
                    "theme": {
                        "header_full_width": 719,
                        "header_full_height": 1280,
                        "header_focus_width": 615,
                        "header_focus_height": 346,
                        "avatar_shape": "circle",
                        "background_color": "#f0e7eb",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "438,670,784,55",
                        "header_image": "https://static.tumblr.com/9933a877562ba34ae84be2e609c086eb/ngsnt5h/8apoo79dn/tumblr_static_.png",
                        "header_image_focused": "https://static.tumblr.com/9933a877562ba34ae84be2e609c086eb/ngsnt5h/hS8plfwen/tumblr_static_tumblr_static__focused_v3.png",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_02_focused_v3.png?_v=b976ee00195b1b7806c94ae285ca46a7",
                        "header_stretch": true,
                        "link_color": "#666666",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "FangSong",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182424038808"
                },
                "content_raw": "<p>one time someone compared oct*via blake to arya stark and im still upset </p>",
                "content": "<p>one time someone compared oct*via blake to arya stark and im still upset&nbsp;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "asongofstarkandtargaryen",
        "blog": {
            "name": "asongofstarkandtargaryen",
            "title": "Dracarys!",
            "description": "Jon/Dany/Bran/Arya Stan. Salty about the got ending. Also likes: The 100,  Star Wars, Stranger Things.",
            "url": "https://asongofstarkandtargaryen.tumblr.com/",
            "uuid": "t:MQLEPrBfaW57QFv6zpyqYg",
            "updated": 1561668350
        },
        "id": 182423697694,
        "post_url": "https://asongofstarkandtargaryen.tumblr.com/post/182423697694/my-favourite-arya-moments-are-all-from-the-book",
        "slug": "my-favourite-arya-moments-are-all-from-the-book",
        "date": "2019-01-30 14:26:22 GMT",
        "timestamp": 1548858382,
        "state": "published",
        "format": "html",
        "reblog_key": "y9gfDQ4e",
        "tags": [
            "remember how tiny was Arya back in s1?",
            "arya stark",
            "got",
            "house stark"
        ],
        "short_url": "https://tmblr.co/ZYQPae2fvJBaU",
        "summary": "My favourite Arya moments are all from the book canon. However, the way little Arya acted on the first episode of the tv show...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 20,
        "title": null,
        "body": "<p>My favourite Arya moments are all from the book canon. However, the way little Arya acted on the first episode of the tv show also has a special place in my heart. It was really funny to see Arya arriving late to the reception of the royal party while wearing a helmet so she wouldn’t be recognized. And it was adorable when she beated Bran in archery and then bowed being sassy- followed by my favourite Arya&amp;Bran moment of them running around, chasing each other.</p>",
        "reblog": {
            "comment": "<p>My favourite Arya moments are all from the book canon. However, the way little Arya acted on the first episode of the tv show also has a special place in my heart. It was really funny to see Arya arriving late to the reception of the royal party while wearing a helmet so she wouldn’t be recognized. And it was adorable when she beated Bran in archery and then bowed being sassy- followed by my favourite Arya&amp;Bran moment of them running around, chasing each other.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "asongofstarkandtargaryen",
                    "active": true,
                    "theme": {
                        "header_full_width": 3733,
                        "header_full_height": 2100,
                        "header_focus_width": 2048,
                        "header_focus_height": 1151,
                        "avatar_shape": "circle",
                        "background_color": "#4D7067",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,3733,2099,0",
                        "header_image": "https://static.tumblr.com/f58918c2f25d80e89164372631e3619f/dsaln5x/dAXpr4llt/tumblr_static_e7l949alh68sg4owow484osw0.jpg",
                        "header_image_focused": "https://static.tumblr.com/c6762f3a09d3cd190c7423978fce1be7/dsaln5x/2sfpr4llw/tumblr_static_tumblr_static_e7l949alh68sg4owow484osw0_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f58918c2f25d80e89164372631e3619f/dsaln5x/dAXpr4llt/tumblr_static_e7l949alh68sg4owow484osw0_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182423697694"
                },
                "content_raw": "<p>My favourite Arya moments are all from the book canon. However, the way little Arya acted on the first episode of the tv show also has a special place in my heart. It was really funny to see Arya arriving late to the reception of the royal party while wearing a helmet so she wouldn’t be recognized. And it was adorable when she beated Bran in archery and then bowed being sassy- followed by my favourite Arya&amp;Bran moment of them running around, chasing each other.</p>",
                "content": "<p>My favourite Arya moments are all from the book canon. However, the way little Arya acted on the first episode of the tv show also has a special place in my heart. It was really funny to see Arya arriving late to the reception of the royal party while wearing a helmet so she wouldn&rsquo;t be recognized. And it was adorable when she beated Bran in archery and then bowed being sassy- followed by my favourite Arya&amp;Bran moment of them running around, chasing each other.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "chat",
        "blog_name": "aryafaceless",
        "blog": {
            "name": "aryafaceless",
            "title": "Arya x Jaqen",
            "description": "",
            "url": "https://aryafaceless.tumblr.com/",
            "uuid": "t:mRDwiLunebc56UkZUe61jA",
            "updated": 1561730437
        },
        "id": 182423284617,
        "post_url": "https://aryafaceless.tumblr.com/post/182423284617/gendry-you-are-obsessed-with-jaqen-hghar-arya",
        "slug": "gendry-you-are-obsessed-with-jaqen-hghar-arya",
        "date": "2019-01-30 14:00:40 GMT",
        "timestamp": 1548856840,
        "state": "published",
        "format": "html",
        "reblog_key": "b4JQyNpF",
        "tags": [
            "arya x jaqen",
            "arya stark",
            "jaqen h'ghar",
            "gendry waters",
            "hot pie",
            "harrenhal",
            "got incorrect quotes",
            "source: hannibal"
        ],
        "short_url": "https://tmblr.co/ZgpuGe2fvHck9",
        "summary": "Gendry: You are obsessed with Jaqen H'ghar.\nArya:  I am intrigued.\nHot Pie:  Obsessively.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 33,
        "title": null,
        "body": "Gendry: You are obsessed with Jaqen H'ghar.\nArya:  I am intrigued.\nHot Pie:  Obsessively.",
        "dialogue": [
            {
                "name": "Gendry",
                "label": "Gendry:",
                "phrase": "You are obsessed with Jaqen H'ghar."
            },
            {
                "name": "Arya",
                "label": "Arya:",
                "phrase": "I am intrigued."
            },
            {
                "name": "Hot Pie",
                "label": "Hot Pie:",
                "phrase": "Obsessively."
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "dothrakidaenerys",
        "blog": {
            "name": "dothrakidaenerys",
            "title": "fire and blood",
            "description": "",
            "url": "https://dothrakidaenerys.tumblr.com/",
            "uuid": "t:LmGBRAQ8W6NQcjajjHuAfQ",
            "updated": 1561726826
        },
        "id": 182423279574,
        "post_url": "https://dothrakidaenerys.tumblr.com/post/182423279574",
        "slug": "",
        "date": "2019-01-30 14:00:35 GMT",
        "timestamp": 1548856835,
        "state": "published",
        "format": "html",
        "reblog_key": "krf3R7wl",
        "tags": [
            "jaqen h'ghar",
            "arya stark",
            "masie williams",
            "tom wlaschiha",
            "game of thrones",
            "game of thrones gifs",
            "got gifs",
            "got season 5"
        ],
        "short_url": "https://tmblr.co/ZU2bKk2fvHbVM",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 62,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "photoset_layout": "111",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/b2958909e6df03181bb50caa7fb87066/tumblr_pai8bo3pIf1uxb9ydo3_540.gif",
                    "width": 525,
                    "height": 243
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/b2958909e6df03181bb50caa7fb87066/tumblr_pai8bo3pIf1uxb9ydo3_540.gif",
                        "width": 525,
                        "height": 243
                    },
                    {
                        "url": "https://66.media.tumblr.com/b2958909e6df03181bb50caa7fb87066/tumblr_pai8bo3pIf1uxb9ydo3_500.gif",
                        "width": 500,
                        "height": 231
                    },
                    {
                        "url": "https://66.media.tumblr.com/b2958909e6df03181bb50caa7fb87066/tumblr_pai8bo3pIf1uxb9ydo3_400.gif",
                        "width": 400,
                        "height": 185
                    },
                    {
                        "url": "https://66.media.tumblr.com/b2958909e6df03181bb50caa7fb87066/tumblr_pai8bo3pIf1uxb9ydo3_250.gif",
                        "width": 250,
                        "height": 116
                    },
                    {
                        "url": "https://66.media.tumblr.com/b2958909e6df03181bb50caa7fb87066/tumblr_pai8bo3pIf1uxb9ydo3_100.gif",
                        "width": 100,
                        "height": 46
                    },
                    {
                        "url": "https://66.media.tumblr.com/b2958909e6df03181bb50caa7fb87066/tumblr_pai8bo3pIf1uxb9ydo3_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/d2063bdc01aa708855ef2296268fac47/tumblr_pai8bo3pIf1uxb9ydo1_540.gif",
                    "width": 525,
                    "height": 243
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/d2063bdc01aa708855ef2296268fac47/tumblr_pai8bo3pIf1uxb9ydo1_540.gif",
                        "width": 525,
                        "height": 243
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2063bdc01aa708855ef2296268fac47/tumblr_pai8bo3pIf1uxb9ydo1_500.gif",
                        "width": 500,
                        "height": 231
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2063bdc01aa708855ef2296268fac47/tumblr_pai8bo3pIf1uxb9ydo1_400.gif",
                        "width": 400,
                        "height": 185
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2063bdc01aa708855ef2296268fac47/tumblr_pai8bo3pIf1uxb9ydo1_250.gif",
                        "width": 250,
                        "height": 116
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2063bdc01aa708855ef2296268fac47/tumblr_pai8bo3pIf1uxb9ydo1_100.gif",
                        "width": 100,
                        "height": 46
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2063bdc01aa708855ef2296268fac47/tumblr_pai8bo3pIf1uxb9ydo1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/1018c01f064f518185878497b8c81f8d/tumblr_pai8bo3pIf1uxb9ydo2_540.gif",
                    "width": 525,
                    "height": 243
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/1018c01f064f518185878497b8c81f8d/tumblr_pai8bo3pIf1uxb9ydo2_540.gif",
                        "width": 525,
                        "height": 243
                    },
                    {
                        "url": "https://66.media.tumblr.com/1018c01f064f518185878497b8c81f8d/tumblr_pai8bo3pIf1uxb9ydo2_500.gif",
                        "width": 500,
                        "height": 231
                    },
                    {
                        "url": "https://66.media.tumblr.com/1018c01f064f518185878497b8c81f8d/tumblr_pai8bo3pIf1uxb9ydo2_400.gif",
                        "width": 400,
                        "height": 185
                    },
                    {
                        "url": "https://66.media.tumblr.com/1018c01f064f518185878497b8c81f8d/tumblr_pai8bo3pIf1uxb9ydo2_250.gif",
                        "width": 250,
                        "height": 116
                    },
                    {
                        "url": "https://66.media.tumblr.com/1018c01f064f518185878497b8c81f8d/tumblr_pai8bo3pIf1uxb9ydo2_100.gif",
                        "width": 100,
                        "height": 46
                    },
                    {
                        "url": "https://66.media.tumblr.com/1018c01f064f518185878497b8c81f8d/tumblr_pai8bo3pIf1uxb9ydo2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "link",
        "blog_name": "ao3feed-jonrya",
        "blog": {
            "name": "ao3feed-jonrya",
            "title": "AO3feed-Jonrya",
            "description": "  An automated feed for Jon x Arya fics posted on AO3.",
            "url": "https://ao3feed-jonrya.tumblr.com/",
            "uuid": "t:vwJRJGkZFFBKOLkwu-cxuA",
            "updated": 1561275029
        },
        "id": 182422398644,
        "post_url": "https://ao3feed-jonrya.tumblr.com/post/182422398644/reminisce",
        "slug": "reminisce",
        "date": "2019-01-30 13:01:54 GMT",
        "timestamp": 1548853314,
        "state": "published",
        "format": "html",
        "reblog_key": "Koyt3Neo",
        "tags": [
            "arya stark",
            "jon snow",
            "jon x arya",
            "needleheart",
            "jonrya",
            "ao3feed",
            "fanfic",
            "IFTTT"
        ],
        "short_url": "https://tmblr.co/ZmpZRZ2fvEEQq",
        "summary": "REMINISCE",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 3,
        "title": "REMINISCE",
        "url": "http://archiveofourown.org/works/17598146",
        "link_author": null,
        "excerpt": null,
        "publisher": "archiveofourown.org",
        "description": "<p>by <a rel=\"author\" href=\"/users/Rudra/pseuds/Rudra\">Rudra</a></p><p>&lsquo;is it real, is it really true&rsquo;,</p>\n<p> Is it her or someone whom he desperately wants her to be? Nevertheless, she looks just like her. 300 years and yet nothing changed, his eyes still in search of her, his heart still in her grasp. </p>\n<p>(story begins 300 years after Great war with others.<br/>jon gave up his throne to Gendry, after legitimizing him, so its all you need to know)</p><p>Words: 2346, Chapters: 1/1, Language: English</p><ul><li>Fandoms: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)/works\">Game of Thrones (TV)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20RPF/works\">Game of Thrones RPF</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20-%20George%20R*d*%20R*d*%20Martin/works\">A Song of Ice and Fire - George R. R. Martin</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20*a*%20Related%20Fandoms/works\">A Song of Ice and Fire &amp; Related Fandoms</a>\n</li>\n<li>Rating: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a>\n</li>\n<li>Warnings: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Choose%20Not%20To%20Use%20Archive%20Warnings/works\">Creator Chose Not To Use Archive Warnings</a>\n</li>\n<li>Categories: <a class=\"tag\" href=\"http://archiveofourown.org/tags/F*s*M/works\">F/M</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gen/works\">Gen</a>\n</li>\n<li>Characters: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20Stark/works\">Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow/works\">Jon Snow</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20%7C%20Aegon%20Targaryen/works\">Jon Snow | Aegon Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Theon%20Greyjoy/works\">Theon Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gendry%20Waters/works\">Gendry Waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rhaenys%20Baratheon/works\">Rhaenys Baratheon</a>\n</li>\n<li>Relationships: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Arya%20Stark/works\">Jon Snow/Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20*a*%20Arya%20Stark/works\">Jon Snow &amp; Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Original%20Female%20Character(s)/works\">Jon Snow/Original Female Character(s)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20Stark*s*Gendry%20Waters/works\">Arya Stark/Gendry Waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/OC%20-%20Relationship/works\">OC - Relationship</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Sansa%20Stark/works\">Jon Snow/Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Daenerys%20Targaryen/works\">Jon Snow/Daenerys Targaryen</a>\n</li>\n<li>Additional Tags: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Future%20Fic/works\">Future Fic</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/300%20years%20later/works\">300 years later</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Reincarnation%20maybe/works\">Reincarnation maybe</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Doppelganger/works\">Doppelganger</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Love/works\">Love</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Hurt/works\">Hurt</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Slow%20Burn/works\">Slow Burn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/this%20story%20could%20be%20OCC%20so%20be%20careful/works\">this story could be OCC so be careful</a>\n</li>\n</ul>",
        "reblog": {
            "comment": "<p><p>by <a rel=\"author\" href=\"/users/Rudra/pseuds/Rudra\">Rudra</a></p><p>‘is it real, is it really true’,</p>\n<p> Is it her or someone whom he desperately wants her to be? Nevertheless, she looks just like her. 300 years and yet nothing changed, his eyes still in search of her, his heart still in her grasp. </p>\n<p>(story begins 300 years after Great war with others.<br>jon gave up his throne to Gendry, after legitimizing him, so its all you need to know)</p><p>Words: 2346, Chapters: 1/1, Language: English</p><ul><li>Fandoms: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)/works\">Game of Thrones (TV)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20RPF/works\">Game of Thrones RPF</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20-%20George%20R*d*%20R*d*%20Martin/works\">A Song of Ice and Fire - George R. R. Martin</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20*a*%20Related%20Fandoms/works\">A Song of Ice and Fire &amp; Related Fandoms</a>\n</li>\n<li>Rating: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a>\n</li>\n<li>Warnings: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Choose%20Not%20To%20Use%20Archive%20Warnings/works\">Creator Chose Not To Use Archive Warnings</a>\n</li>\n<li>Categories: <a class=\"tag\" href=\"http://archiveofourown.org/tags/F*s*M/works\">F/M</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gen/works\">Gen</a>\n</li>\n<li>Characters: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20Stark/works\">Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow/works\">Jon Snow</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20%7C%20Aegon%20Targaryen/works\">Jon Snow | Aegon Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Theon%20Greyjoy/works\">Theon Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gendry%20Waters/works\">Gendry Waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rhaenys%20Baratheon/works\">Rhaenys Baratheon</a>\n</li>\n<li>Relationships: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Arya%20Stark/works\">Jon Snow/Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20*a*%20Arya%20Stark/works\">Jon Snow &amp; Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Original%20Female%20Character(s)/works\">Jon Snow/Original Female Character(s)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20Stark*s*Gendry%20Waters/works\">Arya Stark/Gendry Waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/OC%20-%20Relationship/works\">OC - Relationship</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Sansa%20Stark/works\">Jon Snow/Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Daenerys%20Targaryen/works\">Jon Snow/Daenerys Targaryen</a>\n</li>\n<li>Additional Tags: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Future%20Fic/works\">Future Fic</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/300%20years%20later/works\">300 years later</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Reincarnation%20maybe/works\">Reincarnation maybe</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Doppelganger/works\">Doppelganger</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Love/works\">Love</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Hurt/works\">Hurt</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Slow%20Burn/works\">Slow Burn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/this%20story%20could%20be%20OCC%20so%20be%20careful/works\">this story could be OCC so be careful</a>\n</li>\n</ul></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ao3feed-jonrya",
                    "active": true,
                    "theme": {
                        "header_full_width": 3000,
                        "header_full_height": 1055,
                        "header_focus_width": 1068,
                        "header_focus_height": 601,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "111,2041,712,973",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_05.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_image_focused": "https://static.tumblr.com/7032fac7091015e342cc53dc7f060a57/mailbkd/MTmpfkldy/tumblr_static_optica_pattern_05_focused_v3.png",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_05_focused_v3.png?_v=671444c5f47705cce40d8aefd23df3b1",
                        "header_stretch": true,
                        "link_color": "#000000",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182422398644"
                },
                "content_raw": "<p><p>by <a rel=\"author\" href=\"/users/Rudra/pseuds/Rudra\">Rudra</a></p><p>‘is it real, is it really true’,</p>\n<p> Is it her or someone whom he desperately wants her to be? Nevertheless, she looks just like her. 300 years and yet nothing changed, his eyes still in search of her, his heart still in her grasp. </p>\n<p>(story begins 300 years after Great war with others.<br>jon gave up his throne to Gendry, after legitimizing him, so its all you need to know)</p><p>Words: 2346, Chapters: 1/1, Language: English</p><ul><li>Fandoms: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)/works\">Game of Thrones (TV)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20RPF/works\">Game of Thrones RPF</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20-%20George%20R*d*%20R*d*%20Martin/works\">A Song of Ice and Fire - George R. R. Martin</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20*a*%20Related%20Fandoms/works\">A Song of Ice and Fire &amp; Related Fandoms</a>\n</li>\n<li>Rating: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a>\n</li>\n<li>Warnings: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Choose%20Not%20To%20Use%20Archive%20Warnings/works\">Creator Chose Not To Use Archive Warnings</a>\n</li>\n<li>Categories: <a class=\"tag\" href=\"http://archiveofourown.org/tags/F*s*M/works\">F/M</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gen/works\">Gen</a>\n</li>\n<li>Characters: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20Stark/works\">Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow/works\">Jon Snow</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20%7C%20Aegon%20Targaryen/works\">Jon Snow | Aegon Targaryen</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Theon%20Greyjoy/works\">Theon Greyjoy</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Gendry%20Waters/works\">Gendry Waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Rhaenys%20Baratheon/works\">Rhaenys Baratheon</a>\n</li>\n<li>Relationships: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Arya%20Stark/works\">Jon Snow/Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow%20*a*%20Arya%20Stark/works\">Jon Snow &amp; Arya Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Original%20Female%20Character(s)/works\">Jon Snow/Original Female Character(s)</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Arya%20Stark*s*Gendry%20Waters/works\">Arya Stark/Gendry Waters</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/OC%20-%20Relationship/works\">OC - Relationship</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Sansa%20Stark/works\">Jon Snow/Sansa Stark</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Daenerys%20Targaryen/works\">Jon Snow/Daenerys Targaryen</a>\n</li>\n<li>Additional Tags: <a class=\"tag\" href=\"http://archiveofourown.org/tags/Future%20Fic/works\">Future Fic</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/300%20years%20later/works\">300 years later</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Reincarnation%20maybe/works\">Reincarnation maybe</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Doppelganger/works\">Doppelganger</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Love/works\">Love</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Hurt/works\">Hurt</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/Slow%20Burn/works\">Slow Burn</a>, <a class=\"tag\" href=\"http://archiveofourown.org/tags/this%20story%20could%20be%20OCC%20so%20be%20careful/works\">this story could be OCC so be careful</a>\n</li>\n</ul></p>",
                "content": "<p><p>by <a href=\"/users/Rudra/pseuds/Rudra\">Rudra</a></p><p>&lsquo;is it real, is it really true&rsquo;,</p>\n<p> Is it her or someone whom he desperately wants her to be? Nevertheless, she looks just like her. 300 years and yet nothing changed, his eyes still in search of her, his heart still in her grasp. </p>\n<p>(story begins 300 years after Great war with others.<br />jon gave up his throne to Gendry, after legitimizing him, so its all you need to know)</p><p>Words: 2346, Chapters: 1/1, Language: English</p><ul><li>Fandoms: <a href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20(TV)/works\">Game of Thrones (TV)</a>, <a href=\"http://archiveofourown.org/tags/Game%20of%20Thrones%20RPF/works\">Game of Thrones RPF</a>, <a href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20-%20George%20R*d*%20R*d*%20Martin/works\">A Song of Ice and Fire - George R. R. Martin</a>, <a href=\"http://archiveofourown.org/tags/A%20Song%20of%20Ice%20and%20Fire%20*a*%20Related%20Fandoms/works\">A Song of Ice and Fire &amp; Related Fandoms</a>\n</li>\n<li>Rating: <a href=\"http://archiveofourown.org/tags/Not%20Rated/works\">Not Rated</a>\n</li>\n<li>Warnings: <a href=\"http://archiveofourown.org/tags/Choose%20Not%20To%20Use%20Archive%20Warnings/works\">Creator Chose Not To Use Archive Warnings</a>\n</li>\n<li>Categories: <a href=\"http://archiveofourown.org/tags/F*s*M/works\">F/M</a>, <a href=\"http://archiveofourown.org/tags/Gen/works\">Gen</a>\n</li>\n<li>Characters: <a href=\"http://archiveofourown.org/tags/Arya%20Stark/works\">Arya Stark</a>, <a href=\"http://archiveofourown.org/tags/Jon%20Snow/works\">Jon Snow</a>, <a href=\"http://archiveofourown.org/tags/Jon%20Snow%20%7C%20Aegon%20Targaryen/works\">Jon Snow | Aegon Targaryen</a>, <a href=\"http://archiveofourown.org/tags/Theon%20Greyjoy/works\">Theon Greyjoy</a>, <a href=\"http://archiveofourown.org/tags/Gendry%20Waters/works\">Gendry Waters</a>, <a href=\"http://archiveofourown.org/tags/Rhaenys%20Baratheon/works\">Rhaenys Baratheon</a>\n</li>\n<li>Relationships: <a href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Arya%20Stark/works\">Jon Snow/Arya Stark</a>, <a href=\"http://archiveofourown.org/tags/Jon%20Snow%20*a*%20Arya%20Stark/works\">Jon Snow &amp; Arya Stark</a>, <a href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Original%20Female%20Character(s)/works\">Jon Snow/Original Female Character(s)</a>, <a href=\"http://archiveofourown.org/tags/Arya%20Stark*s*Gendry%20Waters/works\">Arya Stark/Gendry Waters</a>, <a href=\"http://archiveofourown.org/tags/OC%20-%20Relationship/works\">OC - Relationship</a>, <a href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Sansa%20Stark/works\">Jon Snow/Sansa Stark</a>, <a href=\"http://archiveofourown.org/tags/Jon%20Snow*s*Daenerys%20Targaryen/works\">Jon Snow/Daenerys Targaryen</a>\n</li>\n<li>Additional Tags: <a href=\"http://archiveofourown.org/tags/Future%20Fic/works\">Future Fic</a>, <a href=\"http://archiveofourown.org/tags/300%20years%20later/works\">300 years later</a>, <a href=\"http://archiveofourown.org/tags/Reincarnation%20maybe/works\">Reincarnation maybe</a>, <a href=\"http://archiveofourown.org/tags/Doppelganger/works\">Doppelganger</a>, <a href=\"http://archiveofourown.org/tags/Love/works\">Love</a>, <a href=\"http://archiveofourown.org/tags/Hurt/works\">Hurt</a>, <a href=\"http://archiveofourown.org/tags/Slow%20Burn/works\">Slow Burn</a>, <a href=\"http://archiveofourown.org/tags/this%20story%20could%20be%20OCC%20so%20be%20careful/works\">this story could be OCC so be careful</a>\n</li>\n</ul></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "the-bisexual-disaster",
        "blog": {
            "name": "the-bisexual-disaster",
            "title": "Proud Member of the Arya Stark Defence Club",
            "description": "<p>Kat, 17, she/they. Respect Carol Danvers and Arya Stark or die by my battleaxe</p>",
            "url": "https://the-bisexual-disaster.tumblr.com/",
            "uuid": "t:BCquRTIqjCRYoXojfh4B9g",
            "updated": 1561756454
        },
        "id": 182420472985,
        "post_url": "https://the-bisexual-disaster.tumblr.com/post/182420472985/some-good-shit-in-the-arya-tag-today-guys-keep-it",
        "slug": "some-good-shit-in-the-arya-tag-today-guys-keep-it",
        "date": "2019-01-30 10:25:57 GMT",
        "timestamp": 1548843957,
        "state": "published",
        "format": "html",
        "reblog_key": "eYr00pq8",
        "tags": [
            "one day soon i will write a full essay about arya stark and post it here for all to read",
            "game of thrones",
            "arya stark"
        ],
        "short_url": "https://tmblr.co/ZIIY7m2fv6uIP",
        "summary": "some good shit in the arya tag today guys. keep it up!",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": null,
        "body": "<p>some good shit in the arya tag today guys. keep it up!</p>",
        "reblog": {
            "comment": "<p>some good shit in the arya tag today guys. keep it up!</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "the-bisexual-disaster",
                    "active": true,
                    "theme": {
                        "header_full_width": 960,
                        "header_full_height": 1280,
                        "header_focus_width": 798,
                        "header_focus_height": 448,
                        "avatar_shape": "square",
                        "background_color": "#56037e",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "584,884,1032,86",
                        "header_image": "https://static.tumblr.com/6062642af9cbbff1ec9275762e12a830/mff51sz/Vhspewr57/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/6062642af9cbbff1ec9275762e12a830/mff51sz/1vopr2l12/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_13_focused_v3.png?_v=2f4063be1dd2ee91e4eca54332e25191",
                        "header_stretch": true,
                        "link_color": "#df10b3",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#00C5FF",
                        "title_font": "Sofia Pro",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182420472985"
                },
                "content_raw": "<p>some good shit in the arya tag today guys. keep it up!</p>",
                "content": "<p>some good shit in the arya tag today guys. keep it up!</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "the-swift-tricker",
        "blog": {
            "name": "the-swift-tricker",
            "title": "wanna trade me your soul for this jar of bees?",
            "description": "hi my name's daniel and i'm the thing you meet at the crossroads.",
            "url": "https://the-swift-tricker.tumblr.com/",
            "uuid": "t:6UZ1a1ER0cbK0NoVJ05pkw",
            "updated": 1561757759
        },
        "id": 182418008036,
        "post_url": "https://the-swift-tricker.tumblr.com/post/182418008036/game-of-thrones-reunions-i-cant-wait-for-arya",
        "slug": "game-of-thrones-reunions-i-cant-wait-for-arya",
        "date": "2019-01-30 07:06:31 GMT",
        "timestamp": 1548831991,
        "state": "published",
        "format": "html",
        "reblog_key": "C5eVXNat",
        "tags": [
            "game of thrones",
            "arya stark",
            "gendry waters",
            "gendrya",
            "jon snow",
            "sansa stark",
            "tyrion lannister",
            "bran stark",
            "daenerys targaryen",
            "jorah mormont",
            "samwell tarly",
            "jaime lannister",
            "brienne of tarth",
            "tormund",
            "got season 8",
            "swift-tricker's posts"
        ],
        "short_url": "https://tmblr.co/Z5vnIo2fuzUVa",
        "summary": "Game of Thrones reunions I can’t wait for\n\n  Arya and Gendry Arya and Jon Sansa and Sandor Arya and Sandor Sansa and Tyrion Bran...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 102,
        "title": null,
        "body": "<p><b>\n\nGame of Thrones reunions I can’t wait for\n\n</b><br/></p><p>Arya and Gendry</p><p>Arya and Jon</p><p>Sansa and Sandor</p><p>Arya and Sandor</p><p>Sansa and Tyrion</p><p>Bran and Tyrion</p><p>Daenerys and Jorah</p><p>Sam and Jon</p><p>Jaimie and Brienne</p><p>Brienne and Tormund</p>",
        "reblog": {
            "comment": "<p><b>\n\nGame of Thrones reunions I can’t wait for\n\n</b><br></p><p>Arya and Gendry</p><p>Arya and Jon</p><p>Sansa and Sandor</p><p>Arya and Sandor</p><p>Sansa and Tyrion</p><p>Bran and Tyrion</p><p>Daenerys and Jorah</p><p>Sam and Jon</p><p>Jaimie and Brienne</p><p>Brienne and Tormund</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "the-swift-tricker",
                    "active": true,
                    "theme": {
                        "header_full_width": 2472,
                        "header_full_height": 2704,
                        "header_focus_width": 2048,
                        "header_focus_height": 1151,
                        "avatar_shape": "square",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "939,2472,2329,0",
                        "header_image": "https://static.tumblr.com/6ad1bc03d342ab639d451ed2720a8877/iyjpdtr/9mRpi353a/tumblr_static_74bs5w611jsw8g0kokoc8go4w.jpg",
                        "header_image_focused": "https://static.tumblr.com/6ad1bc03d342ab639d451ed2720a8877/iyjpdtr/WWqplbl9q/tumblr_static_tumblr_static_74bs5w611jsw8g0kokoc8go4w_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_08_focused_v3.png?_v=f0f055039bb6136b9661cf2227b535c2",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#f8f8f8",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182418008036"
                },
                "content_raw": "<p><b>\n\nGame of Thrones reunions I can’t wait for\n\n</b><br></p><p>Arya and Gendry</p><p>Arya and Jon</p><p>Sansa and Sandor</p><p>Arya and Sandor</p><p>Sansa and Tyrion</p><p>Bran and Tyrion</p><p>Daenerys and Jorah</p><p>Sam and Jon</p><p>Jaimie and Brienne</p><p>Brienne and Tormund</p>",
                "content": "<p><b>\n\nGame of Thrones reunions I can&rsquo;t wait for\n\n</b><br /></p><p>Arya and Gendry</p><p>Arya and Jon</p><p>Sansa and Sandor</p><p>Arya and Sandor</p><p>Sansa and Tyrion</p><p>Bran and Tyrion</p><p>Daenerys and Jorah</p><p>Sam and Jon</p><p>Jaimie and Brienne</p><p>Brienne and Tormund</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "chat",
        "blog_name": "aryafaceless",
        "blog": {
            "name": "aryafaceless",
            "title": "Arya x Jaqen",
            "description": "",
            "url": "https://aryafaceless.tumblr.com/",
            "uuid": "t:mRDwiLunebc56UkZUe61jA",
            "updated": 1561730437
        },
        "id": 182408454968,
        "post_url": "https://aryafaceless.tumblr.com/post/182408454968/arya-stark-in-the-hall-of-faces-nice",
        "slug": "arya-stark-in-the-hall-of-faces-nice",
        "date": "2019-01-29 23:02:28 GMT",
        "timestamp": 1548802948,
        "state": "published",
        "format": "html",
        "reblog_key": "dQIRHUkN",
        "tags": [
            "arya stark",
            "jaqen h'ghar",
            "the house of black and white",
            "got incorrect quotes",
            "braavos",
            "game of thrones"
        ],
        "short_url": "https://tmblr.co/ZgpuGe2fuP2Cu",
        "summary": "Arya Stark: *in the hall of faces* Nice place.\nJaqen H'ghar: This is my design.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 26,
        "title": null,
        "body": "Arya Stark: *in the hall of faces* Nice place.\nJaqen H'ghar: This is my design.",
        "dialogue": [
            {
                "name": "Arya Stark",
                "label": "Arya Stark:",
                "phrase": "*in the hall of faces* Nice place."
            },
            {
                "name": "Jaqen H'ghar",
                "label": "Jaqen H'ghar:",
                "phrase": "This is my design."
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "devilsbastion",
        "blog": {
            "name": "devilsbastion",
            "title": "I came from the sea",
            "description": "'Game of Thrones & a Parting Glass' lives here, don't ask why, but you can search by character or author if you wish. and sometimes i snap photos, write words, and paint pictures. and sometimes i realize it's all futile. <!-- Start of StatCounter Code for Tumblr -->\n \n \n<!-- End of StatCounter Code for Tumblr -->",
            "url": "https://devilsbastion.tumblr.com/",
            "uuid": "t:589BeNT5iTFHIYMnv-MNPg",
            "updated": 1561753231
        },
        "id": 182406212228,
        "post_url": "https://devilsbastion.tumblr.com/post/182406212228",
        "slug": "",
        "date": "2019-01-29 21:20:19 GMT",
        "timestamp": 1548796819,
        "state": "published",
        "format": "html",
        "reblog_key": "9pe5atUE",
        "tags": [
            "hot pie",
            "lommy",
            "arya stark",
            "john steinbeck",
            "GoT&aPartingGlass",
            "game of thrones edit"
        ],
        "short_url": "https://tmblr.co/ZnJr5l2fuGUg4",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 11,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "image_permalink": "https://devilsbastion.tumblr.com/image/182406212228",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/d2b83b688888f14350dc0a0ab216806a/tumblr_pm3mlzpWJk1upmviso1_1280.jpg",
                    "width": 1023,
                    "height": 573
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/d2b83b688888f14350dc0a0ab216806a/tumblr_pm3mlzpWJk1upmviso1_1280.jpg",
                        "width": 1023,
                        "height": 573
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2b83b688888f14350dc0a0ab216806a/tumblr_pm3mlzpWJk1upmviso1_640.jpg",
                        "width": 640,
                        "height": 358
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2b83b688888f14350dc0a0ab216806a/tumblr_pm3mlzpWJk1upmviso1_540.jpg",
                        "width": 540,
                        "height": 302
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2b83b688888f14350dc0a0ab216806a/tumblr_pm3mlzpWJk1upmviso1_500.jpg",
                        "width": 500,
                        "height": 280
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2b83b688888f14350dc0a0ab216806a/tumblr_pm3mlzpWJk1upmviso1_400.jpg",
                        "width": 400,
                        "height": 224
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2b83b688888f14350dc0a0ab216806a/tumblr_pm3mlzpWJk1upmviso1_250.jpg",
                        "width": 250,
                        "height": 140
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2b83b688888f14350dc0a0ab216806a/tumblr_pm3mlzpWJk1upmviso1_100.jpg",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2b83b688888f14350dc0a0ab216806a/tumblr_pm3mlzpWJk1upmviso1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "dadvos-of-winterfell",
        "blog": {
            "name": "dadvos-of-winterfell",
            "title": "Starks will endure",
            "description": "reader | writer | artist | fan",
            "url": "https://dadvos-of-winterfell.tumblr.com/",
            "uuid": "t:bgvb_6HR8-tYbAm-RvVG0g",
            "updated": 1554399764
        },
        "id": 182404786618,
        "post_url": "https://dadvos-of-winterfell.tumblr.com/post/182404786618/jon-are-you-upset-you-dont-get-to-be-on-the-same",
        "slug": "jon-are-you-upset-you-dont-get-to-be-on-the-same",
        "date": "2019-01-29 20:11:44 GMT",
        "timestamp": 1548792704,
        "state": "published",
        "format": "html",
        "reblog_key": "mfJ7IUYF",
        "tags": [
            "jon snow",
            "gendry waters",
            "arya stark",
            "podrick payne",
            "jon",
            "gendry",
            "arya",
            "pod",
            "game of thrones",
            "got",
            "incorrect game of thrones",
            "incorrect game of thrones quotes",
            "season 8",
            "i can imagine this quite well",
            "got 8",
            "please d&d let it happen"
        ],
        "short_url": "https://tmblr.co/ZLxOKY2fuB2cw",
        "summary": "Jon: Are you upset you don't get to be on the same training team as Arya?\nGendry: Have you ever trained with Arya?\nJon:...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 261,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> Are you upset you don&rsquo;t get to be on the same training team as Arya?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Gendry:</b> Have you ever trained with Arya?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> No</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Gendry:</b> Have you ever gone into a steel cage with wolverine?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>*cuts to Arya and Pod*</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Arya [to Podrick]:</b> FASTER! FASTER! FASTER! FASTER! DO YOU NOT KNOW THAT WORD?! IT MEANS MORE FAST!</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> Are you upset you don’t get to be on the same training team as Arya?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Gendry:</b> Have you ever trained with Arya?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> No</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Gendry:</b> Have you ever gone into a steel cage with wolverine?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>*cuts to Arya and Pod*</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Arya [to Podrick]:</b> FASTER! FASTER! FASTER! FASTER! DO YOU NOT KNOW THAT WORD?! IT MEANS MORE FAST!</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "dadvos-of-winterfell",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#AA8983",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/6468cdf0ad84a15b8a12fecb53536bb6/6w0yzvh/gNQpgi7ml/tumblr_static_-512713818-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/6468cdf0ad84a15b8a12fecb53536bb6/6w0yzvh/gNQpgi7ml/tumblr_static_-512713818-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/6468cdf0ad84a15b8a12fecb53536bb6/6w0yzvh/gNQpgi7ml/tumblr_static_-512713818-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FD9395",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Clearface FS",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182404786618"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> Are you upset you don’t get to be on the same training team as Arya?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Gendry:</b> Have you ever trained with Arya?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Jon:</b> No</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Gendry:</b> Have you ever gone into a steel cage with wolverine?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>*cuts to Arya and Pod*</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Arya [to Podrick]:</b> FASTER! FASTER! FASTER! FASTER! DO YOU NOT KNOW THAT WORD?! IT MEANS MORE FAST!</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Jon:</b> Are you upset you don&rsquo;t get to be on the same training team as Arya?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Gendry:</b> Have you ever trained with Arya?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Jon:</b> No</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Gendry:</b> Have you ever gone into a steel cage with wolverine?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\">*cuts to Arya and Pod*</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Arya [to Podrick]:</b> FASTER! FASTER! FASTER! FASTER! DO YOU NOT KNOW THAT WORD?! IT MEANS MORE FAST!</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "quote",
        "blog_name": "gendryaonline",
        "blog": {
            "name": "gendryaonline",
            "title": "a nice oak tree",
            "description": "a blog dedicated to arya stark and gendry from a song of ice and fire by george r.r. martin and hbo's game of thrones",
            "url": "https://gendryaonline.tumblr.com/",
            "uuid": "t:sXHFrIJvWXR_WDQPVxyctA",
            "updated": 1561752758
        },
        "id": 182404521201,
        "post_url": "https://gendryaonline.tumblr.com/post/182404521201/gendry-looked-fierce-when-he-scowled-his-beard",
        "slug": "gendry-looked-fierce-when-he-scowled-his-beard",
        "date": "2019-01-29 19:59:39 GMT",
        "timestamp": 1548791979,
        "state": "published",
        "format": "html",
        "reblog_key": "M8VZnGs4",
        "tags": [
            "arya stark",
            "gendry",
            "gendrya",
            "arya x gendry",
            "quote"
        ],
        "short_url": "https://tmblr.co/ZHGJQY2fuA1pn",
        "summary": "Gendry looked fierce when he scowled. His beard had grown in thick and black as briar.“I said, no fires.”",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 100,
        "text": "Gendry looked fierce when he scowled. His beard had grown in thick and black as briar.&ldquo;I said, no fires.&rdquo;",
        "source": "a Clash of Kings",
        "reblog": {
            "comment": "<p>a Clash of Kings</p>",
            "tree_html": ""
        },
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]