[
    {
        "type": "text",
        "blog_name": "coddledtamago",
        "blog": {
            "name": "coddledtamago",
            "title": "CoddledTamago",
            "description": "Self taught greek comic artist and illustrator. I follow back and interact as mondaimono. Daily practice, warmups and doodlery. Fanart from multiple fandoms, because I'm an indulgent bastar.. ehm, because I draw whatever tickles my fancy.",
            "url": "https://coddledtamago.tumblr.com/",
            "uuid": "t:WX0_Drkrym7eTzhRUHZnFg",
            "updated": 1561609821
        },
        "id": 182944078905,
        "post_url": "https://coddledtamago.tumblr.com/post/182944078905/a-mollymauk-i-did-almost-a-year-ago-it-started-as",
        "slug": "a-mollymauk-i-did-almost-a-year-ago-it-started-as",
        "date": "2019-02-20 21:22:44 GMT",
        "timestamp": 1550697764,
        "state": "published",
        "format": "html",
        "reblog_key": "4yKgUyUC",
        "tags": [
            "critical role",
            "critrole",
            "critrolefanart",
            "criticalrolefanart",
            "dnd character",
            "dnd",
            "dnd art",
            "mollymauk the tiefling",
            "cr mollymauk",
            "coddledtamago art",
            "the mighty nein",
            "artists on tumblr",
            "illustration"
        ],
        "short_url": "https://tmblr.co/ZDvjvp2gOKHmv",
        "summary": "A Mollymauk I did almost a year ago. It started as a study of his portrait from one of my favorite artists here, @wehavekookies....",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 24,
        "title": null,
        "body": "<div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"968\"><img src=\"https://66.media.tumblr.com/bddcaded61f83d052c7017fe8de0f0e0/tumblr_pn8u1vqqFc1qdmt7a_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"968\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"1012\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/7772c8339c0e4cad63dbfc56ed5424ee/tumblr_pn8u1w1MgT1qdmt7a_540.jpg\" data-orig-height=\"1012\" data-orig-width=\"1280\"/></figure></div><p>A Mollymauk I did almost a year ago. It started as a study of his portrait from one of my favorite artists here, @wehavekookies. Their portrait of Molly got me into the Mighty 9 in the first place and I loved their art so much i just had to. This study derailed pretty quick and there’s not only this bust but 2 more that I don’t know yet if I’ll ever post. Long may he reign 🖤</p>",
        "reblog": {
            "comment": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"968\"><img src=\"https://66.media.tumblr.com/bddcaded61f83d052c7017fe8de0f0e0/tumblr_pn8u1vqqFc1qdmt7a_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"968\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1012\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/7772c8339c0e4cad63dbfc56ed5424ee/tumblr_pn8u1w1MgT1qdmt7a_540.jpg\" data-orig-height=\"1012\" data-orig-width=\"1280\"></figure></div><p>A Mollymauk I did almost a year ago. It started as a study of his portrait from one of my favorite artists here, @wehavekookies. Their portrait of Molly got me into the Mighty 9 in the first place and I loved their art so much i just had to. This study derailed pretty quick and there’s not only this bust but 2 more that I don’t know yet if I’ll ever post. Long may he reign 🖤</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "coddledtamago",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/24bff35eeee6a7fa6413ba77400d1cdc/ztfrbwg/eLzpm7rb4/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/24bff35eeee6a7fa6413ba77400d1cdc/ztfrbwg/eLzpm7rb4/tumblr_static__2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/24bff35eeee6a7fa6413ba77400d1cdc/ztfrbwg/eLzpm7rb4/tumblr_static__2048_v2.jpg",
                        "header_stretch": false,
                        "link_color": "#211927",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#211927",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182944078905"
                },
                "content_raw": "<p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"968\"><img src=\"https://66.media.tumblr.com/bddcaded61f83d052c7017fe8de0f0e0/tumblr_pn8u1vqqFc1qdmt7a_540.jpg\" data-orig-height=\"1280\" data-orig-width=\"968\"></figure><figure class=\"tmblr-full\" data-orig-height=\"1012\" data-orig-width=\"1280\"><img src=\"https://66.media.tumblr.com/7772c8339c0e4cad63dbfc56ed5424ee/tumblr_pn8u1w1MgT1qdmt7a_540.jpg\" data-orig-height=\"1012\" data-orig-width=\"1280\"></figure></div><p>A Mollymauk I did almost a year ago. It started as a study of his portrait from one of my favorite artists here, @wehavekookies. Their portrait of Molly got me into the Mighty 9 in the first place and I loved their art so much i just had to. This study derailed pretty quick and there’s not only this bust but 2 more that I don’t know yet if I’ll ever post. Long may he reign 🖤</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/bddcaded61f83d052c7017fe8de0f0e0/tumblr_pn8u1vqqFc1qdmt7a_540.jpg\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/7772c8339c0e4cad63dbfc56ed5424ee/tumblr_pn8u1w1MgT1qdmt7a_540.jpg\" class=\"\"/></figure><p>A Mollymauk I did almost a year ago. It started as a study of his portrait from one of my favorite artists here, @wehavekookies. Their portrait of Molly got me into the Mighty 9 in the first place and I loved their art so much i just had to. This study derailed pretty quick and there&rsquo;s not only this bust but 2 more that I don&rsquo;t know yet if I&rsquo;ll ever post. Long may he reign &#128420;</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "assholebeau",
        "blog": {
            "name": "assholebeau",
            "title": "In This House We Love And Stan Marisha Ray",
            "description": "<p>Hey! I’m CJ. This is a blog where I’m gonna talk a lot about Critical Role but also D&amp;D and fantasy in general. Also please talk to me about beaujester</p>",
            "url": "https://assholebeau.tumblr.com/",
            "uuid": "t:-HYMusEw6khWmfzdWpcbOg",
            "updated": 1561757443
        },
        "id": 182943976007,
        "post_url": "https://assholebeau.tumblr.com/post/182943976007/okay-i-wrote-my-first-ever-beaujester-fic-please",
        "slug": "okay-i-wrote-my-first-ever-beaujester-fic-please",
        "date": "2019-02-20 21:17:20 GMT",
        "timestamp": 1550697440,
        "state": "published",
        "format": "html",
        "reblog_key": "BHF19KAG",
        "tags": [
            "beaujester",
            "lavorregard",
            "beaujest",
            "jestregard",
            "critical role",
            "beauregard",
            "jester",
            "my writing",
            "i dont think ive ever posted a fic",
            "also this isnt edited"
        ],
        "short_url": "https://tmblr.co/ZZ6JPb2gOJuf7",
        "summary": "Okay! I wrote my first ever Beaujester fic. Please be gentle. Beau’s attitude toward horror, and this whole fic in general were...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 67,
        "title": null,
        "body": "<p>Okay! I wrote my first ever Beaujester fic. Please be gentle. Beau’s attitude toward horror, and this whole fic in general were inspired by a recent experience I had. For Galentines™️ day my friends and I went to see the prodigy, and while I did leave to use the bathroom no cute girls invited me to play arcade games with them instead. I hope you enjoy!</p><p>———————————————————————</p><p>Molly had dragged her and Caleb to this stupid movie. “None of us are doing anything for Valentine’s Day so I think we should just go do something together instead.” He had explained. Apparently in his head the perfect opposite to the hallmark mushiness of the holliday was a horror movie. </p><p>Not that she would ever admit to it, but Beau hated horror movies almost as much as she hated Valentine’s Day . Well not all horror, it’s just she never feels compelled to care for the characters, and then she’s just being scared for no reason. Well not scared, Beau doesn’t experience fear. And it’s not like she gets scared in real life easy. She’s not a pansy ass little bitch, no sir. But horror movies use special effects, and lighting, and erie music, and suspense that makes things, like, extra spooky. Plus she can’t react like she normally would when watching a movie at home. At a theater she has to sit still and stay quiet. She’d rather be at home where she could perch on her seat when things got intense, or where she could make comments to Caleb and slap at Molly’s arm. So most of the time she’d prefer a nice action movie with lots of punching and guns and car chases. </p><p>But there she was, sitting in between Caleb and Molly. Both of whom had a morbid fascination with the happenings of the film. The little boy on the screen took a pair of scissors and sharpened them while making thinly veiled threats to his mom. Beau already had to watch the little shithead kill the dog, and she was not here for him killing the milf.</p><p>“I gotta go pee.” She said gruffly, stealing some popcorn from Molly, who swatted lightly at her hand. </p><p>“Alright, go now before the plot picks up, ja.” Caleb said absently, eyes fixed on the screen, hand playing with the fabric of his coat. </p><p>Beau quickly made her way out of the room. After looking around in the colorful hallways she made her way to the bathroom. That way if Molly called her out later she wouldn’t technicality be lying. As she sat on the toilet Beau whipped out her phone and looked up a synopsis of the movie. It was kinda hard to find the big plot reveals cause the movie had just come out. There was nothing on the Wikipedia or IMDB. Eventually she found a review that spilled all the plot points. Apparently the little boy was sharing his body (and was not possessed) with the soul of a serial killer. The type of man who took advantage of women and the legal system that doesn’t care about violent aggressions against women. But, like, the movie wasn’t even a critique on that. It was more just jerking off to the idea of a sexy cereal killer. It sickened her. </p><p>Beau left the bathroom making her way back toward the movie she had left. She stood at the doorway checking the time. </p><p>“Ugh” she sighed. She’d only been gone for about 6 minutes. She was hoping to have missed more. She started amping herself up. The same way she would before a boxing match. She bounced up and down lightly, blowing air out of her lungs, and shaking her hands. </p><p>Rocking back on her heels she whispered “Alright, Beau, you got this.” And just as she was about to barrel her way back to her seat a voice interrupted her</p><p>“Psyching yourself up for the spooky movie?” </p><p>The voice caught her off guard and Beau may have stumbled a little bit. A pair of warm hands steadied her from behind, and then just as suddenly dropped. Beau turned around.</p><p>Standing in front of her was the most beautiful girl Beau had ever seen. Blue skin, blue hair, a wide smile. The girls teeth were pointed, bangs brushed her forehead, and there was a smattering of freckles across her smooth skin. </p><p>“Sorry, I don’t mean to scare you!” Her voice had a lilting quality to it “but you just looked really cute and funny, getting yourself prepared to go back in there.”</p><p>Beau, recognizing that she was being teased, came out of her daze of seeing a pretty girl. A frown tugged at her face as she crossed her arms over her chest.</p><p>“I just didn’t want to interrupt the other movie goers.” She grunted.</p><p>“Of course!” The girl replied “I don’t think I really want to go back into my movie either. You see I came with my friend Fjord, he’s really cool, and we were gonna watch this suuuuuuer cute love story about a really hunky guy wooing this cute girl, but then while we were watching the ads before the film Fjord ate something weird and started spitting up a whole bunch of water so I had to take him to the bathroom …” </p><p>As the cute girl, as Beau had dubbed her in her head, continued to tell her story Beau let her eyes survey her. She stood just a half a head shorter than Beau, and had a plump frame. A pair of horns curled right above her ears, adorned with ribbons. She was wearing and appropriately themed pink dress with frills and the like. As she talked she moved her hands wildly and seemed to bounce on the balls of her feet. Even if she had just been teasing Beau, there was something quite endearing about the girl.</p><p>“&hellip; yeah, so now I’m just trying to decide if I want to go prank the ticket clerk or switch the signs on the movie goers!” The girl finished talking and stuck out her hand “I’m Jester, by the way” </p><p>Beau slowly pulled her own down from where it was crossed against her chest and took Jesters. “Nice to meet you? I’m Beau.”</p><p>“Hi Beau” their two hands remained locked “so are you going to finish your movie?”</p><p>“Uhhh” Beau stalled for a moment. She really didn’t want to finish the movie, but she also didn’t want Molly to make fun of her. And there was the fact that there was this really pretty girl still holding onto her hand. “I think I’d rather stay out here.” She let here eyes roam up and down the blue girls figure, giving her a small smirk.</p><p>“Great! Cause there’s this really hard shooter game in the arcade area, and it’s supposed to be easier with two people!” Jester beamed. “Wanna join me?” </p><p>“Just give me a sec.” She reluctantly let go of Jester’s hand and pulled her phone out of her back pocket. She sent Molly and Caleb a quick text </p><p>Just met a cute girl in the hallway</p><p>Think I’m gonna stay out here</p><p>…</p><p>Okay</p><p>Have fun ;)</p><p>Ja, what the purple one said</p><p>stay safe</p><p>Beau looked up and Jester was still standing there smiling shyly. Almost like she was unsure now that she had time to think about what she had asked. </p><p>“Sorry, I just wanted to let my friends know where I was going.” Beau said.</p><p>Jesters small smile then bloomed into a mischievous grin. She made some comment about how many coins they would need to get, but Beau was distracted when the shorter girl grabbed her hand again and drug her toward the machines. </p><p>Molly definitely made fun of her later for not being able to finish a silly horror movie. But Beau didn’t care because she spent her Valentine’s Day playing stupid arcade games with a stupid cute girl. She even managed to get 7 digits and maybe even a small kiss on the cheek. Not that she would admit to being so mushy. </p>",
        "reblog": {
            "comment": "<p>Okay! I wrote my first ever Beaujester fic. Please be gentle. Beau’s attitude toward horror, and this whole fic in general were inspired by a recent experience I had. For Galentines™️ day my friends and I went to see the prodigy, and while I did leave to use the bathroom no cute girls invited me to play arcade games with them instead. I hope you enjoy!</p><p>———————————————————————</p><p>Molly had dragged her and Caleb to this stupid movie. “None of us are doing anything for Valentine’s Day so I think we should just go do something together instead.” He had explained. Apparently in his head the perfect opposite to the hallmark mushiness of the holliday was a horror movie. </p><p>Not that she would ever admit to it, but Beau hated horror movies almost as much as she hated Valentine’s Day . Well not all horror, it’s just she never feels compelled to care for the characters, and then she’s just being scared for no reason. Well not scared, Beau doesn’t experience fear. And it’s not like she gets scared in real life easy. She’s not a pansy ass little bitch, no sir. But horror movies use special effects, and lighting, and erie music, and suspense that makes things, like, extra spooky. Plus she can’t react like she normally would when watching a movie at home. At a theater she has to sit still and stay quiet. She’d rather be at home where she could perch on her seat when things got intense, or where she could make comments to Caleb and slap at Molly’s arm. So most of the time she’d prefer a nice action movie with lots of punching and guns and car chases. </p><p>But there she was, sitting in between Caleb and Molly. Both of whom had a morbid fascination with the happenings of the film. The little boy on the screen took a pair of scissors and sharpened them while making thinly veiled threats to his mom. Beau already had to watch the little shithead kill the dog, and she was not here for him killing the milf.</p><p>“I gotta go pee.” She said gruffly, stealing some popcorn from Molly, who swatted lightly at her hand. </p><p>“Alright, go now before the plot picks up, ja.” Caleb said absently, eyes fixed on the screen, hand playing with the fabric of his coat. </p><p>Beau quickly made her way out of the room. After looking around in the colorful hallways she made her way to the bathroom. That way if Molly called her out later she wouldn’t technicality be lying. As she sat on the toilet Beau whipped out her phone and looked up a synopsis of the movie. It was kinda hard to find the big plot reveals cause the movie had just come out. There was nothing on the Wikipedia or IMDB. Eventually she found a review that spilled all the plot points. Apparently the little boy was sharing his body (and was not possessed) with the soul of a serial killer. The type of man who took advantage of women and the legal system that doesn’t care about violent aggressions against women. But, like, the movie wasn’t even a critique on that. It was more just jerking off to the idea of a sexy cereal killer. It sickened her. </p><p>Beau left the bathroom making her way back toward the movie she had left. She stood at the doorway checking the time. </p><p>“Ugh” she sighed. She’d only been gone for about 6 minutes. She was hoping to have missed more. She started amping herself up. The same way she would before a boxing match. She bounced up and down lightly, blowing air out of her lungs, and shaking her hands. </p><p>Rocking back on her heels she whispered “Alright, Beau, you got this.” And just as she was about to barrel her way back to her seat a voice interrupted her</p><p>“Psyching yourself up for the spooky movie?” </p><p>The voice caught her off guard and Beau may have stumbled a little bit. A pair of warm hands steadied her from behind, and then just as suddenly dropped. Beau turned around.</p><p>Standing in front of her was the most beautiful girl Beau had ever seen. Blue skin, blue hair, a wide smile. The girls teeth were pointed, bangs brushed her forehead, and there was a smattering of freckles across her smooth skin. </p><p>“Sorry, I don’t mean to scare you!” Her voice had a lilting quality to it “but you just looked really cute and funny, getting yourself prepared to go back in there.”</p><p>Beau, recognizing that she was being teased, came out of her daze of seeing a pretty girl. A frown tugged at her face as she crossed her arms over her chest.</p><p>“I just didn’t want to interrupt the other movie goers.” She grunted.</p><p>“Of course!” The girl replied “I don’t think I really want to go back into my movie either. You see I came with my friend Fjord, he’s really cool, and we were gonna watch this suuuuuuer cute love story about a really hunky guy wooing this cute girl, but then while we were watching the ads before the film Fjord ate something weird and started spitting up a whole bunch of water so I had to take him to the bathroom …” </p><p>As the cute girl, as Beau had dubbed her in her head, continued to tell her story Beau let her eyes survey her. She stood just a half a head shorter than Beau, and had a plump frame. A pair of horns curled right above her ears, adorned with ribbons. She was wearing and appropriately themed pink dress with frills and the like. As she talked she moved her hands wildly and seemed to bounce on the balls of her feet. Even if she had just been teasing Beau, there was something quite endearing about the girl.</p><p>“… yeah, so now I’m just trying to decide if I want to go prank the ticket clerk or switch the signs on the movie goers!” The girl finished talking and stuck out her hand “I’m Jester, by the way” </p><p>Beau slowly pulled her own down from where it was crossed against her chest and took Jesters. “Nice to meet you? I’m Beau.”</p><p>“Hi Beau” their two hands remained locked “so are you going to finish your movie?”</p><p>“Uhhh” Beau stalled for a moment. She really didn’t want to finish the movie, but she also didn’t want Molly to make fun of her. And there was the fact that there was this really pretty girl still holding onto her hand. “I think I’d rather stay out here.” She let here eyes roam up and down the blue girls figure, giving her a small smirk.</p><p>“Great! Cause there’s this really hard shooter game in the arcade area, and it’s supposed to be easier with two people!” Jester beamed. “Wanna join me?” </p><p>“Just give me a sec.” She reluctantly let go of Jester’s hand and pulled her phone out of her back pocket. She sent Molly and Caleb a quick text </p><p>Just met a cute girl in the hallway</p><p>Think I’m gonna stay out here</p><p>…</p><p>Okay</p><p>Have fun ;)</p><p>Ja, what the purple one said</p><p>stay safe</p><p>Beau looked up and Jester was still standing there smiling shyly. Almost like she was unsure now that she had time to think about what she had asked. </p><p>“Sorry, I just wanted to let my friends know where I was going.” Beau said.</p><p>Jesters small smile then bloomed into a mischievous grin. She made some comment about how many coins they would need to get, but Beau was distracted when the shorter girl grabbed her hand again and drug her toward the machines. </p><p>Molly definitely made fun of her later for not being able to finish a silly horror movie. But Beau didn’t care because she spent her Valentine’s Day playing stupid arcade games with a stupid cute girl. She even managed to get 7 digits and maybe even a small kiss on the cheek. Not that she would admit to being so mushy. </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "assholebeau",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 387,
                        "header_focus_width": 591,
                        "header_focus_height": 332,
                        "avatar_shape": "circle",
                        "background_color": "#83B9DA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "51,612,383,21",
                        "header_image": "https://static.tumblr.com/d55511d925b7dd243c1a86b7a387ca23/azcvexz/Tssp2oe65/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/d55511d925b7dd243c1a86b7a387ca23/azcvexz/fNrp2oe66/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/d55511d925b7dd243c1a86b7a387ca23/azcvexz/Tssp2oe65/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#888888",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943976007"
                },
                "content_raw": "<p>Okay! I wrote my first ever Beaujester fic. Please be gentle. Beau’s attitude toward horror, and this whole fic in general were inspired by a recent experience I had. For Galentines™️ day my friends and I went to see the prodigy, and while I did leave to use the bathroom no cute girls invited me to play arcade games with them instead. I hope you enjoy!</p><p>———————————————————————</p><p>Molly had dragged her and Caleb to this stupid movie. “None of us are doing anything for Valentine’s Day so I think we should just go do something together instead.” He had explained. Apparently in his head the perfect opposite to the hallmark mushiness of the holliday was a horror movie. </p><p>Not that she would ever admit to it, but Beau hated horror movies almost as much as she hated Valentine’s Day . Well not all horror, it’s just she never feels compelled to care for the characters, and then she’s just being scared for no reason. Well not scared, Beau doesn’t experience fear. And it’s not like she gets scared in real life easy. She’s not a pansy ass little bitch, no sir. But horror movies use special effects, and lighting, and erie music, and suspense that makes things, like, extra spooky. Plus she can’t react like she normally would when watching a movie at home. At a theater she has to sit still and stay quiet. She’d rather be at home where she could perch on her seat when things got intense, or where she could make comments to Caleb and slap at Molly’s arm. So most of the time she’d prefer a nice action movie with lots of punching and guns and car chases. </p><p>But there she was, sitting in between Caleb and Molly. Both of whom had a morbid fascination with the happenings of the film. The little boy on the screen took a pair of scissors and sharpened them while making thinly veiled threats to his mom. Beau already had to watch the little shithead kill the dog, and she was not here for him killing the milf.</p><p>“I gotta go pee.” She said gruffly, stealing some popcorn from Molly, who swatted lightly at her hand. </p><p>“Alright, go now before the plot picks up, ja.” Caleb said absently, eyes fixed on the screen, hand playing with the fabric of his coat. </p><p>Beau quickly made her way out of the room. After looking around in the colorful hallways she made her way to the bathroom. That way if Molly called her out later she wouldn’t technicality be lying. As she sat on the toilet Beau whipped out her phone and looked up a synopsis of the movie. It was kinda hard to find the big plot reveals cause the movie had just come out. There was nothing on the Wikipedia or IMDB. Eventually she found a review that spilled all the plot points. Apparently the little boy was sharing his body (and was not possessed) with the soul of a serial killer. The type of man who took advantage of women and the legal system that doesn’t care about violent aggressions against women. But, like, the movie wasn’t even a critique on that. It was more just jerking off to the idea of a sexy cereal killer. It sickened her. </p><p>Beau left the bathroom making her way back toward the movie she had left. She stood at the doorway checking the time. </p><p>“Ugh” she sighed. She’d only been gone for about 6 minutes. She was hoping to have missed more. She started amping herself up. The same way she would before a boxing match. She bounced up and down lightly, blowing air out of her lungs, and shaking her hands. </p><p>Rocking back on her heels she whispered “Alright, Beau, you got this.” And just as she was about to barrel her way back to her seat a voice interrupted her</p><p>“Psyching yourself up for the spooky movie?” </p><p>The voice caught her off guard and Beau may have stumbled a little bit. A pair of warm hands steadied her from behind, and then just as suddenly dropped. Beau turned around.</p><p>Standing in front of her was the most beautiful girl Beau had ever seen. Blue skin, blue hair, a wide smile. The girls teeth were pointed, bangs brushed her forehead, and there was a smattering of freckles across her smooth skin. </p><p>“Sorry, I don’t mean to scare you!” Her voice had a lilting quality to it “but you just looked really cute and funny, getting yourself prepared to go back in there.”</p><p>Beau, recognizing that she was being teased, came out of her daze of seeing a pretty girl. A frown tugged at her face as she crossed her arms over her chest.</p><p>“I just didn’t want to interrupt the other movie goers.” She grunted.</p><p>“Of course!” The girl replied “I don’t think I really want to go back into my movie either. You see I came with my friend Fjord, he’s really cool, and we were gonna watch this suuuuuuer cute love story about a really hunky guy wooing this cute girl, but then while we were watching the ads before the film Fjord ate something weird and started spitting up a whole bunch of water so I had to take him to the bathroom …” </p><p>As the cute girl, as Beau had dubbed her in her head, continued to tell her story Beau let her eyes survey her. She stood just a half a head shorter than Beau, and had a plump frame. A pair of horns curled right above her ears, adorned with ribbons. She was wearing and appropriately themed pink dress with frills and the like. As she talked she moved her hands wildly and seemed to bounce on the balls of her feet. Even if she had just been teasing Beau, there was something quite endearing about the girl.</p><p>“… yeah, so now I’m just trying to decide if I want to go prank the ticket clerk or switch the signs on the movie goers!” The girl finished talking and stuck out her hand “I’m Jester, by the way” </p><p>Beau slowly pulled her own down from where it was crossed against her chest and took Jesters. “Nice to meet you? I’m Beau.”</p><p>“Hi Beau” their two hands remained locked “so are you going to finish your movie?”</p><p>“Uhhh” Beau stalled for a moment. She really didn’t want to finish the movie, but she also didn’t want Molly to make fun of her. And there was the fact that there was this really pretty girl still holding onto her hand. “I think I’d rather stay out here.” She let here eyes roam up and down the blue girls figure, giving her a small smirk.</p><p>“Great! Cause there’s this really hard shooter game in the arcade area, and it’s supposed to be easier with two people!” Jester beamed. “Wanna join me?” </p><p>“Just give me a sec.” She reluctantly let go of Jester’s hand and pulled her phone out of her back pocket. She sent Molly and Caleb a quick text </p><p>Just met a cute girl in the hallway</p><p>Think I’m gonna stay out here</p><p>…</p><p>Okay</p><p>Have fun ;)</p><p>Ja, what the purple one said</p><p>stay safe</p><p>Beau looked up and Jester was still standing there smiling shyly. Almost like she was unsure now that she had time to think about what she had asked. </p><p>“Sorry, I just wanted to let my friends know where I was going.” Beau said.</p><p>Jesters small smile then bloomed into a mischievous grin. She made some comment about how many coins they would need to get, but Beau was distracted when the shorter girl grabbed her hand again and drug her toward the machines. </p><p>Molly definitely made fun of her later for not being able to finish a silly horror movie. But Beau didn’t care because she spent her Valentine’s Day playing stupid arcade games with a stupid cute girl. She even managed to get 7 digits and maybe even a small kiss on the cheek. Not that she would admit to being so mushy. </p>",
                "content": "<p>Okay! I wrote my first ever Beaujester fic. Please be gentle. Beau&rsquo;s attitude toward horror, and this whole fic in general were inspired by a recent experience I had. For Galentines&trade;&#65039; day my friends and I went to see the prodigy, and while I did leave to use the bathroom no cute girls invited me to play arcade games with them instead. I hope you enjoy!</p><p>&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;&mdash;</p><p>Molly had dragged her and Caleb to this stupid movie. &ldquo;None of us are doing anything for Valentine&rsquo;s Day so I think we should just go do something together instead.&rdquo; He had explained. Apparently in his head the perfect opposite to the hallmark mushiness of the holliday was a horror movie. </p><p>Not that she would ever admit to it, but Beau hated horror movies almost as much as she hated Valentine&rsquo;s Day . Well not all horror, it&rsquo;s just she never feels compelled to care for the characters, and then she&rsquo;s just being scared for no reason. Well not scared, Beau doesn&rsquo;t experience fear. And it&rsquo;s not like she gets scared in real life easy. She&rsquo;s not a pansy ass little bitch, no sir. But horror movies use special effects, and lighting, and erie music, and suspense that makes things, like, extra spooky. Plus she can&rsquo;t react like she normally would when watching a movie at home. At a theater she has to sit still and stay quiet. She&rsquo;d rather be at home where she could perch on her seat when things got intense, or where she could make comments to Caleb and slap at Molly&rsquo;s arm. So most of the time she&rsquo;d prefer a nice action movie with lots of punching and guns and car chases. </p><p>But there she was, sitting in between Caleb and Molly. Both of whom had a morbid fascination with the happenings of the film. The little boy on the screen took a pair of scissors and sharpened them while making thinly veiled threats to his mom. Beau already had to watch the little shithead kill the dog, and she was not here for him killing the milf.</p><p>&ldquo;I gotta go pee.&rdquo; She said gruffly, stealing some popcorn from Molly, who swatted lightly at her hand. </p><p>&ldquo;Alright, go now before the plot picks up, ja.&rdquo; Caleb said absently, eyes fixed on the screen, hand playing with the fabric of his coat. </p><p>Beau quickly made her way out of the room. After looking around in the colorful hallways she made her way to the bathroom. That way if Molly called her out later she wouldn&rsquo;t technicality be lying. As she sat on the toilet Beau whipped out her phone and looked up a synopsis of the movie. It was kinda hard to find the big plot reveals cause the movie had just come out. There was nothing on the Wikipedia or IMDB. Eventually she found a review that spilled all the plot points. Apparently the little boy was sharing his body (and was not possessed) with the soul of a serial killer. The type of man who took advantage of women and the legal system that doesn&rsquo;t care about violent aggressions against women. But, like, the movie wasn&rsquo;t even a critique on that. It was more just jerking off to the idea of a sexy cereal killer. It sickened her. </p><p>Beau left the bathroom making her way back toward the movie she had left. She stood at the doorway checking the time. </p><p>&ldquo;Ugh&rdquo; she sighed. She&rsquo;d only been gone for about 6 minutes. She was hoping to have missed more. She started amping herself up. The same way she would before a boxing match. She bounced up and down lightly, blowing air out of her lungs, and shaking her hands. </p><p>Rocking back on her heels she whispered &ldquo;Alright, Beau, you got this.&rdquo; And just as she was about to barrel her way back to her seat a voice interrupted her</p><p>&ldquo;Psyching yourself up for the spooky movie?&rdquo; </p><p>The voice caught her off guard and Beau may have stumbled a little bit. A pair of warm hands steadied her from behind, and then just as suddenly dropped. Beau turned around.</p><p>Standing in front of her was the most beautiful girl Beau had ever seen. Blue skin, blue hair, a wide smile. The girls teeth were pointed, bangs brushed her forehead, and there was a smattering of freckles across her smooth skin. </p><p>&ldquo;Sorry, I don&rsquo;t mean to scare you!&rdquo; Her voice had a lilting quality to it &ldquo;but you just looked really cute and funny, getting yourself prepared to go back in there.&rdquo;</p><p>Beau, recognizing that she was being teased, came out of her daze of seeing a pretty girl. A frown tugged at her face as she crossed her arms over her chest.</p><p>&ldquo;I just didn&rsquo;t want to interrupt the other movie goers.&rdquo; She grunted.</p><p>&ldquo;Of course!&rdquo; The girl replied &ldquo;I don&rsquo;t think I really want to go back into my movie either. You see I came with my friend Fjord, he&rsquo;s really cool, and we were gonna watch this suuuuuuer cute love story about a really hunky guy wooing this cute girl, but then while we were watching the ads before the film Fjord ate something weird and started spitting up a whole bunch of water so I had to take him to the bathroom &hellip;&rdquo; </p><p>As the cute girl, as Beau had dubbed her in her head, continued to tell her story Beau let her eyes survey her. She stood just a half a head shorter than Beau, and had a plump frame. A pair of horns curled right above her ears, adorned with ribbons. She was wearing and appropriately themed pink dress with frills and the like. As she talked she moved her hands wildly and seemed to bounce on the balls of her feet. Even if she had just been teasing Beau, there was something quite endearing about the girl.</p><p>&ldquo;&hellip; yeah, so now I&rsquo;m just trying to decide if I want to go prank the ticket clerk or switch the signs on the movie goers!&rdquo; The girl finished talking and stuck out her hand &ldquo;I&rsquo;m Jester, by the way&rdquo; </p><p>Beau slowly pulled her own down from where it was crossed against her chest and took Jesters. &ldquo;Nice to meet you? I&rsquo;m Beau.&rdquo;</p><p>&ldquo;Hi Beau&rdquo; their two hands remained locked &ldquo;so are you going to finish your movie?&rdquo;</p><p>&ldquo;Uhhh&rdquo; Beau stalled for a moment. She really didn&rsquo;t want to finish the movie, but she also didn&rsquo;t want Molly to make fun of her. And there was the fact that there was this really pretty girl still holding onto her hand. &ldquo;I think I&rsquo;d rather stay out here.&rdquo; She let here eyes roam up and down the blue girls figure, giving her a small smirk.</p><p>&ldquo;Great! Cause there&rsquo;s this really hard shooter game in the arcade area, and it&rsquo;s supposed to be easier with two people!&rdquo; Jester beamed. &ldquo;Wanna join me?&rdquo; </p><p>&ldquo;Just give me a sec.&rdquo; She reluctantly let go of Jester&rsquo;s hand and pulled her phone out of her back pocket. She sent Molly and Caleb a quick text </p><p>Just met a cute girl in the hallway</p><p>Think I&rsquo;m gonna stay out here</p><p>&hellip;</p><p>Okay</p><p>Have fun ;)</p><p>Ja, what the purple one said</p><p>stay safe</p><p>Beau looked up and Jester was still standing there smiling shyly. Almost like she was unsure now that she had time to think about what she had asked. </p><p>&ldquo;Sorry, I just wanted to let my friends know where I was going.&rdquo; Beau said.</p><p>Jesters small smile then bloomed into a mischievous grin. She made some comment about how many coins they would need to get, but Beau was distracted when the shorter girl grabbed her hand again and drug her toward the machines. </p><p>Molly definitely made fun of her later for not being able to finish a silly horror movie. But Beau didn&rsquo;t care because she spent her Valentine&rsquo;s Day playing stupid arcade games with a stupid cute girl. She even managed to get 7 digits and maybe even a small kiss on the cheek. Not that she would admit to being so mushy. </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "handbookerhelper",
        "blog": {
            "name": "handbookerhelper",
            "title": "",
            "description": "Everything Handbooker Helper related. A smidge of #EverythingIsContent and a dash of Critical Role. Plus generous helpings of D&D. Asks are now open.",
            "url": "https://handbookerhelper.tumblr.com/",
            "uuid": "t:-rBMbrG7Dhcnd3dYOtpDZg",
            "updated": 1561755139
        },
        "id": 182943894075,
        "post_url": "https://handbookerhelper.tumblr.com/post/182943894075/if-you-whack-a-goblin-with-a-stick-you-still",
        "slug": "if-you-whack-a-goblin-with-a-stick-you-still",
        "date": "2019-02-20 21:13:01 GMT",
        "timestamp": 1550697181,
        "state": "published",
        "format": "html",
        "reblog_key": "tFAj47sX",
        "tags": [
            "handbooker helper",
            "critical role",
            "marisha ray",
            "nott the brave",
            "goblin",
            "monk",
            "ttrpg",
            "dnd",
            "dnd5e",
            "d&d",
            "dungeons and dragons",
            "i made this with a potato",
            "sorry for the spam",
            "but it's a wednesday",
            "this is a joke btw",
            "beau and not are friend goals"
        ],
        "short_url": "https://tmblr.co/Z7zjqY2gOJaex",
        "summary": "“If you whack a goblin with a stick, you still have time to deck ‘em in the face”",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 458,
        "caption": "<p><i><b>“If you whack a goblin with a stick, you still have time to deck ‘em in the face”</b></i></p>",
        "reblog": {
            "comment": "<p><i><b>“If you whack a goblin with a stick, you still have time to deck ‘em in the face”</b></i></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "handbookerhelper",
                    "active": true,
                    "theme": {
                        "header_full_width": 480,
                        "header_full_height": 270,
                        "header_focus_width": 479,
                        "header_focus_height": 270,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,479,270,0",
                        "header_image": "https://static.tumblr.com/f89f7c52e186076f097029a463b19174/uwlagzp/koRprlpgz/tumblr_static_2x6ab3hsuh440gw440gc4gk8o.gif",
                        "header_image_focused": "https://static.tumblr.com/f89f7c52e186076f097029a463b19174/uwlagzp/Ogaprlph1/tumblr_static_tumblr_static_2x6ab3hsuh440gw440gc4gk8o_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/f89f7c52e186076f097029a463b19174/uwlagzp/koRprlpgz/tumblr_static_2x6ab3hsuh440gw440gc4gk8o_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943894075"
                },
                "content_raw": "<p><i><b>“If you whack a goblin with a stick, you still have time to deck ‘em in the face”</b></i></p>",
                "content": "<p><i><b>&ldquo;If you whack a goblin with a stick, you still have time to deck&nbsp;&lsquo;em in the face&rdquo;</b></i></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://handbookerhelper.tumblr.com/image/182943894075",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/3dadfed0f6318efe0c2a828d5ecce7ff/tumblr_pn8tlpoV0m1xevgoco1_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/3dadfed0f6318efe0c2a828d5ecce7ff/tumblr_pn8tlpoV0m1xevgoco1_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/3dadfed0f6318efe0c2a828d5ecce7ff/tumblr_pn8tlpoV0m1xevgoco1_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/3dadfed0f6318efe0c2a828d5ecce7ff/tumblr_pn8tlpoV0m1xevgoco1_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/3dadfed0f6318efe0c2a828d5ecce7ff/tumblr_pn8tlpoV0m1xevgoco1_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/3dadfed0f6318efe0c2a828d5ecce7ff/tumblr_pn8tlpoV0m1xevgoco1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "a-dot-fell",
        "blog": {
            "name": "a-dot-fell",
            "title": "Gayer Than A Tree Full Of Monkeys On Nitrous Oxide",
            "description": "<p>Previously Li Fics. Icon by: Dykeiel</p>",
            "url": "https://a-dot-fell.tumblr.com/",
            "uuid": "t:5VnUGg4gsMnaOP891ppGKw",
            "updated": 1561736756
        },
        "id": 182943825928,
        "post_url": "https://a-dot-fell.tumblr.com/post/182943825928/something-i-love-about-watching-cr-rather-than",
        "slug": "something-i-love-about-watching-cr-rather-than",
        "date": "2019-02-20 21:09:26 GMT",
        "timestamp": 1550696966,
        "state": "published",
        "format": "html",
        "reblog_key": "5AE8d7dV",
        "tags": [
            "cr",
            "critical role",
            "critrole",
            "marisha ray",
            "matt mercer",
            "matthew mercer"
        ],
        "short_url": "https://tmblr.co/ZLYedd2gOJK08",
        "summary": "Something I love about watching CR rather than just listening to it: \nMarisha’s horny on main look when Matt gets REALLY into...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 93,
        "title": null,
        "body": "<p>Something I love about watching CR rather than just listening to it: </p><h2><i><b>Marisha’s horny on main look when Matt gets REALLY into describing something.</b></i></h2>",
        "reblog": {
            "comment": "<p><p>Something I love about watching CR rather than just listening to it: </p><h2><i><b>Marisha’s horny on main look when Matt gets REALLY into describing something.</b></i></h2></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "a-dot-fell",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/1b89a2d0d4af935f2321c4b7e800181d/ytgpmkb/HXQpt2ck9/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/1b89a2d0d4af935f2321c4b7e800181d/ytgpmkb/HXQpt2ck9/tumblr_static__2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/1b89a2d0d4af935f2321c4b7e800181d/ytgpmkb/HXQpt2ck9/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#91E0FF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943825928"
                },
                "content_raw": "<p><p>Something I love about watching CR rather than just listening to it: </p><h2><i><b>Marisha’s horny on main look when Matt gets REALLY into describing something.</b></i></h2></p>",
                "content": "<p><p>Something I love about watching CR rather than just listening to it: </p><h2><i><b>Marisha&rsquo;s horny on main look when Matt gets REALLY into describing something.</b></i></h2></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "goblinbefriender",
        "blog": {
            "name": "goblinbefriender",
            "title": "safe for the gobliest of goblins",
            "description": "liv | she/her",
            "url": "https://goblinbefriender.tumblr.com/",
            "uuid": "t:g4u-MQQi64PiIV1Kp4JXDg",
            "updated": 1561705178
        },
        "id": 182943813375,
        "post_url": "https://goblinbefriender.tumblr.com/post/182943813375/in-my-spare-time-i-like-to-listen-to-atlaseight",
        "slug": "in-my-spare-time-i-like-to-listen-to-atlaseight",
        "date": "2019-02-20 21:08:59 GMT",
        "timestamp": 1550696939,
        "state": "published",
        "format": "html",
        "reblog_key": "AzrNGevz",
        "tags": [
            "critical role",
            "critical role spoilers",
            "caleb widogast",
            "yall i just really like the song",
            "and i really want caleb to be ok at some point",
            "sleeping at last"
        ],
        "short_url": "https://tmblr.co/ZvtaDi2gOJGx-",
        "summary": "in my spare time i like to listen to Atlas:Eight by Sleeping at Last, think about how it relates to Caleb Widogast and cry",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 6,
        "title": null,
        "body": "<p>in my spare time i like to listen to Atlas:Eight by Sleeping at Last, think about how it relates to Caleb Widogast and cry</p>",
        "reblog": {
            "comment": "<p>in my spare time i like to listen to Atlas:Eight by Sleeping at Last, think about how it relates to Caleb Widogast and cry</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "goblinbefriender",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#D2735B",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/554e00003f51d8f4e97693e447b33891/fq1ze51/cLEpmdllk/tumblr_static_-518262596-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/554e00003f51d8f4e97693e447b33891/fq1ze51/cLEpmdllk/tumblr_static_-518262596-content_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/554e00003f51d8f4e97693e447b33891/fq1ze51/cLEpmdllk/tumblr_static_-518262596-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFB1A5",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943813375"
                },
                "content_raw": "<p>in my spare time i like to listen to Atlas:Eight by Sleeping at Last, think about how it relates to Caleb Widogast and cry</p>",
                "content": "<p>in my spare time i like to listen to Atlas:Eight by Sleeping at Last, think about how it relates to Caleb Widogast and cry</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "handbookerhelper",
        "blog": {
            "name": "handbookerhelper",
            "title": "",
            "description": "Everything Handbooker Helper related. A smidge of #EverythingIsContent and a dash of Critical Role. Plus generous helpings of D&D. Asks are now open.",
            "url": "https://handbookerhelper.tumblr.com/",
            "uuid": "t:-rBMbrG7Dhcnd3dYOtpDZg",
            "updated": 1561755139
        },
        "id": 182943710195,
        "post_url": "https://handbookerhelper.tumblr.com/post/182943710195/orders-from-our-all-powerful-overlord",
        "slug": "orders-from-our-all-powerful-overlord",
        "date": "2019-02-20 21:03:24 GMT",
        "timestamp": 1550696604,
        "state": "published",
        "format": "html",
        "reblog_key": "nmgC8eeV",
        "tags": [
            "handbooker helper",
            "critical role",
            "dnd",
            "d&d",
            "dungeons and dragons",
            "dnd5e",
            "marisha ray",
            "cr",
            "critters",
            "crit role",
            "monk",
            "monk class",
            "ttrpg",
            "this is out of context",
            "in case you couldn't tell",
            "i made this with a potato"
        ],
        "short_url": "https://tmblr.co/Z7zjqY2gOItlp",
        "summary": "Orders from our all-powerful Overlord.",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1611,
        "caption": "<p><i><b>Orders from our all-powerful Overlord</b>.</i></p>",
        "reblog": {
            "comment": "<p><i><b>Orders from our all-powerful Overlord</b>.</i></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "handbookerhelper",
                    "active": true,
                    "theme": {
                        "header_full_width": 480,
                        "header_full_height": 270,
                        "header_focus_width": 479,
                        "header_focus_height": 270,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,479,270,0",
                        "header_image": "https://static.tumblr.com/f89f7c52e186076f097029a463b19174/uwlagzp/koRprlpgz/tumblr_static_2x6ab3hsuh440gw440gc4gk8o.gif",
                        "header_image_focused": "https://static.tumblr.com/f89f7c52e186076f097029a463b19174/uwlagzp/Ogaprlph1/tumblr_static_tumblr_static_2x6ab3hsuh440gw440gc4gk8o_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/f89f7c52e186076f097029a463b19174/uwlagzp/koRprlpgz/tumblr_static_2x6ab3hsuh440gw440gc4gk8o_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943710195"
                },
                "content_raw": "<p><i><b>Orders from our all-powerful Overlord</b>.</i></p>",
                "content": "<p><i><b>Orders from our all-powerful Overlord</b>.</i></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://handbookerhelper.tumblr.com/image/182943710195",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/f2476f75745eb76b9c3edb6483aca0c3/tumblr_pn8t5oOL8J1xevgoco1_500.gif",
                    "width": 480,
                    "height": 270
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/f2476f75745eb76b9c3edb6483aca0c3/tumblr_pn8t5oOL8J1xevgoco1_500.gif",
                        "width": 480,
                        "height": 270
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2476f75745eb76b9c3edb6483aca0c3/tumblr_pn8t5oOL8J1xevgoco1_400.gif",
                        "width": 400,
                        "height": 225
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2476f75745eb76b9c3edb6483aca0c3/tumblr_pn8t5oOL8J1xevgoco1_250.gif",
                        "width": 250,
                        "height": 141
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2476f75745eb76b9c3edb6483aca0c3/tumblr_pn8t5oOL8J1xevgoco1_100.gif",
                        "width": 100,
                        "height": 56
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2476f75745eb76b9c3edb6483aca0c3/tumblr_pn8t5oOL8J1xevgoco1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "cr-cast-reactions-daily",
        "blog": {
            "name": "cr-cast-reactions-daily",
            "title": "Critical Role Cast Reactions",
            "description": "<p>Feel free to submit any reactions you might have and want to share</p><p>Please ask if you can use my photos as your icon</p>",
            "url": "https://cr-cast-reactions-daily.tumblr.com/",
            "uuid": "t:z6htwepI3D5wUuDtUb0mhg",
            "updated": 1561748458
        },
        "id": 182943668699,
        "post_url": "https://cr-cast-reactions-daily.tumblr.com/post/182943668699",
        "slug": "",
        "date": "2019-02-20 21:01:24 GMT",
        "timestamp": 1550696484,
        "state": "published",
        "format": "html",
        "reblog_key": "jjzTEcky",
        "tags": [
            "cr cast reactions",
            "critical role",
            "cr cast",
            "critical role cast",
            "cr",
            "critrole",
            "critrole cast",
            "marisha ray"
        ],
        "short_url": "https://tmblr.co/ZVPo2Y2gOIjdR",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 65,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"661\" data-orig-width=\"533\"><img src=\"https://66.media.tumblr.com/45c116f8bafb925659127264b48087b7/tumblr_pn41fyAnNh1rt2vm1_540.jpg\" data-orig-height=\"661\" data-orig-width=\"533\"/></figure>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"661\" data-orig-width=\"533\"><img src=\"https://66.media.tumblr.com/45c116f8bafb925659127264b48087b7/tumblr_pn41fyAnNh1rt2vm1_540.jpg\" data-orig-height=\"661\" data-orig-width=\"533\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "cr-cast-reactions-daily",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#CDAEEC",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_03.png?_v=a0f20b51ed40eb5a930ab86effe42a40",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_03_focused_v3.png?_v=a0f20b51ed40eb5a930ab86effe42a40",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_03_focused_v3.png?_v=a0f20b51ed40eb5a930ab86effe42a40",
                        "header_stretch": true,
                        "link_color": "#4B435A",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943668699"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"661\" data-orig-width=\"533\"><img src=\"https://66.media.tumblr.com/45c116f8bafb925659127264b48087b7/tumblr_pn41fyAnNh1rt2vm1_540.jpg\" data-orig-height=\"661\" data-orig-width=\"533\"></figure></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/45c116f8bafb925659127264b48087b7/tumblr_pn41fyAnNh1rt2vm1_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "emeraldhookphotography",
        "blog": {
            "name": "emeraldhookphotography",
            "title": "Emerald Hook Photography!",
            "description": "",
            "url": "https://emeraldhookphotography.tumblr.com/",
            "uuid": "t:UcIIywiBn-D6szZYZGOP0w",
            "updated": 1561752086
        },
        "id": 182943665453,
        "post_url": "https://emeraldhookphotography.tumblr.com/post/182943665453/cosplay-critical-role-emerald-hook-photography",
        "slug": "cosplay-critical-role-emerald-hook-photography",
        "date": "2019-02-20 21:01:18 GMT",
        "timestamp": 1550696478,
        "state": "published",
        "format": "html",
        "reblog_key": "bMgKo1FM",
        "tags": [
            "Emerald Hook Photography",
            "Photography",
            "Critical Role",
            "Critical Role Cosplay",
            "Cosplay"
        ],
        "short_url": "https://tmblr.co/ZVIswY2gOIiqj",
        "summary": "Cosplay: Critical Role Emerald Hook Photography",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 8,
        "caption": "<p>Cosplay: Critical Role</p><p>Emerald Hook Photography</p>",
        "reblog": {
            "comment": "<p>Cosplay: Critical Role</p><p>Emerald Hook Photography</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "emeraldhookphotography",
                    "active": true,
                    "theme": {
                        "header_full_width": 1280,
                        "header_full_height": 960,
                        "header_focus_width": 1096,
                        "header_focus_height": 617,
                        "avatar_shape": "circle",
                        "background_color": "#00863D",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "189,1275,806,179",
                        "header_image": "https://static.tumblr.com/f4542ff0d382747a413a41550b6eed6f/tctunt4/iMDpdj38i/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/f4542ff0d382747a413a41550b6eed6f/tctunt4/xwCpdj38n/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f4542ff0d382747a413a41550b6eed6f/tctunt4/iMDpdj38i/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#D85F46",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#B8E2CD",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943665453"
                },
                "content_raw": "<p>Cosplay: Critical Role</p><p>Emerald Hook Photography</p>",
                "content": "<p>Cosplay: Critical Role</p><p>Emerald Hook Photography</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "photoset_layout": "3232",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/f1b1dfc1c54791cb72edf9bbcbd1e450/tumblr_pmeyy3eifo1xdxqpgo1_1280.jpg",
                    "width": 1280,
                    "height": 853
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/f1b1dfc1c54791cb72edf9bbcbd1e450/tumblr_pmeyy3eifo1xdxqpgo1_1280.jpg",
                        "width": 1280,
                        "height": 853
                    },
                    {
                        "url": "https://66.media.tumblr.com/f1b1dfc1c54791cb72edf9bbcbd1e450/tumblr_pmeyy3eifo1xdxqpgo1_640.jpg",
                        "width": 640,
                        "height": 427
                    },
                    {
                        "url": "https://66.media.tumblr.com/f1b1dfc1c54791cb72edf9bbcbd1e450/tumblr_pmeyy3eifo1xdxqpgo1_540.jpg",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/f1b1dfc1c54791cb72edf9bbcbd1e450/tumblr_pmeyy3eifo1xdxqpgo1_500.jpg",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/f1b1dfc1c54791cb72edf9bbcbd1e450/tumblr_pmeyy3eifo1xdxqpgo1_400.jpg",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/f1b1dfc1c54791cb72edf9bbcbd1e450/tumblr_pmeyy3eifo1xdxqpgo1_250.jpg",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/f1b1dfc1c54791cb72edf9bbcbd1e450/tumblr_pmeyy3eifo1xdxqpgo1_100.jpg",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/f1b1dfc1c54791cb72edf9bbcbd1e450/tumblr_pmeyy3eifo1xdxqpgo1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ],
                "exif": {
                    "Camera": "Nikon D3200",
                    "ISO": 280,
                    "Aperture": "f/5.6",
                    "Exposure": "1/125th",
                    "FocalLength": "50mm"
                }
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/46151b6cfd933f89fc59e15a35bb3586/tumblr_pmeyy3eifo1xdxqpgo2_1280.jpg",
                    "width": 1280,
                    "height": 853
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/46151b6cfd933f89fc59e15a35bb3586/tumblr_pmeyy3eifo1xdxqpgo2_1280.jpg",
                        "width": 1280,
                        "height": 853
                    },
                    {
                        "url": "https://66.media.tumblr.com/46151b6cfd933f89fc59e15a35bb3586/tumblr_pmeyy3eifo1xdxqpgo2_640.jpg",
                        "width": 640,
                        "height": 427
                    },
                    {
                        "url": "https://66.media.tumblr.com/46151b6cfd933f89fc59e15a35bb3586/tumblr_pmeyy3eifo1xdxqpgo2_540.jpg",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/46151b6cfd933f89fc59e15a35bb3586/tumblr_pmeyy3eifo1xdxqpgo2_500.jpg",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/46151b6cfd933f89fc59e15a35bb3586/tumblr_pmeyy3eifo1xdxqpgo2_400.jpg",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/46151b6cfd933f89fc59e15a35bb3586/tumblr_pmeyy3eifo1xdxqpgo2_250.jpg",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/46151b6cfd933f89fc59e15a35bb3586/tumblr_pmeyy3eifo1xdxqpgo2_100.jpg",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/46151b6cfd933f89fc59e15a35bb3586/tumblr_pmeyy3eifo1xdxqpgo2_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ],
                "exif": {
                    "Camera": "Nikon D3200",
                    "ISO": 320,
                    "Aperture": "f/5.6",
                    "Exposure": "1/125th",
                    "FocalLength": "18mm"
                }
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/8325ba64fe2d69c11e7cae248df191eb/tumblr_pmeyy3eifo1xdxqpgo3_1280.jpg",
                    "width": 1280,
                    "height": 853
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/8325ba64fe2d69c11e7cae248df191eb/tumblr_pmeyy3eifo1xdxqpgo3_1280.jpg",
                        "width": 1280,
                        "height": 853
                    },
                    {
                        "url": "https://66.media.tumblr.com/8325ba64fe2d69c11e7cae248df191eb/tumblr_pmeyy3eifo1xdxqpgo3_640.jpg",
                        "width": 640,
                        "height": 427
                    },
                    {
                        "url": "https://66.media.tumblr.com/8325ba64fe2d69c11e7cae248df191eb/tumblr_pmeyy3eifo1xdxqpgo3_540.jpg",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/8325ba64fe2d69c11e7cae248df191eb/tumblr_pmeyy3eifo1xdxqpgo3_500.jpg",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/8325ba64fe2d69c11e7cae248df191eb/tumblr_pmeyy3eifo1xdxqpgo3_400.jpg",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/8325ba64fe2d69c11e7cae248df191eb/tumblr_pmeyy3eifo1xdxqpgo3_250.jpg",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/8325ba64fe2d69c11e7cae248df191eb/tumblr_pmeyy3eifo1xdxqpgo3_100.jpg",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/8325ba64fe2d69c11e7cae248df191eb/tumblr_pmeyy3eifo1xdxqpgo3_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ],
                "exif": {
                    "Camera": "Nikon D3200",
                    "ISO": 320,
                    "Aperture": "f/5.6",
                    "Exposure": "1/125th",
                    "FocalLength": "20mm"
                }
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/58dd74cecde32d3df15e3953e1a4c324/tumblr_pmeyy3eifo1xdxqpgo4_1280.jpg",
                    "width": 1280,
                    "height": 853
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/58dd74cecde32d3df15e3953e1a4c324/tumblr_pmeyy3eifo1xdxqpgo4_1280.jpg",
                        "width": 1280,
                        "height": 853
                    },
                    {
                        "url": "https://66.media.tumblr.com/58dd74cecde32d3df15e3953e1a4c324/tumblr_pmeyy3eifo1xdxqpgo4_640.jpg",
                        "width": 640,
                        "height": 427
                    },
                    {
                        "url": "https://66.media.tumblr.com/58dd74cecde32d3df15e3953e1a4c324/tumblr_pmeyy3eifo1xdxqpgo4_540.jpg",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/58dd74cecde32d3df15e3953e1a4c324/tumblr_pmeyy3eifo1xdxqpgo4_500.jpg",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/58dd74cecde32d3df15e3953e1a4c324/tumblr_pmeyy3eifo1xdxqpgo4_400.jpg",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/58dd74cecde32d3df15e3953e1a4c324/tumblr_pmeyy3eifo1xdxqpgo4_250.jpg",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/58dd74cecde32d3df15e3953e1a4c324/tumblr_pmeyy3eifo1xdxqpgo4_100.jpg",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/58dd74cecde32d3df15e3953e1a4c324/tumblr_pmeyy3eifo1xdxqpgo4_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ],
                "exif": {
                    "Camera": "Nikon D3200",
                    "ISO": 360,
                    "Aperture": "f/5.6",
                    "Exposure": "1/125th",
                    "FocalLength": "18mm"
                }
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/f2ac3d5cac2aa98de0bfa1ccf8d37812/tumblr_pmeyy3eifo1xdxqpgo5_1280.jpg",
                    "width": 1280,
                    "height": 853
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/f2ac3d5cac2aa98de0bfa1ccf8d37812/tumblr_pmeyy3eifo1xdxqpgo5_1280.jpg",
                        "width": 1280,
                        "height": 853
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2ac3d5cac2aa98de0bfa1ccf8d37812/tumblr_pmeyy3eifo1xdxqpgo5_640.jpg",
                        "width": 640,
                        "height": 427
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2ac3d5cac2aa98de0bfa1ccf8d37812/tumblr_pmeyy3eifo1xdxqpgo5_540.jpg",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2ac3d5cac2aa98de0bfa1ccf8d37812/tumblr_pmeyy3eifo1xdxqpgo5_500.jpg",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2ac3d5cac2aa98de0bfa1ccf8d37812/tumblr_pmeyy3eifo1xdxqpgo5_400.jpg",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2ac3d5cac2aa98de0bfa1ccf8d37812/tumblr_pmeyy3eifo1xdxqpgo5_250.jpg",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2ac3d5cac2aa98de0bfa1ccf8d37812/tumblr_pmeyy3eifo1xdxqpgo5_100.jpg",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/f2ac3d5cac2aa98de0bfa1ccf8d37812/tumblr_pmeyy3eifo1xdxqpgo5_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ],
                "exif": {
                    "Camera": "Nikon D3200",
                    "ISO": 250,
                    "Aperture": "f/5.6",
                    "Exposure": "1/125th",
                    "FocalLength": "21mm"
                }
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/72b1fdaf9741a85488ba71b3ab5f42e8/tumblr_pmeyy3eifo1xdxqpgo6_1280.jpg",
                    "width": 1280,
                    "height": 853
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/72b1fdaf9741a85488ba71b3ab5f42e8/tumblr_pmeyy3eifo1xdxqpgo6_1280.jpg",
                        "width": 1280,
                        "height": 853
                    },
                    {
                        "url": "https://66.media.tumblr.com/72b1fdaf9741a85488ba71b3ab5f42e8/tumblr_pmeyy3eifo1xdxqpgo6_640.jpg",
                        "width": 640,
                        "height": 427
                    },
                    {
                        "url": "https://66.media.tumblr.com/72b1fdaf9741a85488ba71b3ab5f42e8/tumblr_pmeyy3eifo1xdxqpgo6_540.jpg",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/72b1fdaf9741a85488ba71b3ab5f42e8/tumblr_pmeyy3eifo1xdxqpgo6_500.jpg",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/72b1fdaf9741a85488ba71b3ab5f42e8/tumblr_pmeyy3eifo1xdxqpgo6_400.jpg",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/72b1fdaf9741a85488ba71b3ab5f42e8/tumblr_pmeyy3eifo1xdxqpgo6_250.jpg",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/72b1fdaf9741a85488ba71b3ab5f42e8/tumblr_pmeyy3eifo1xdxqpgo6_100.jpg",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/72b1fdaf9741a85488ba71b3ab5f42e8/tumblr_pmeyy3eifo1xdxqpgo6_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ],
                "exif": {
                    "Camera": "Nikon D3200",
                    "ISO": 360,
                    "Aperture": "f/5.6",
                    "Exposure": "1/125th",
                    "FocalLength": "18mm"
                }
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/563fa425e04d0642151e0c2211e3971a/tumblr_pmeyy3eifo1xdxqpgo8_1280.jpg",
                    "width": 1280,
                    "height": 853
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/563fa425e04d0642151e0c2211e3971a/tumblr_pmeyy3eifo1xdxqpgo8_1280.jpg",
                        "width": 1280,
                        "height": 853
                    },
                    {
                        "url": "https://66.media.tumblr.com/563fa425e04d0642151e0c2211e3971a/tumblr_pmeyy3eifo1xdxqpgo8_640.jpg",
                        "width": 640,
                        "height": 427
                    },
                    {
                        "url": "https://66.media.tumblr.com/563fa425e04d0642151e0c2211e3971a/tumblr_pmeyy3eifo1xdxqpgo8_540.jpg",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/563fa425e04d0642151e0c2211e3971a/tumblr_pmeyy3eifo1xdxqpgo8_500.jpg",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/563fa425e04d0642151e0c2211e3971a/tumblr_pmeyy3eifo1xdxqpgo8_400.jpg",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/563fa425e04d0642151e0c2211e3971a/tumblr_pmeyy3eifo1xdxqpgo8_250.jpg",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/563fa425e04d0642151e0c2211e3971a/tumblr_pmeyy3eifo1xdxqpgo8_100.jpg",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/563fa425e04d0642151e0c2211e3971a/tumblr_pmeyy3eifo1xdxqpgo8_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ],
                "exif": {
                    "Camera": "Nikon D3200",
                    "ISO": 320,
                    "Aperture": "f/5.6",
                    "Exposure": "1/125th",
                    "FocalLength": "21mm"
                }
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/6414bc1b35a126bc86a861277967e523/tumblr_pmeyy3eifo1xdxqpgo7_1280.jpg",
                    "width": 1280,
                    "height": 853
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/6414bc1b35a126bc86a861277967e523/tumblr_pmeyy3eifo1xdxqpgo7_1280.jpg",
                        "width": 1280,
                        "height": 853
                    },
                    {
                        "url": "https://66.media.tumblr.com/6414bc1b35a126bc86a861277967e523/tumblr_pmeyy3eifo1xdxqpgo7_640.jpg",
                        "width": 640,
                        "height": 427
                    },
                    {
                        "url": "https://66.media.tumblr.com/6414bc1b35a126bc86a861277967e523/tumblr_pmeyy3eifo1xdxqpgo7_540.jpg",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/6414bc1b35a126bc86a861277967e523/tumblr_pmeyy3eifo1xdxqpgo7_500.jpg",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/6414bc1b35a126bc86a861277967e523/tumblr_pmeyy3eifo1xdxqpgo7_400.jpg",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/6414bc1b35a126bc86a861277967e523/tumblr_pmeyy3eifo1xdxqpgo7_250.jpg",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/6414bc1b35a126bc86a861277967e523/tumblr_pmeyy3eifo1xdxqpgo7_100.jpg",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/6414bc1b35a126bc86a861277967e523/tumblr_pmeyy3eifo1xdxqpgo7_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ],
                "exif": {
                    "Camera": "Nikon D3200",
                    "ISO": 320,
                    "Aperture": "f/5.6",
                    "Exposure": "1/125th",
                    "FocalLength": "21mm"
                }
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/941d1bb52ba03d996076614a14841ec1/tumblr_pmeyy3eifo1xdxqpgo9_1280.jpg",
                    "width": 1280,
                    "height": 853
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/941d1bb52ba03d996076614a14841ec1/tumblr_pmeyy3eifo1xdxqpgo9_1280.jpg",
                        "width": 1280,
                        "height": 853
                    },
                    {
                        "url": "https://66.media.tumblr.com/941d1bb52ba03d996076614a14841ec1/tumblr_pmeyy3eifo1xdxqpgo9_640.jpg",
                        "width": 640,
                        "height": 427
                    },
                    {
                        "url": "https://66.media.tumblr.com/941d1bb52ba03d996076614a14841ec1/tumblr_pmeyy3eifo1xdxqpgo9_540.jpg",
                        "width": 540,
                        "height": 360
                    },
                    {
                        "url": "https://66.media.tumblr.com/941d1bb52ba03d996076614a14841ec1/tumblr_pmeyy3eifo1xdxqpgo9_500.jpg",
                        "width": 500,
                        "height": 333
                    },
                    {
                        "url": "https://66.media.tumblr.com/941d1bb52ba03d996076614a14841ec1/tumblr_pmeyy3eifo1xdxqpgo9_400.jpg",
                        "width": 400,
                        "height": 267
                    },
                    {
                        "url": "https://66.media.tumblr.com/941d1bb52ba03d996076614a14841ec1/tumblr_pmeyy3eifo1xdxqpgo9_250.jpg",
                        "width": 250,
                        "height": 167
                    },
                    {
                        "url": "https://66.media.tumblr.com/941d1bb52ba03d996076614a14841ec1/tumblr_pmeyy3eifo1xdxqpgo9_100.jpg",
                        "width": 100,
                        "height": 67
                    },
                    {
                        "url": "https://66.media.tumblr.com/941d1bb52ba03d996076614a14841ec1/tumblr_pmeyy3eifo1xdxqpgo9_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ],
                "exif": {
                    "Camera": "Nikon D3200",
                    "ISO": 360,
                    "Aperture": "f/5.6",
                    "Exposure": "1/125th",
                    "FocalLength": "21mm"
                }
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/c6451a57ed29d6d7acac226ff071779d/tumblr_pmeyy3eifo1xdxqpgo10_1280.jpg",
                    "width": 1280,
                    "height": 851
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/c6451a57ed29d6d7acac226ff071779d/tumblr_pmeyy3eifo1xdxqpgo10_1280.jpg",
                        "width": 1280,
                        "height": 851
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6451a57ed29d6d7acac226ff071779d/tumblr_pmeyy3eifo1xdxqpgo10_640.jpg",
                        "width": 640,
                        "height": 426
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6451a57ed29d6d7acac226ff071779d/tumblr_pmeyy3eifo1xdxqpgo10_540.jpg",
                        "width": 540,
                        "height": 359
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6451a57ed29d6d7acac226ff071779d/tumblr_pmeyy3eifo1xdxqpgo10_500.jpg",
                        "width": 500,
                        "height": 332
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6451a57ed29d6d7acac226ff071779d/tumblr_pmeyy3eifo1xdxqpgo10_400.jpg",
                        "width": 400,
                        "height": 266
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6451a57ed29d6d7acac226ff071779d/tumblr_pmeyy3eifo1xdxqpgo10_250.jpg",
                        "width": 250,
                        "height": 166
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6451a57ed29d6d7acac226ff071779d/tumblr_pmeyy3eifo1xdxqpgo10_100.jpg",
                        "width": 100,
                        "height": 66
                    },
                    {
                        "url": "https://66.media.tumblr.com/c6451a57ed29d6d7acac226ff071779d/tumblr_pmeyy3eifo1xdxqpgo10_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ],
                "exif": {
                    "Camera": "Nikon D3200",
                    "ISO": 280,
                    "Aperture": "f/5.6",
                    "Exposure": "1/125th",
                    "FocalLength": "25mm"
                }
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "link",
        "blog_name": "lushthemagicdragon",
        "blog": {
            "name": "lushthemagicdragon",
            "title": "Oui Oui Mon ami je m'appelle drunk baguette",
            "description": "New Yorker in London<br />\n28<br />\nHe/She <br/>\nWriter<br />\nMuseum Staff<br />\nRavenclaw<br />\nSloth & Envy<br />\nHouse Baratheon<br />\nFree love punk hippie cynic<br />\nLike Cassandra at Troy<br />\nFilth Gremlin<br />\n<br />\n<a href=\"http://lushthemagicdragon.tumblr.com/tagged/mystuff\">my art and shit<br /></a>\n<a href=\"http://lushthemagicdragon.tumblr.com/tagged/my cosplay\">cosplay stuff</a><br />\n<a href=\"http://lushthemagicdragon.tumblr.com/tagged/miri%20writes\"> my writing</a></br >\n<a href=\"http://lushthemagicdragon.tumblr.com/tagged/about%20me\">about me</a><br />\n<a href=\"http://ko-fi.com/A7782MJL\">Buy me a coffee??</a>\n\n<br />",
            "url": "https://lushthemagicdragon.tumblr.com/",
            "uuid": "t:VhWgXVptbrKzB_6pNzWAUg",
            "updated": 1561746802
        },
        "id": 182943578968,
        "post_url": "https://lushthemagicdragon.tumblr.com/post/182943578968/back-to-the-worms-where-you-belong",
        "slug": "back-to-the-worms-where-you-belong",
        "date": "2019-02-20 20:57:56 GMT",
        "timestamp": 1550696276,
        "state": "published",
        "format": "html",
        "reblog_key": "YdOk95cA",
        "tags": [
            "miri writes",
            "mystuff",
            "my stuff",
            "critical role",
            "cw: suicide",
            "cw: death",
            "mollymauk tealeaf",
            "caduceus clay",
            "this was a fun fic to write but man it is dark"
        ],
        "short_url": "https://tmblr.co/ZuqoRy2gOINjO",
        "summary": "Back To The Worms Where You Belong - lushthemagicdragon - Critical Role [Archive of Our Own]",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": "Back To The Worms Where You Belong - lushthemagicdragon - Critical Role [Archive of Our Own]",
        "url": "https://archiveofourown.org/works/17865650",
        "link_author": "Organization for Transformative Works",
        "excerpt": "An Archive of Our Own, a project of the Organization for Transformative Works",
        "publisher": "archiveofourown.org",
        "description": "<p>I wrote this for an x-mas exchange, and it is REALLY fucking dark. Which, admittedly, seems to be my MO as the last fic I posted had child death in it. <br/>CW: Suicide attempts and death in this one. </p><p>\n\n<b>Back To The Worms Where You Belong<br/></b>No ship, Caduceus Clay and Mollymauk Tealeaf<br/>Critical Role<br/>Rated M<br/>CW WARNING FOR SUICIDE ATTEMPTS AND DEATH-BASED THINGS.</p><p><a href=\"https://archiveofourown.org/works/17865650\">Here</a> @ AO3\n\n<br/></p><hr><p>By the time that Mollymauk pushed his way through the packed dirt of his frigid grave, he had died four times. The first time, so far away from here in a world of colour and fancy, his will to live and the drive of whatever force had breathed a second chance into his body had him clawing through the fresh, warm dirt until he was gasping for breathe with no words or name to claim as his own. The soil had not been packed well by cat or man. It was soft, and while brown flecks had remained embedded in his teeth and nails for weeks, the effort had not broken skin.</p><!-- more --><p>The second and third times Molly woke up in his grave, the earth was frozen from the northern winter chill. It had frozen so solidly that it did not fill his mouth when he gasped for air and tried to cry out. He couldn’t make it out.</p><p>The fourth time that Molly woke from the dead the winter snow had melted, sinking into the soil that had trapped him months earlier. He woke up feeling damp, with a trickle of water against his ears. The nails that he could not remember scratching and breaking against the frozen dirt pulled and tugged him out into the open air. He wheezed and he wept, scrambling away from the near frozen tomb. He couldn&rsquo;t remember what had scared him so severely, but the crunch of ice under now bruised knees, palms, elbows and bloodied fingers sent his stomach turning and his throat retching up nothing but newly thawed stomach acid in lingering panic.</p><p>Mollymauk came back with no memory each time. The first he had been left with nothing. The second and third found him trapped. The fourth came with panic, a pounding headache, and then a soft voice nearby.</p><p>“I was wondering when you would come out of there. It’s been a few months, but your friends really hoped that you would.”</p><p>“Here you go, this should warm you up.” The tea cup in Molly’s hands was the first truly warm sensation that he could recall. It seeped in through the crevices of his fingerprints like the coat wrapped around his body couldn’t. The tall man that found him, that had hefted him into a cart and took Molly to the warmth of his home had wrapped the thing around Molly’s body like it mattered. He said something about that coat being Molly’s.  It rang no bells in Molly’s ears, sounded no alarm. All that it was was not warm enough.</p><p>“My names Caduceus. Caduceus Clay.  Do you remember your name?”</p><p>Silence. Molly opened his mouth. Closed it. There was nothing. The emptiness was dizzying.</p><p>“Well that’s no good.”</p><p>The scraping of a chair on the ground broke the silence and, finally sitting, Caduceus nodded, and he smiled. He spoke slowly, like the words themselves took time to carry.</p><p>“You’ve got some friends out there who think you’re dead, but after what they told me&hellip;Well, I’m not really a fan of anyone raising from the dead like you did but I’ll admit, you had me curious, and I needed to make sure. They said your name’s Molly. Can you say Molly for me?”</p><p>He opened his mouth again. He tried to speak, and all that passed through his lips was a weak rasp. <i>Molly</i>.  The sound of it couldn’t find his tongue. The back of his eyes prickled, and he just couldn’t grasp it.</p><p>“That’s alright.  We’ll get you there. Drink that tea, it’ll help.”</p><p>Caduceus smiled with such gentle surety that Molly believed him, and he drank.</p><p>Grief is a funny thing. Sometimes, it creeps up without anyone knowing it’s there at all. It can come out screaming, or sink you deep into a void where nothing moves for miles and miles. Caduceus had seen grief in its many forms. He had seen it in the living, the dying, and the dead. The dead, he’s found, grieve in stunned silence more often than not. They grieve viscerally, because they are in all senses of the word no longer attached. For his whole life Caduceus had worked with death and its griefs, and for five days Caduceus Clay worked on Molly. For five days he sat with him, talked with a practiced softness about nothing, with all the care he had worked his whole life to perfect. They picked leaves and vegetables from the garden, and Molly was alright. They dried out mushrooms and kept the dead company at their graves, and Molly was alright. Molly was alive, slowly finding words on his tongue, remembered nothing, but he was alright.</p><p>He was alright until he wasn’t, but that’s always the way with grief.</p><p>Caduceus stitched up the wounds on his wrists with a steady hand, the ones that had made the knife in Molly’s hand glow and caused him to call out in surprise.  The wounds whose whole purpose of being was to bleed, and whose blood alerted Caduceus to their presence in the night. The stitches were perfect, masterfully done Molly imagined, with no frame of reference beyond how even they look in his skin.  Big, gentle hands wiped the blood away with a warm cloth, and that prickle in the back of his eyes came again at the sensation. His eyes were wet but there were no tears. No pain, no numbness, only the warmth of Caduceus’ hand that seemed that it could never reach his insides at that magnitude.</p><p><i>You shouldn’t be alive and you know it</i>. a voice had spoken into Molly’s ear off the wing of some black-feathered bird passing ahead in the dead of night. It rang through straight to his core where the emptiness sat. No memories, no life, no connection to the names he was supposed to know, the people he was supposed to care for. Covered in scars he couldn’t recall or identify, what would one more set do?</p><p>“I don’t want this.” Molly’s voice didn’t shake. It darted out past his tongue like a scared snake, and receded again.</p><p>“I know.”</p><p>“Why won’t you just let me die?”</p><p>Caduceus sighed, took a beat before sitting down on his haunches and looked at Molly from his position of care on the floor.</p><p>“I’ve been in this house my whole life, taking care of those graves and the people who belong to them. All of my family have gone looking for some way to save this place, but I stayed here, because the Wildmother needed me to. I’ve been looking for a sign from her for what to do next, for something important that I need to do. If you excuse what uh, might sound a little crass&hellip;Well, I think you might be it.”</p><p>“I don’t care that you think I’m important. I shouldn’t be alive.”</p><p>The void pricked at the back of Molly’s eyes again, and it echoed inside his stomach. His voice wavered like it could crack. There was nothing. He was grasping at straws to find any reason at all to exist and all he that he found is nothing.</p><p>“No, you shouldn’t be.”</p><p>“What?”</p><p>“Death should be a natural thing. Everything dies eventually, and they go back to the earth where they came from. Death is&hellip;random, and a lot of the time it comes when maybe it shouldn’t, but it comes anyway. Now I don’t know how you died the first time, or if it even was the first time. This time you died badly, but you still died. You should have stayed dead, and I think that because you didn’t, something else must have taken your place. That&hellip;That&rsquo;s not a good thing at all. You won’t die if you kill yourself like this. You’ll only make all of whatever this is worse, and who knows what will happen to you if you keep coming back from the dead. <i>This</i>, how you are right now, is unnatural. Going back into the dirt right now, the way you are, is even worse. Stay alive. Something is taking your place, surely.”</p><p>Grief, Caduceus has found over the years, takes many forms. It shows it’s soft underbelly and pretends that it wants the gentle caress of comfort.  It curls into a ball with it’s spikes and points pointing outwards, threatening, wanting no touch at all, as if getting on the defensive means that all it has to do is wait until the danger has passed. More often than not though, he’s found that a gentle caress, or simply walking away from the defensive barbs doesn’t help. It isn’t, at the end, what grief always needs. Sometimes it needs honesty, a grounding in reality that feels safe. Grief is terribly afraid of what comes next, if anything at all. The truth hurts enough to uncurl the defensive barbs and expose the stomach to the care it needs, and Mollymauk felt alone when he began to cry.  He clutched at his own wrists like he could tear the good stitching out, and the words he couldn’t find didn’t come. The hollowness bled and filled, remained hollow, bled and filled again to the brim and drained its excess.</p><p>“Hey, come here now,” Comforting words came with the strong embrace of Caduceus’ arms as he pulled Mollymauk into his chest, caressed his hair, let that very alive dead thing empty his fear into Caduceus’ chest. “You’re going to be fine. I’ve got you. Well get you back in the ground later but right now, you get to live.”</p>",
        "description_abstract": "\n<p>I wrote this for an x-mas exchange, and it is REALLY fucking dark. Which, admittedly, seems to be my MO as the last fic I posted had child death in it.&nbsp;<br>CW: Suicide attempts and death in this one.&nbsp;</p>\n<p>\n\n<b>Back To The Worms Where You Belong<br></b>No ship, Caduceus Clay and Mollymauk Tealeaf<br>Critical Role<br>Rated M<br>CW WARNING FOR SUICIDE ATTEMPTS AND DEATH-BASED THINGS.</p>\n<p><a href=\"https://archiveofourown.org/works/17865650\">Here</a> @ AO3\n\n<br></p>\n<hr>\n<p>By the time that Mollymauk pushed his way through the packed dirt of his frigid grave, he had died four times. The first time, so far away from here in a world of colour and fancy, his will to live and the drive of whatever force had breathed a second chance into his body had him clawing through the fresh, warm dirt until he was gasping for breathe with no words or name to claim as his own. The soil had not been packed well by cat or man. It was soft, and while brown flecks had remained embedded in his teeth and nails for weeks, the effort had not broken skin.</p>\n",
        "reblog": {
            "comment": "<p>I wrote this for an x-mas exchange, and it is REALLY fucking dark. Which, admittedly, seems to be my MO as the last fic I posted had child death in it. <br>CW: Suicide attempts and death in this one. </p><p>\n\n<b>Back To The Worms Where You Belong<br></b>No ship, Caduceus Clay and Mollymauk Tealeaf<br>Critical Role<br>Rated M<br>CW WARNING FOR SUICIDE ATTEMPTS AND DEATH-BASED THINGS.</p><p><a href=\"https://archiveofourown.org/works/17865650\">Here</a> @ AO3\n\n<br></p><hr><p>By the time that Mollymauk pushed his way through the packed dirt of his frigid grave, he had died four times. The first time, so far away from here in a world of colour and fancy, his will to live and the drive of whatever force had breathed a second chance into his body had him clawing through the fresh, warm dirt until he was gasping for breathe with no words or name to claim as his own. The soil had not been packed well by cat or man. It was soft, and while brown flecks had remained embedded in his teeth and nails for weeks, the effort had not broken skin.</p>[[MORE]]<p>The second and third times Molly woke up in his grave, the earth was frozen from the northern winter chill. It had frozen so solidly that it did not fill his mouth when he gasped for air and tried to cry out. He couldn’t make it out.</p><p>The fourth time that Molly woke from the dead the winter snow had melted, sinking into the soil that had trapped him months earlier. He woke up feeling damp, with a trickle of water against his ears. The nails that he could not remember scratching and breaking against the frozen dirt pulled and tugged him out into the open air. He wheezed and he wept, scrambling away from the near frozen tomb. He couldn’t remember what had scared him so severely, but the crunch of ice under now bruised knees, palms, elbows and bloodied fingers sent his stomach turning and his throat retching up nothing but newly thawed stomach acid in lingering panic.</p><p>Mollymauk came back with no memory each time. The first he had been left with nothing. The second and third found him trapped. The fourth came with panic, a pounding headache, and then a soft voice nearby.</p><p>“I was wondering when you would come out of there. It’s been a few months, but your friends really hoped that you would.”</p><p>“Here you go, this should warm you up.” The tea cup in Molly’s hands was the first truly warm sensation that he could recall. It seeped in through the crevices of his fingerprints like the coat wrapped around his body couldn’t. The tall man that found him, that had hefted him into a cart and took Molly to the warmth of his home had wrapped the thing around Molly’s body like it mattered. He said something about that coat being Molly’s.  It rang no bells in Molly’s ears, sounded no alarm. All that it was was not warm enough.</p><p>“My names Caduceus. Caduceus Clay.  Do you remember your name?”</p><p>Silence. Molly opened his mouth. Closed it. There was nothing. The emptiness was dizzying.</p><p>“Well that’s no good.”</p><p>The scraping of a chair on the ground broke the silence and, finally sitting, Caduceus nodded, and he smiled. He spoke slowly, like the words themselves took time to carry.</p><p>“You’ve got some friends out there who think you’re dead, but after what they told me…Well, I’m not really a fan of anyone raising from the dead like you did but I’ll admit, you had me curious, and I needed to make sure. They said your name’s Molly. Can you say Molly for me?”</p><p>He opened his mouth again. He tried to speak, and all that passed through his lips was a weak rasp. <i>Molly</i>.  The sound of it couldn’t find his tongue. The back of his eyes prickled, and he just couldn’t grasp it.</p><p>“That’s alright.  We’ll get you there. Drink that tea, it’ll help.”</p><p>Caduceus smiled with such gentle surety that Molly believed him, and he drank.</p><p>Grief is a funny thing. Sometimes, it creeps up without anyone knowing it’s there at all. It can come out screaming, or sink you deep into a void where nothing moves for miles and miles. Caduceus had seen grief in its many forms. He had seen it in the living, the dying, and the dead. The dead, he’s found, grieve in stunned silence more often than not. They grieve viscerally, because they are in all senses of the word no longer attached. For his whole life Caduceus had worked with death and its griefs, and for five days Caduceus Clay worked on Molly. For five days he sat with him, talked with a practiced softness about nothing, with all the care he had worked his whole life to perfect. They picked leaves and vegetables from the garden, and Molly was alright. They dried out mushrooms and kept the dead company at their graves, and Molly was alright. Molly was alive, slowly finding words on his tongue, remembered nothing, but he was alright.</p><p>He was alright until he wasn’t, but that’s always the way with grief.</p><p>Caduceus stitched up the wounds on his wrists with a steady hand, the ones that had made the knife in Molly’s hand glow and caused him to call out in surprise.  The wounds whose whole purpose of being was to bleed, and whose blood alerted Caduceus to their presence in the night. The stitches were perfect, masterfully done Molly imagined, with no frame of reference beyond how even they look in his skin.  Big, gentle hands wiped the blood away with a warm cloth, and that prickle in the back of his eyes came again at the sensation. His eyes were wet but there were no tears. No pain, no numbness, only the warmth of Caduceus’ hand that seemed that it could never reach his insides at that magnitude.</p><p><i>You shouldn’t be alive and you know it</i>. a voice had spoken into Molly’s ear off the wing of some black-feathered bird passing ahead in the dead of night. It rang through straight to his core where the emptiness sat. No memories, no life, no connection to the names he was supposed to know, the people he was supposed to care for. Covered in scars he couldn’t recall or identify, what would one more set do?</p><p>“I don’t want this.” Molly’s voice didn’t shake. It darted out past his tongue like a scared snake, and receded again.</p><p>“I know.”</p><p>“Why won’t you just let me die?”</p><p>Caduceus sighed, took a beat before sitting down on his haunches and looked at Molly from his position of care on the floor.</p><p>“I’ve been in this house my whole life, taking care of those graves and the people who belong to them. All of my family have gone looking for some way to save this place, but I stayed here, because the Wildmother needed me to. I’ve been looking for a sign from her for what to do next, for something important that I need to do. If you excuse what uh, might sound a little crass…Well, I think you might be it.”</p><p>“I don’t care that you think I’m important. I shouldn’t be alive.”</p><p>The void pricked at the back of Molly’s eyes again, and it echoed inside his stomach. His voice wavered like it could crack. There was nothing. He was grasping at straws to find any reason at all to exist and all he that he found is nothing.</p><p>“No, you shouldn’t be.”</p><p>“What?”</p><p>“Death should be a natural thing. Everything dies eventually, and they go back to the earth where they came from. Death is…random, and a lot of the time it comes when maybe it shouldn’t, but it comes anyway. Now I don’t know how you died the first time, or if it even was the first time. This time you died badly, but you still died. You should have stayed dead, and I think that because you didn’t, something else must have taken your place. That…That’s not a good thing at all. You won’t die if you kill yourself like this. You’ll only make all of whatever this is worse, and who knows what will happen to you if you keep coming back from the dead. <i>This</i>, how you are right now, is unnatural. Going back into the dirt right now, the way you are, is even worse. Stay alive. Something is taking your place, surely.”</p><p>Grief, Caduceus has found over the years, takes many forms. It shows it’s soft underbelly and pretends that it wants the gentle caress of comfort.  It curls into a ball with it’s spikes and points pointing outwards, threatening, wanting no touch at all, as if getting on the defensive means that all it has to do is wait until the danger has passed. More often than not though, he’s found that a gentle caress, or simply walking away from the defensive barbs doesn’t help. It isn’t, at the end, what grief always needs. Sometimes it needs honesty, a grounding in reality that feels safe. Grief is terribly afraid of what comes next, if anything at all. The truth hurts enough to uncurl the defensive barbs and expose the stomach to the care it needs, and Mollymauk felt alone when he began to cry.  He clutched at his own wrists like he could tear the good stitching out, and the words he couldn’t find didn’t come. The hollowness bled and filled, remained hollow, bled and filled again to the brim and drained its excess.</p><p>“Hey, come here now,” Comforting words came with the strong embrace of Caduceus’ arms as he pulled Mollymauk into his chest, caressed his hair, let that very alive dead thing empty his fear into Caduceus’ chest. “You’re going to be fine. I’ve got you. Well get you back in the ground later but right now, you get to live.”</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "lushthemagicdragon",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 670,
                        "header_focus_width": 500,
                        "header_focus_height": 282,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "356,500,638,0",
                        "header_image": "https://static.tumblr.com/7bd34996eb7b6162456184cb5b6ab001/xykwwkq/m5qn5y0rm/tumblr_static_4lhc4hid87i8kwogsko04ggsk.png",
                        "header_image_focused": "https://static.tumblr.com/7bd34996eb7b6162456184cb5b6ab001/xykwwkq/mNbn5y0rn/tumblr_static_tumblr_static_4lhc4hid87i8kwogsko04ggsk_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/7bd34996eb7b6162456184cb5b6ab001/xykwwkq/m5qn5y0rm/tumblr_static_4lhc4hid87i8kwogsko04ggsk_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943578968"
                },
                "content_raw": "<p>I wrote this for an x-mas exchange, and it is REALLY fucking dark. Which, admittedly, seems to be my MO as the last fic I posted had child death in it. <br>CW: Suicide attempts and death in this one. </p><p>\n\n<b>Back To The Worms Where You Belong<br></b>No ship, Caduceus Clay and Mollymauk Tealeaf<br>Critical Role<br>Rated M<br>CW WARNING FOR SUICIDE ATTEMPTS AND DEATH-BASED THINGS.</p><p><a href=\"https://archiveofourown.org/works/17865650\">Here</a> @ AO3\n\n<br></p><hr><p>By the time that Mollymauk pushed his way through the packed dirt of his frigid grave, he had died four times. The first time, so far away from here in a world of colour and fancy, his will to live and the drive of whatever force had breathed a second chance into his body had him clawing through the fresh, warm dirt until he was gasping for breathe with no words or name to claim as his own. The soil had not been packed well by cat or man. It was soft, and while brown flecks had remained embedded in his teeth and nails for weeks, the effort had not broken skin.</p>[[MORE]]<p>The second and third times Molly woke up in his grave, the earth was frozen from the northern winter chill. It had frozen so solidly that it did not fill his mouth when he gasped for air and tried to cry out. He couldn’t make it out.</p><p>The fourth time that Molly woke from the dead the winter snow had melted, sinking into the soil that had trapped him months earlier. He woke up feeling damp, with a trickle of water against his ears. The nails that he could not remember scratching and breaking against the frozen dirt pulled and tugged him out into the open air. He wheezed and he wept, scrambling away from the near frozen tomb. He couldn’t remember what had scared him so severely, but the crunch of ice under now bruised knees, palms, elbows and bloodied fingers sent his stomach turning and his throat retching up nothing but newly thawed stomach acid in lingering panic.</p><p>Mollymauk came back with no memory each time. The first he had been left with nothing. The second and third found him trapped. The fourth came with panic, a pounding headache, and then a soft voice nearby.</p><p>“I was wondering when you would come out of there. It’s been a few months, but your friends really hoped that you would.”</p><p>“Here you go, this should warm you up.” The tea cup in Molly’s hands was the first truly warm sensation that he could recall. It seeped in through the crevices of his fingerprints like the coat wrapped around his body couldn’t. The tall man that found him, that had hefted him into a cart and took Molly to the warmth of his home had wrapped the thing around Molly’s body like it mattered. He said something about that coat being Molly’s.  It rang no bells in Molly’s ears, sounded no alarm. All that it was was not warm enough.</p><p>“My names Caduceus. Caduceus Clay.  Do you remember your name?”</p><p>Silence. Molly opened his mouth. Closed it. There was nothing. The emptiness was dizzying.</p><p>“Well that’s no good.”</p><p>The scraping of a chair on the ground broke the silence and, finally sitting, Caduceus nodded, and he smiled. He spoke slowly, like the words themselves took time to carry.</p><p>“You’ve got some friends out there who think you’re dead, but after what they told me…Well, I’m not really a fan of anyone raising from the dead like you did but I’ll admit, you had me curious, and I needed to make sure. They said your name’s Molly. Can you say Molly for me?”</p><p>He opened his mouth again. He tried to speak, and all that passed through his lips was a weak rasp. <i>Molly</i>.  The sound of it couldn’t find his tongue. The back of his eyes prickled, and he just couldn’t grasp it.</p><p>“That’s alright.  We’ll get you there. Drink that tea, it’ll help.”</p><p>Caduceus smiled with such gentle surety that Molly believed him, and he drank.</p><p>Grief is a funny thing. Sometimes, it creeps up without anyone knowing it’s there at all. It can come out screaming, or sink you deep into a void where nothing moves for miles and miles. Caduceus had seen grief in its many forms. He had seen it in the living, the dying, and the dead. The dead, he’s found, grieve in stunned silence more often than not. They grieve viscerally, because they are in all senses of the word no longer attached. For his whole life Caduceus had worked with death and its griefs, and for five days Caduceus Clay worked on Molly. For five days he sat with him, talked with a practiced softness about nothing, with all the care he had worked his whole life to perfect. They picked leaves and vegetables from the garden, and Molly was alright. They dried out mushrooms and kept the dead company at their graves, and Molly was alright. Molly was alive, slowly finding words on his tongue, remembered nothing, but he was alright.</p><p>He was alright until he wasn’t, but that’s always the way with grief.</p><p>Caduceus stitched up the wounds on his wrists with a steady hand, the ones that had made the knife in Molly’s hand glow and caused him to call out in surprise.  The wounds whose whole purpose of being was to bleed, and whose blood alerted Caduceus to their presence in the night. The stitches were perfect, masterfully done Molly imagined, with no frame of reference beyond how even they look in his skin.  Big, gentle hands wiped the blood away with a warm cloth, and that prickle in the back of his eyes came again at the sensation. His eyes were wet but there were no tears. No pain, no numbness, only the warmth of Caduceus’ hand that seemed that it could never reach his insides at that magnitude.</p><p><i>You shouldn’t be alive and you know it</i>. a voice had spoken into Molly’s ear off the wing of some black-feathered bird passing ahead in the dead of night. It rang through straight to his core where the emptiness sat. No memories, no life, no connection to the names he was supposed to know, the people he was supposed to care for. Covered in scars he couldn’t recall or identify, what would one more set do?</p><p>“I don’t want this.” Molly’s voice didn’t shake. It darted out past his tongue like a scared snake, and receded again.</p><p>“I know.”</p><p>“Why won’t you just let me die?”</p><p>Caduceus sighed, took a beat before sitting down on his haunches and looked at Molly from his position of care on the floor.</p><p>“I’ve been in this house my whole life, taking care of those graves and the people who belong to them. All of my family have gone looking for some way to save this place, but I stayed here, because the Wildmother needed me to. I’ve been looking for a sign from her for what to do next, for something important that I need to do. If you excuse what uh, might sound a little crass…Well, I think you might be it.”</p><p>“I don’t care that you think I’m important. I shouldn’t be alive.”</p><p>The void pricked at the back of Molly’s eyes again, and it echoed inside his stomach. His voice wavered like it could crack. There was nothing. He was grasping at straws to find any reason at all to exist and all he that he found is nothing.</p><p>“No, you shouldn’t be.”</p><p>“What?”</p><p>“Death should be a natural thing. Everything dies eventually, and they go back to the earth where they came from. Death is…random, and a lot of the time it comes when maybe it shouldn’t, but it comes anyway. Now I don’t know how you died the first time, or if it even was the first time. This time you died badly, but you still died. You should have stayed dead, and I think that because you didn’t, something else must have taken your place. That…That’s not a good thing at all. You won’t die if you kill yourself like this. You’ll only make all of whatever this is worse, and who knows what will happen to you if you keep coming back from the dead. <i>This</i>, how you are right now, is unnatural. Going back into the dirt right now, the way you are, is even worse. Stay alive. Something is taking your place, surely.”</p><p>Grief, Caduceus has found over the years, takes many forms. It shows it’s soft underbelly and pretends that it wants the gentle caress of comfort.  It curls into a ball with it’s spikes and points pointing outwards, threatening, wanting no touch at all, as if getting on the defensive means that all it has to do is wait until the danger has passed. More often than not though, he’s found that a gentle caress, or simply walking away from the defensive barbs doesn’t help. It isn’t, at the end, what grief always needs. Sometimes it needs honesty, a grounding in reality that feels safe. Grief is terribly afraid of what comes next, if anything at all. The truth hurts enough to uncurl the defensive barbs and expose the stomach to the care it needs, and Mollymauk felt alone when he began to cry.  He clutched at his own wrists like he could tear the good stitching out, and the words he couldn’t find didn’t come. The hollowness bled and filled, remained hollow, bled and filled again to the brim and drained its excess.</p><p>“Hey, come here now,” Comforting words came with the strong embrace of Caduceus’ arms as he pulled Mollymauk into his chest, caressed his hair, let that very alive dead thing empty his fear into Caduceus’ chest. “You’re going to be fine. I’ve got you. Well get you back in the ground later but right now, you get to live.”</p>",
                "content": "<p>I wrote this for an x-mas exchange, and it is REALLY fucking dark. Which, admittedly, seems to be my MO as the last fic I posted had child death in it.&nbsp;<br />CW: Suicide attempts and death in this one.&nbsp;</p><p>\n\n<b>Back To The Worms Where You Belong<br /></b>No ship, Caduceus Clay and Mollymauk Tealeaf<br />Critical Role<br />Rated M<br />CW WARNING FOR SUICIDE ATTEMPTS AND DEATH-BASED THINGS.</p><p><a href=\"https://archiveofourown.org/works/17865650\">Here</a> @ AO3\n\n<br /></p><hr /><p>By the time that Mollymauk pushed his way through the packed dirt of his frigid grave, he had died four times. The first time, so far away from here in a world of colour and fancy, his will to live and the drive of whatever force had breathed a second chance into his body had him clawing through the fresh, warm dirt until he was gasping for breathe with no words or name to claim as his own. The soil had not been packed well by cat or man. It was soft, and while brown flecks had remained embedded in his teeth and nails for weeks, the effort had not broken skin.</p><p>The second and third times Molly woke up in his grave, the earth was frozen from the northern winter chill. It had frozen so solidly that it did not fill his mouth when he gasped for air and tried to cry out. He couldn&rsquo;t make it out.</p><p>The fourth time that Molly woke from the dead the winter snow had melted, sinking into the soil that had trapped him months earlier. He woke up feeling damp, with a trickle of water against his ears. The nails that he could not remember scratching and breaking against the frozen dirt pulled and tugged him out into the open air. He wheezed and he wept, scrambling away from the near frozen tomb. He couldn&rsquo;t remember what had scared him so severely, but the crunch of ice under now bruised knees, palms, elbows and bloodied fingers sent his stomach turning and his throat retching up nothing but newly thawed stomach acid in lingering panic.</p><p>Mollymauk came back with no memory each time. The first he had been left with nothing. The second and third found him trapped. The fourth came with panic, a pounding headache, and then a soft voice nearby.</p><p>&ldquo;I was wondering when you would come out of there. It&rsquo;s been a few months, but your friends really hoped that you would.&rdquo;</p><p>&ldquo;Here you go, this should warm you up.&rdquo; The tea cup in Molly&rsquo;s hands was the first truly warm sensation that he could recall. It seeped in through the crevices of his fingerprints like the coat wrapped around his body couldn&rsquo;t. The tall man that found him, that had hefted him into a cart and took Molly to the warmth of his home had wrapped the thing around Molly&rsquo;s body like it mattered. He said something about that coat being Molly&rsquo;s. &nbsp;It rang no bells in Molly&rsquo;s ears, sounded no alarm. All that it was was not warm enough.</p><p>&ldquo;My names Caduceus. Caduceus Clay. &nbsp;Do you remember your name?&rdquo;</p><p>Silence. Molly opened his mouth. Closed it. There was nothing. The emptiness was dizzying.</p><p>&ldquo;Well that&rsquo;s no good.&rdquo;</p><p>The scraping of a chair on the ground broke the silence and, finally sitting, Caduceus nodded, and he smiled. He spoke slowly, like the words themselves took time to carry.</p><p>&ldquo;You&rsquo;ve got some friends out there who think you&rsquo;re dead, but after what they told me&hellip;Well, I&rsquo;m not really a fan of anyone raising from the dead like you did but I&rsquo;ll admit, you had me curious, and I needed to make sure. They said your name&rsquo;s Molly. Can you say Molly for me?&rdquo;</p><p>He opened his mouth again. He tried to speak, and all that passed through his lips was a weak rasp. <i>Molly</i>. &nbsp;The sound of it couldn&rsquo;t find his tongue. The back of his eyes prickled, and he just couldn&rsquo;t grasp it.</p><p>&ldquo;That&rsquo;s alright. &nbsp;We&rsquo;ll get you there. Drink that tea, it&rsquo;ll help.&rdquo;</p><p>Caduceus smiled with such gentle surety that Molly believed him, and he drank.</p><p>Grief is a funny thing. Sometimes, it creeps up without anyone knowing it&rsquo;s there at all. It can come out screaming, or sink you deep into a void where nothing moves for miles and miles. Caduceus had seen grief in its many forms. He had seen it in the living, the dying, and the dead. The dead, he&rsquo;s found, grieve in stunned silence more often than not. They grieve viscerally, because they are in all senses of the word no longer attached. For his whole life Caduceus had worked with death and its griefs, and for five days Caduceus Clay worked on Molly. For five days he sat with him, talked with a practiced softness about nothing, with all the care he had worked his whole life to perfect. They picked leaves and vegetables from the garden, and Molly was alright. They dried out mushrooms and kept the dead company at their graves, and Molly was alright. Molly was alive, slowly finding words on his tongue, remembered nothing, but he was alright.</p><p>He was alright until he wasn&rsquo;t, but that&rsquo;s always the way with grief.</p><p>Caduceus stitched up the wounds on his wrists with a steady hand, the ones that had made the knife in Molly&rsquo;s hand glow and caused him to call out in surprise. &nbsp;The wounds whose whole purpose of being was to bleed, and whose blood alerted Caduceus to their presence in the night. The stitches were perfect, masterfully done Molly imagined, with no frame of reference beyond how even they look in his skin. &nbsp;Big, gentle hands wiped the blood away with a warm cloth, and that prickle in the back of his eyes came again at the sensation. His eyes were wet but there were no tears. No pain, no numbness, only the warmth of Caduceus&rsquo; hand that seemed that it could never reach his insides at that magnitude.</p><p><i>You shouldn&rsquo;t be alive and you know it</i>. a voice had spoken into Molly&rsquo;s ear off the wing of some black-feathered bird passing ahead in the dead of night. It rang through straight to his core where the emptiness sat. No memories, no life, no connection to the names he was supposed to know, the people he was supposed to care for. Covered in scars he couldn&rsquo;t recall or identify, what would one more set do?</p><p>&ldquo;I don&rsquo;t want this.&rdquo; Molly&rsquo;s voice didn&rsquo;t shake. It darted out past his tongue like a scared snake, and receded again.</p><p>&ldquo;I know.&rdquo;</p><p>&ldquo;Why won&rsquo;t you just let me die?&rdquo;</p><p>Caduceus sighed, took a beat before sitting down on his haunches and looked at Molly from his position of care on the floor.</p><p>&ldquo;I&rsquo;ve been in this house my whole life, taking care of those graves and the people who belong to them. All of my family have gone looking for some way to save this place, but I stayed here, because the Wildmother needed me to. I&rsquo;ve been looking for a sign from her for what to do next, for something important that I need to do. If you excuse what uh, might sound a little crass&hellip;Well, I think you might be it.&rdquo;</p><p>&ldquo;I don&rsquo;t care that you think I&rsquo;m important. I shouldn&rsquo;t be alive.&rdquo;</p><p>The void pricked at the back of Molly&rsquo;s eyes again, and it echoed inside his stomach. His voice wavered like it could crack. There was nothing. He was grasping at straws to find any reason at all to exist and all he that he found is nothing.</p><p>&ldquo;No, you shouldn&rsquo;t be.&rdquo;</p><p>&ldquo;What?&rdquo;</p><p>&ldquo;Death should be a natural thing. Everything dies eventually, and they go back to the earth where they came from. Death is&hellip;random, and a lot of the time it comes when maybe it shouldn&rsquo;t, but it comes anyway. Now I don&rsquo;t know how you died the first time, or if it even was the first time. This time you died badly, but you still died. You should have stayed dead, and I think that because you didn&rsquo;t, something else must have taken your place. That&hellip;That&rsquo;s not a good thing at all. You won&rsquo;t die if you kill yourself like this. You&rsquo;ll only make all of whatever this is worse, and who knows what will happen to you if you keep coming back from the dead. <i>This</i>, how you are right now, is unnatural. Going back into the dirt right now, the way you are, is even worse. Stay alive. Something is taking your place, surely.&rdquo;</p><p>Grief, Caduceus has found over the years, takes many forms. It shows it&rsquo;s soft underbelly and pretends that it wants the gentle caress of comfort. &nbsp;It curls into a ball with it&rsquo;s spikes and points pointing outwards, threatening, wanting no touch at all, as if getting on the defensive means that all it has to do is wait until the danger has passed. More often than not though, he&rsquo;s found that a gentle caress, or simply walking away from the defensive barbs doesn&rsquo;t help. It isn&rsquo;t, at the end, what grief always needs. Sometimes it needs honesty, a grounding in reality that feels safe. Grief is terribly afraid of what comes next, if anything at all. The truth hurts enough to uncurl the defensive barbs and expose the stomach to the care it needs, and Mollymauk felt alone when he began to cry. &nbsp;He clutched at his own wrists like he could tear the good stitching out, and the words he couldn&rsquo;t find didn&rsquo;t come. The hollowness bled and filled, remained hollow, bled and filled again to the brim and drained its excess.</p><p>&ldquo;Hey, come here now,&rdquo; Comforting words came with the strong embrace of Caduceus&rsquo; arms as he pulled Mollymauk into his chest, caressed his hair, let that very alive dead thing empty his fear into Caduceus&rsquo; chest. &ldquo;You&rsquo;re going to be fine. I&rsquo;ve got you. Well get you back in the ground later but right now, you get to live.&rdquo;</p>",
                "content_abstract": "<p>\n<p>I wrote this for an x-mas exchange, and it is REALLY fucking dark. Which, admittedly, seems to be my MO as the last fic I posted had child death in it.&nbsp;<br />CW: Suicide attempts and death in this one.&nbsp;</p>\n<p>\n\n<b>Back To The Worms Where You Belong<br /></b>No ship, Caduceus Clay and Mollymauk Tealeaf<br />Critical Role<br />Rated M<br />CW WARNING FOR SUICIDE ATTEMPTS AND DEATH-BASED THINGS.</p>\n<p><a href=\"https://archiveofourown.org/works/17865650\">Here</a> @ AO3\n\n<br /></p>\n<hr />\n<p>By the time that Mollymauk pushed his way through the packed dirt of his frigid grave, he had died four times. The first time, so far away from here in a world of colour and fancy, his will to live and the drive of whatever force had breathed a second chance into his body had him clawing through the fresh, warm dirt until he was gasping for breathe with no words or name to claim as his own. The soil had not been packed well by cat or man. It was soft, and while brown flecks had remained embedded in his teeth and nails for weeks, the effort had not broken skin.</p>\n</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "glassesanddreads",
        "blog": {
            "name": "glassesanddreads",
            "title": "emotional resonance and rocket launchers",
            "description": "<p>\n<p> - <a href=\"/tagged/my-face\">stevie</a>. she/her. trans lesbian. 28. MA, USA. <p>@gayvalkyries on twitter.\n<p>\n- <a href=\"https://www.instagram.com/steviemilitello/\">instagram</a> // <a href=\"/socialmedia\">+</a> // - ask for snapchat etc. - \n<p>\n- Watching - Schitt's Creek<br>\n- Reading - A Darker Shade of Magic<br>\n- Playing - Assassin's Creed: Odyssey",
            "url": "https://glassesanddreads.tumblr.com/",
            "uuid": "t:pAweS65GULmhtWhBubVa_Q",
            "updated": 1561752379
        },
        "id": 182943567098,
        "post_url": "https://glassesanddreads.tumblr.com/post/182943567098/jester-how-was-your-day-traveler-i-also-had",
        "slug": "jester-how-was-your-day-traveler-i-also-had",
        "date": "2019-02-20 20:57:18 GMT",
        "timestamp": 1550696238,
        "state": "published",
        "format": "html",
        "reblog_key": "qALw7c5i",
        "tags": [
            "jester lavorre",
            "critical role",
            "orphan black",
            "my text posts",
            "text posts"
        ],
        "short_url": "https://tmblr.co/ZTfgEq2gOIKpw",
        "summary": "jester: “how was your day, traveler? I also had pleasant day. I went working and shopping.”",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 34,
        "title": null,
        "body": "<p>jester: “how was your day, traveler? I also had pleasant day. I went working and shopping.”</p>",
        "reblog": {
            "comment": "<p>jester: “how was your day, traveler? I also had pleasant day. I went working and shopping.”</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "glassesanddreads",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#F6F6F6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/34a79d6d83c3b58865dfce78ca16310d/xbexmwc/oBrntk1p0/tumblr_static_er8d4ojnqzkk4ooog4coc04cw.gif",
                        "header_image_focused": "https://static.tumblr.com/34a79d6d83c3b58865dfce78ca16310d/xbexmwc/oBrntk1p0/tumblr_static_er8d4ojnqzkk4ooog4coc04cw_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/34a79d6d83c3b58865dfce78ca16310d/xbexmwc/oBrntk1p0/tumblr_static_er8d4ojnqzkk4ooog4coc04cw_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943567098"
                },
                "content_raw": "<p>jester: “how was your day, traveler? I also had pleasant day. I went working and shopping.”</p>",
                "content": "<p>jester:&nbsp;&ldquo;how was your day, traveler? I also had pleasant day. I went working and shopping.&rdquo;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "chucktaylorupset",
        "blog": {
            "name": "chucktaylorupset",
            "title": "Resurrection Needed: Cause of Death, CR EP69",
            "description": "She/Her, Call me Chuck. Terrifyingly, Technically an Adult.",
            "url": "https://chucktaylorupset.tumblr.com/",
            "uuid": "t:7wj7aOl35Gzq26e2pxuVgg",
            "updated": 1561745252
        },
        "id": 182943459728,
        "post_url": "https://chucktaylorupset.tumblr.com/post/182943459728/hey-widofjord-shippers-how-many-of-you-were",
        "slug": "hey-widofjord-shippers-how-many-of-you-were",
        "date": "2019-02-20 20:51:42 GMT",
        "timestamp": 1550695902,
        "state": "published",
        "format": "html",
        "reblog_key": "wXPZEMdH",
        "tags": [
            "cr2",
            "critical role",
            "widofjord",
            "fjord",
            "caleb widogast",
            "my post",
            "im just curious"
        ],
        "short_url": "https://tmblr.co/ZgP6sk2gOHwcG",
        "summary": "hey widofjord shippers, how many of you were excited when fjord slept with avantika and y’all got inexorable proof that fjord’s...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 47,
        "title": null,
        "body": "<p>hey widofjord shippers, how many of you were excited when fjord slept with avantika and y’all got inexorable proof that fjord’s into redheads </p>",
        "reblog": {
            "comment": "<p>hey widofjord shippers, how many of you were excited when fjord slept with avantika and y’all got inexorable proof that fjord’s into redheads </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "chucktaylorupset",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_07.png?_v=c52eb3e7fd4be5c98b8970b4c330d172",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_07.png?_v=c52eb3e7fd4be5c98b8970b4c330d172",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_07.png?_v=c52eb3e7fd4be5c98b8970b4c330d172",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943459728"
                },
                "content_raw": "<p>hey widofjord shippers, how many of you were excited when fjord slept with avantika and y’all got inexorable proof that fjord’s into redheads </p>",
                "content": "<p>hey widofjord shippers, how many of you were excited when fjord slept with avantika and y&rsquo;all got inexorable proof that fjord&rsquo;s into redheads&nbsp;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "transct-5385",
        "blog": {
            "name": "transct-5385",
            "title": "mouthful of glitter",
            "description": "<p>Life Before Death - Strength Before Weakness -Journey Before Destination</p><p>they/he + black + aries + tired moss goth + ask me about the clone wars</p>",
            "url": "https://transct-5385.tumblr.com/",
            "uuid": "t:aTnjf1brA6rsx0xuUEM3pA",
            "updated": 1555772993
        },
        "id": 182943246903,
        "post_url": "https://transct-5385.tumblr.com/post/182943246903",
        "slug": "",
        "date": "2019-02-20 20:40:33 GMT",
        "timestamp": 1550695233,
        "state": "published",
        "format": "html",
        "reblog_key": "oVXdg8Bn",
        "tags": [
            "uhhhhhh",
            "anyway im no good at digital art but",
            "heres my fave boy",
            "caleb widogast",
            "critical role",
            "mighty nein",
            "cr"
        ],
        "short_url": "https://tmblr.co/ZDmtZd2gOH6et",
        "summary": "",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 99,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"834\"><img src=\"https://66.media.tumblr.com/9365279d2147757de9c13dbe01e4f622/tumblr_pn8s3lcAxA1v1qm8x_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"834\"/></figure>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"834\"><img src=\"https://66.media.tumblr.com/9365279d2147757de9c13dbe01e4f622/tumblr_pn8s3lcAxA1v1qm8x_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"834\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "transct-5385",
                    "active": true,
                    "theme": {
                        "header_full_width": 1000,
                        "header_full_height": 666,
                        "header_focus_width": 920,
                        "header_focus_height": 517,
                        "avatar_shape": "circle",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "74,960,591,40",
                        "header_image": "https://static.tumblr.com/214f72f2e7e0b127bfaad64d5b1ce6a0/juclfqk/W43pn97qh/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/214f72f2e7e0b127bfaad64d5b1ce6a0/juclfqk/gDPpn97qh/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/214f72f2e7e0b127bfaad64d5b1ce6a0/juclfqk/W43pn97qh/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#FFFFFF",
                        "title_font": "Calluna Sans",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943246903"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1280\" data-orig-width=\"834\"><img src=\"https://66.media.tumblr.com/9365279d2147757de9c13dbe01e4f622/tumblr_pn8s3lcAxA1v1qm8x_1280.jpg\" data-orig-height=\"1280\" data-orig-width=\"834\"></figure></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/9365279d2147757de9c13dbe01e4f622/tumblr_pn8s3lcAxA1v1qm8x_1280.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "itskatystark",
        "blog": {
            "name": "itskatystark",
            "title": "You’ve reached the Life-Model Decoy of Katy Stark.",
            "description": "<center>Just a stuck-up, half-witted, scruffy-looking werewolf.<br><br><a href=\"http://itskatystark.tumblr.com/tagged/katy-blogs\">personal posts.</a><br><a href=\"http://itskatystark.tumblr.com/tagged/asks-answered\">answered asks.</a><br><a href=\"http://itskatystark.tumblr.com/tagged/oh-this-is-my-face\">my face.</a><br><a href=\"http://itskatystark.tumblr.com/tagged/my-art\">my art.</a></center>",
            "url": "https://itskatystark.tumblr.com/",
            "uuid": "t:6UzSCnUWKYXhhwjHOmTtHw",
            "updated": 1561687690
        },
        "id": 182943125412,
        "post_url": "https://itskatystark.tumblr.com/post/182943125412/so-ive-been-reading-the-cr-announcement-and",
        "slug": "so-ive-been-reading-the-cr-announcement-and",
        "date": "2019-02-20 20:34:10 GMT",
        "timestamp": 1550694850,
        "state": "published",
        "format": "html",
        "reblog_key": "wd5Junxh",
        "tags": [
            "i mean I still have an account (for d&d beyond)...",
            "but still.... twitch is a little well... twitchy for me",
            "i can’t be the only one?",
            "critical role",
            "my tv",
            "katy blogs"
        ],
        "short_url": "https://tmblr.co/ZxUk9x2gOGe_a",
        "summary": "So I’ve been reading the CR announcement, and forgive me if I sound like a moron, but will we still be able to watch live on...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 9,
        "title": null,
        "body": "<p>So I’ve been reading the CR announcement, and forgive me if I sound like a moron, but will we still be able to watch live on Youtube as well as Twitch? Just on the CR channel instead (like on Twitch)?</p><p>I prefer watching live on Youtube, because with my internet out in the middle of nowhere, Twitch tends to fuck up quite a bit&hellip; I’ll watch the VOD if need be, but I just love watching Live on Thursdays.</p>",
        "reblog": {
            "comment": "<p>So I’ve been reading the CR announcement, and forgive me if I sound like a moron, but will we still be able to watch live on Youtube as well as Twitch? Just on the CR channel instead (like on Twitch)?</p><p>I prefer watching live on Youtube, because with my internet out in the middle of nowhere, Twitch tends to fuck up quite a bit… I’ll watch the VOD if need be, but I just love watching Live on Thursdays.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "itskatystark",
                    "active": true,
                    "theme": {
                        "header_full_width": 2520,
                        "header_full_height": 1368,
                        "header_focus_width": 1737,
                        "header_focus_height": 977,
                        "avatar_shape": "circle",
                        "background_color": "#CCCCCC",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "195,2124,1172,387",
                        "header_image": "https://static.tumblr.com/d72920c0351a0cf1232115cb9699c024/0godpj1/uU8pk8vw9/tumblr_static_11xrt52ztfeow00cwo0c8wcg0.jpg",
                        "header_image_focused": "https://static.tumblr.com/3afbe1026ee93b9483a71f464ebee88d/0godpj1/NrQpk8vwd/tumblr_static_tumblr_static_11xrt52ztfeow00cwo0c8wcg0_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/d72920c0351a0cf1232115cb9699c024/0godpj1/uU8pk8vw9/tumblr_static_11xrt52ztfeow00cwo0c8wcg0_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#86649b",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943125412"
                },
                "content_raw": "<p>So I’ve been reading the CR announcement, and forgive me if I sound like a moron, but will we still be able to watch live on Youtube as well as Twitch? Just on the CR channel instead (like on Twitch)?</p><p>I prefer watching live on Youtube, because with my internet out in the middle of nowhere, Twitch tends to fuck up quite a bit… I’ll watch the VOD if need be, but I just love watching Live on Thursdays.</p>",
                "content": "<p>So I&rsquo;ve been reading the CR announcement, and forgive me if I sound like a moron, but will we still be able to watch live on Youtube as well as Twitch? Just on the CR channel instead (like on Twitch)?</p><p>I prefer watching live on Youtube, because with my internet out in the middle of nowhere, Twitch tends to fuck up quite a bit&hellip; I&rsquo;ll watch the VOD if need be, but I just love watching Live on Thursdays.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "just-things-i-like-mostly",
        "blog": {
            "name": "just-things-i-like-mostly",
            "title": "What should I call this anyway?",
            "description": "Just some things I like (HP, FBawtft, LotRs/Hobbit, Nature, Animals, Good News that sort of thing),... or find stupid occasionally (Trump and the like nuff said)... about me: female, demisexual, INFJ, Slytherin, Aquarius, fangirl, multiple pairing shipper (ship wars are stupid, ship what you like, enjoy your day while you do it).",
            "url": "https://just-things-i-like-mostly.tumblr.com/",
            "uuid": "t:sbM4CTFMWncdXxo432ICYQ",
            "updated": 1561569112
        },
        "id": 182943061639,
        "post_url": "https://just-things-i-like-mostly.tumblr.com/post/182943061639/so-im-rewatching-campaign-2-of-critical-role-and",
        "slug": "so-im-rewatching-campaign-2-of-critical-role-and",
        "date": "2019-02-20 20:30:51 GMT",
        "timestamp": 1550694651,
        "state": "published",
        "format": "html",
        "reblog_key": "EN0UEt6k",
        "tags": [
            "you're a halfling you go talk to him",
            "critical role",
            "mighty nein",
            "critical role spoilers",
            "cr spoilers",
            "did i mention the",
            "spoilers"
        ],
        "short_url": "https://tmblr.co/ZSAq6r2gOGPQ7",
        "summary": "so... i’m rewatching campaign 2 of critical role and I’m watching episode 6 and... Laura actually accidentally spoils the big...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": null,
        "body": "<p>so&hellip; i’m rewatching campaign 2 of critical role and I’m watching episode 6 and&hellip; Laura actually accidentally spoils the big episode 49 (or was it 50) “everything that Nott is not” reveal.</p>",
        "reblog": {
            "comment": "<p>so… i’m rewatching campaign 2 of critical role and I’m watching episode 6 and… Laura actually accidentally spoils the big episode 49 (or was it 50) “everything that Nott is not” reveal.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "just-things-i-like-mostly",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_03.png?_v=a0f20b51ed40eb5a930ab86effe42a40",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_03.png?_v=a0f20b51ed40eb5a930ab86effe42a40",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_03.png?_v=a0f20b51ed40eb5a930ab86effe42a40",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182943061639"
                },
                "content_raw": "<p>so… i’m rewatching campaign 2 of critical role and I’m watching episode 6 and… Laura actually accidentally spoils the big episode 49 (or was it 50) “everything that Nott is not” reveal.</p>",
                "content": "<p>so&hellip; i&rsquo;m rewatching campaign 2 of critical role and I&rsquo;m watching episode 6 and&hellip; Laura actually accidentally spoils the big episode 49 (or was it 50) &ldquo;everything that Nott is not&rdquo; reveal.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "link",
        "blog_name": "ceryneian-archer",
        "blog": {
            "name": "ceryneian-archer",
            "title": "Ceryneian archer",
            "description": "leatherworker, illustrator, archer - Noor Beun leatherworks on Etsy",
            "url": "https://ceryneian-archer.tumblr.com/",
            "uuid": "t:nV0fzzO2H-5p6QPk-SY9Ag",
            "updated": 1560958231
        },
        "id": 182942995908,
        "post_url": "https://ceryneian-archer.tumblr.com/post/182942995908/ceryneian-archer-on-twitter",
        "slug": "ceryneian-archer-on-twitter",
        "date": "2019-02-20 20:27:25 GMT",
        "timestamp": 1550694445,
        "state": "published",
        "format": "html",
        "reblog_key": "isQLk09Q",
        "tags": [
            "gilded archive",
            "leatherwork",
            "livestream",
            "kickstar",
            "critical role",
            "critical role fanart",
            "tusk love",
            "smutty",
            "and we all love it",
            "dungeons and dragons",
            "dnd"
        ],
        "short_url": "https://tmblr.co/ZxRBLs2gOG9N4",
        "summary": "Ceryneian Archer on Twitter",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 4,
        "title": "Ceryneian Archer on Twitter",
        "url": "https://twitter.com/CeryneianA/status/1098306652929957893",
        "link_image": "https://66.media.tumblr.com/d2c0fc1ba1369e52d347c8785810b1c2/tumblr_pn8rhp5ix71spb56c_og_540.jpg",
        "link_image_dimensions": {
            "width": 400,
            "height": 400
        },
        "link_author": null,
        "excerpt": "“The sketch for the TUSK LOVE bookcover is done and the final drawing on the way! Next week: livestreaming how I paint the final leather cover! But what time would you guys prefer? ⏰ #gildedarchive #criticalrolefanart #CriticalRoleArt #CriticalRole #Livestream”",
        "publisher": "twitter.com",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/d2c0fc1ba1369e52d347c8785810b1c2/tumblr_pn8rhp5ix71spb56c_og_1280.jpg",
                    "width": 400,
                    "height": 400
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/d2c0fc1ba1369e52d347c8785810b1c2/tumblr_pn8rhp5ix71spb56c_og_400.jpg",
                        "width": 400,
                        "height": 400
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2c0fc1ba1369e52d347c8785810b1c2/tumblr_pn8rhp5ix71spb56c_og_250.jpg",
                        "width": 250,
                        "height": 250
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2c0fc1ba1369e52d347c8785810b1c2/tumblr_pn8rhp5ix71spb56c_og_100.jpg",
                        "width": 100,
                        "height": 100
                    },
                    {
                        "url": "https://66.media.tumblr.com/d2c0fc1ba1369e52d347c8785810b1c2/tumblr_pn8rhp5ix71spb56c_og_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "description": "<p>If you enjoy watching me paint, chat and be weird, you can now help decide at what time I will do my next livestream on Kickstarter next week and tune in! <br/></p><p>I’ll be painting the leather bookcover for <b>TUSK LOVE </b>from <b>Critical Role</b> (a brand new original design by me!) and AMA in the chat! <br/></p><p>If enough people like the cover I’ll add it to the list of designs you can choose from to get your own Player’s Handbook leather jacket. And\nof course\n\n all designs will be available in my Etsy shop when this whole campaign ends!</p><p><a href=\"https://www.kickstarter.com/projects/296689940/the-gilded-archive-a-5e-personal-leather-book-cove?ref=a7wtjm\">Go check out the <b>Kickstarter</b> right now if you want to see all current designs!</a><br/></p>",
        "reblog": {
            "comment": "<p>If you enjoy watching me paint, chat and be weird, you can now help decide at what time I will do my next livestream on Kickstarter next week and tune in! <br></p><p>I’ll be painting the leather bookcover for <b>TUSK LOVE </b>from <b>Critical Role</b> (a brand new original design by me!) and AMA in the chat! <br></p><p>If enough people like the cover I’ll add it to the list of designs you can choose from to get your own Player’s Handbook leather jacket. And\nof course\n\n all designs will be available in my Etsy shop when this whole campaign ends!</p><p><a href=\"https://www.kickstarter.com/projects/296689940/the-gilded-archive-a-5e-personal-leather-book-cove?ref=a7wtjm\">Go check out the <b>Kickstarter</b> right now if you want to see all current designs!</a><br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ceryneian-archer",
                    "active": true,
                    "theme": {
                        "header_full_width": 1372,
                        "header_full_height": 915,
                        "header_focus_width": 1372,
                        "header_focus_height": 771,
                        "avatar_shape": "circle",
                        "background_color": "#f3fbff",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1372,771,0",
                        "header_image": "https://static.tumblr.com/bdb3d96a1faf7a7664c724d329a5d183/c1hllof/13Mpd7403/tumblr_static_ag792xl05uokgok4coso40kgk.jpg",
                        "header_image_focused": "https://static.tumblr.com/bdb3d96a1faf7a7664c724d329a5d183/c1hllof/861pd7407/tumblr_static_tumblr_static_ag792xl05uokgok4coso40kgk_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/bdb3d96a1faf7a7664c724d329a5d183/c1hllof/13Mpd7403/tumblr_static_ag792xl05uokgok4coso40kgk_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#ece8d2",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#857101",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182942995908"
                },
                "content_raw": "<p>If you enjoy watching me paint, chat and be weird, you can now help decide at what time I will do my next livestream on Kickstarter next week and tune in! <br></p><p>I’ll be painting the leather bookcover for <b>TUSK LOVE </b>from <b>Critical Role</b> (a brand new original design by me!) and AMA in the chat! <br></p><p>If enough people like the cover I’ll add it to the list of designs you can choose from to get your own Player’s Handbook leather jacket. And\nof course\n\n all designs will be available in my Etsy shop when this whole campaign ends!</p><p><a href=\"https://www.kickstarter.com/projects/296689940/the-gilded-archive-a-5e-personal-leather-book-cove?ref=a7wtjm\">Go check out the <b>Kickstarter</b> right now if you want to see all current designs!</a><br></p>",
                "content": "<p>If you enjoy watching me paint, chat and be weird, you can now help decide at what time I will do my next livestream on Kickstarter next week and tune in! <br /></p><p>I&rsquo;ll be painting the leather bookcover for <b>TUSK LOVE </b>from <b>Critical Role</b> (a brand new original design by me!) and AMA in the chat! <br /></p><p>If enough people like the cover I&rsquo;ll add it to the list of designs you can choose from to get your own Player&rsquo;s Handbook leather jacket. And\nof course\n\n all designs will be available in my Etsy shop when this whole campaign ends!</p><p><a href=\"https://www.kickstarter.com/projects/296689940/the-gilded-archive-a-5e-personal-leather-book-cove?ref=a7wtjm\">Go check out the <b>Kickstarter</b> right now if you want to see all current designs!</a><br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "isitthursdayyet",
        "blog": {
            "name": "isitthursdayyet",
            "title": "Don't forget to love each other",
            "description": "Header credit : @/mbeechcreative on twitter. Profile credit: @/karekareo on twitter",
            "url": "https://isitthursdayyet.tumblr.com/",
            "uuid": "t:vN6BwSxotJjr7ssV2KuGNg",
            "updated": 1561670345
        },
        "id": 182942968354,
        "post_url": "https://isitthursdayyet.tumblr.com/post/182942968354/is-it-thursday-yet",
        "slug": "is-it-thursday-yet",
        "date": "2019-02-20 20:25:53 GMT",
        "timestamp": 1550694353,
        "state": "published",
        "format": "html",
        "reblog_key": "t6F4JpCi",
        "tags": [
            "ashley johnson",
            "beauregard",
            "caduceus clay",
            "caleb widogast",
            "critical role",
            "is it thursday yet?",
            "jester lavorre",
            "fjord",
            "laura bailey",
            "liam o'brien",
            "marisha ray",
            "matt mercer",
            "matthew mercer",
            "mollymauk",
            "nott the brave",
            "sam riegel",
            "taliesin jaffe",
            "travis willingham",
            "yasha"
        ],
        "short_url": "https://tmblr.co/ZmeMRc2gOG2eY",
        "summary": "Is it Thursday yet?",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 17,
        "title": null,
        "body": "<h1>Is it Thursday yet?</h1><p>Tomorrow!!</p><p>(If you haven&rsquo;t heard, moving on from now, all broadcasts and VODs moving forward of both Critical Role and Talks Machina will only be available on their Twitch and Youtube channels! </p><p>The Search for Grog also has a stream date! This Friday at 7pm PST it will be streamed from the Criical Role Twitch channel, and it will be up on Youtube on Saturday for those people who don&rsquo;t catch it live.)</p>",
        "reblog": {
            "comment": "<p><h1>Is it Thursday yet?</h1><p>Tomorrow!!</p><p>(If you haven’t heard, moving on from now, all broadcasts and VODs moving forward of both Critical Role and Talks Machina will only be available on their Twitch and Youtube channels! </p><p>The Search for Grog also has a stream date! This Friday at 7pm PST it will be streamed from the Criical Role Twitch channel, and it will be up on Youtube on Saturday for those people who don’t catch it live.)</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "isitthursdayyet",
                    "active": true,
                    "theme": {
                        "header_full_width": 1080,
                        "header_full_height": 1920,
                        "header_focus_width": 1080,
                        "header_focus_height": 607,
                        "avatar_shape": "circle",
                        "background_color": "#BAB0B0",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "567,1080,1174,0",
                        "header_image": "https://static.tumblr.com/4a34588a1de3ea46335e199561d01c49/rluqyxu/loZpjfuz3/tumblr_static_-517424668-content.png",
                        "header_image_focused": "https://static.tumblr.com/90c4404d30453dbb2fa15b16a5031cf0/rluqyxu/RJapjg0ck/tumblr_static_tumblr_static_-517424668-content_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/4a34588a1de3ea46335e199561d01c49/rluqyxu/loZpjfuz3/tumblr_static_-517424668-content_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#030D87",
                        "title_font": "Clarendon Text Pro",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182942968354"
                },
                "content_raw": "<p><h1>Is it Thursday yet?</h1><p>Tomorrow!!</p><p>(If you haven’t heard, moving on from now, all broadcasts and VODs moving forward of both Critical Role and Talks Machina will only be available on their Twitch and Youtube channels! </p><p>The Search for Grog also has a stream date! This Friday at 7pm PST it will be streamed from the Criical Role Twitch channel, and it will be up on Youtube on Saturday for those people who don’t catch it live.)</p></p>",
                "content": "<p><h1>Is it Thursday yet?</h1><p>Tomorrow!!</p><p>(If you haven&rsquo;t heard, moving on from now, all broadcasts and VODs moving forward of both Critical Role and Talks Machina will only be available on their Twitch and Youtube channels! </p><p>The Search for Grog also has a stream date! This Friday at 7pm PST it will be streamed from the Criical Role Twitch channel, and it will be up on Youtube on Saturday for those people who don&rsquo;t catch it live.)</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "whatsshecalled",
        "blog": {
            "name": "whatsshecalled",
            "title": "",
            "description": "eliza, 18, 1st year animation student and big ol Critter. star trek side blog is sapphic-saavik",
            "url": "https://whatsshecalled.tumblr.com/",
            "uuid": "t:W3KFYHoWMT-wpmh5kAgjDg",
            "updated": 1560698586
        },
        "id": 182942920854,
        "post_url": "https://whatsshecalled.tumblr.com/post/182942920854/she-had-a-wife",
        "slug": "she-had-a-wife",
        "date": "2019-02-20 20:23:21 GMT",
        "timestamp": 1550694201,
        "state": "published",
        "format": "html",
        "reblog_key": "eORAimxb",
        "tags": [
            "yasha",
            "yasha nydoorin",
            "critical role",
            "ashley johnson",
            "yasha x zuala",
            "zuala nydoorin",
            "tw: death",
            "tw: gore",
            "critical role fanart"
        ],
        "short_url": "https://tmblr.co/ZDO2Re2gOFt2M",
        "summary": "she had a wife.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 635,
        "title": null,
        "body": "<p>she had a wife.</p><figure class=\"tmblr-full\" data-orig-height=\"2739\" data-orig-width=\"2851\"><img src=\"https://66.media.tumblr.com/ce346c7925589c3d56b8b29ea535c015/tumblr_pn8rauw0xy1uhp0o4_540.png\" data-orig-height=\"2739\" data-orig-width=\"2851\"/></figure>",
        "reblog": {
            "comment": "<p><p>she had a wife.</p><figure class=\"tmblr-full\" data-orig-height=\"2739\" data-orig-width=\"2851\"><img src=\"https://66.media.tumblr.com/ce346c7925589c3d56b8b29ea535c015/tumblr_pn8rauw0xy1uhp0o4_540.png\" data-orig-height=\"2739\" data-orig-width=\"2851\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "whatsshecalled",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/d2f01a526dfce60d9013c22e3fd6c343/si4ocmm/Tzzp5jxca/tumblr_static_filename.png",
                        "header_image_focused": "https://static.tumblr.com/d2f01a526dfce60d9013c22e3fd6c343/si4ocmm/Tzzp5jxca/tumblr_static_filename_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/d2f01a526dfce60d9013c22e3fd6c343/si4ocmm/Tzzp5jxca/tumblr_static_filename_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#9DBB7D",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182942920854"
                },
                "content_raw": "<p><p>she had a wife.</p><figure class=\"tmblr-full\" data-orig-height=\"2739\" data-orig-width=\"2851\"><img src=\"https://66.media.tumblr.com/ce346c7925589c3d56b8b29ea535c015/tumblr_pn8rauw0xy1uhp0o4_540.png\" data-orig-height=\"2739\" data-orig-width=\"2851\"></figure></p>",
                "content": "<p><p>she had a wife.</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/ce346c7925589c3d56b8b29ea535c015/tumblr_pn8rauw0xy1uhp0o4_540.png\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "squiishiichaos",
        "blog": {
            "name": "squiishiichaos",
            "title": "Welcome to the Squishier Side of Chaos!",
            "description": "Squishi---26---Female.   I'm a self-proclaimed writer working on finishing my first book while getting derailed constantly by new game releases and updating manga. Credit @Spritlezyart (spritlezyart.tumblr.com) for the beautiful new header and thanks to Novallion (novallion.tumblr.com) for letting me use Baby Vani as my avatar!",
            "url": "https://squiishiichaos.tumblr.com/",
            "uuid": "t:C36ARlrOWf5dB_a03KNrHA",
            "updated": 1561304085
        },
        "id": 182942909406,
        "post_url": "https://squiishiichaos.tumblr.com/post/182942909406/preordered-critical-role-prints-before-they",
        "slug": "preordered-critical-role-prints-before-they",
        "date": "2019-02-20 20:22:38 GMT",
        "timestamp": 1550694158,
        "state": "published",
        "format": "html",
        "reblog_key": "K4zaBn59",
        "tags": [
            "by like 2 months",
            "critrole",
            "critical role",
            "those things look cool"
        ],
        "short_url": "https://tmblr.co/ZjqWKX2gOFqFU",
        "summary": "Preordered Critical Role prints before they actually went on sale!  Happy Early Birthday to myself!",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 1,
        "title": null,
        "body": "<p>Preordered Critical Role prints before they actually went on sale!  Happy Early Birthday to myself!</p>",
        "reblog": {
            "comment": "<p>Preordered Critical Role prints before they actually went on sale!  Happy Early Birthday to myself!</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "squiishiichaos",
                    "active": true,
                    "theme": {
                        "header_full_width": 897,
                        "header_full_height": 1196,
                        "header_focus_width": 884,
                        "header_focus_height": 497,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "539,884,1036,0",
                        "header_image": "https://static.tumblr.com/c2d2df90f81958cda0e10d91560c76e8/mln4lzr/zZ0pp5nxi/tumblr_static_6f9tfmqe24sookcgg48wo8k4k.jpg",
                        "header_image_focused": "https://static.tumblr.com/a6e7d35009c0f1211c6c14810e105a79/mln4lzr/t2ypp5nxk/tumblr_static_tumblr_static_6f9tfmqe24sookcgg48wo8k4k_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/c2d2df90f81958cda0e10d91560c76e8/mln4lzr/zZ0pp5nxi/tumblr_static_6f9tfmqe24sookcgg48wo8k4k_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182942909406"
                },
                "content_raw": "<p>Preordered Critical Role prints before they actually went on sale!  Happy Early Birthday to myself!</p>",
                "content": "<p>Preordered Critical Role prints before they actually went on sale!  Happy Early Birthday to myself!</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "beaureguarded",
        "blog": {
            "name": "beaureguarded",
            "title": "Everybody Lies. No Exceptions. 🦋",
            "description": "<p>~~COMMISSIONS OPEN (PM me for details examples and prices)~~</p><p>| Welcome to the trash pit... Why am I still here | Kara | She/her/they/ them | Critical Role, Life is Strange, TAZ, cartoons, video games, art, shit posts, and whatever else I'm feeling</p><p>(Twitter- @beaureguarded)</p>",
            "url": "https://beaureguarded.tumblr.com/",
            "uuid": "t:Tub0YbfM5YJrG0jC5MXo2w",
            "updated": 1561710277
        },
        "id": 182942904341,
        "post_url": "https://beaureguarded.tumblr.com/post/182942904341/who-do-i-miss-every-single-day-hint-shes",
        "slug": "who-do-i-miss-every-single-day-hint-shes",
        "date": "2019-02-20 20:22:22 GMT",
        "timestamp": 1550694142,
        "state": "published",
        "format": "html",
        "reblog_key": "6OuWJjwR",
        "tags": [
            "keyleth",
            "vox machina",
            "critical role",
            "crs1",
            "critical role fanart",
            "critical role art",
            "cr1",
            "lady keyleth",
            "kiki",
            "pub draw",
            "critters",
            "critter art",
            "cr",
            "crit role"
        ],
        "short_url": "https://tmblr.co/Zknd1w2gOFp0L",
        "summary": "who do I miss every single day? (Hint, Shes Marisha Ray's sweet God baby). Can't wait for the Search for Grog!!!",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 7,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"1118\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/d7470a81dcd11efdf0e34d517e408fb5/tumblr_pn8r9aUgds1r6j583_540.jpg\" data-orig-height=\"1118\" data-orig-width=\"750\"/></figure><p>who do I miss every single day? (Hint, Shes Marisha Ray&rsquo;s sweet God baby). Can&rsquo;t wait for the Search for Grog!!! </p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"1118\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/d7470a81dcd11efdf0e34d517e408fb5/tumblr_pn8r9aUgds1r6j583_540.jpg\" data-orig-height=\"1118\" data-orig-width=\"750\"></figure><p>who do I miss every single day? (Hint, Shes Marisha Ray’s sweet God baby). Can’t wait for the Search for Grog!!! </p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "beaureguarded",
                    "active": true,
                    "theme": {
                        "header_full_width": 400,
                        "header_full_height": 222,
                        "header_focus_width": 371,
                        "header_focus_height": 209,
                        "avatar_shape": "square",
                        "background_color": "#A4E0ED",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "10,395,219,24",
                        "header_image": "https://static.tumblr.com/869c4196ac4f8a83e43c7e587c571e31/qdhvu6u/3y0pmsehg/tumblr_static_.gif",
                        "header_image_focused": "https://static.tumblr.com/869c4196ac4f8a83e43c7e587c571e31/qdhvu6u/ubnpmsehi/tumblr_static_tumblr_static__focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/869c4196ac4f8a83e43c7e587c571e31/qdhvu6u/3y0pmsehg/tumblr_static__2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#003564",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#00217F",
                        "title_font": "Square Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182942904341"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"1118\" data-orig-width=\"750\"><img src=\"https://66.media.tumblr.com/d7470a81dcd11efdf0e34d517e408fb5/tumblr_pn8r9aUgds1r6j583_540.jpg\" data-orig-height=\"1118\" data-orig-width=\"750\"></figure><p>who do I miss every single day? (Hint, Shes Marisha Ray’s sweet God baby). Can’t wait for the Search for Grog!!! </p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d7470a81dcd11efdf0e34d517e408fb5/tumblr_pn8r9aUgds1r6j583_540.jpg\" class=\"\"/></figure><p>who do I miss every single day? (Hint, Shes Marisha Ray&rsquo;s sweet God baby). Can&rsquo;t wait for the Search for Grog!!! </p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "jewishdragon",
        "blog": {
            "name": "jewishdragon",
            "title": "Jewish You Were This Cool!",
            "description": "Hi! I’m TuiteyFruity (b. 1995). Call me Tuitey for short. Pronounce it like the jellybean flavor Tutti Frutti! I am known for writing the Let it Go parody \"Let Them Burn\". This blog is safe for work! [They/Them]. Jewish (duh). Religious but not spiritual. Homeschmuck. ",
            "url": "https://jewishdragon.tumblr.com/",
            "uuid": "t:gJntZaSAWip12nNmjeIg1Q",
            "updated": 1561756839
        },
        "id": 182942903606,
        "post_url": "https://jewishdragon.tumblr.com/post/182942903606/im-so-fucking-stoked-for-search-for-grog-to",
        "slug": "im-so-fucking-stoked-for-search-for-grog-to",
        "date": "2019-02-20 20:22:20 GMT",
        "timestamp": 1550694140,
        "state": "published",
        "format": "html",
        "reblog_key": "eg93mQll",
        "tags": [
            "vox machina",
            "critical role",
            "i doubt mh favorite peice of imagry will be drawn but ah well"
        ],
        "short_url": "https://tmblr.co/ZxtzAw2gOFoqs",
        "summary": "I’m so fucking stoked for Search For Grog to finally be released bc there are so many great moments and i cannot WAIT for the...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 11,
        "title": null,
        "body": "<p>I’m so fucking stoked for Search For Grog to finally be released bc there are so many great moments and i cannot WAIT for the amazing fanart of all the new VM content!!! </p>",
        "reblog": {
            "comment": "<p>I’m so fucking stoked for Search For Grog to finally be released bc there are so many great moments and i cannot WAIT for the amazing fanart of all the new VM content!!! </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jewishdragon",
                    "active": true,
                    "theme": {
                        "header_full_width": 700,
                        "header_full_height": 377,
                        "header_focus_width": 427,
                        "header_focus_height": 239,
                        "avatar_shape": "square",
                        "background_color": "#F6F6F6",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,520,239,93",
                        "header_image": "https://static.tumblr.com/db4da4428f994cfd38d5823c5d372ac1/sinqgxr/FSLna4qg4/tumblr_static_au8od9lvnkwgsg84sg4ko8cok.jpg",
                        "header_image_focused": "https://static.tumblr.com/db4da4428f994cfd38d5823c5d372ac1/sinqgxr/aNtpnoepj/tumblr_static_tumblr_static_au8od9lvnkwgsg84sg4ko8cok_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_14_focused_v3.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Helvetica Neue",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182942903606"
                },
                "content_raw": "<p>I’m so fucking stoked for Search For Grog to finally be released bc there are so many great moments and i cannot WAIT for the amazing fanart of all the new VM content!!! </p>",
                "content": "<p>I&rsquo;m so fucking stoked for Search For Grog to finally be released bc there are so many great moments and i cannot WAIT for the amazing fanart of all the new VM content!!! </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]