[
    {
        "type": "text",
        "blog_name": "perlalat",
        "blog": {
            "name": "perlalat",
            "title": "s t o r m b o r n",
            "description": "Fire and Blood",
            "url": "https://perlalat.tumblr.com/",
            "uuid": "t:4fXn2zWrew53L9VwjO9vyg",
            "updated": 1560615463
        },
        "id": 182303354037,
        "post_url": "https://perlalat.tumblr.com/post/182303354037/fave-thing-in-tumblr",
        "slug": "fave-thing-in-tumblr",
        "date": "2019-01-25 21:06:18 GMT",
        "timestamp": 1548450378,
        "state": "published",
        "format": "html",
        "reblog_key": "BfwTqeY3",
        "tags": [
            "game of thrones",
            "game of thrones ladies",
            "arya stark",
            "sansa stark",
            "cersei lannister",
            "gilly",
            "lyanna mormont",
            "brienne of tarth",
            "margaery tyrell",
            "daenerys targaryen",
            "missandei of naath",
            "melisandre",
            "meera reed"
        ],
        "short_url": "https://tmblr.co/Zs3C3Z2fo86or",
        "summary": "Fave thing in tumblr",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 17,
        "title": null,
        "body": "<h1>Fave thing in tumblr</h1><p>Gif sets of [Game of Thrones] ladies and feminist poems</p>",
        "reblog": {
            "comment": "<p><h1>Fave thing in tumblr</h1><p>Gif sets of [Game of Thrones] ladies and feminist poems</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "perlalat",
                    "active": true,
                    "theme": {
                        "header_full_width": 736,
                        "header_full_height": 729,
                        "header_focus_width": 736,
                        "header_focus_height": 414,
                        "avatar_shape": "circle",
                        "background_color": "#F7F7F7",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "165,736,579,0",
                        "header_image": "https://static.tumblr.com/55470dba0d71cc5cfb4a9f9676bf7ad4/jih8jc3/BzSpq3cty/tumblr_static_-517419923-content.jpg",
                        "header_image_focused": "https://static.tumblr.com/873b40427a5d054e4fad12dee6949c76/jih8jc3/NRJpq3ctz/tumblr_static_tumblr_static_-517419923-content_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/55470dba0d71cc5cfb4a9f9676bf7ad4/jih8jc3/BzSpq3cty/tumblr_static_-517419923-content_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#6D1F14",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#6D1F14",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": true,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182303354037"
                },
                "content_raw": "<p><h1>Fave thing in tumblr</h1><p>Gif sets of [Game of Thrones] ladies and feminist poems</p></p>",
                "content": "<p><h1>Fave thing in tumblr</h1><p>Gif sets of [Game of Thrones] ladies and feminist poems</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "ohemgee-world",
        "blog": {
            "name": "ohemgee-world",
            "title": "OhEmGee-World",
            "description": "A place of multiple fandom characters, places and universes from books, films, tv shows and stories... also other random stuff that catch my attention. Pringles xxx",
            "url": "https://ohemgee-world.tumblr.com/",
            "uuid": "t:uDSqCe8usN_ri7a-gGyD6A",
            "updated": 1561741240
        },
        "id": 182302753532,
        "post_url": "https://ohemgee-world.tumblr.com/post/182302753532",
        "slug": "",
        "date": "2019-01-25 20:38:14 GMT",
        "timestamp": 1548448694,
        "state": "published",
        "format": "html",
        "reblog_key": "crU0K2u8",
        "tags": [
            "got",
            "game of thrones",
            "sansa stark",
            "arya stark",
            "sansa and arya",
            "stark sisters",
            "*"
        ],
        "short_url": "https://tmblr.co/Zp2xuX2fo5qBy",
        "summary": "",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 49,
        "caption": "",
        "reblog": {
            "comment": "",
            "tree_html": ""
        },
        "trail": [],
        "photoset_layout": "2",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/8c5312f190bfba690c543b6a6fcca033/tumblr_plwmnqDXKK1y0hf95o1_r1_250.gif",
                    "width": 245,
                    "height": 202
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/8c5312f190bfba690c543b6a6fcca033/tumblr_plwmnqDXKK1y0hf95o1_r1_250.gif",
                        "width": 245,
                        "height": 202
                    },
                    {
                        "url": "https://66.media.tumblr.com/8c5312f190bfba690c543b6a6fcca033/tumblr_plwmnqDXKK1y0hf95o1_r1_100.gif",
                        "width": 100,
                        "height": 82
                    },
                    {
                        "url": "https://66.media.tumblr.com/8c5312f190bfba690c543b6a6fcca033/tumblr_plwmnqDXKK1y0hf95o1_r1_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            },
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/1c3011a503faf6adcb4d67502b452e7c/tumblr_plwmnqDXKK1y0hf95o2_250.gif",
                    "width": 245,
                    "height": 202
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/1c3011a503faf6adcb4d67502b452e7c/tumblr_plwmnqDXKK1y0hf95o2_250.gif",
                        "width": 245,
                        "height": 202
                    },
                    {
                        "url": "https://66.media.tumblr.com/1c3011a503faf6adcb4d67502b452e7c/tumblr_plwmnqDXKK1y0hf95o2_100.gif",
                        "width": 100,
                        "height": 82
                    },
                    {
                        "url": "https://66.media.tumblr.com/1c3011a503faf6adcb4d67502b452e7c/tumblr_plwmnqDXKK1y0hf95o2_75sq.gif",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "she-wolf-of-highgarden",
        "blog": {
            "name": "she-wolf-of-highgarden",
            "title": "They Danced Through The Day And Into The Night",
            "description": "<p>23/grad student/book nerd/ lover of arya stark/ Meera Reed defender/ searching for Edric Dayne/ mainly Jonrya and Gendrya</p>",
            "url": "https://she-wolf-of-highgarden.tumblr.com/",
            "uuid": "t:cM2lOkh03Sb0t1vin7GKUQ",
            "updated": 1561755539
        },
        "id": 182302522999,
        "post_url": "https://she-wolf-of-highgarden.tumblr.com/post/182302522999/something-i-see-again-and-again-in-the-asoiaf",
        "slug": "something-i-see-again-and-again-in-the-asoiaf",
        "date": "2019-01-25 20:26:45 GMT",
        "timestamp": 1548448005,
        "state": "published",
        "format": "html",
        "reblog_key": "52jtn7Qp",
        "tags": [
            "Arya Stark",
            "long post",
            "A Song of Ice and Fire",
            "asoiaf",
            "leave her alone"
        ],
        "short_url": "https://tmblr.co/Zzjdmg2fo4xvt",
        "summary": "Something i see again and again in the ASoIaF fandom is that people who love Arya do so because she rejects femininity. As...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 214,
        "title": null,
        "body": "<p>Something i see again and again in the ASoIaF fandom is that people who love Arya do so because she rejects femininity. As someone who is feminine, i find this kind of annoying because honestly femininity has nothing to do with how i feel about her. So here are my top five reasons for loving Arya Stark:</p><p><b>1. Her empathy </b></p><p>“<i>The bars were too narrow to pass a cup through, but Harwin and Gendry offered her a leg up. She planted a foot in Harwin&rsquo;s cupped hands, vaulted onto Gendry&rsquo;s shoulders, and grabbed the bars on top of the cage. The fat man turned his face up and pressed his cheek to the iron, and Arya poured the waterover him. He sucked at it eagerly and let it run down over his head and cheeks and hands, and then he licked the dampness off the bars. He would have licked Arya&rsquo;s fingers if she hadn&rsquo;t snatched them back. By the time she served the other two the same, a crowd had gathered to watch her. &ldquo;The Mad Huntsman will hear of this,&rdquo; a man threatened. &ldquo;He won&rsquo;t like it. No, he won&rsquo;t</i>.&rdquo;\n- Arya V, ASoS<br/></p><p>“\n\n<i>It was even worse than before; Lady Smallwood insisted that Arya take another bath, and cut and comb her hair besides; the dress she put her in this time was sort of lilac-colored, and decorated with little baby pearls. The only good thing about it was that it was so delicate that no one could expect her to ride in it. So the next morning as they broke their fast, Lady Smallwood gave her breeches, belt, and tunic to wear, and a brown doeskin jerkin dotted with iron studs. &ldquo;They were my son&rsquo;s things,&rdquo; she said. &ldquo;He died when he was seven.&rdquo;&ldquo;I&rsquo;m sorry, my lady.&rdquo; Arya suddenly felt bad for her, and ashamed. &ldquo;I&rsquo;m sorry I tore the acorn dress too. It was pretty</i>.&rdquo;\n- Arya IV, ASoS<br/></p><p><b>2. Her friendliness </b></p><p><i>“\n\nSansa knew all about the sorts of people Arya liked to talk to: squires and grooms and serving girls, old men and naked children, rough-spoken freeriders of uncertain birth. Arya would make friends with anybody. This Mycah was the worst; a butcher&rsquo;s boy, thirteen and wild, he slept in the meat wagon and smelled of the slaughtering block.” - </i>Sansa I, AGoT<br/></p><p>“\n\n<i>Cat had made friends along the wharves; porters and mummers, ropemakers and sailmenders, taverners, brewers and bakers and beggars and whores. They bought clams and cockles from her, told her true tales of Braavos and lies about their lives, and laughed at the way she talked when she tried to speak Braavosi. She never let that trouble her. Instead, she showed them all the fig, and told them they were camel cunts, which made them roar with laughter. Gyloro Dothare taught her filthy songs, and his brother Gyleno told her the best places to catch eels. The mummers off the Ship showed her how a hero stands, and taught her speeches from The Song of the Rhoyne, The Conqueror&rsquo;s Two Wives, and The Merchant&rsquo;s Lusty Lady. Quill, the sad-eyed little man who made up all the bawdy farces for the Ship, offered to teach her how a woman kisses, but Tagganaro smacked him with a codfish and put an end to that. Cossomo the Conjurer instructed her in sleight of hand. He could swallow mice and pull them from her ears. &ldquo;It&rsquo;s magic,&rdquo; he&rsquo;d say. &ldquo;It&rsquo;s not,&rdquo; Cat said. &ldquo;The mouse was up your sleeve the whole time. I could see it moving.&rdquo;\n- </i>Cat of the Canals, AFfC</p><p><b>3. Her childishness </b></p><p><i>&ldquo;You don&rsquo;t even know what a brothel is.&rdquo;<br/>&ldquo;I do so,&rdquo; she insisted. &ldquo;It&rsquo;s like an inn, with girls.</i>&rdquo;\n- Arya V, ASoS<br/></p><p>“\n\n<i>You know the words, but you are too proud to serve. A servant must be humble and obedient.&ldquo;<br/>&quot;I obey. I can be humbler than anyone<b>.</b></i>&rdquo;\n- The Ugly Little Girl, ADwD</p><p><b>4. Her leave-no-person-behind attitude </b></p><p><i>“He&rsquo;s going to die, and the sooner he does it, the better for the rest of us. We should just leave him, like he says. If it was you or me hurt, you know he&rsquo;d leave us.&ldquo; They scrambled down a steep cut and up the other side, using roots for handholds. &quot;I&rsquo;m sick of carrying him, and I&rsquo;m sick of all his talk about yielding too. If he could stand up, I&rsquo;d knock his teeth in. Lommy&rsquo;s no use to anyone. That crying girl&rsquo;s no use either.&rdquo;<br/>&ldquo;You leave Weasel alone, she&rsquo;s just scared and hungry is all.&rdquo; Arya glanced back, but the girl was not following for once. Hot Pie must have grabbed her, like Gendry had told him.” - </i>Arya V, ACoK<br/></p><p><i>“\n\nShe would make much better time on her own, Arya knew, but she could not leave them. They were her pack, her friends, the only living friends that remained to her, and if not for her they would still be safe at Harrenhal, Gendry sweating at his forge and Hot Pie in the kitchens. If the Mummers catch us, I&rsquo;ll tell them that I&rsquo;m Ned Stark&rsquo;s daughter and sister to the King in the North. I&rsquo;ll command them to take me to my brother, and to do no harm to Hot Pie and Gendry. They might not believe her, though, and even if they did &hellip; Lord Bolton was her brother&rsquo;s bannerman, but he frightened her all the same. I won&rsquo;t let them take us, she vowed silently, reaching back over her shoulder to touch the hilt of the sword that Gendry had stolen for her. I won&rsquo;t.” - </i>Arya I, ASoS<br/></p><p><b>5. Her bravery </b></p><p><i>“ \n\nRobb took them all the way down to the end, past Grandfather and Brandon and Lyanna, to show them their own tombs. Sansa kept looking at the stubby little candle, anxious that it might go out. Old Nan had told her there were spiders down here, and rats as big as dogs. Robb smiled when she said that. &ldquo;There are worse things than spiders and rats,&rdquo; he whispered. &ldquo;This is where the dead walk.&rdquo; That was when they heard the sound, low and deep and shivery. Baby Bran had clutched at Arya&rsquo;s hand.<br/>\n\nWhen the spirit stepped out of the open tomb, pale white and moaning for blood, Sansa ran shrieking for the stairs, and Bran wrapped himself around Robb&rsquo;s leg, sobbing. Arya stood her ground and gave the spirit a punch. It was only Jon, covered with flour. &ldquo;You stupid,&rdquo; she told him, &ldquo;you scared the baby,&rdquo; but Jon and Robb just laughed and laughed, and pretty soon Bran and Arya were laughing too.\n\n” - </i>Arya IV, AGoT<br/></p><p><b>“\n\n</b><i>She should be more frightened herself, she knew. She was only ten, a skinny girl on a stolen horse with a dark forest ahead of her and men behind who would gladly cut off her feet. Yet somehow she felt calmer than she ever had in Harrenhal. The rain had washed the guard&rsquo;s blood off her fingers, she wore a swordacross her back, wolves were prowling through the dark like lean grey shadows, and Arya Stark was unafraid. Fear cuts deeper than swords, she whispered under her breath, the words that Syrio Forel had taught her, and Jaqen&rsquo;s words too, valar morghulis.” - </i>Arya I, ASoS<br/></p>",
        "reblog": {
            "comment": "<p>Something i see again and again in the ASoIaF fandom is that people who love Arya do so because she rejects femininity. As someone who is feminine, i find this kind of annoying because honestly femininity has nothing to do with how i feel about her. So here are my top five reasons for loving Arya Stark:</p><p><b>1. Her empathy </b></p><p>“<i>The bars were too narrow to pass a cup through, but Harwin and Gendry offered her a leg up. She planted a foot in Harwin’s cupped hands, vaulted onto Gendry’s shoulders, and grabbed the bars on top of the cage. The fat man turned his face up and pressed his cheek to the iron, and Arya poured the waterover him. He sucked at it eagerly and let it run down over his head and cheeks and hands, and then he licked the dampness off the bars. He would have licked Arya’s fingers if she hadn’t snatched them back. By the time she served the other two the same, a crowd had gathered to watch her. “The Mad Huntsman will hear of this,” a man threatened. “He won’t like it. No, he won’t</i>.”\n- Arya V, ASoS<br></p><p>“\n\n<i>It was even worse than before; Lady Smallwood insisted that Arya take another bath, and cut and comb her hair besides; the dress she put her in this time was sort of lilac-colored, and decorated with little baby pearls. The only good thing about it was that it was so delicate that no one could expect her to ride in it. So the next morning as they broke their fast, Lady Smallwood gave her breeches, belt, and tunic to wear, and a brown doeskin jerkin dotted with iron studs. “They were my son’s things,” she said. “He died when he was seven.”“I’m sorry, my lady.” Arya suddenly felt bad for her, and ashamed. “I’m sorry I tore the acorn dress too. It was pretty</i>.”\n- Arya IV, ASoS<br></p><p><b>2. Her friendliness </b></p><p><i>“\n\nSansa knew all about the sorts of people Arya liked to talk to: squires and grooms and serving girls, old men and naked children, rough-spoken freeriders of uncertain birth. Arya would make friends with anybody. This Mycah was the worst; a butcher’s boy, thirteen and wild, he slept in the meat wagon and smelled of the slaughtering block.” - </i>Sansa I, AGoT<br></p><p>“\n\n<i>Cat had made friends along the wharves; porters and mummers, ropemakers and sailmenders, taverners, brewers and bakers and beggars and whores. They bought clams and cockles from her, told her true tales of Braavos and lies about their lives, and laughed at the way she talked when she tried to speak Braavosi. She never let that trouble her. Instead, she showed them all the fig, and told them they were camel cunts, which made them roar with laughter. Gyloro Dothare taught her filthy songs, and his brother Gyleno told her the best places to catch eels. The mummers off the Ship showed her how a hero stands, and taught her speeches from The Song of the Rhoyne, The Conqueror’s Two Wives, and The Merchant’s Lusty Lady. Quill, the sad-eyed little man who made up all the bawdy farces for the Ship, offered to teach her how a woman kisses, but Tagganaro smacked him with a codfish and put an end to that. Cossomo the Conjurer instructed her in sleight of hand. He could swallow mice and pull them from her ears. “It’s magic,” he’d say. “It’s not,” Cat said. “The mouse was up your sleeve the whole time. I could see it moving.”\n- </i>Cat of the Canals, AFfC</p><p><b>3. Her childishness </b></p><p><i>“You don’t even know what a brothel is.”<br>“I do so,” she insisted. “It’s like an inn, with girls.</i>”\n- Arya V, ASoS<br></p><p>“\n\n<i>You know the words, but you are too proud to serve. A servant must be humble and obedient.“<br>\"I obey. I can be humbler than anyone<b>.</b></i>”\n- The Ugly Little Girl, ADwD</p><p><b>4. Her leave-no-person-behind attitude </b></p><p><i>“He’s going to die, and the sooner he does it, the better for the rest of us. We should just leave him, like he says. If it was you or me hurt, you know he’d leave us.“ They scrambled down a steep cut and up the other side, using roots for handholds. \"I’m sick of carrying him, and I’m sick of all his talk about yielding too. If he could stand up, I’d knock his teeth in. Lommy’s no use to anyone. That crying girl’s no use either.”<br>“You leave Weasel alone, she’s just scared and hungry is all.” Arya glanced back, but the girl was not following for once. Hot Pie must have grabbed her, like Gendry had told him.” - </i>Arya V, ACoK<br></p><p><i>“\n\nShe would make much better time on her own, Arya knew, but she could not leave them. They were her pack, her friends, the only living friends that remained to her, and if not for her they would still be safe at Harrenhal, Gendry sweating at his forge and Hot Pie in the kitchens. If the Mummers catch us, I’ll tell them that I’m Ned Stark’s daughter and sister to the King in the North. I’ll command them to take me to my brother, and to do no harm to Hot Pie and Gendry. They might not believe her, though, and even if they did … Lord Bolton was her brother’s bannerman, but he frightened her all the same. I won’t let them take us, she vowed silently, reaching back over her shoulder to touch the hilt of the sword that Gendry had stolen for her. I won’t.” - </i>Arya I, ASoS<br></p><p><b>5. Her bravery </b></p><p><i>“ \n\nRobb took them all the way down to the end, past Grandfather and Brandon and Lyanna, to show them their own tombs. Sansa kept looking at the stubby little candle, anxious that it might go out. Old Nan had told her there were spiders down here, and rats as big as dogs. Robb smiled when she said that. “There are worse things than spiders and rats,” he whispered. “This is where the dead walk.” That was when they heard the sound, low and deep and shivery. Baby Bran had clutched at Arya’s hand.<br>\n\nWhen the spirit stepped out of the open tomb, pale white and moaning for blood, Sansa ran shrieking for the stairs, and Bran wrapped himself around Robb’s leg, sobbing. Arya stood her ground and gave the spirit a punch. It was only Jon, covered with flour. “You stupid,” she told him, “you scared the baby,” but Jon and Robb just laughed and laughed, and pretty soon Bran and Arya were laughing too.\n\n” - </i>Arya IV, AGoT<br></p><p><b>“\n\n</b><i>She should be more frightened herself, she knew. She was only ten, a skinny girl on a stolen horse with a dark forest ahead of her and men behind who would gladly cut off her feet. Yet somehow she felt calmer than she ever had in Harrenhal. The rain had washed the guard’s blood off her fingers, she wore a swordacross her back, wolves were prowling through the dark like lean grey shadows, and Arya Stark was unafraid. Fear cuts deeper than swords, she whispered under her breath, the words that Syrio Forel had taught her, and Jaqen’s words too, valar morghulis.” - </i>Arya I, ASoS<br></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "she-wolf-of-highgarden",
                    "active": true,
                    "theme": {
                        "header_full_width": 960,
                        "header_full_height": 1280,
                        "header_focus_width": 822,
                        "header_focus_height": 462,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "410,891,872,69",
                        "header_image": "https://static.tumblr.com/25b2447f720423b6ba82cfca8c53cfc1/7hvfnbt/hoqouant3/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/25b2447f720423b6ba82cfca8c53cfc1/7hvfnbt/5uGouant5/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/25b2447f720423b6ba82cfca8c53cfc1/7hvfnbt/hoqouant3/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#B8E2CD",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182302522999"
                },
                "content_raw": "<p>Something i see again and again in the ASoIaF fandom is that people who love Arya do so because she rejects femininity. As someone who is feminine, i find this kind of annoying because honestly femininity has nothing to do with how i feel about her. So here are my top five reasons for loving Arya Stark:</p><p><b>1. Her empathy </b></p><p>“<i>The bars were too narrow to pass a cup through, but Harwin and Gendry offered her a leg up. She planted a foot in Harwin’s cupped hands, vaulted onto Gendry’s shoulders, and grabbed the bars on top of the cage. The fat man turned his face up and pressed his cheek to the iron, and Arya poured the waterover him. He sucked at it eagerly and let it run down over his head and cheeks and hands, and then he licked the dampness off the bars. He would have licked Arya’s fingers if she hadn’t snatched them back. By the time she served the other two the same, a crowd had gathered to watch her. “The Mad Huntsman will hear of this,” a man threatened. “He won’t like it. No, he won’t</i>.”\n- Arya V, ASoS<br></p><p>“\n\n<i>It was even worse than before; Lady Smallwood insisted that Arya take another bath, and cut and comb her hair besides; the dress she put her in this time was sort of lilac-colored, and decorated with little baby pearls. The only good thing about it was that it was so delicate that no one could expect her to ride in it. So the next morning as they broke their fast, Lady Smallwood gave her breeches, belt, and tunic to wear, and a brown doeskin jerkin dotted with iron studs. “They were my son’s things,” she said. “He died when he was seven.”“I’m sorry, my lady.” Arya suddenly felt bad for her, and ashamed. “I’m sorry I tore the acorn dress too. It was pretty</i>.”\n- Arya IV, ASoS<br></p><p><b>2. Her friendliness </b></p><p><i>“\n\nSansa knew all about the sorts of people Arya liked to talk to: squires and grooms and serving girls, old men and naked children, rough-spoken freeriders of uncertain birth. Arya would make friends with anybody. This Mycah was the worst; a butcher’s boy, thirteen and wild, he slept in the meat wagon and smelled of the slaughtering block.” - </i>Sansa I, AGoT<br></p><p>“\n\n<i>Cat had made friends along the wharves; porters and mummers, ropemakers and sailmenders, taverners, brewers and bakers and beggars and whores. They bought clams and cockles from her, told her true tales of Braavos and lies about their lives, and laughed at the way she talked when she tried to speak Braavosi. She never let that trouble her. Instead, she showed them all the fig, and told them they were camel cunts, which made them roar with laughter. Gyloro Dothare taught her filthy songs, and his brother Gyleno told her the best places to catch eels. The mummers off the Ship showed her how a hero stands, and taught her speeches from The Song of the Rhoyne, The Conqueror’s Two Wives, and The Merchant’s Lusty Lady. Quill, the sad-eyed little man who made up all the bawdy farces for the Ship, offered to teach her how a woman kisses, but Tagganaro smacked him with a codfish and put an end to that. Cossomo the Conjurer instructed her in sleight of hand. He could swallow mice and pull them from her ears. “It’s magic,” he’d say. “It’s not,” Cat said. “The mouse was up your sleeve the whole time. I could see it moving.”\n- </i>Cat of the Canals, AFfC</p><p><b>3. Her childishness </b></p><p><i>“You don’t even know what a brothel is.”<br>“I do so,” she insisted. “It’s like an inn, with girls.</i>”\n- Arya V, ASoS<br></p><p>“\n\n<i>You know the words, but you are too proud to serve. A servant must be humble and obedient.“<br>\"I obey. I can be humbler than anyone<b>.</b></i>”\n- The Ugly Little Girl, ADwD</p><p><b>4. Her leave-no-person-behind attitude </b></p><p><i>“He’s going to die, and the sooner he does it, the better for the rest of us. We should just leave him, like he says. If it was you or me hurt, you know he’d leave us.“ They scrambled down a steep cut and up the other side, using roots for handholds. \"I’m sick of carrying him, and I’m sick of all his talk about yielding too. If he could stand up, I’d knock his teeth in. Lommy’s no use to anyone. That crying girl’s no use either.”<br>“You leave Weasel alone, she’s just scared and hungry is all.” Arya glanced back, but the girl was not following for once. Hot Pie must have grabbed her, like Gendry had told him.” - </i>Arya V, ACoK<br></p><p><i>“\n\nShe would make much better time on her own, Arya knew, but she could not leave them. They were her pack, her friends, the only living friends that remained to her, and if not for her they would still be safe at Harrenhal, Gendry sweating at his forge and Hot Pie in the kitchens. If the Mummers catch us, I’ll tell them that I’m Ned Stark’s daughter and sister to the King in the North. I’ll command them to take me to my brother, and to do no harm to Hot Pie and Gendry. They might not believe her, though, and even if they did … Lord Bolton was her brother’s bannerman, but he frightened her all the same. I won’t let them take us, she vowed silently, reaching back over her shoulder to touch the hilt of the sword that Gendry had stolen for her. I won’t.” - </i>Arya I, ASoS<br></p><p><b>5. Her bravery </b></p><p><i>“ \n\nRobb took them all the way down to the end, past Grandfather and Brandon and Lyanna, to show them their own tombs. Sansa kept looking at the stubby little candle, anxious that it might go out. Old Nan had told her there were spiders down here, and rats as big as dogs. Robb smiled when she said that. “There are worse things than spiders and rats,” he whispered. “This is where the dead walk.” That was when they heard the sound, low and deep and shivery. Baby Bran had clutched at Arya’s hand.<br>\n\nWhen the spirit stepped out of the open tomb, pale white and moaning for blood, Sansa ran shrieking for the stairs, and Bran wrapped himself around Robb’s leg, sobbing. Arya stood her ground and gave the spirit a punch. It was only Jon, covered with flour. “You stupid,” she told him, “you scared the baby,” but Jon and Robb just laughed and laughed, and pretty soon Bran and Arya were laughing too.\n\n” - </i>Arya IV, AGoT<br></p><p><b>“\n\n</b><i>She should be more frightened herself, she knew. She was only ten, a skinny girl on a stolen horse with a dark forest ahead of her and men behind who would gladly cut off her feet. Yet somehow she felt calmer than she ever had in Harrenhal. The rain had washed the guard’s blood off her fingers, she wore a swordacross her back, wolves were prowling through the dark like lean grey shadows, and Arya Stark was unafraid. Fear cuts deeper than swords, she whispered under her breath, the words that Syrio Forel had taught her, and Jaqen’s words too, valar morghulis.” - </i>Arya I, ASoS<br></p>",
                "content": "<p>Something i see again and again in the ASoIaF fandom is that people who love Arya do so because she rejects femininity. As someone who is feminine, i find this kind of annoying because honestly femininity has nothing to do with how i feel about her. So here are my top five reasons for loving Arya Stark:</p><p><b>1. Her empathy&nbsp;</b></p><p>&ldquo;<i>The bars were too narrow to pass a cup through, but Harwin and Gendry offered her a leg up. She planted a foot in Harwin&rsquo;s cupped hands, vaulted onto Gendry&rsquo;s shoulders, and grabbed the bars on top of the cage. The fat man turned his face up and pressed his cheek to the iron, and Arya poured the waterover him. He sucked at it eagerly and let it run down over his head and cheeks and hands, and then he licked the dampness off the bars. He would have licked Arya&rsquo;s fingers if she hadn&rsquo;t snatched them back. By the time she served the other two the same, a crowd had gathered to watch her. &ldquo;The Mad Huntsman will hear of this,&rdquo; a man threatened. &ldquo;He won&rsquo;t like it. No, he won&rsquo;t</i>.&rdquo;\n- Arya V, ASoS<br /></p><p>&ldquo;\n\n<i>It was even worse than before; Lady Smallwood insisted that Arya take another bath, and cut and comb her hair besides; the dress she put her in this time was sort of lilac-colored, and decorated with little baby pearls. The only good thing about it was that it was so delicate that no one could expect her to ride in it. So the next morning as they broke their fast, Lady Smallwood gave her breeches, belt, and tunic to wear, and a brown doeskin jerkin dotted with iron studs. &ldquo;They were my son&rsquo;s things,&rdquo; she said. &ldquo;He died when he was seven.&rdquo;&ldquo;I&rsquo;m sorry, my lady.&rdquo; Arya suddenly felt bad for her, and ashamed. &ldquo;I&rsquo;m sorry I tore the acorn dress too. It was pretty</i>.&rdquo;\n- Arya IV, ASoS<br /></p><p><b>2. Her friendliness&nbsp;</b></p><p><i>&ldquo;\n\nSansa knew all about the sorts of people Arya liked to talk to: squires and grooms and serving girls, old men and naked children, rough-spoken freeriders of uncertain birth. Arya would make friends with anybody. This Mycah was the worst; a butcher&rsquo;s boy, thirteen and wild, he slept in the meat wagon and smelled of the slaughtering block.&rdquo; - </i>Sansa I, AGoT<br /></p><p>&ldquo;\n\n<i>Cat had made friends along the wharves; porters and mummers, ropemakers and sailmenders, taverners, brewers and bakers and beggars and whores. They bought clams and cockles from her, told her true tales of Braavos and lies about their lives, and laughed at the way she talked when she tried to speak Braavosi. She never let that trouble her. Instead, she showed them all the fig, and told them they were camel cunts, which made them roar with laughter. Gyloro Dothare taught her filthy songs, and his brother Gyleno told her the best places to catch eels. The mummers off the Ship showed her how a hero stands, and taught her speeches from The Song of the Rhoyne, The Conqueror&rsquo;s Two Wives, and The Merchant&rsquo;s Lusty Lady. Quill, the sad-eyed little man who made up all the bawdy farces for the Ship, offered to teach her how a woman kisses, but Tagganaro smacked him with a codfish and put an end to that. Cossomo the Conjurer instructed her in sleight of hand. He could swallow mice and pull them from her ears. &ldquo;It&rsquo;s magic,&rdquo; he&rsquo;d say. &ldquo;It&rsquo;s not,&rdquo; Cat said. &ldquo;The mouse was up your sleeve the whole time. I could see it moving.&rdquo;\n- </i>Cat of the Canals, AFfC</p><p><b>3. Her childishness&nbsp;</b></p><p><i>&ldquo;You don&rsquo;t even know what a brothel is.&rdquo;<br />&ldquo;I do so,&rdquo; she insisted. &ldquo;It&rsquo;s like an inn, with girls.</i>&rdquo;\n- Arya V, ASoS<br /></p><p>&ldquo;\n\n<i>You know the words, but you are too proud to serve. A servant must be humble and obedient.&ldquo;<br />\"I obey. I can be humbler than anyone<b>.</b></i>&rdquo;\n- The Ugly Little Girl, ADwD</p><p><b>4. Her leave-no-person-behind attitude&nbsp;</b></p><p><i>&ldquo;He&rsquo;s going to die, and the sooner he does it, the better for the rest of us. We should just leave him, like he says. If it was you or me hurt, you know he&rsquo;d leave us.&ldquo; They scrambled down a steep cut and up the other side, using roots for handholds. \"I&rsquo;m sick of carrying him, and I&rsquo;m sick of all his talk about yielding too. If he could stand up, I&rsquo;d knock his teeth in. Lommy&rsquo;s no use to anyone. That crying girl&rsquo;s no use either.&rdquo;<br />&ldquo;You leave Weasel alone, she&rsquo;s just scared and hungry is all.&rdquo; Arya glanced back, but the girl was not following for once. Hot Pie must have grabbed her, like Gendry had told him.&rdquo; - </i>Arya V, ACoK<br /></p><p><i>&ldquo;\n\nShe would make much better time on her own, Arya knew, but she could not leave them. They were her pack, her friends, the only living friends that remained to her, and if not for her they would still be safe at Harrenhal, Gendry sweating at his forge and Hot Pie in the kitchens. If the Mummers catch us, I&rsquo;ll tell them that I&rsquo;m Ned Stark&rsquo;s daughter and sister to the King in the North. I&rsquo;ll command them to take me to my brother, and to do no harm to Hot Pie and Gendry. They might not believe her, though, and even if they did &hellip; Lord Bolton was her brother&rsquo;s bannerman, but he frightened her all the same. I won&rsquo;t let them take us, she vowed silently, reaching back over her shoulder to touch the hilt of the sword that Gendry had stolen for her. I won&rsquo;t.&rdquo; - </i>Arya I, ASoS<br /></p><p><b>5. Her bravery&nbsp;</b></p><p><i>&ldquo;&nbsp;\n\nRobb took them all the way down to the end, past Grandfather and Brandon and Lyanna, to show them their own tombs. Sansa kept looking at the stubby little candle, anxious that it might go out. Old Nan had told her there were spiders down here, and rats as big as dogs. Robb smiled when she said that. &ldquo;There are worse things than spiders and rats,&rdquo; he whispered. &ldquo;This is where the dead walk.&rdquo; That was when they heard the sound, low and deep and shivery. Baby Bran had clutched at Arya&rsquo;s hand.<br />\n\nWhen the spirit stepped out of the open tomb, pale white and moaning for blood, Sansa ran shrieking for the stairs, and Bran wrapped himself around Robb&rsquo;s leg, sobbing. Arya stood her ground and gave the spirit a punch. It was only Jon, covered with flour. &ldquo;You stupid,&rdquo; she told him, &ldquo;you scared the baby,&rdquo; but Jon and Robb just laughed and laughed, and pretty soon Bran and Arya were laughing too.\n\n&rdquo; - </i>Arya IV, AGoT<br /></p><p><b>&ldquo;\n\n</b><i>She should be more frightened herself, she knew. She was only ten, a skinny girl on a stolen horse with a dark forest ahead of her and men behind who would gladly cut off her feet. Yet somehow she felt calmer than she ever had in Harrenhal. The rain had washed the guard&rsquo;s blood off her fingers, she wore a swordacross her back, wolves were prowling through the dark like lean grey shadows, and Arya Stark was unafraid. Fear cuts deeper than swords, she whispered under her breath, the words that Syrio Forel had taught her, and Jaqen&rsquo;s words too, valar morghulis.&rdquo; - </i>Arya I, ASoS<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "madeleineengland",
        "blog": {
            "name": "madeleineengland",
            "title": "Anime, free shipping, series, books and no limits",
            "description": "",
            "url": "https://madeleineengland.tumblr.com/",
            "uuid": "t:GE8YVykpMPTCVYIa8JOh5A",
            "updated": 1561750898
        },
        "id": 182302382493,
        "post_url": "https://madeleineengland.tumblr.com/post/182302382493/stark-sisters-together-the-pack-survives",
        "slug": "stark-sisters-together-the-pack-survives",
        "date": "2019-01-25 20:19:33 GMT",
        "timestamp": 1548447573,
        "state": "published",
        "format": "html",
        "reblog_key": "tHAWv7z4",
        "tags": [
            "sansa stark",
            "arya stark",
            "sansa x arya",
            "sansaedit",
            "aryaedit",
            "game of thrones",
            "starklings",
            "stark sisters",
            "house stark",
            "the pack survives",
            "got season 7",
            "got",
            "gotedit",
            "asoiaf",
            "winter is coming",
            "winterfell",
            "snow",
            "gotsansastarkedit",
            "gotaryastark",
            "gotaryastarkedit"
        ],
        "short_url": "https://tmblr.co/ZCd3oq2fo4PcT",
        "summary": "Stark Sisters together 🐺 the pack survives",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 41,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"527\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/39b2bec2f92fec705efa661cd209b7d2/tumblr_plwlskUNyE1s77hly_1280.png\" data-orig-height=\"527\" data-orig-width=\"720\"/></figure><figure class=\"tmblr-full\" data-orig-height=\"529\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/02c9fdac3a7afd088bebbeddc94bf996/tumblr_plwlsjYxtz1s77hly_1280.png\" data-orig-height=\"529\" data-orig-width=\"720\"/></figure><p>Stark Sisters together 🐺 the pack survives</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"527\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/39b2bec2f92fec705efa661cd209b7d2/tumblr_plwlskUNyE1s77hly_1280.png\" data-orig-height=\"527\" data-orig-width=\"720\"></figure><figure class=\"tmblr-full\" data-orig-height=\"529\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/02c9fdac3a7afd088bebbeddc94bf996/tumblr_plwlsjYxtz1s77hly_1280.png\" data-orig-height=\"529\" data-orig-width=\"720\"></figure><p>Stark Sisters together 🐺 the pack survives</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "madeleineengland",
                    "active": true,
                    "theme": {
                        "header_full_width": 450,
                        "header_full_height": 253,
                        "header_focus_width": 450,
                        "header_focus_height": 252,
                        "avatar_shape": "square",
                        "background_color": "#A1D8BD",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,450,252,0",
                        "header_image": "https://static.tumblr.com/d98da892c3ad3d58f707bb1286ebf4b8/8k5ewsg/WYwppcmz7/tumblr_static_-516562743-content.gif",
                        "header_image_focused": "https://static.tumblr.com/d98da892c3ad3d58f707bb1286ebf4b8/8k5ewsg/iTyppcmzb/tumblr_static_tumblr_static_-516562743-content_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/d98da892c3ad3d58f707bb1286ebf4b8/8k5ewsg/WYwppcmz7/tumblr_static_-516562743-content_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182302382493"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"527\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/39b2bec2f92fec705efa661cd209b7d2/tumblr_plwlskUNyE1s77hly_1280.png\" data-orig-height=\"527\" data-orig-width=\"720\"></figure><figure class=\"tmblr-full\" data-orig-height=\"529\" data-orig-width=\"720\"><img src=\"https://66.media.tumblr.com/02c9fdac3a7afd088bebbeddc94bf996/tumblr_plwlsjYxtz1s77hly_1280.png\" data-orig-height=\"529\" data-orig-width=\"720\"></figure><p>Stark Sisters together 🐺 the pack survives</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/39b2bec2f92fec705efa661cd209b7d2/tumblr_plwlskUNyE1s77hly_1280.png\" class=\"\"/></figure><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/02c9fdac3a7afd088bebbeddc94bf996/tumblr_plwlsjYxtz1s77hly_1280.png\" class=\"\"/></figure><p>Stark Sisters together &#128058; the pack survives</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "quote",
        "blog_name": "gendryaonline",
        "blog": {
            "name": "gendryaonline",
            "title": "a nice oak tree",
            "description": "a blog dedicated to arya stark and gendry from a song of ice and fire by george r.r. martin and hbo's game of thrones",
            "url": "https://gendryaonline.tumblr.com/",
            "uuid": "t:sXHFrIJvWXR_WDQPVxyctA",
            "updated": 1561752758
        },
        "id": 182301897701,
        "post_url": "https://gendryaonline.tumblr.com/post/182301897701/arya-hopped-from-the-high-branch-to-one-beneath",
        "slug": "arya-hopped-from-the-high-branch-to-one-beneath",
        "date": "2019-01-25 19:54:54 GMT",
        "timestamp": 1548446094,
        "state": "published",
        "format": "html",
        "reblog_key": "TPxKTUI2",
        "tags": [
            "arya stark",
            "gendry",
            "arya x gendry",
            "gendrya",
            "quote"
        ],
        "short_url": "https://tmblr.co/ZHGJQY2fo2ZFb",
        "summary": "Arya hopped from the high branch to one beneath it, her hands out for balance. A water dancer never falls. Lightfoot, her toes...",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 66,
        "text": "Arya hopped from the high branch to one beneath it, her hands out for balance. A water dancer never falls. Lightfoot, her toes curled tight around the branch, she walked a few feet, hopped down to a larger limb, then swung hand over hand through the tangle of leaves until she reached the trunk. The bark was rough beneath her fingers, against her toes. She descended quickly, jumping down the final six feet, rolling when she landed.<br/>\nGendry gave her a hand to pull her up. &ldquo;You were up there a long time. What could you see?&rdquo;<br/>\n&ldquo;A fishing village, just a little place, north along the shore. Twenty-six thatch roofs and one slate, I counted. I saw part of a wagon. Someone&rsquo;s there.&rdquo;",
        "source": "a Clash of Kings",
        "reblog": {
            "comment": "<p>a Clash of Kings</p>",
            "tree_html": ""
        },
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "she-wolf-of-highgarden",
        "blog": {
            "name": "she-wolf-of-highgarden",
            "title": "They Danced Through The Day And Into The Night",
            "description": "<p>23/grad student/book nerd/ lover of arya stark/ Meera Reed defender/ searching for Edric Dayne/ mainly Jonrya and Gendrya</p>",
            "url": "https://she-wolf-of-highgarden.tumblr.com/",
            "uuid": "t:cM2lOkh03Sb0t1vin7GKUQ",
            "updated": 1561755539
        },
        "id": 182301398034,
        "post_url": "https://she-wolf-of-highgarden.tumblr.com/post/182301398034/some-of-you-ignore-how-much-guilt-and-self",
        "slug": "some-of-you-ignore-how-much-guilt-and-self",
        "date": "2019-01-25 19:29:09 GMT",
        "timestamp": 1548444549,
        "state": "published",
        "format": "html",
        "reblog_key": "Aoq6uAPi",
        "tags": [
            "Arya Stark",
            "A Song of Ice and Fire",
            "ASoIaF"
        ],
        "short_url": "https://tmblr.co/Zzjdmg2fo0fGI",
        "summary": "Some of you ignore how much guilt and self loathing Arya has and it shows. ",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 19,
        "title": null,
        "body": "<p>Some of you ignore how much guilt and self loathing Arya has and it shows. </p>",
        "reblog": {
            "comment": "<p>Some of you ignore how much guilt and self loathing Arya has and it shows. </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "she-wolf-of-highgarden",
                    "active": true,
                    "theme": {
                        "header_full_width": 960,
                        "header_full_height": 1280,
                        "header_focus_width": 822,
                        "header_focus_height": 462,
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "410,891,872,69",
                        "header_image": "https://static.tumblr.com/25b2447f720423b6ba82cfca8c53cfc1/7hvfnbt/hoqouant3/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/25b2447f720423b6ba82cfca8c53cfc1/7hvfnbt/5uGouant5/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/25b2447f720423b6ba82cfca8c53cfc1/7hvfnbt/hoqouant3/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#B8E2CD",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182301398034"
                },
                "content_raw": "<p>Some of you ignore how much guilt and self loathing Arya has and it shows. </p>",
                "content": "<p>Some of you ignore&nbsp;how much guilt and self loathing Arya has and it shows.&nbsp;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "tluohsalohcin",
        "blog": {
            "name": "tluohsalohcin",
            "title": "Justice for Jon Snow and Jaime Lannister",
            "description": "Official member of the Sansa Stark Defense Squad. Certified Jonsa Trash. Also a Nick Hoult loyalist since 2011.",
            "url": "https://tluohsalohcin.tumblr.com/",
            "uuid": "t:o3FSE2qkYbdcAeBlGlZGRA",
            "updated": 1561753871
        },
        "id": 182301311059,
        "post_url": "https://tluohsalohcin.tumblr.com/post/182301311059/an-edit-of-jon-sansa-and-aryas-promo-for-s8-it",
        "slug": "an-edit-of-jon-sansa-and-aryas-promo-for-s8-it",
        "date": "2019-01-25 19:24:34 GMT",
        "timestamp": 1548444274,
        "state": "published",
        "format": "html",
        "reblog_key": "PgcdoJ4V",
        "tags": [
            "house stark",
            "sansa stark",
            "sansa stark defense squad",
            "pro sansa stark",
            "arya stark",
            "jon snow",
            "pro jon snow",
            "jonsa",
            "sansa x jon",
            "jon x sansa"
        ],
        "short_url": "https://tmblr.co/ZQuqEl2fo0K1J",
        "summary": "An edit of Jon, Sansa and Arya's promo for S8: It wasn't just Aegon. It was Aegon AND his sisters, Visenya and Rhaenys.\nAntis:...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 159,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>An edit of Jon, Sansa and Arya&rsquo;s promo for S8:</b> It wasn&rsquo;t just Aegon. It was Aegon AND his sisters, Visenya and Rhaenys.</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Antis:</b> aEgOnS sIsTeRs kNeW hOw tO dRaW a sWoRd, bUt sAnSa &hellip; 😂😂😂</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Me:</b></p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>Read!!</p><figure class=\"tmblr-full\" data-orig-height=\"190\" data-orig-width=\"320\"><img src=\"https://66.media.tumblr.com/d381c2e94e9b0a0f41a38ced486b0fdb/tumblr_plwj8xt1421toh13a_400.gif\" data-orig-height=\"190\" data-orig-width=\"320\"/></figure>",
        "reblog": {
            "comment": "<p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>An edit of Jon, Sansa and Arya’s promo for S8:</b> It wasn’t just Aegon. It was Aegon AND his sisters, Visenya and Rhaenys.</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Antis:</b> aEgOnS sIsTeRs kNeW hOw tO dRaW a sWoRd, bUt sAnSa … 😂😂😂</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Me:</b></p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>Read!!</p><figure class=\"tmblr-full\" data-orig-height=\"190\" data-orig-width=\"320\"><img src=\"https://66.media.tumblr.com/d381c2e94e9b0a0f41a38ced486b0fdb/tumblr_plwj8xt1421toh13a_400.gif\" data-orig-height=\"190\" data-orig-width=\"320\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "tluohsalohcin",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#B3D9DF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/66f591f2232ead4b9c2fc2a83608cfd9/csr9unf/gHLp95i1y/tumblr_static_68em16mqlyww4w80c00c00ows.jpg",
                        "header_image_focused": "https://static.tumblr.com/66f591f2232ead4b9c2fc2a83608cfd9/csr9unf/gHLp95i1y/tumblr_static_68em16mqlyww4w80c00c00ows_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/66f591f2232ead4b9c2fc2a83608cfd9/csr9unf/gHLp95i1y/tumblr_static_68em16mqlyww4w80c00c00ows_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#D8964F",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#11261c",
                        "title_font": "Clarendon Text Pro",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182301311059"
                },
                "content_raw": "<p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>An edit of Jon, Sansa and Arya’s promo for S8:</b> It wasn’t just Aegon. It was Aegon AND his sisters, Visenya and Rhaenys.</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Antis:</b> aEgOnS sIsTeRs kNeW hOw tO dRaW a sWoRd, bUt sAnSa … 😂😂😂</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Me:</b></p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'>Read!!</p><figure class=\"tmblr-full\" data-orig-height=\"190\" data-orig-width=\"320\"><img src=\"https://66.media.tumblr.com/d381c2e94e9b0a0f41a38ced486b0fdb/tumblr_plwj8xt1421toh13a_400.gif\" data-orig-height=\"190\" data-orig-width=\"320\"></figure></p>",
                "content": "<p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>An edit of Jon, Sansa and Arya&rsquo;s promo for S8:</b> It wasn&rsquo;t just Aegon. It was Aegon AND his sisters, Visenya and Rhaenys.</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Antis:</b> aEgOnS sIsTeRs kNeW hOw tO dRaW a sWoRd, bUt sAnSa &hellip; &#128514;&#128514;&#128514;</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Me:</b></p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\">Read!!</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/d381c2e94e9b0a0f41a38ced486b0fdb/tumblr_plwj8xt1421toh13a_400.gif\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "aegon",
        "blog": {
            "name": "aegon",
            "title": "the conqueror",
            "description": "<p><a href=\"http://aegon.tumblr.com/about\">aly </a>// <a href=\"https://aegon.tumblr.com/birthdaycelebrations\">xxiii</a> // #useraegon </p><p>the <a href=\"http://aegon.tumblr.com/tagged/mine\">blood</a> of the <a href=\"http://dailyjonaryadany.tumblr.com\">dragon</a> </p><p>does not <a href=\"http://aryajon.tumblr.com\">weep</a></p>",
            "url": "https://aegon.tumblr.com/",
            "uuid": "t:4lOlvjm6iXWx6Vj6MjiM6w",
            "updated": 1561486061
        },
        "id": 182301187544,
        "post_url": "https://aegon.tumblr.com/post/182301187544/arya-stark-positivity-post-2501-when-a-fire",
        "slug": "arya-stark-positivity-post-2501-when-a-fire",
        "date": "2019-01-25 19:18:21 GMT",
        "timestamp": 1548443901,
        "state": "published",
        "format": "html",
        "reblog_key": "7SgO9glh",
        "tags": [
            "arya stark",
            "my darling wolf pup",
            "she’s so brave",
            "and so self-sacrificial",
            "like she literally can’t turn away from people in need",
            "and it takes such a toll on her asdfghjkl",
            "what a hero",
            "love of my life",
            "arya*positivity",
            "hey yo a whole week of arya positivity!!",
            "I wonder if I can hit a whole month oof"
        ],
        "short_url": "https://tmblr.co/Zw3VWk2fn-rtO",
        "summary": "arya stark positivity post\n25/01\nwhen a fire breaks out in harrenhal, jaqen h’ghar and two other prisoners are still trapped in...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 53,
        "title": null,
        "body": "<p><b>arya stark positivity post</b></p><p>25/01</p><p>when a fire breaks out in harrenhal, jaqen h’ghar and two other prisoners are still trapped in a cage and unable to escape.</p><p>arya literally crawls to the sounds of their screams. blinded by smoke, she helps them free themselves before fleeing herself.</p><p>when she’s safe in a tunnel away from the flames - still hearing screams and still blinded by smoke and dust - she cries. </p>",
        "reblog": {
            "comment": "<p><b>arya stark positivity post</b></p><p>25/01</p><p>when a fire breaks out in harrenhal, jaqen h’ghar and two other prisoners are still trapped in a cage and unable to escape.</p><p>arya literally crawls to the sounds of their screams. blinded by smoke, she helps them free themselves before fleeing herself.</p><p>when she’s safe in a tunnel away from the flames - still hearing screams and still blinded by smoke and dust - she cries. </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "aegon",
                    "active": true,
                    "theme": {
                        "header_full_width": 621,
                        "header_full_height": 317,
                        "header_focus_width": 564,
                        "header_focus_height": 317,
                        "avatar_shape": "circle",
                        "background_color": "#000000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,621,317,57",
                        "header_image": "https://static.tumblr.com/7c13e41eddf3832fca8aae692f54f7bd/hsoj6dv/bxhpsag4d/tumblr_static_a38t7dx57kg88c4o0wgc8k0ko.gif",
                        "header_image_focused": "https://static.tumblr.com/7c13e41eddf3832fca8aae692f54f7bd/hsoj6dv/8Uppsag4f/tumblr_static_tumblr_static_a38t7dx57kg88c4o0wgc8k0ko_focused_v3.gif",
                        "header_image_scaled": "https://static.tumblr.com/7c13e41eddf3832fca8aae692f54f7bd/hsoj6dv/bxhpsag4d/tumblr_static_a38t7dx57kg88c4o0wgc8k0ko_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#DA3E28",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#CCCCCC",
                        "title_font": "Lorimer No 2",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182301187544"
                },
                "content_raw": "<p><b>arya stark positivity post</b></p><p>25/01</p><p>when a fire breaks out in harrenhal, jaqen h’ghar and two other prisoners are still trapped in a cage and unable to escape.</p><p>arya literally crawls to the sounds of their screams. blinded by smoke, she helps them free themselves before fleeing herself.</p><p>when she’s safe in a tunnel away from the flames - still hearing screams and still blinded by smoke and dust - she cries. </p>",
                "content": "<p><b>arya stark positivity post</b></p><p>25/01</p><p>when a fire breaks out in harrenhal, jaqen h&rsquo;ghar and two other prisoners are still trapped in a cage and unable to escape.</p><p>arya literally crawls to the sounds of their screams. blinded by smoke, she helps them free themselves before fleeing herself.</p><p>when she&rsquo;s safe in a tunnel away from the flames - still hearing screams and still blinded by smoke and dust - she cries. </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "video",
        "blog_name": "unionrising",
        "blog": {
            "name": "unionrising",
            "title": "RISE UNITED",
            "description": "",
            "url": "https://unionrising.tumblr.com/",
            "uuid": "t:K_N4c6EeF_T8lLCty1VBhg",
            "updated": 1561689637
        },
        "id": 182300275546,
        "post_url": "https://unionrising.tumblr.com/post/182300275546/roger-stone-happy-mueller-friday-mood",
        "slug": "roger-stone-happy-mueller-friday-mood",
        "date": "2019-01-25 18:30:38 GMT",
        "timestamp": 1548441038,
        "state": "published",
        "format": "html",
        "reblog_key": "CGUq4aLD",
        "tags": [
            "roger stone",
            "arya stark",
            "game of thrones",
            "robert mueller"
        ],
        "short_url": "https://tmblr.co/ZR4jDg2fnyNDQ",
        "summary": "ROGER STONE Happy Mueller Friday Mood!",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 5,
        "caption": "<p><strike>ROGER STONE</strike></p><p>Happy Mueller Friday Mood!</p>",
        "reblog": {
            "comment": "<p><strike>ROGER STONE</strike></p><p>Happy Mueller Friday Mood!</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "unionrising",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#6b0000",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://static.tumblr.com/ae094cbcc14ee26b57da3a565d90660a/h41npjr/S1Locnxnb/tumblr_static_6q59h8x5qjk0ows8kgco040ws.png",
                        "header_image_focused": "https://static.tumblr.com/ae094cbcc14ee26b57da3a565d90660a/h41npjr/S1Locnxnb/tumblr_static_6q59h8x5qjk0ows8kgco040ws_2048_v2.png",
                        "header_image_scaled": "https://static.tumblr.com/ae094cbcc14ee26b57da3a565d90660a/h41npjr/S1Locnxnb/tumblr_static_6q59h8x5qjk0ows8kgco040ws_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#f9fb8d",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#f0ec06",
                        "title_font": "Arquitecta",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182300275546"
                },
                "content_raw": "<p><strike>ROGER STONE</strike></p><p>Happy Mueller Friday Mood!</p>",
                "content": "<p><strike>ROGER STONE</strike></p><p>Happy Mueller Friday Mood!</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "permalink_url": "https://www.youtube.com/watch?v=YcDEy88B5hY",
        "html5_capable": true,
        "video": {
            "youtube": {
                "video_id": "YcDEy88B5hY",
                "width": 540,
                "height": 304
            }
        },
        "thumbnail_url": "https://i.ytimg.com/vi/YcDEy88B5hY/hqdefault.jpg",
        "thumbnail_width": 480,
        "thumbnail_height": 360,
        "player": [
            {
                "width": 250,
                "embed_code": "<iframe width=\"250\" height=\"141\"  id=\"youtube_iframe\" src=\"https://www.youtube.com/embed/YcDEy88B5hY?feature=oembed&amp;enablejsapi=1&amp;origin=https://safe.txmblr.com&amp;wmode=opaque\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>"
            },
            {
                "width": 400,
                "embed_code": "<iframe width=\"400\" height=\"225\"  id=\"youtube_iframe\" src=\"https://www.youtube.com/embed/YcDEy88B5hY?feature=oembed&amp;enablejsapi=1&amp;origin=https://safe.txmblr.com&amp;wmode=opaque\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>"
            },
            {
                "width": 500,
                "embed_code": "<iframe width=\"500\" height=\"281\"  id=\"youtube_iframe\" src=\"https://www.youtube.com/embed/YcDEy88B5hY?feature=oembed&amp;enablejsapi=1&amp;origin=https://safe.txmblr.com&amp;wmode=opaque\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>"
            }
        ],
        "video_type": "youtube",
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "answer",
        "blog_name": "fedonciadale",
        "blog": {
            "name": "fedonciadale",
            "title": "FedonCiadale",
            "description": "Fantasy aficionado since I read Tolkien in my teenage years. I still love Tolkien but I am also into other works. I love ASOIAF (books) and GoT (Show). I also like Brandon Sanderson, Lois McMaster Bujold, in short in my free time it's fantasy...Header by courtesy of ragekitn! ",
            "url": "https://fedonciadale.tumblr.com/",
            "uuid": "t:ldA0C9REPIshq10W6HNMSA",
            "updated": 1561752192
        },
        "id": 182300122130,
        "post_url": "https://fedonciadale.tumblr.com/post/182300122130/hi-there-ive-seen-people-theorizing-about-danys",
        "slug": "hi-there-ive-seen-people-theorizing-about-danys",
        "date": "2019-01-25 18:22:57 GMT",
        "timestamp": 1548440577,
        "state": "published",
        "format": "html",
        "reblog_key": "L2DyN7du",
        "tags": [
            "anon ask",
            "Will Arya kill Dany?",
            "Anti-Daenerys",
            "Arya Stark",
            "Yes",
            "tagged this Arya",
            "this is about her character",
            "Don't like",
            "don't read",
            "DarkDany",
            "Dany as Denethor",
            "Icarus imagery",
            "How will it fit?",
            "Will Jon kill Dany?"
        ],
        "short_url": "https://tmblr.co/ZP5HTf2fnxnmI",
        "summary": "Hi there, I’ve seen people theorizing about Dany’s death. That Jon or Arya or even childbirth will kill her, and to me, those...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 47,
        "asking_name": "Anonymous",
        "asking_url": null,
        "question": "Hi there, I’ve seen people theorizing about Dany’s death. That Jon or Arya or even childbirth will kill her, and to me, those seem like such unsatisfactory endings for her arc. I’ve always believed Dany’s fate is in her own hands and her own choices. So she either does become a savior/heroic sacrifice death OR she dies for her own hubris and means (eaten by dragon/fall from dragon/killed by fire). Anything else feels like bad writing. What do you think?",
        "answer": "<p>Dear nonny,</p><p>I would absolutely hate for Da€nerys to die in childbirth. That would be pretty anticlimatic. I want her to go out in a blaze, like the last dragon she is. A really spectacular death. A hero from the other side, a woman who fulfills the role of the person who had good intentions and went awry. Yes, I want her death to be memorable. <br/></p><p>I wouldn’t say it would be not like GRRM to do an anticlimatic death. I always suspected that Walder Frey in the books might just die from old age, because this is what occasionally happens with villains, but I doubt that GRRM has a death like that for a super important antagonist. <br/></p><p>As for how she will die, I am a bit torn about that. The Icarus imagery in her arc is very strong and this means that a fall from her dragon would be a possibility. There is also the fact that D herself seems to be convinced that fire “cannot kill a dragon”, and wouldn’t it be nice if that turned out to be wrong - and both would indeed fit into the hubris and fall trope. <a class=\"tumblelog\" href=\"https://tmblr.co/mrHV0A6XAqV1AbH1L0Bo2Bw\">@rose-of-red-lake</a> has speculated that the famous ‘red door’ might be a dragon’s mouth. <br/></p><p>I always wanted her to die a Gollum death - which might come to pass via being eaten by a dragon or via fall from a dragon. I want her to think she has won it all, “her presciousss” only to fall to her death. It would be very nice, if she accidentally helps the case against the WW with her fall. <br/></p><p>I’m not so sure about that any longer: I mean I always thought that GRRM wanted to create a beautiful antagonist, someone who would not be seen as a villain immediately, a beautiful Gollum. But D might also be Denethor, the betrayer in the midst of the peopel who fight against evil (and Denethor dies in flames as well!). As much as I would like D to mirror Gollum, I think that there are many more parallels to Denethor and that she will forsake the cause against the WW because she wants to secure her claim. So if she goes for King’s Landing I expect her to fall or die in the flames in the moment she blows the place up.</p><p>I must admit that I would hate for Jon to kill her. I don’t want him to become a kinslayer, and other than have Jon killing a woman when he shied from that when he met Ygritte, it doesn’t serve any narrative purpose. Jon and D in a Targbowl has been set up, but Jon as killer not necesssarily. If Jon kills a woman it might be Cersei (although my pet theory is that it will be Bran via warging).</p><p>You can make a case for Arya though. We ladies at <a class=\"tumblelog\" href=\"https://tmblr.co/mN2Tk4D3PoYooipN6QjDY2Q\">@delulumeta</a> are checking this theory and we have had some very interesting finds already (I posted one). I’m more and more convinced that this will happen. I do think it would be satisfying for Arya’s arc who wouldn’t kill for revenge but for protection, but it would have to be tied with the hubris arc that is prevalent in D’s story, and I’m not yet sure, how these can be brought together in a satisfying way. I think it can be done, you can have D overreaching, having her moment of triumph and then Arya steps in to protect Jon and finishes her. <br/></p><p>GRRM usually manages to have an outcome that is satisfying for several arcs at once and since I think D is important (if an antagonist) I feel that her arc has to be interwoven with the arcs of the others. I think it is possible to do that, have her die of hubris and killed by Arya, but I’m not yet sure how. <br/></p><p>For a very long time I’ve believed that D would get a last minute saviour action, either from remorse after burning King’s Landing or accidentally like Gollum - and her being an accidental saviour is something that is also very preeminent in her arc. But I’m not that sure any more. GRRM might really go the whole way and have her die an unrepentent villain. <br/></p><p>So, in general I agree with you. Dying in childbirth would be just mehhhh. Very unsatisfactory. But to me the evidence for Arya killing D has set me thinking. It would be difficult to pull that of as satisfactory for D, not unmanagable though - but for Arya it is a very fitting scenario. Her arc which is so much about revenge and mercy and the boundaries that she’ll have to set for herself, that I would really like her to kill not for revenge but for protection as an action that is not directed towards the past but towards the future of her cousin Jon.<br/></p><div><p>Thanks for the ask!<br/></p></div>",
        "reblog": {
            "comment": "<p><p>Dear nonny,</p><p>I would absolutely hate for Da€nerys to die in childbirth. That would be pretty anticlimatic. I want her to go out in a blaze, like the last dragon she is. A really spectacular death. A hero from the other side, a woman who fulfills the role of the person who had good intentions and went awry. Yes, I want her death to be memorable. <br></p><p>I wouldn’t say it would be not like GRRM to do an anticlimatic death. I always suspected that Walder Frey in the books might just die from old age, because this is what occasionally happens with villains, but I doubt that GRRM has a death like that for a super important antagonist. <br></p><p>As for how she will die, I am a bit torn about that. The Icarus imagery in her arc is very strong and this means that a fall from her dragon would be a possibility. There is also the fact that D herself seems to be convinced that fire “cannot kill a dragon”, and wouldn’t it be nice if that turned out to be wrong - and both would indeed fit into the hubris and fall trope. <a class=\"tumblelog\" href=\"https://tmblr.co/mrHV0A6XAqV1AbH1L0Bo2Bw\">@rose-of-red-lake</a> has speculated that the famous ‘red door’ might be a dragon’s mouth. <br></p><p>I always wanted her to die a Gollum death - which might come to pass via being eaten by a dragon or via fall from a dragon. I want her to think she has won it all, “her presciousss” only to fall to her death. It would be very nice, if she accidentally helps the case against the WW with her fall. <br></p><p>I’m not so sure about that any longer: I mean I always thought that GRRM wanted to create a beautiful antagonist, someone who would not be seen as a villain immediately, a beautiful Gollum. But D might also be Denethor, the betrayer in the midst of the peopel who fight against evil (and Denethor dies in flames as well!). As much as I would like D to mirror Gollum, I think that there are many more parallels to Denethor and that she will forsake the cause against the WW because she wants to secure her claim. So if she goes for King’s Landing I expect her to fall or die in the flames in the moment she blows the place up.</p><p>I must admit that I would hate for Jon to kill her. I don’t want him to become a kinslayer, and other than have Jon killing a woman when he shied from that when he met Ygritte, it doesn’t serve any narrative purpose. Jon and D in a Targbowl has been set up, but Jon as killer not necesssarily. If Jon kills a woman it might be Cersei (although my pet theory is that it will be Bran via warging).</p><p>You can make a case for Arya though. We ladies at <a class=\"tumblelog\" href=\"https://tmblr.co/mN2Tk4D3PoYooipN6QjDY2Q\">@delulumeta</a> are checking this theory and we have had some very interesting finds already (I posted one). I’m more and more convinced that this will happen. I do think it would be satisfying for Arya’s arc who wouldn’t kill for revenge but for protection, but it would have to be tied with the hubris arc that is prevalent in D’s story, and I’m not yet sure, how these can be brought together in a satisfying way. I think it can be done, you can have D overreaching, having her moment of triumph and then Arya steps in to protect Jon and finishes her. <br></p><p>GRRM usually manages to have an outcome that is satisfying for several arcs at once and since I think D is important (if an antagonist) I feel that her arc has to be interwoven with the arcs of the others. I think it is possible to do that, have her die of hubris and killed by Arya, but I’m not yet sure how. <br></p><p>For a very long time I’ve believed that D would get a last minute saviour action, either from remorse after burning King’s Landing or accidentally like Gollum - and her being an accidental saviour is something that is also very preeminent in her arc. But I’m not that sure any more. GRRM might really go the whole way and have her die an unrepentent villain. <br></p><p>So, in general I agree with you. Dying in childbirth would be just mehhhh. Very unsatisfactory. But to me the evidence for Arya killing D has set me thinking. It would be difficult to pull that of as satisfactory for D, not unmanagable though - but for Arya it is a very fitting scenario. Her arc which is so much about revenge and mercy and the boundaries that she’ll have to set for herself, that I would really like her to kill not for revenge but for protection as an action that is not directed towards the past but towards the future of her cousin Jon.<br></p><div><p>Thanks for the ask!<br></p></div></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "fedonciadale",
                    "active": true,
                    "theme": {
                        "header_full_width": 1000,
                        "header_full_height": 563,
                        "header_focus_width": 1000,
                        "header_focus_height": 562,
                        "avatar_shape": "square",
                        "background_color": "#6664d0",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,1000,562,0",
                        "header_image": "https://static.tumblr.com/fb6a967e6258f1781113443ef2ec1a52/aiid9l2/B4Vpkxaei/tumblr_static_cewv75jmjfccwc4g884osg8sc.png",
                        "header_image_focused": "https://static.tumblr.com/63122a95881a026daab8aa31088abcd3/aiid9l2/DBWpkxael/tumblr_static_tumblr_static_cewv75jmjfccwc4g884osg8sc_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/fb6a967e6258f1781113443ef2ec1a52/aiid9l2/B4Vpkxaei/tumblr_static_cewv75jmjfccwc4g884osg8sc_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#52c0cc",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182300122130"
                },
                "content_raw": "<p><p>Dear nonny,</p><p>I would absolutely hate for Da€nerys to die in childbirth. That would be pretty anticlimatic. I want her to go out in a blaze, like the last dragon she is. A really spectacular death. A hero from the other side, a woman who fulfills the role of the person who had good intentions and went awry. Yes, I want her death to be memorable. <br></p><p>I wouldn’t say it would be not like GRRM to do an anticlimatic death. I always suspected that Walder Frey in the books might just die from old age, because this is what occasionally happens with villains, but I doubt that GRRM has a death like that for a super important antagonist. <br></p><p>As for how she will die, I am a bit torn about that. The Icarus imagery in her arc is very strong and this means that a fall from her dragon would be a possibility. There is also the fact that D herself seems to be convinced that fire “cannot kill a dragon”, and wouldn’t it be nice if that turned out to be wrong - and both would indeed fit into the hubris and fall trope. <a class=\"tumblelog\" href=\"https://tmblr.co/mrHV0A6XAqV1AbH1L0Bo2Bw\">@rose-of-red-lake</a> has speculated that the famous ‘red door’ might be a dragon’s mouth. <br></p><p>I always wanted her to die a Gollum death - which might come to pass via being eaten by a dragon or via fall from a dragon. I want her to think she has won it all, “her presciousss” only to fall to her death. It would be very nice, if she accidentally helps the case against the WW with her fall. <br></p><p>I’m not so sure about that any longer: I mean I always thought that GRRM wanted to create a beautiful antagonist, someone who would not be seen as a villain immediately, a beautiful Gollum. But D might also be Denethor, the betrayer in the midst of the peopel who fight against evil (and Denethor dies in flames as well!). As much as I would like D to mirror Gollum, I think that there are many more parallels to Denethor and that she will forsake the cause against the WW because she wants to secure her claim. So if she goes for King’s Landing I expect her to fall or die in the flames in the moment she blows the place up.</p><p>I must admit that I would hate for Jon to kill her. I don’t want him to become a kinslayer, and other than have Jon killing a woman when he shied from that when he met Ygritte, it doesn’t serve any narrative purpose. Jon and D in a Targbowl has been set up, but Jon as killer not necesssarily. If Jon kills a woman it might be Cersei (although my pet theory is that it will be Bran via warging).</p><p>You can make a case for Arya though. We ladies at <a class=\"tumblelog\" href=\"https://tmblr.co/mN2Tk4D3PoYooipN6QjDY2Q\">@delulumeta</a> are checking this theory and we have had some very interesting finds already (I posted one). I’m more and more convinced that this will happen. I do think it would be satisfying for Arya’s arc who wouldn’t kill for revenge but for protection, but it would have to be tied with the hubris arc that is prevalent in D’s story, and I’m not yet sure, how these can be brought together in a satisfying way. I think it can be done, you can have D overreaching, having her moment of triumph and then Arya steps in to protect Jon and finishes her. <br></p><p>GRRM usually manages to have an outcome that is satisfying for several arcs at once and since I think D is important (if an antagonist) I feel that her arc has to be interwoven with the arcs of the others. I think it is possible to do that, have her die of hubris and killed by Arya, but I’m not yet sure how. <br></p><p>For a very long time I’ve believed that D would get a last minute saviour action, either from remorse after burning King’s Landing or accidentally like Gollum - and her being an accidental saviour is something that is also very preeminent in her arc. But I’m not that sure any more. GRRM might really go the whole way and have her die an unrepentent villain. <br></p><p>So, in general I agree with you. Dying in childbirth would be just mehhhh. Very unsatisfactory. But to me the evidence for Arya killing D has set me thinking. It would be difficult to pull that of as satisfactory for D, not unmanagable though - but for Arya it is a very fitting scenario. Her arc which is so much about revenge and mercy and the boundaries that she’ll have to set for herself, that I would really like her to kill not for revenge but for protection as an action that is not directed towards the past but towards the future of her cousin Jon.<br></p><div><p>Thanks for the ask!<br></p></div></p>",
                "content": "<p>Dear nonny,</p><p>I would absolutely hate for Da&euro;nerys to die in childbirth. That would be pretty anticlimatic. I want her to go out in a blaze, like the last dragon she is. A really spectacular death. A hero from the other side, a woman who fulfills the role of the person who had good intentions and went awry. Yes, I want her death to be memorable. <br /></p><p>I wouldn&rsquo;t say it would be not like GRRM to do an anticlimatic death. I always suspected that Walder Frey in the books might just die from old age, because this is what occasionally happens with villains, but I doubt that GRRM has a death like that for a super important antagonist. <br /></p><p>As for how she will die, I am a bit torn about that. The Icarus imagery in her arc is very strong and this means that a fall from her dragon would be a possibility. There is also the fact that D herself seems to be convinced that fire &ldquo;cannot kill a dragon&rdquo;, and wouldn&rsquo;t it be nice if that turned out to be wrong - and both would indeed fit into the hubris and fall trope. <a href=\"https://tmblr.co/mrHV0A6XAqV1AbH1L0Bo2Bw\">@rose-of-red-lake</a> has speculated that the famous &lsquo;red door&rsquo; might be a dragon&rsquo;s mouth. <br /></p><p>I always wanted her to die a Gollum death - which might come to pass via being eaten by a dragon or via fall from a dragon. I want her to think she has won it all, &ldquo;her presciousss&rdquo; only to fall to her death. It would be very nice, if she accidentally helps the case against the WW with her fall. <br /></p><p>I&rsquo;m not so sure about that any longer: I mean I always thought that GRRM wanted to create a beautiful antagonist, someone who would not be seen as a villain immediately, a beautiful Gollum. But D might also be Denethor, the betrayer in the midst of the peopel who fight against evil (and Denethor dies in flames as well!). As much as I would like D to mirror Gollum, I think that there are many more parallels to Denethor and that she will forsake the cause against the WW because she wants to secure her claim. So if she goes for King&rsquo;s Landing I expect her to fall or die in the flames in the moment she blows the place up.</p><p>I must admit that I would hate for Jon to kill her. I don&rsquo;t want him to become a kinslayer, and other than have Jon killing a woman when he shied from that when he met Ygritte, it doesn&rsquo;t serve any narrative purpose. Jon and D in a Targbowl has been set up, but Jon as killer not necesssarily. If Jon kills a woman it might be Cersei (although my pet theory is that it will be Bran via warging).</p><p>You can make a case for Arya though. We ladies at <a href=\"https://tmblr.co/mN2Tk4D3PoYooipN6QjDY2Q\">@delulumeta</a> are checking this theory and we have had some very interesting finds already (I posted one). I&rsquo;m more and more convinced that this will happen. I do think it would be satisfying for Arya&rsquo;s arc who wouldn&rsquo;t kill for revenge but for protection, but it would have to be tied with the hubris arc that is prevalent in D&rsquo;s story, and I&rsquo;m not yet sure, how these can be brought together in a satisfying way. I think it can be done, you can have D overreaching, having her moment of triumph and then Arya steps in to protect Jon and finishes her. <br /></p><p>GRRM usually manages to have an outcome that is satisfying for several arcs at once and since I think D is important (if an antagonist) I feel that her arc has to be interwoven with the arcs of the others. I think it is possible to do that, have her die of hubris and killed by Arya, but I&rsquo;m not yet sure how. <br /></p><p>For a very long time I&rsquo;ve believed that D would get a last minute saviour action, either from remorse after burning King&rsquo;s Landing or accidentally like Gollum - and her being an accidental saviour is something that is also very preeminent in her arc. But I&rsquo;m not that sure any more. GRRM might really go the whole way and have her die an unrepentent villain. <br /></p><p>So, in general I agree with you. Dying in childbirth would be just mehhhh. Very unsatisfactory. But to me the evidence for Arya killing D has set me thinking. It would be difficult to pull that of as satisfactory for D, not unmanagable though - but for Arya it is a very fitting scenario. Her arc which is so much about revenge and mercy and the boundaries that she&rsquo;ll have to set for herself, that I would really like her to kill not for revenge but for protection as an action that is not directed towards the past but towards the future of her cousin Jon.<br /></p><p>Thanks for the ask!<br /></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "asongofstarkandtargaryen",
        "blog": {
            "name": "asongofstarkandtargaryen",
            "title": "Dracarys!",
            "description": "Jon/Dany/Bran/Arya Stan. Salty about the got ending. Also likes: The 100,  Star Wars, Stranger Things.",
            "url": "https://asongofstarkandtargaryen.tumblr.com/",
            "uuid": "t:MQLEPrBfaW57QFv6zpyqYg",
            "updated": 1561668350
        },
        "id": 182300061144,
        "post_url": "https://asongofstarkandtargaryen.tumblr.com/post/182300061144/arya-can-be-a-badass-warrior-girl-and-have-a-love",
        "slug": "arya-can-be-a-badass-warrior-girl-and-have-a-love",
        "date": "2019-01-25 18:19:45 GMT",
        "timestamp": 1548440385,
        "state": "published",
        "format": "html",
        "reblog_key": "uwxntA3r",
        "tags": [
            "arya stark",
            "a post of ice and fire"
        ],
        "short_url": "https://tmblr.co/ZYQPae2fnxYtO",
        "summary": "Arya can be a badass warrior girl and have a love interest. The one does not exclude the other.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 46,
        "title": null,
        "body": "<p>Arya can be a badass warrior girl <i><b>and </b></i>have a love interest. The one does not exclude the other.</p>",
        "reblog": {
            "comment": "<p>Arya can be a badass warrior girl <i><b>and </b></i>have a love interest. The one does not exclude the other.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "asongofstarkandtargaryen",
                    "active": true,
                    "theme": {
                        "header_full_width": 3733,
                        "header_full_height": 2100,
                        "header_focus_width": 2048,
                        "header_focus_height": 1151,
                        "avatar_shape": "circle",
                        "background_color": "#4D7067",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,3733,2099,0",
                        "header_image": "https://static.tumblr.com/f58918c2f25d80e89164372631e3619f/dsaln5x/dAXpr4llt/tumblr_static_e7l949alh68sg4owow484osw0.jpg",
                        "header_image_focused": "https://static.tumblr.com/c6762f3a09d3cd190c7423978fce1be7/dsaln5x/2sfpr4llw/tumblr_static_tumblr_static_e7l949alh68sg4owow484osw0_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f58918c2f25d80e89164372631e3619f/dsaln5x/dAXpr4llt/tumblr_static_e7l949alh68sg4owow484osw0_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182300061144"
                },
                "content_raw": "<p>Arya can be a badass warrior girl <i><b>and </b></i>have a love interest. The one does not exclude the other.</p>",
                "content": "<p>Arya can be a badass warrior girl <i><b>and </b></i>have a love interest. The one does not exclude the other.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "buttercup--bee",
        "blog": {
            "name": "buttercup--bee",
            "title": "My whole existence at this point is just a meme",
            "description": "Prompts are open! If you'd like to buy me a coffee, my Ko-Fi is at                ko-fi.com/avairvin.   Header artwork done by @wolvesofspring",
            "url": "https://buttercup--bee.tumblr.com/",
            "uuid": "t:clOK1NwEMjQb7hm1d2jQbw",
            "updated": 1561754469
        },
        "id": 182299565478,
        "post_url": "https://buttercup--bee.tumblr.com/post/182299565478/arya-right-thats-the-guy-you-said-the-lame",
        "slug": "arya-right-thats-the-guy-you-said-the-lame",
        "date": "2019-01-25 17:54:07 GMT",
        "timestamp": 1548438847,
        "state": "published",
        "format": "html",
        "reblog_key": "2w1LFW1f",
        "tags": [
            "arya stark",
            "sansa stark",
            "incorrect game of thrones",
            "house stark",
            "genderya",
            "gendry x arya",
            "arya x gendry",
            "gendry waters",
            "gendry baratheon",
            "game of thrones",
            "a song of ice and fire",
            "asoiaf"
        ],
        "short_url": "https://tmblr.co/ZAPmNi2fnvfsc",
        "summary": "Arya: Right, that’s the guy you said the lame stuff about, like he’s a good listener. \nSansa: Sorry, what do you look for in a...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 141,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Arya:</b> Right, that’s the guy you said the lame stuff about, like he’s a good listener. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> Sorry, what do you look for in a guy?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Arya:</b> *ogling Gendry* real stuff, like the shape of his ass. </p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Arya:</b> Right, that’s the guy you said the lame stuff about, like he’s a good listener. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> Sorry, what do you look for in a guy?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Arya:</b> *ogling Gendry* real stuff, like the shape of his ass. </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "buttercup--bee",
                    "active": true,
                    "theme": {
                        "header_full_width": 700,
                        "header_full_height": 367,
                        "header_focus_width": 515,
                        "header_focus_height": 289,
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "39,608,328,93",
                        "header_image": "https://static.tumblr.com/bcc01924d7ee65eca120036aad1f3cbf/6fbsd4f/Swjpmpa5m/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/2a48fd02f8eef729bd5b76d1fe0d1640/6fbsd4f/TwTpmpa5n/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/bcc01924d7ee65eca120036aad1f3cbf/6fbsd4f/Swjpmpa5m/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#211927",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182299565478"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Arya:</b> Right, that’s the guy you said the lame stuff about, like he’s a good listener. </p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> Sorry, what do you look for in a guy?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Arya:</b> *ogling Gendry* real stuff, like the shape of his ass. </p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Arya:</b> Right, that&rsquo;s the guy you said the lame stuff about, like he&rsquo;s a good listener. </p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Sansa:</b> Sorry, what do you look for in a guy?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Arya:</b> *ogling Gendry* real stuff, like the shape of his ass. </p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "aqueenofmarble",
        "blog": {
            "name": "aqueenofmarble",
            "title": "Do I Dare Disturb the Universe?",
            "description": "<p>she/her | 20 | slytherin | intj </p>",
            "url": "https://aqueenofmarble.tumblr.com/",
            "uuid": "t:i-tage3AgDIt29YcTxBmIg",
            "updated": 1561752358
        },
        "id": 182299462389,
        "post_url": "https://aqueenofmarble.tumblr.com/post/182299462389/gendry-with-arya-shirtless-clean-shaven-shows",
        "slug": "gendry-with-arya-shirtless-clean-shaven-shows",
        "date": "2019-01-25 17:48:46 GMT",
        "timestamp": 1548438526,
        "state": "published",
        "format": "html",
        "reblog_key": "PTj3UdQW",
        "tags": [
            "look me in the eyes and tell me their love is not real",
            "game of thrones",
            "gendry",
            "arya stark",
            "gendrya",
            "arya x gendry"
        ],
        "short_url": "https://tmblr.co/ZJGbti2fnvGhr",
        "summary": "Gendry with Arya: shirtless, clean-shaven, shows off his fighting skills\nGendry with Hot Pie: fully clothed, unshaven, smiths...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 285,
        "title": null,
        "body": "<p><b>Gendry with Arya:</b> shirtless, clean-shaven, shows off his fighting skills</p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"1024\"><img src=\"https://66.media.tumblr.com/bd240093448dbb5d251544bbfb8245e8/tumblr_plwetaigPD1th8svc_540.jpg\" data-orig-height=\"640\" data-orig-width=\"1024\"/></figure><p><b>Gendry with Hot Pie:</b> fully clothed, unshaven, smiths with a brooding expression </p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"1030\"><img src=\"https://66.media.tumblr.com/ebf01ced42a4dc0ed424a1ed7b4f9aa2/tumblr_plwetaS4zU1th8svc_540.jpg\" data-orig-height=\"640\" data-orig-width=\"1030\"/></figure>",
        "reblog": {
            "comment": "<p><p><b>Gendry with Arya:</b> shirtless, clean-shaven, shows off his fighting skills</p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"1024\"><img src=\"https://66.media.tumblr.com/bd240093448dbb5d251544bbfb8245e8/tumblr_plwetaigPD1th8svc_540.jpg\" data-orig-height=\"640\" data-orig-width=\"1024\"></figure><p><b>Gendry with Hot Pie:</b> fully clothed, unshaven, smiths with a brooding expression </p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"1030\"><img src=\"https://66.media.tumblr.com/ebf01ced42a4dc0ed424a1ed7b4f9aa2/tumblr_plwetaS4zU1th8svc_540.jpg\" data-orig-height=\"640\" data-orig-width=\"1030\"></figure></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "aqueenofmarble",
                    "active": true,
                    "theme": {
                        "header_full_width": 640,
                        "header_full_height": 391,
                        "header_focus_width": 640,
                        "header_focus_height": 360,
                        "avatar_shape": "circle",
                        "background_color": "#FFE7E7",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,640,360,0",
                        "header_image": "https://static.tumblr.com/1b75c28d644f4f507b5e63c0a2d12be6/jcfn1ps/rQUpocqt5/tumblr_static_.jpg",
                        "header_image_focused": "https://static.tumblr.com/612e27ecd9866921c1eb8eeb1078a9ea/jcfn1ps/aEtpocqt5/tumblr_static_tumblr_static__focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/1b75c28d644f4f507b5e63c0a2d12be6/jcfn1ps/rQUpocqt5/tumblr_static__2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#AE4AF0",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#A08395",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182299462389"
                },
                "content_raw": "<p><p><b>Gendry with Arya:</b> shirtless, clean-shaven, shows off his fighting skills</p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"1024\"><img src=\"https://66.media.tumblr.com/bd240093448dbb5d251544bbfb8245e8/tumblr_plwetaigPD1th8svc_540.jpg\" data-orig-height=\"640\" data-orig-width=\"1024\"></figure><p><b>Gendry with Hot Pie:</b> fully clothed, unshaven, smiths with a brooding expression </p><figure class=\"tmblr-full\" data-orig-height=\"640\" data-orig-width=\"1030\"><img src=\"https://66.media.tumblr.com/ebf01ced42a4dc0ed424a1ed7b4f9aa2/tumblr_plwetaS4zU1th8svc_540.jpg\" data-orig-height=\"640\" data-orig-width=\"1030\"></figure></p>",
                "content": "<p><p><b>Gendry with Arya:</b> shirtless, clean-shaven, shows off his fighting skills</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/bd240093448dbb5d251544bbfb8245e8/tumblr_plwetaigPD1th8svc_540.jpg\" class=\"\"/></figure><p><b>Gendry with Hot Pie:</b> fully clothed, unshaven, smiths with a brooding expression </p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/ebf01ced42a4dc0ed424a1ed7b4f9aa2/tumblr_plwetaS4zU1th8svc_540.jpg\" class=\"\"/></figure></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "photo",
        "blog_name": "ficklesuperfickle",
        "blog": {
            "name": "ficklesuperfickle",
            "title": "ASOIAF/fashion",
            "description": "WHAT WOULD THEY WEAR",
            "url": "https://ficklesuperfickle.tumblr.com/",
            "uuid": "t:Kw7UeoipHHdwM5jcOJZ8tQ",
            "updated": 1561737649
        },
        "id": 182297358829,
        "post_url": "https://ficklesuperfickle.tumblr.com/post/182297358829/arya-stark-amiri-fw2019-menswear",
        "slug": "arya-stark-amiri-fw2019-menswear",
        "date": "2019-01-25 16:00:36 GMT",
        "timestamp": 1548432036,
        "state": "published",
        "format": "html",
        "reblog_key": "U9DWSQYO",
        "tags": [
            "arya stark",
            "house stark",
            "amiri",
            "runway"
        ],
        "short_url": "https://tmblr.co/ZvQvYi2fnnF7j",
        "summary": "Arya Stark - Amiri FW2019 Menswear",
        "should_open_in_legacy": true,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 10,
        "caption": "<p>Arya Stark - Amiri FW2019 Menswear</p>",
        "reblog": {
            "comment": "<p>Arya Stark - Amiri FW2019 Menswear</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "ficklesuperfickle",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": 0,
                        "header_image": "https://assets.tumblr.com/images/default_header/optica_pattern_04.png?_v=7c4e5e82cf797042596e2e64af1c383f",
                        "header_image_focused": "https://assets.tumblr.com/images/default_header/optica_pattern_04.png?_v=7c4e5e82cf797042596e2e64af1c383f",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_04.png?_v=7c4e5e82cf797042596e2e64af1c383f",
                        "header_stretch": true,
                        "link_color": "#529ECC",
                        "show_avatar": false,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Arquitecta",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182297358829"
                },
                "content_raw": "<p>Arya Stark - Amiri FW2019 Menswear</p>",
                "content": "<p>Arya Stark - Amiri FW2019 Menswear</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "image_permalink": "https://ficklesuperfickle.tumblr.com/image/182297358829",
        "photos": [
            {
                "caption": "",
                "original_size": {
                    "url": "https://66.media.tumblr.com/f3f9f1d4c3f4f1ce65e2ece6e12ae397/tumblr_plmsrdFn6A1v2s05so1_1280.jpg",
                    "width": 1280,
                    "height": 1920
                },
                "alt_sizes": [
                    {
                        "url": "https://66.media.tumblr.com/f3f9f1d4c3f4f1ce65e2ece6e12ae397/tumblr_plmsrdFn6A1v2s05so1_1280.jpg",
                        "width": 1280,
                        "height": 1920
                    },
                    {
                        "url": "https://66.media.tumblr.com/f3f9f1d4c3f4f1ce65e2ece6e12ae397/tumblr_plmsrdFn6A1v2s05so1_640.jpg",
                        "width": 640,
                        "height": 960
                    },
                    {
                        "url": "https://66.media.tumblr.com/f3f9f1d4c3f4f1ce65e2ece6e12ae397/tumblr_plmsrdFn6A1v2s05so1_540.jpg",
                        "width": 540,
                        "height": 810
                    },
                    {
                        "url": "https://66.media.tumblr.com/f3f9f1d4c3f4f1ce65e2ece6e12ae397/tumblr_plmsrdFn6A1v2s05so1_500.jpg",
                        "width": 500,
                        "height": 750
                    },
                    {
                        "url": "https://66.media.tumblr.com/f3f9f1d4c3f4f1ce65e2ece6e12ae397/tumblr_plmsrdFn6A1v2s05so1_400.jpg",
                        "width": 400,
                        "height": 600
                    },
                    {
                        "url": "https://66.media.tumblr.com/f3f9f1d4c3f4f1ce65e2ece6e12ae397/tumblr_plmsrdFn6A1v2s05so1_250.jpg",
                        "width": 250,
                        "height": 375
                    },
                    {
                        "url": "https://66.media.tumblr.com/f3f9f1d4c3f4f1ce65e2ece6e12ae397/tumblr_plmsrdFn6A1v2s05so1_100.jpg",
                        "width": 100,
                        "height": 150
                    },
                    {
                        "url": "https://66.media.tumblr.com/f3f9f1d4c3f4f1ce65e2ece6e12ae397/tumblr_plmsrdFn6A1v2s05so1_75sq.jpg",
                        "width": 75,
                        "height": 75
                    }
                ]
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "jonsafam",
        "blog": {
            "name": "jonsafam",
            "title": "I'm Jonsa Incorrect",
            "description": "Juls | age unknown | ace",
            "url": "https://jonsafam.tumblr.com/",
            "uuid": "t:SUmIX_wgny8zd3V99_DHqg",
            "updated": 1561496560
        },
        "id": 182297301372,
        "post_url": "https://jonsafam.tumblr.com/post/182297301372/kidnapper-we-have-your-son-sansa-i-dont-have-a",
        "slug": "kidnapper-we-have-your-son-sansa-i-dont-have-a",
        "date": "2019-01-25 15:57:21 GMT",
        "timestamp": 1548431841,
        "state": "published",
        "format": "html",
        "reblog_key": "rOhQe9i9",
        "tags": [
            "actually jonsa",
            "arya stark",
            "game of thrones",
            "house stark",
            "sansa stark",
            "jon snow",
            "jonsa",
            "incorrect quotes",
            "starklings",
            "jonsa is endgame",
            "jonsa fanfiction",
            "jonsa is coming"
        ],
        "short_url": "https://tmblr.co/Zzzd2b2fnn15y",
        "summary": "Kidnapper: we have your son\nSansa: i don't have a son\nKidnapper: then who just asked for warm chocolate milk and made us cut the...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 798,
        "title": null,
        "body": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Kidnapper:</b> we have your son</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> i don&rsquo;t have a son</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Kidnapper:</b> then who just asked for warm chocolate milk and made us cut the crusts off his sandwich?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> oh my gods you have Jon</p>",
        "reblog": {
            "comment": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Kidnapper:</b> we have your son</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> i don’t have a son</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Kidnapper:</b> then who just asked for warm chocolate milk and made us cut the crusts off his sandwich?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> oh my gods you have Jon</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "jonsafam",
                    "active": true,
                    "theme": {
                        "header_full_width": 540,
                        "header_full_height": 304,
                        "header_focus_width": 540,
                        "header_focus_height": 303,
                        "avatar_shape": "circle",
                        "background_color": "#A4E0ED",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,540,303,0",
                        "header_image": "https://static.tumblr.com/d3a243e651665abb3f8d88f92dbf7b10/7svacoz/36Opbxmqd/tumblr_static_filename.jpg",
                        "header_image_focused": "https://static.tumblr.com/d3a243e651665abb3f8d88f92dbf7b10/7svacoz/ZAKpbxmqe/tumblr_static_tumblr_static_filename_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/d3a243e651665abb3f8d88f92dbf7b10/7svacoz/36Opbxmqd/tumblr_static_filename_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": false,
                        "show_title": true,
                        "title_color": "#000000",
                        "title_font": "Calluna",
                        "title_font_weight": "regular"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182297301372"
                },
                "content_raw": "<p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Kidnapper:</b> we have your son</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> i don’t have a son</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Kidnapper:</b> then who just asked for warm chocolate milk and made us cut the crusts off his sandwich?</p><p class=\"npf_chat\" data-npf='{\"subtype\":\"chat\"}'><b>Sansa:</b> oh my gods you have Jon</p>",
                "content": "<p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Kidnapper:</b> we have your son</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Sansa:</b> i don&rsquo;t have a son</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Kidnapper:</b> then who just asked for warm chocolate milk and made us cut the crusts off his sandwich?</p><p class=\"npf_chat\" data-npf=\"{&quot;subtype&quot;:&quot;chat&quot;}\"><b>Sansa:</b> oh my gods you have Jon</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "flavblist",
        "blog": {
            "name": "flavblist",
            "title": "Flavblist Blog",
            "description": "News,Business,Events,Sports,Entertainment,Technology,Lifestyle&fashion,Health,Politics and yes....Gist&Gossips!!!!!",
            "url": "https://flavblist.tumblr.com/",
            "uuid": "t:NVL4KW_MGHcpMVzKvn3w_w",
            "updated": 1552654079
        },
        "id": 182297280900,
        "post_url": "https://flavblist.tumblr.com/post/182297280900/game-of-thrones-arya-stark-opens-up-about-the",
        "slug": "game-of-thrones-arya-stark-opens-up-about-the",
        "date": "2019-01-25 15:56:15 GMT",
        "timestamp": 1548431775,
        "state": "published",
        "format": "html",
        "reblog_key": "ah77rquP",
        "tags": [
            "Arya Stark",
            "GOT"
        ],
        "short_url": "https://tmblr.co/Zrrz6b2fnmy64",
        "summary": "Game Of Thrones: 'Arya Stark' Opens Up About The End Of The Series",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 0,
        "title": "Game Of Thrones: 'Arya Stark' Opens Up About The End Of The Series",
        "body": "<p><a href=\"http://flavblist.wordpress.com/2019/01/25/game-of-thrones-arya-stark-opens-up-about-the-end-of-the-series/\">Game Of Thrones: ‘Arya Stark’ Opens Up About The End Of The Series</a></p><img width=\"300\" height=\"200\" style=\"float: right; padding:10px;\" src=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=300\" class=\"attachment-medium size-medium wp-post-image\" alt=\"\" srcset=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=300 300w, https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=600 600w, https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=150 150w\" sizes=\"(max-width: 34.9rem) calc(100vw - 2rem), (max-width: 53rem) calc(8 * (100vw / 12)), (min-width: 53rem) calc(6 * (100vw / 12)), 100vw\" data-attachment-id=\"2547\" data-permalink=\"https://flavblist.wordpress.com/game-of-thrones-additional-season-finale-016920124382246709753/\" data-orig-file=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg\" data-orig-size=\"885,590\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"game-of-thrones-additional-season-finale-016920124382246709753.jpg\" data-image-description=\"\" data-medium-file=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=300\" data-large-file=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=640\"/><blockquote><p><img src=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-arya-stark-opens-up-about-the-end-of-the-series4298644203758667747232992547782479398..jpg?w=640\"/></p>\n\n<p>Everything you need to live well</p>\n\n\n<p>English actress Maisie Williams who plays Arya Stark in popular HBO SERIES “Game Of Thrones” doesn’t think any of the Game of Thrones cast members will be happy when the show comes to an end.</p>\n<p>The 21-year-old actress has somewhat come to terms with the end of the series, but admitted that it’s going to be difficult to move on during an interview with Sky News.</p></blockquote><p><a href=\"http://flavblist.wordpress.com/2019/01/25/game-of-thrones-arya-stark-opens-up-about-the-end-of-the-series/\">View On WordPress</a></p><div style=\"clear:both;\"></div>",
        "reblog": {
            "comment": "<p><p><a href=\"http://flavblist.wordpress.com/2019/01/25/game-of-thrones-arya-stark-opens-up-about-the-end-of-the-series/\">Game Of Thrones: ‘Arya Stark’ Opens Up About The End Of The Series</a></p><img width=\"300\" height=\"200\" style=\"float: right; padding:10px;\" src=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=300\" class=\"attachment-medium size-medium wp-post-image\" alt=\"\" srcset=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=300 300w, https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=600 600w, https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=150 150w\" sizes=\"(max-width: 34.9rem) calc(100vw - 2rem), (max-width: 53rem) calc(8 * (100vw / 12)), (min-width: 53rem) calc(6 * (100vw / 12)), 100vw\" data-attachment-id=\"2547\" data-permalink=\"https://flavblist.wordpress.com/game-of-thrones-additional-season-finale-016920124382246709753/\" data-orig-file=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg\" data-orig-size=\"885,590\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"game-of-thrones-additional-season-finale-016920124382246709753.jpg\" data-image-description=\"\" data-medium-file=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=300\" data-large-file=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=640\"><blockquote><p><img src=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-arya-stark-opens-up-about-the-end-of-the-series4298644203758667747232992547782479398..jpg?w=640\"></p>\n\n<p>Everything you need to live well</p>\n\n\n<p>English actress Maisie Williams who plays Arya Stark in popular HBO SERIES “Game Of Thrones” doesn’t think any of the Game of Thrones cast members will be happy when the show comes to an end.</p>\n<p>The 21-year-old actress has somewhat come to terms with the end of the series, but admitted that it’s going to be difficult to move on during an interview with Sky News.</p></blockquote><p><a href=\"http://flavblist.wordpress.com/2019/01/25/game-of-thrones-arya-stark-opens-up-about-the-end-of-the-series/\">View On WordPress</a></p><div style=\"clear:both;\"></div></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "flavblist",
                    "active": true,
                    "theme": {
                        "avatar_shape": "square",
                        "background_color": "#FAFAFA",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/36856a4eba251be84b9cc9bb94fa78da/btlaeau/Mj6pn69s4/tumblr_static_5t856a0o0zcwgwcc8c44cckw8.jpg",
                        "header_image_focused": "https://static.tumblr.com/36856a4eba251be84b9cc9bb94fa78da/btlaeau/Mj6pn69s4/tumblr_static_5t856a0o0zcwgwcc8c44cckw8_2048_v2.jpg",
                        "header_image_scaled": "https://static.tumblr.com/36856a4eba251be84b9cc9bb94fa78da/btlaeau/Mj6pn69s4/tumblr_static_5t856a0o0zcwgwcc8c44cckw8_2048_v2.jpg",
                        "header_stretch": false,
                        "link_color": "#529ECC",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Streetscript",
                        "title_font_weight": "bold"
                    },
                    "share_likes": true,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182297280900"
                },
                "content_raw": "<p><p><a href=\"http://flavblist.wordpress.com/2019/01/25/game-of-thrones-arya-stark-opens-up-about-the-end-of-the-series/\">Game Of Thrones: ‘Arya Stark’ Opens Up About The End Of The Series</a></p><img width=\"300\" height=\"200\" style=\"float: right; padding:10px;\" src=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=300\" class=\"attachment-medium size-medium wp-post-image\" alt=\"\" srcset=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=300 300w, https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=600 600w, https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=150 150w\" sizes=\"(max-width: 34.9rem) calc(100vw - 2rem), (max-width: 53rem) calc(8 * (100vw / 12)), (min-width: 53rem) calc(6 * (100vw / 12)), 100vw\" data-attachment-id=\"2547\" data-permalink=\"https://flavblist.wordpress.com/game-of-thrones-additional-season-finale-016920124382246709753/\" data-orig-file=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg\" data-orig-size=\"885,590\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"game-of-thrones-additional-season-finale-016920124382246709753.jpg\" data-image-description=\"\" data-medium-file=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=300\" data-large-file=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=640\"><blockquote><p><img src=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-arya-stark-opens-up-about-the-end-of-the-series4298644203758667747232992547782479398..jpg?w=640\"></p>\n\n<p>Everything you need to live well</p>\n\n\n<p>English actress Maisie Williams who plays Arya Stark in popular HBO SERIES “Game Of Thrones” doesn’t think any of the Game of Thrones cast members will be happy when the show comes to an end.</p>\n<p>The 21-year-old actress has somewhat come to terms with the end of the series, but admitted that it’s going to be difficult to move on during an interview with Sky News.</p></blockquote><p><a href=\"http://flavblist.wordpress.com/2019/01/25/game-of-thrones-arya-stark-opens-up-about-the-end-of-the-series/\">View On WordPress</a></p><div style=\"clear:both;\"></div></p>",
                "content": "<p><a href=\"http://flavblist.wordpress.com/2019/01/25/game-of-thrones-arya-stark-opens-up-about-the-end-of-the-series/\">Game Of Thrones: &lsquo;Arya Stark&rsquo; Opens Up About The End Of The Series</a></p><div class=\"external-image-wrapper\" data-loading-text=\"Loading...\" data-src=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-additional-season-finale-016920124382246709753.jpg?w=300\">External image</div><blockquote><p><div class=\"external-image-wrapper\" data-loading-text=\"Loading...\" data-src=\"https://flavblist.files.wordpress.com/2019/01/game-of-thrones-arya-stark-opens-up-about-the-end-of-the-series4298644203758667747232992547782479398..jpg?w=640\">External image</div></p>\n\n<p>Everything you need to live well</p>\n\n\n<p>English actress Maisie Williams who plays Arya Stark in popular HBO SERIES &ldquo;Game Of Thrones&rdquo; doesn&rsquo;t think any of the Game of Thrones cast members will be happy when the show comes to an end.</p>\n<p>The 21-year-old actress has somewhat come to terms with the end of the series, but admitted that it&rsquo;s going to be difficult to move on during an interview with Sky News.</p></blockquote><p><a href=\"http://flavblist.wordpress.com/2019/01/25/game-of-thrones-arya-stark-opens-up-about-the-end-of-the-series/\">View On WordPress</a></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "asongofstarkandtargaryen",
        "blog": {
            "name": "asongofstarkandtargaryen",
            "title": "Dracarys!",
            "description": "Jon/Dany/Bran/Arya Stan. Salty about the got ending. Also likes: The 100,  Star Wars, Stranger Things.",
            "url": "https://asongofstarkandtargaryen.tumblr.com/",
            "uuid": "t:MQLEPrBfaW57QFv6zpyqYg",
            "updated": 1561668350
        },
        "id": 182296925899,
        "post_url": "https://asongofstarkandtargaryen.tumblr.com/post/182296925899/arya-you-deserve-a-reward-for-putting-up-with-me",
        "slug": "arya-you-deserve-a-reward-for-putting-up-with-me",
        "date": "2019-01-25 15:35:29 GMT",
        "timestamp": 1548430529,
        "state": "published",
        "format": "html",
        "reblog_key": "k9yOdmHF",
        "tags": [
            "gendrya",
            "gendry",
            "arya stark",
            "I found this quote somewhere on the internet but I don't remember where",
            "?"
        ],
        "short_url": "https://tmblr.co/ZYQPae2fnlbRB",
        "summary": "Arya: You deserve a reward for putting up with me. Gendry: You are my reward.",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 95,
        "title": null,
        "body": "<p>Arya: You deserve a reward for putting up with me.</p><p>Gendry: You are my reward.</p>",
        "reblog": {
            "comment": "<p>Arya: You deserve a reward for putting up with me.</p><p>Gendry: You are my reward.</p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "asongofstarkandtargaryen",
                    "active": true,
                    "theme": {
                        "header_full_width": 3733,
                        "header_full_height": 2100,
                        "header_focus_width": 2048,
                        "header_focus_height": 1151,
                        "avatar_shape": "circle",
                        "background_color": "#4D7067",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "0,3733,2099,0",
                        "header_image": "https://static.tumblr.com/f58918c2f25d80e89164372631e3619f/dsaln5x/dAXpr4llt/tumblr_static_e7l949alh68sg4owow484osw0.jpg",
                        "header_image_focused": "https://static.tumblr.com/c6762f3a09d3cd190c7423978fce1be7/dsaln5x/2sfpr4llw/tumblr_static_tumblr_static_e7l949alh68sg4owow484osw0_focused_v3.jpg",
                        "header_image_scaled": "https://static.tumblr.com/f58918c2f25d80e89164372631e3619f/dsaln5x/dAXpr4llt/tumblr_static_e7l949alh68sg4owow484osw0_2048_v2.jpg",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Sans Serif",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182296925899"
                },
                "content_raw": "<p>Arya: You deserve a reward for putting up with me.</p><p>Gendry: You are my reward.</p>",
                "content": "<p>Arya: You deserve a reward for putting up with me.</p><p>Gendry: You are my reward.</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "lodessa",
        "blog": {
            "name": "lodessa",
            "title": "Not a Smut Queen... A Smut Khaleesi",
            "description": "<div align=left>I appear to have tumbled back down into Game of Thrones/A Song of Ice and Fire Fandom again (Jaime/Brienne, Dany/Jorah, Jon/Sansa, amongst other pairings). I'm still living that Star Trek Fan Life (mostly Voyager [Janeway/Chakotay OTP) and Discovery (Admiral Katrina Cornwell and Captain Philippa Georgiou focus).  I cannot possibly list everything I might reblog, but forever carrying a torch for Veronica Mars (I live a Weevil appreciation life), Miss Fisher's Murder Mysteries, Doctor Who (Nine, Martha Jones), Roslin/Adama, Buffy/Faith, Aral/Cordelia, amongst others.</p>\n<p>  </p>\n<br> <small>\n<b>Testimonial by <a href=\"wakeupgreat.tumblr.com\"><font color=38FEFF>wakeupgreat</font></a>: </b><div align=justify>\n\n<p><i>\"lodessa is an amazing human! she can be recognized in the wild by her inara icon and is known across the land for star trek rpf and for being into a song of ice and fire long before it was a tv show. she is a fellow fandom oldie and we relate on many levels. also once she wrote me cersei/brienne so basically she is the BEST.\"</p>\n<break>\n<br>\n\n<form action=\"/search\" method=\"get\">\n    <input type=\"text\" name=\"q\" value=\"\"/>\n    <input type=\"submit\" value=\"Search\"/>\n</form>\n\n<br>",
            "url": "https://lodessa.tumblr.com/",
            "uuid": "t:ECCyx7cVTtNdN-JoJ5-dHA",
            "updated": 1561756957
        },
        "id": 182296798469,
        "post_url": "https://lodessa.tumblr.com/post/182296798469/yet-another-au-idea-i-dont-have-time-to-write",
        "slug": "yet-another-au-idea-i-dont-have-time-to-write",
        "date": "2019-01-25 15:28:01 GMT",
        "timestamp": 1548430081,
        "state": "published",
        "format": "html",
        "reblog_key": "DDqWSiod",
        "tags": [
            "a league of their own",
            "a song of ice and fire",
            "game of thrones",
            "sansa stark",
            "arya stark",
            "brienne of tarth",
            "jaime x brienne",
            "arianne is mae (madonna)",
            "asha is doris (rosie o'donnel)",
            "those two are the most liberated",
            "and asha is more bawdy as opposed to arianne who is a more seductive",
            "margaery is helen haley because she's elegant and nice to ladies in a worse position than her",
            "gilly is evelyn with her nasty deadbeat husband and awful demon son",
            "dany is on racine to represent the continental and political divide"
        ],
        "short_url": "https://tmblr.co/ZNzdRy2fnl6K5",
        "summary": "Yet Another AU Idea I Don’t Have Time To Write",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 17,
        "title": "Yet Another AU Idea I Don’t Have Time To Write",
        "body": "<h2>Westeros Characters<i> A League of their Own </i>AU.  </h2><figure class=\"tmblr-full\" data-orig-height=\"213\" data-orig-width=\"500\" data-tumblr-attribution=\"ginjaninjanelsie:k-7ZgX12A2-rZGt1YDC51g:Z6EV9v17xk-I5\"><img src=\"https://66.media.tumblr.com/65eca3cd38f02fa5470e0168affbcb79/tumblr_n19xjznbr11rxw1edo1_400.gif\" data-orig-height=\"213\" data-orig-width=\"500\"/></figure><p>With the war on and all the men away, all our favorite ladies are recruited to “keep baseball going”.   It’s got the perfect mix of ladies being awesome and good at stuff and ladies living in a patriarchal hells-cape that they have absolutely internalized to work with ASOIAF/GOT.</p><p>I mean it wouldn’t be an exact matchup.  Sansa and Arya with their sister issues are clearly Dottie and Kit* (Arya absolutely cannot lay off the high ones) but Dottie’s interactions with Jimmy Dugan don’t make sense for Sansa.</p><p> Instead the lion’s share of that dynamic would belong to Brienne (who, of course, also has a lot of Marla’s plot line with being ultra competent but treated in a humiliating subhuman way for not meeting beauty standards) as Jaime would be in the Jimmy role ( I considered Tyrion as the more alcoholic brother, but Jaime has that lost hope/injury made him feel useless/stripped him of his identity plotline&hellip; Tyrion can be Ira Lowenstein the “wiz kid” who does his best to save women’s baseball when Tywin as Harvey stops being into the idea). </p><p>*Cat and Lysa would be even more apt as Dottie and Kit but there’s nothing interesting about the rest of the plot/characters if we move it back a generation. (Also no one in the movie is catty enough to be Cersei.)</p>",
        "reblog": {
            "comment": "<p><h2>Westeros Characters<i> A League of their Own </i>AU.  </h2><figure class=\"tmblr-full\" data-orig-height=\"213\" data-orig-width=\"500\" data-tumblr-attribution=\"ginjaninjanelsie:k-7ZgX12A2-rZGt1YDC51g:Z6EV9v17xk-I5\"><img src=\"https://66.media.tumblr.com/65eca3cd38f02fa5470e0168affbcb79/tumblr_n19xjznbr11rxw1edo1_400.gif\" data-orig-height=\"213\" data-orig-width=\"500\"></figure><p>With the war on and all the men away, all our favorite ladies are recruited to “keep baseball going”.   It’s got the perfect mix of ladies being awesome and good at stuff and ladies living in a patriarchal hells-cape that they have absolutely internalized to work with ASOIAF/GOT.</p><p>I mean it wouldn’t be an exact matchup.  Sansa and Arya with their sister issues are clearly Dottie and Kit* (Arya absolutely cannot lay off the high ones) but Dottie’s interactions with Jimmy Dugan don’t make sense for Sansa.</p><p> Instead the lion’s share of that dynamic would belong to Brienne (who, of course, also has a lot of Marla’s plot line with being ultra competent but treated in a humiliating subhuman way for not meeting beauty standards) as Jaime would be in the Jimmy role ( I considered Tyrion as the more alcoholic brother, but Jaime has that lost hope/injury made him feel useless/stripped him of his identity plotline… Tyrion can be Ira Lowenstein the “wiz kid” who does his best to save women’s baseball when Tywin as Harvey stops being into the idea). </p><p>*Cat and Lysa would be even more apt as Dottie and Kit but there’s nothing interesting about the rest of the plot/characters if we move it back a generation. (Also no one in the movie is catty enough to be Cersei.)</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "lodessa",
                    "active": true,
                    "theme": {
                        "header_full_width": 500,
                        "header_full_height": 281,
                        "header_focus_width": 485,
                        "header_focus_height": 274,
                        "avatar_shape": "circle",
                        "background_color": "#81dac2",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "3,492,277,7",
                        "header_image": "https://static.tumblr.com/c68745831d1b8e0222a784792f97e1b7/cqyeatk/2S9ndgtg1/tumblr_static_5ve2edd69dgcoog0w8wcks8s8.png",
                        "header_image_focused": "https://static.tumblr.com/c68745831d1b8e0222a784792f97e1b7/cqyeatk/uQkndgtg2/tumblr_static_tumblr_static_5ve2edd69dgcoog0w8wcks8s8_focused_v3.png",
                        "header_image_scaled": "https://static.tumblr.com/c68745831d1b8e0222a784792f97e1b7/cqyeatk/2S9ndgtg1/tumblr_static_5ve2edd69dgcoog0w8wcks8s8_2048_v2.png",
                        "header_stretch": true,
                        "link_color": "#818080",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#444444",
                        "title_font": "Quadrat",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": true,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182296798469"
                },
                "content_raw": "<p><h2>Westeros Characters<i> A League of their Own </i>AU.  </h2><figure class=\"tmblr-full\" data-orig-height=\"213\" data-orig-width=\"500\" data-tumblr-attribution=\"ginjaninjanelsie:k-7ZgX12A2-rZGt1YDC51g:Z6EV9v17xk-I5\"><img src=\"https://66.media.tumblr.com/65eca3cd38f02fa5470e0168affbcb79/tumblr_n19xjznbr11rxw1edo1_400.gif\" data-orig-height=\"213\" data-orig-width=\"500\"></figure><p>With the war on and all the men away, all our favorite ladies are recruited to “keep baseball going”.   It’s got the perfect mix of ladies being awesome and good at stuff and ladies living in a patriarchal hells-cape that they have absolutely internalized to work with ASOIAF/GOT.</p><p>I mean it wouldn’t be an exact matchup.  Sansa and Arya with their sister issues are clearly Dottie and Kit* (Arya absolutely cannot lay off the high ones) but Dottie’s interactions with Jimmy Dugan don’t make sense for Sansa.</p><p> Instead the lion’s share of that dynamic would belong to Brienne (who, of course, also has a lot of Marla’s plot line with being ultra competent but treated in a humiliating subhuman way for not meeting beauty standards) as Jaime would be in the Jimmy role ( I considered Tyrion as the more alcoholic brother, but Jaime has that lost hope/injury made him feel useless/stripped him of his identity plotline… Tyrion can be Ira Lowenstein the “wiz kid” who does his best to save women’s baseball when Tywin as Harvey stops being into the idea). </p><p>*Cat and Lysa would be even more apt as Dottie and Kit but there’s nothing interesting about the rest of the plot/characters if we move it back a generation. (Also no one in the movie is catty enough to be Cersei.)</p></p>",
                "content": "<p><h2>Westeros Characters<i> A League of their Own </i>AU.&nbsp;&nbsp;</h2><figure data-tumblr-media-id=\"0\" class=\"tmblr-full\"></figure><p>With the war on and all the men away, all our favorite ladies are recruited to&nbsp;&ldquo;keep baseball going&rdquo;.&nbsp; &nbsp;It&rsquo;s got the perfect mix of ladies being awesome and good at stuff and ladies living in a patriarchal hells-cape that they have absolutely internalized to work with ASOIAF/GOT.</p><p>I mean it wouldn&rsquo;t be an exact matchup.&nbsp; Sansa and Arya with their sister issues are clearly Dottie and Kit* (Arya absolutely cannot lay off the high ones) but Dottie&rsquo;s interactions with Jimmy Dugan don&rsquo;t make sense for Sansa.</p><p>&nbsp;Instead the lion&rsquo;s share of that dynamic would belong to Brienne (who, of course, also has a lot of Marla&rsquo;s plot line with being ultra competent but treated in a humiliating subhuman way for not meeting beauty standards) as Jaime would be in the Jimmy role ( I considered Tyrion as the more alcoholic brother, but Jaime has that lost hope/injury made him feel useless/stripped him of his identity plotline&hellip; Tyrion can be Ira Lowenstein the&nbsp;&ldquo;wiz kid&rdquo; who does his best to save women&rsquo;s baseball when Tywin as Harvey stops being into the idea).&nbsp;</p><p>*Cat and Lysa would be even more apt as Dottie and Kit but there&rsquo;s nothing interesting about the rest of the plot/characters if we move it back a generation. (Also no one in the movie is catty enough to be Cersei.)</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "princessaryathevaliant",
        "blog": {
            "name": "princessaryathevaliant",
            "title": "Princess Arya the Valiant",
            "description": "A devoted fan defending her precious cinnamon roll, its all you need to know!...and i love cheesecake...bye. Currently on hiatus.  ",
            "url": "https://princessaryathevaliant.tumblr.com/",
            "uuid": "t:0u4KDUwtOxBT0Bq9zU_OqA",
            "updated": 1561548680
        },
        "id": 182292576633,
        "post_url": "https://princessaryathevaliant.tumblr.com/post/182292576633/my-feelings-towards-george-are-so-weird-i-look-at",
        "slug": "my-feelings-towards-george-are-so-weird-i-look-at",
        "date": "2019-01-25 10:35:16 GMT",
        "timestamp": 1548412516,
        "state": "published",
        "format": "html",
        "reblog_key": "Lb5kBjRE",
        "tags": [
            "asoiaf",
            "george rr martin",
            "game of thrones",
            "arya stark"
        ],
        "short_url": "https://tmblr.co/Z-Xe9g2fnU-bv",
        "summary": "My feelings towards George are so weird. I look at the pain he has caused me through his books, the evil glint in his eyes in...",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 19,
        "title": null,
        "body": "<p>My feelings towards George are so weird. I look at the pain he has caused me through his books, the evil glint in his eyes in pictures, and i can swear he is a just a mean old jerk, but then in videos he is a cute old man who giggles at everything and is a complete nerdy dork. </p><figure data-orig-width=\"640\" data-orig-height=\"384\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/dd6cfc3bf3a94f389ee82d9a871053b2/tumblr_inline_plvuuf5YSj1utnnon_540.jpg\" alt=\"image\" data-orig-width=\"640\" data-orig-height=\"384\"/></figure><p>Why so adorable, George? I am confusion. People, explain! </p>",
        "reblog": {
            "comment": "<p>My feelings towards George are so weird. I look at the pain he has caused me through his books, the evil glint in his eyes in pictures, and i can swear he is a just a mean old jerk, but then in videos he is a cute old man who giggles at everything and is a complete nerdy dork. </p><figure data-orig-width=\"640\" data-orig-height=\"384\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/dd6cfc3bf3a94f389ee82d9a871053b2/tumblr_inline_plvuuf5YSj1utnnon_540.jpg\" alt=\"image\" data-orig-width=\"640\" data-orig-height=\"384\"></figure><p>Why so adorable, George? I am confusion. People, explain! </p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "princessaryathevaliant",
                    "active": true,
                    "theme": {
                        "header_full_width": 1919,
                        "header_full_height": 1031,
                        "header_focus_width": 1710,
                        "header_focus_height": 962,
                        "avatar_shape": "circle",
                        "background_color": "#dccbe7",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "34,1814,996,104",
                        "header_image": "https://static.tumblr.com/644c2bc77f912163e5614aa1735eb687/2xmo7se/2q7oc24j9/tumblr_static_bugajkg2flwgk4w048oc0sw88.jpg",
                        "header_image_focused": "https://static.tumblr.com/644c2bc77f912163e5614aa1735eb687/2xmo7se/UZwple0cu/tumblr_static_tumblr_static_bugajkg2flwgk4w048oc0sw88_focused_v3.jpg",
                        "header_image_scaled": "https://assets.tumblr.com/images/default_header/optica_pattern_14_focused_v3.png?_v=8c2d3b00544b7efbc4ac06dc3f80e374",
                        "header_stretch": true,
                        "link_color": "#97c5e0",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": false,
                        "title_color": "#000000",
                        "title_font": "Gibson",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182292576633"
                },
                "content_raw": "<p>My feelings towards George are so weird. I look at the pain he has caused me through his books, the evil glint in his eyes in pictures, and i can swear he is a just a mean old jerk, but then in videos he is a cute old man who giggles at everything and is a complete nerdy dork. </p><figure data-orig-width=\"640\" data-orig-height=\"384\" class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/dd6cfc3bf3a94f389ee82d9a871053b2/tumblr_inline_plvuuf5YSj1utnnon_540.jpg\" alt=\"image\" data-orig-width=\"640\" data-orig-height=\"384\"></figure><p>Why so adorable, George? I am confusion. People, explain! </p>",
                "content": "<p>My feelings towards George are so weird. I look at the pain he has caused me through his books, the evil glint in his eyes in pictures, and i can swear he is a just a mean old jerk, but then in videos he is a cute old man who giggles at everything and is a complete nerdy dork.&nbsp;</p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/dd6cfc3bf3a94f389ee82d9a871053b2/tumblr_inline_plvuuf5YSj1utnnon_540.jpg\" class=\"\"/></figure><p>Why so adorable, George? I am confusion. People, explain!&nbsp;</p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    },
    {
        "type": "text",
        "blog_name": "buttercuparry",
        "blog": {
            "name": "buttercuparry",
            "title": "Warm Winter Sun",
            "description": "If a 12 year old has to save the world then so be it!",
            "url": "https://buttercuparry.tumblr.com/",
            "uuid": "t:SF1Z-0AdFhlaCoJT5p2f5A",
            "updated": 1561749038
        },
        "id": 182290070995,
        "post_url": "https://buttercuparry.tumblr.com/post/182290070995/you-know-it-feels-so-good-to-see-that-people-have",
        "slug": "you-know-it-feels-so-good-to-see-that-people-have",
        "date": "2019-01-25 07:19:40 GMT",
        "timestamp": 1548400780,
        "state": "published",
        "format": "html",
        "reblog_key": "nsvybFsr",
        "tags": [
            "arya stark",
            "my queen"
        ],
        "short_url": "https://tmblr.co/Z-vWkf2fnLRtJ",
        "summary": "You know it feels so good to see that people have finally started to  acknowledge Arya Stark as a hero 😌💕",
        "should_open_in_legacy": false,
        "recommended_source": null,
        "recommended_color": null,
        "note_count": 78,
        "title": null,
        "body": "<figure class=\"tmblr-full\" data-orig-height=\"273\" data-orig-width=\"538\"><img src=\"https://66.media.tumblr.com/b7849b134a1eb8c8c6f599f84086c212/tumblr_plvlosbrzy1uwd08y_540.jpg\" data-orig-height=\"273\" data-orig-width=\"538\"/></figure><p>You know it feels so good to see that people have finally started to  acknowledge Arya Stark as a hero 😌💕</p>",
        "reblog": {
            "comment": "<p><figure class=\"tmblr-full\" data-orig-height=\"273\" data-orig-width=\"538\"><img src=\"https://66.media.tumblr.com/b7849b134a1eb8c8c6f599f84086c212/tumblr_plvlosbrzy1uwd08y_540.jpg\" data-orig-height=\"273\" data-orig-width=\"538\"></figure><p>You know it feels so good to see that people have finally started to  acknowledge Arya Stark as a hero 😌💕</p></p>",
            "tree_html": ""
        },
        "trail": [
            {
                "blog": {
                    "name": "buttercuparry",
                    "active": true,
                    "theme": {
                        "avatar_shape": "circle",
                        "background_color": "#FFFFFF",
                        "body_font": "Helvetica Neue",
                        "header_bounds": "",
                        "header_image": "https://static.tumblr.com/a7c271341850c4655169b2d3b5cad268/r42twf3/GIbok0mrh/tumblr_static_c10727643tw0kswso04cogkss.gif",
                        "header_image_focused": "https://static.tumblr.com/a7c271341850c4655169b2d3b5cad268/r42twf3/GIbok0mrh/tumblr_static_c10727643tw0kswso04cogkss_2048_v2.gif",
                        "header_image_scaled": "https://static.tumblr.com/a7c271341850c4655169b2d3b5cad268/r42twf3/GIbok0mrh/tumblr_static_c10727643tw0kswso04cogkss_2048_v2.gif",
                        "header_stretch": true,
                        "link_color": "#FFFFFF",
                        "show_avatar": true,
                        "show_description": true,
                        "show_header_image": true,
                        "show_title": true,
                        "title_color": "#666666",
                        "title_font": "Calluna",
                        "title_font_weight": "bold"
                    },
                    "share_likes": false,
                    "share_following": false,
                    "can_be_followed": true
                },
                "post": {
                    "id": "182290070995"
                },
                "content_raw": "<p><figure class=\"tmblr-full\" data-orig-height=\"273\" data-orig-width=\"538\"><img src=\"https://66.media.tumblr.com/b7849b134a1eb8c8c6f599f84086c212/tumblr_plvlosbrzy1uwd08y_540.jpg\" data-orig-height=\"273\" data-orig-width=\"538\"></figure><p>You know it feels so good to see that people have finally started to  acknowledge Arya Stark as a hero 😌💕</p></p>",
                "content": "<p><figure class=\"tmblr-full\"><img src=\"https://66.media.tumblr.com/b7849b134a1eb8c8c6f599f84086c212/tumblr_plvlosbrzy1uwd08y_540.jpg\" class=\"\"/></figure><p>You know it feels so good to see that people have finally started to  acknowledge Arya Stark as a hero &#128524;&#128149;</p></p>",
                "is_current_item": true,
                "is_root_item": true
            }
        ],
        "can_like": false,
        "can_reblog": false,
        "can_send_in_message": true,
        "can_reply": false,
        "display_avatar": true
    }
]